[
  {
    "title": "像我前女友这样的是不是现在女生的常态？",
    "url": "https://www.v2ex.com/t/882353",
    "summary": "qiushui777: <p>lz 大概半年前分手的，确实受了很大的伤然后中间也接受不了新人，对找对象失去了信心，情绪也不大稳定，借此问下各位这样的女生是不是大家正常女朋友的样子，还是说我作为一名不大社交的程序员，对于现在妹子的品性缺乏了解。我自己总共谈过两次，第一次渣女，不提了。第二次这次性格两个人其实相处挺开心的，总共在一起一年吧，然后分手主要是对方一些事情让我觉得双标，实在接受不了。把这些事情说出来其实也是想发下牢骚，可能也会被网友吐槽或者讽刺吧，但是我也尽量平常心去面对了，毕竟这半年过的真的挺难受的。</p>\n<ol>\n<li>\n<p>我买房子的时候大部分首付是我出的，妹纸对此不开心，说我爸妈对我不好，首付就出这一点，要是她一定会和爸妈吵架。我爸妈先前准备卖掉一套房子给我的，但是后来没卖掉，手上的现金两年前买了一套房子老了住，因为地段好点，买之前也问过我的。这些我都和妹纸说了，但是她说了好几次我爸妈坏话，然后那段时间也弄得我觉得爸妈对我不好。后来有天她说，我的钱不拿去付首付她就可以拿去花了。</p>\n</li>\n<li>\n<p>我房子离妹子工作地点开车 40 几分钟吧。她觉得远了，刚开始商量说，婚前两家出钱再买一套，我问，那写谁的名字，她笑了笑说她一个人。我问，那反过来你爸妈愿意？她说不愿意，然后她说，那婚后买的话两家一起出钱我的房子卖掉把两家一起买的房子的贷款还了。当时我就觉得她有点自私了。后来她就不停叫我和爸妈说他们名下的一套便宜点卖掉之类的话。</p>\n</li>\n<li>\n<p>我自己做项目，具体就不说了。有段时间比较难，因为美金打回国那个卡还没寄到，我每个月又要付个 1w 的服务器费用。手上就十几万了，还有每月两万的房贷（不过我收入还行，家里条件也还行，所以我知道自己肯定可以面对）。我给妹纸看了银行卡余额，但妹纸还是让我给她买个奢侈品 1w 多，说得证明下感情。我说现在真的比较困难。她叫我买，没钱了问爸妈要之类的。那段时间可以是我的低谷期了，面对工作压力，她还不停叫我买这个，还说娶她 60w 彩礼。反正压力爆炸。最让我伤心的是我生日她买了个 300 的电动牙刷，其实我觉得挺好的。但是后来有天说起来，她说她那时候只能买这么多因为手上就 1.5w ，不可能买个 1k 的。我当时就很郁闷问她，那为什么我手上十几万还压力这么多你觉得可以买个 1w 多的奢侈品。她笑笑就不说话了。</p>\n</li>\n<li>\n<p>上面那些事情后，妹子坚持要我花钱证明。刚开始每个月 1k 吧，护肤品。后来每个月递增，2k 的丝绸睡衣，3k 的衣服。到了年初，又提了那个 1w 多的手链。我实在受不了就提了分手。她叫我买了再分手，不然就来我家敲门。这里大家别骂我，我买了。</p>\n</li>\n<li>\n<p>本以为我买了后就结束了。妹纸又来缠着我说不能就这么结束，她不想这么放弃。她是老师，过完寒假又来找我。我说你去找新的男朋友吧，她给我看截图说有个男的在找她聊天什么的，她已经在接触了。我说那你来找我干嘛，她叫我再陪她一会。然后说什么同时给她介绍达摩院的程序员，她拒绝了。那我以为她真的就是让我再陪她一段时间。然后有天她说什么要是她找到新的男朋友就不能像现在这样陪着玩了。我心里顿觉不对，但是实在不敢问她是不是真的在找对象。后来有天，聊天的时候她说叫我买这么多的东西是为了分手她不至于啥都没有。我整人都懵了，就爆发了很激烈的争吵，那之后就断了联系。</p>\n</li>\n<li>\n<p>上面之后三个月，我把她送的一些小东西都扔了。因为她给我买过几件衬衫，几百块的海澜之家的那种，还有几件外套，总共 2k 吧估计。那天我哭了很久，就和她说了。聊天中她说有了男朋友，而且感觉在一起有段时间的那种。并承认了最后那段时间和我在一起的时候已经接触新人了，我整个人抑郁了。甚至之后有次，她男朋友在上班她说工作累，想找人倾诉下还打电话给我。我后来才意识到她男朋友没空，所以她找我来聊天。我太懦弱了，她找我倾诉说压力大我根本没办法拒绝，而且她还说什么她男朋友不会介意的。哎，后来越想越难受。</p>\n</li>\n</ol>\n<p>写了这么多，我也不知道自己放没放下。主要一个是和她平时一起出去玩还挺开心，她脾气除了这些事情外还好，不容易生气，也相对情绪稳定不会忽冷忽热。然后长得确实也还行，但是在一起也是很有共同话题水到渠成的。我最近相亲遇到的妹纸，基本上没遇到聊的起来，或者情商高的让我觉得舒服的。所以可能多少有点怀念吧。例如有时候我写代码累了她还会给我按下太阳穴之类的小事，挺甜蜜的。 </p>\n<p>我不知道现在的妹子究竟是怎样的，还是说就是男生就该像她说的那样子无私付出？这次以后，我觉得可能我会变得认为男生这样花钱，接受她的任性，例如卖房子这些事情是正常的？可能那种愿意付出，各方面又满足我要求的妹纸不存在吧，哎。</p>",
    "publish_time": "2022-09-23 11:32:54",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  },
  {
    "title": "这两天早上 14pro 大量补货啊，可惜没有 max",
    "url": "https://www.v2ex.com/t/882284",
    "summary": "snsn: <p>今早随手就抢到 pro 线下取货了，可是我要 max 啊。</p>",
    "publish_time": "2022-09-23 08:31:10",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  },
  {
    "title": "迷茫，是否离开上海，回济南，求交流",
    "url": "https://www.v2ex.com/t/882291",
    "summary": "MushiY0619: <p>毕业后留上海至今 9 年，夫妻都在国企，收入一般，有上海户口+两套房产(郊区商品房+学区老破小），月供 1w 左右，父母不愿在上海带孩子，想让回济南，理由是在上海无亲戚朋友、工作加班多不利于身体健康，居住条件一般（以后上小学要住学区房）、不好要二胎等；老婆已拿到济南的 offer （国企，税前 20w ），本人在找工作中，回济南亲戚较多、能买大面积学区房，但总有种逃兵的感觉，且回济南涉及新工作、户口迁移、转学、卖房、买房等诸多未知，迷茫！</p>",
    "publish_time": "2022-09-23 09:00:11",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  },
  {
    "title": "AirPods Pro2 初体验",
    "url": "https://www.v2ex.com/t/882311",
    "summary": "Bad0Guy: 早上一觉醒来看了眼快递信息，耳机已经到邮政快递点了，然后起床去了一趟快递点拿了耳机，路上刚好是早高峰时间，车辆多，施工地段也开始了一天的施工作业，所以正好给了我一个不错的测试环境。<br />1/降噪效果来看，跟一代初代版本固件效果差不多，可能比一代还要好那么一点。自适应通透这块的话，我在路上骑车的时候手表提示我外界噪音音量过大（当时记得是 91 ），但是我的耳朵里噪音感觉是正常接受水平，不会感觉很吵的那种。<br />2/路上测试的歌曲是杜比全景声版本的 bad guy-billie eilish 跟 pink venom-black pink 以及无损版本的 get lucky-daft punk ，杜比的声场效果比一代好很多，一代给我的感觉是有些歌曲声场效果处理得很好，有些歌曲处理得比较粗糙。<br />3/现阶段固件还没支持无损，但是我昨天跟我朋友讨论之后发现最新的 14 系列才支持 Le audio 的那个蓝牙 5.2……所以我不知道我的 11 会不会被支持进去，如果没法支持那只能等明年换了 15 再议无损的事儿了。。",
    "publish_time": "2022-09-23 10:07:51",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  },
  {
    "title": "Web 会取代操作系统吗？",
    "url": "https://www.v2ex.com/t/882341",
    "summary": "smilefox: <p>现在 web 的功能越来越强大了，在很久之前还需要视频播放器、音频播放器、PDF 阅读器等等...</p>\n<p>现代浏览器都能解决这些问题。</p>\n<p>紧跟着 WebGPU 的发展，感觉 Web 能做的事情越来越多，之前许多需要安装的应用现在在我眼里看来完全没必要。</p>\n<p>大家怎么看待未来 Web 是否会取代操作系统？</p>",
    "publish_time": "2022-09-23 11:15:23",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  }
]