[
  {
    "title": "父母诉讼离婚，我真的不知道该怎么办了",
    "url": "https://www.v2ex.com/t/948534",
    "summary": "rainoprime: <h2>内容</h2>\n<pre><code>父母结婚多年以来，几乎天天吵架，父亲也动手打过母亲大概三四次吧，总是因为一点生活小事琐事就争吵，搞得人尽皆知，现在他们离婚，每个人都给我打过电话，但他们俩人对我说的内容根本就合不起来，我不知道该相信谁，希望各位能帮我看看，我是真的没办法了。感激不尽\n</code></pre>\n<h2>起诉诉求</h2>\n<pre><code>一处平房，马上要拆迁了，一处商铺，一辆车，我妈要求固定资产平分，我爸是不想给，因为这些年，商铺是我爸还的贷款，之前断过一段时间，听他的意思貌似是上征信了，我妈也不掏钱（这是我爸告诉我的），车也是我爸买的，不过车主名字是我妈（因为我妈一直闹，怕他往外借）\n</code></pre>\n<h2>母亲性格</h2>\n<pre><code>爱发脾气，爱干净，喜欢把钱拿在自己手里，强势。\n比如：会因为我爸在房屋踩了几个脚印而吵架\n会因为我爸吃完饭没把桌子收拾干净而吵架\n会因为我爸每年剩不下钱而吵架（具体为什么没剩请往下看）\n会因为我爸接她的话不满意而吵架\n会因为我爸放假睡觉不帮他收拾而吵架，也就是所谓的眼里没活（厂长，一个月只有两天假）\n会因为我爸几点说要请吃饭但晚了几个小时而生气吵架\n会因为我爸不交电费而吵架\n总而言之，在我看来这都是生活中在小不能小的事情，但我妈总能找各种理由来吵架，有的时候我也不知道她为什么生气\n她爱拍抖音，我记得有一次，我和她吵起来了，一生气删了她俩视频，结果我妈气的直接把手机摔了，并让我给她找回来，说就这么点爱好，我也是第一次见到这样的母亲，容易过激。\n花钱的地方就是负责日常家庭开销，以及我的生活费，我记得的唯一大的开销就是，我父亲骑电动碰了一个老头拿了 3 万还是 5 万来着，我爸拿了两万三万；因为拆迁所以盖另一个院子拿了 9 万，我爸拿了 4 万。现在在对外出租，房租都是我妈收。\n我爸是一年 10 万，总说我爸不剩钱，说是外面有小三，但没有证据。\n因为在家里有点小生意，也是我爸弄起来的，所以我妈平常很清闲，相当于呆着一年就挣七万吧。\n</code></pre>\n<h1>父亲的性格</h1>\n<pre><code>我妈总说吵架爱翻旧账，结婚初期动手打人，为家庭考虑大局，想的长远，吵起来不依不饶，除了动手最严重的时候是砸电视，砸玻璃，不会哄女人，爱和朋友吃饭喝酒，抗压能力强，在家里话比较少，算是沉孔寡言吧，我感觉是不敢说话了。\n在我有记忆的时候，家里的大事一直是我爸花钱，比如房子盖东配房，商铺，汽车，我培训的学费，上私立学校的学费，以及在家弄点小生意的各种机器的费用，\n和我爸沟通少，能想到的就这些\n</code></pre>\n<h2>母亲对我说的</h2>\n<pre><code>首先在两周前跟我说他们要去民政局离婚了，但是没离成，说是我把不想把房产平分，让我妈去起诉吧，再然后就是各种说我爸的不好，说在我妈不在的时候对我小姨和大姨有非分之想？（说实话这个我是不信），还总说对不起我，要不是为了我早离婚了，这段时间总是对我哭，说为什么这么苦，我本来就心软，然后就让我录了段视频，证明的是那处平方是他们的共同财产。还说离婚以后不会再婚了，房产的钱都是留给我的。\n</code></pre>\n<h2>父亲对我说的</h2>\n<pre><code>我爸将结婚到现在所有的过往以及大的花销都说了一遍，然后说去民政局离婚是因为我妈的身份呢证号码和结婚证上不一样。其他的目的就是为了让我知道他们要离婚了，说是不想让我知道的，怕对我有影响，他说告诉我的目的就是想知道我是什么看法，如果我怪他们，那他说俩人都净身出户，所有钱和房产都给我过到我名下；如果我不怪他们，那我爸就要尽全力争共同财产，也就是想尽各种办法利益最大化。\n</code></pre>\n<h2>我的想法</h2>\n<pre><code>至于协议离婚的时候他们俩说的完全不一样，我不知道该信谁的，至于其他的也是各有各的理，我已经不知道该怎怎么办了，究竟是为了自己的利益怪他们（这里对于我妈来讲，如果都打给我，她肯定会哭着找我要的，不要就会说我不孝顺，没良心，白养你这么大），还是说让他们自己看着来吧，毕竟这么多年我是想让他们离婚的。\n</code></pre>",
    "publish_time": "2023-06-14 09:02:04",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  }
]