[
  {
    "title": "拼多多是我见过最恶心的平台，没有之一！",
    "url": "https://www.v2ex.com/t/970281",
    "summary": "BeijingBaby: 作为拼多多小卖家，经常被羊毛买家、平台恶心。<br /><br />起因：商品销售价 68 元，买家购买两件，打折后 116 元。<br /><br />买家收到货后，立即发起退货退款，但是邮寄回来的商品已经损坏、且只退回 1 件、赠品也没有退回。<br /><br />随后与买家通过拼多多聊天说明情况，要求退回全部商品+赠品，买家从始至终不提只退回一件的事，就说不好用。<br /><br /><br />随后拒绝退款，上传了损坏图、完整拆箱视频，理由：<br /><br /><br />1 、商品已经损坏无法再次销售，不符合 7 天无理由。<br />2 、商品少退，应退回 2 件+赠品，实际只退回 1 件商品且损坏状态。<br /><br />拼多多自动介入，要求商家再次举证拒绝理由，随后重新上传了损坏图、完整拆箱视频，并说明少退。<br /><br />拼多多判定结果：<br /><br />商家未积极主动与买家沟通情况，计入售后纠纷、支持买家退款请求，随后就全额退款了。<br /><br /><br />我尼玛，作为商家被全额退款了，还损失了 2 件商品+赠品+快递费，真 tm 恶心到家了。",
    "publish_time": "2023-09-02 08:58:18",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  },
  {
    "title": "求推荐手机浏览器",
    "url": "https://www.v2ex.com/t/970283",
    "summary": "stonesirsir: 之前一直用 chrom ，用网页写了个 dplayer 在线播放 m3u8 ，电脑，ios 播放都没问题，手机 chrom 经常出现视频卡住，声音继续播放的情况。网上查阅了说是 chrom 的锅。测试了微信网页打开没这个问题，但是不方便。<br /><br /><br /><br />各位 d 大的兄弟们有好用的手机浏览器推荐吗？",
    "publish_time": "2023-09-02 09:05:59",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  },
  {
    "title": "险些被起诉的我，做了这份工作的复盘：[三] 我竟然从一个写服务器的，差点被公司领导给转成了电焊工",
    "url": "https://www.v2ex.com/t/970291",
    "summary": "Ivone29: <p>如果我经历了什么不了解的话，可以移步到先了解一下我写这些内容的背景：</p>\n<p><a href=\"https://www.v2ex.com/t/950173\" rel=\"nofollow\">🤬小人打小报告，被公司辞退了</a></p>\n<p><a href=\"https://www.v2ex.com/t/951649\" rel=\"nofollow\">😡被辞退后，竟然要刑事起诉我</a></p>\n<p>如果你不了在此之前发生的事情，请移步到下方链接：</p>\n<p><a href=\"https://www.v2ex.com/t/970121\" rel=\"nofollow\">🔥险些被起诉的我，做了这份工作的复盘：入坑篇</a></p>\n<p><a href=\"https://www.v2ex.com/t/970218\" rel=\"nofollow\">🎭险些被起诉的我，做了这份工作的复盘：血汗工厂篇</a></p>\n<hr />\n<p><strong>以下为本篇正文部分</strong></p>\n<hr />\n<p>接上篇。</p>\n<p>我竟然从一个写服务器的，差点被公司领导强制给转成了电焊工。</p>\n<p>起因是，公司领导看到了现在有很多智能的垃圾桶，居民投递后可以识别垃圾重量，可以自动积分什么的，还能在即将满桶的时候通知附近的工作人员，领导就说公司也想弄个，看上去能卖个好价钱。我给领导说这都是硬件的工作我不会做啊，领导显然没有理解，他说你试试吧，需要买什么尽管提。他就再也没管我说什么，继续做他的事情去了。</p>\n<p>我就跟人事主管聊这事儿，人事主管给我透露，之前招过一个写服务器的，领导想要这个智能垃圾桶，直接被拒绝了，领导很生气就把他给开了，领导觉得无论硬件还是软件不都是写代码，说是不会其实就是在欺骗领导不懂而已。人事建议让我试试这事儿，说不定能成。</p>\n<p>于是我就回到自己工位上，又要满足公司需要，还要把东西搞出来，想了一天，加上跟小伙伴（后面出现的人比较多，后面给小伙伴成为 J ）讨论，最终选择使用树莓派，当时觉得只需要写 python 就行了，问题不大。</p>\n<p>可现实总比想象的难。我一口气买了二十个树莓派 4B ，找了几个空着的工位加上路由器组了个网，python 写的代码没问题了，边缘计算、云端上传、本地服务等等。接下来我找了好多教程和材料，找到了 HX711 和称重传感器，买了一堆线接起来，GitHub 找了一大堆代码，终于实现了称重。我用同样的方式，找到了摄像头，实现了居民账户的二维码识别；找到了红外感应和电推杆，实现了检测到有人后自动开启垃圾箱口的功能 ... </p>\n<p>光上述功能写完测试完就费了我近一个多月时间，在给领导演示的时候，感觉领导马上就要把这做成产品卖出去了，就催促我尽快完成，完成后大大有赏。我就通过公司的资源，找到了给公司供设备的一个可以做铁壳的供应商（后面还会提到，这里称作供货商 D ），不过公司贪图他们的低价，供货商 D 的位置非常偏僻，下场雨地上都能有没过脚的积水，周围都是违建和污水。</p>\n<p>按照公司的设计，供货商 D 做出了一个壳子，让我们自己做电路。我一听就懵了，啥，电路？我硬着头皮上去做了试试，根本不知道这个电路怎么弄，供货商看我无奈就替我做了，但树莓派的线路焊接什么的还是由我们做。这得发动整个团队的力量了，我们团队四个人就买了松香、焊锡丝、电烙铁开始焊接，谁都是第一次搞，搞得办公室一股糊了的味道，一开始半小时焊不上一个点，后来也熟练了。</p>\n<p>但问题又来了，树莓派用的是普通的 220V 插座，每个垃圾桶下面一个树莓派，触屏后面也有一个，加起来一套垃圾桶（可回收、其他、有害、厨余）至少五个，供应商那边根本没想到我们的需求，就来回改电路配合我们测试。在跟供应商捣鼓一个多月后，公司领导找到了一家成熟且成套的产品供应商，几千块就能买一套，在我们不知道的情况下采购了多套设备，就把我们自己开发这事儿搁置了。两个多月的工作又打了水漂。</p>\n<p>不过公司领导似乎没有要停下来的意思，让我们去对接设备上传的数据，必须要投递后要积累上居民的积分。据说这家产品供应商老板十分厉害，曾经是某个研究院出身。但对接的时候，对方工程师态度极其恶劣，电话里说好的尽快提供说明文档，到了第二天变成不需要写文档；说好的走 HTTP 协议，没多久就说 PLC 不支持，必须要走 modbus 才行；以至于最后我们沟通中，供货商工程师直接骂我们说：你们说话连住谓语都不会说，你们学会了说话再来找我，再找就是不接电话，没多久就听说他就已经离职了。</p>\n<p>无奈下，让领导又找了一家供货商，在购买前确认好了协议和上传内容，终于实现了领导的想法。然而，这仅仅是戳中了领导兴奋点的开始。</p>\n<p>“必须要让居民更愿意使用才行”，领导在会议上说，“我决定了，我们要用无人售卖机，跟社区超市打通”。我们团队又跑河北和湖南两地，领导不同意买机票，都是我们自己开车去的，就是为了看看自动售卖机能不能跟系统完成对接，还不能太贵。最终买了一台 6k 左右的设备，能跟小程序的积分系统打通。不过这事儿领导也就热乎了一阵，跑业务的同事谈了十家超市里面十家不愿意合作，最终设备就扔外面，也黄了。</p>\n<p>你以为领导受到挫折就此罢休了吗？并不是，他开始让我去接触电气工程师的工作，去研究 PLC 的云端远程控制和车载电脑，痛苦和折磨在此展开。</p>\n<p>[待续 ...]</p>",
    "publish_time": "2023-09-02 10:26:59",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  }
]