[
  {
    "title": "关于啃老这件事",
    "url": "https://www.v2ex.com/t/912784",
    "summary": "Sanshi4396: <p>我有个朋友。  </p>\n<p>苏北人，最近想买车。原先预算是 15w 左右，但是由于最近特斯拉狂降价，有点想买 modelY 。  </p>\n<p>但是买车的钱自己只能出 10%，剩下的 90%都得爸妈来承担，他现在很纠结，觉得给家里人的压力太大了，因为他爸妈已经为他在苏南某发达城市购置了新房，目前正在装修（装修钱也是爸妈出）。  </p>\n<p>还有一个细节，他已经跟他爸妈开过口了，爸妈表示你想买就买。  </p>\n<p>想听听大家的意见，到底是满足自己的欲望还是为父母考虑，尽这份孝道。</p>",
    "publish_time": "2023-02-03 10:03:36",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  },
  {
    "title": "关于不交社保的一些设想，请大家研讨一下",
    "url": "https://www.v2ex.com/t/912787",
    "summary": "Milicense: 写在最开始：这个想法和方案呢，纯为我自己考虑，或者说起码不是给有户口等方面影响的城市所设想的。但其他很多城市应该也是可以参考的。<br /><br />个人情况简介：本人今年 30 周岁。上海工作了几年回家发展（ 2 线中游城市吧）。在上海交了几年社保，回家到现在为止应该有四五年了，交了大概不到 2 年社保（当时在单位上班）。目前自己开小公司创业，距离上一次交社保应该有 2 年 gap 了。<br /><br />本设想的一些现实依据以及对未来的判断：<br />1 、如果交社保，因为我只是开个小公司所以理论上来说，个人和公司部分都是我承担的，所以我按 1300/月来计算。<br /><br />2 、根据最新的政策，以及全球的趋势，退休年龄肯定会越来越迟。所以我按 65 周岁计算，我还需要交 35 年社保。<br /><br />3 、我对未来的判断，现在社会发展的速度非常快（以前可能 10-20 年不会有大变动，但现在 3-5 年就翻天覆地）加上老龄化日益凸显，所以我分析社保政策以及我退休以后享受到的政策肯定比现在有变化，且大概率是比现在差的。<br /><br />4 、我计划每个月拿出 1300-1500 来定投黄金（至于为什么不选其他金融产品，这个就不过多讨论了吧，大概的原因就是我们这个世界货币体系是金本位，其余钞票货币都只是符号而已，或许定投 30 年基金也能赚很多，但这需要有一定的投资经验，不适用于大部分人，且这项投资最关键是求稳，黄金我认为是有这个能力的）。<br /><br />5 、这么计算下来，到我退休我共计需要交 55-60W 人民币的社保。<br /><br />分析下交不交的利弊。<br /><br />交社保：<br />好处：<br />1 、很高比例的住院报销，这也是我目前最纠结的点。<br />2 、每个月可以有一定的医保卡余额来买药，也就相当于现金了，毕竟头疼感冒是肯定会有的。<br />3 、其余的工伤 /生育 /失业说实话，在我看来聊胜于无。<br />4 、退休以后每个月可以领到一笔退休金。关于退休金，我目前身边亲戚退休，交的社保年限不高也不低的，大概在 2300-2700 这个区间（刚退休三五年后面还会慢慢涨），因为我如果目前交社保，我认为基本最后退休了计算下来应该也是在这个区间，所以我按这个退休金在目前社会通胀以及我的城市和我个人家庭消费水准来判断，对我来说基本就是零花钱，也就是说，聊胜于无。当然，这并不代表说我是富二代或者怎么样，只是现在一个月 2000 多，实在算不上多吧？不要杠什么最低标准的什么的，咱就按用着 iphone ，电脑用 macbook ，汽油加 95 的个人和家庭来说。<br /><br />缺点：<br />1 、我个人对退休政策以及未来世界整体 [养老金] 的发展趋势持悲观态度，我认为最后可能是赔的。<br />2 、在国家看来我是无业状态，在办信用卡等一些情景下会有影响。<br />3 、活到 100 岁的话，可能领的退休金是多的。。。<br />4 、住院所有的费用自己全额支付。<br /><br />我整合了一下我的需求，不求赚只要不赔就行，所以：<br />55-60W 元的本金定投黄金，从 30 岁到死住院看病够不够。<br />我们家没什么遗传病，爷爷奶奶姥姥姥爷身体都挺好的，我身体虽然算不上多健壮，起码没什么常年的病。<br /><br />各位彦祖们怎么看？（此贴并非针对最近的政策新闻，而是因为我一直没交社保所以早有这个想法）",
    "publish_time": "2023-02-03 10:10:22",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  }
]