[
  {
    "title": "怎么现在新房好多都是精装房了？装修质量可不可靠？",
    "url": "https://www.v2ex.com/t/987299",
    "summary": "kisshere: 有没有买精装房的 V 友，会不会偷工减料 or 用黑心材料？会不会用个几年后全是问题？<br />选精装房是不是大的开放商就没问题？",
    "publish_time": "2023-11-01 08:12:46",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  },
  {
    "title": "这几年开始落伍的开发技术有哪些？",
    "url": "https://www.v2ex.com/t/987300",
    "summary": "mingdeng: 1.模版引擎及 mvc 开发模式，被前后端分离替代；<br />2.js 的 dom 操作及 jquery ，被 vue 、react 替代。<br />以上是我知道的，欢迎补充",
    "publish_time": "2023-11-01 08:16:59",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  },
  {
    "title": "既然这是为你好，各位还买菊花的设备吗？",
    "url": "https://www.v2ex.com/t/987326",
    "summary": "Kowloon: 一个问题，有过这么一出为你好以后，在坐的各位还会选择菊花的设备吗？非常想听听大家的想法。<br /><br />我家现网除一块哇为手表以外无任何该社产品，至于我控制不到的城域网 NE40E-X16 SR/NE5000E CR 操心也没意义了......",
    "publish_time": "2023-11-01 09:41:00",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  },
  {
    "title": "感情受挫，真诚发问",
    "url": "https://www.v2ex.com/t/987536",
    "summary": "i7eo: <p>希望有经验或相同经历的 v 友能给出建议，我确实有些不知所措了🥺</p>\n<h2>背景交代</h2>\n<p>我 29 女友 27 ，相恋 3.5 年，目前俩人都在西安。女友前天中午提出分手给出理由：“在我心中你很强大，情绪稳定。但是目前的我很懦弱我一时半会说服不了我妈让咱们在一起，我不想你这么卑微”</p>\n<h3>女方背景</h3>\n<p>硕士毕业的东北女生，女友整个家庭已从东北搬至西安近 10 年。期间女友妈妈与他人合伙在西安做生意，目前带着几个依附于女方妈妈的亲戚在陕北开店做生意。家庭中女方妈妈是主心骨。女方妈妈不论是生意还是家庭都很强势基本属于一言堂。女友家在西安有几套房产，女友名下有一套房一辆车，费用（包括月供）均由女友妈妈爸爸提供。女友目前在某初中做实习教师，因为上半年才考的教师资格证所以目前 0 薪实习。</p>\n<h3>男方背景</h3>\n<p>本人咸阳人，普通一本毕业，从事软件开发工作。西安有一套房（还贷中），无车。父母某国企厂员工，爸爸还在厂子里上班等退休，妈妈 2014 年主动办理退休，自学、报班学习育婴/家政方面的技能。目前在北京做育婴/家政/育婴培训讲师方向的事暂无退休打算。我目前月税前（主+副） 32-40 不等。</p>\n<h2>自我认知</h2>\n<p>上述为简单背景，女友家各方面条件自然好于我。她家人对于她找对象这件事给出的方向是博士学历无房或西安本地稍有实力。我本人与我爸妈表示理解因为每个人都有追求更好生活的权力，而且希望子女更上一层楼是人之常情。在与女友交往期间也曾多次讨论过这个问题，但是我们设想过多种解决方案：例如我去读在职或者尝试副业/创业（短期内挣钱的能力）已满足女友妈妈的条件。随后也算顺利的开始了副业。女友去年研究生毕业，因为毕业/找工作/考取教师资格证事情不太顺利加上期间女友妈妈也是对女友的能力质疑不间断的施加压力导致女友一直比较 emo ，不过最终我们共同陪伴走了过来。我本人是典型的外冷内热，不熟的人根本不想沟通；女友是比较外向开朗的类型，性格非常好，可能因为家里做生意的背景，女友的沟通与处事尺度把握的很到位。这点是我非常欣赏与佩服的，我们的朋友都说我们及其互补也很看好我们结婚。在我们交往期间女友尝试在她妈妈面前提起过我但都被学历低/家庭条件不匹配回绝，期间曾断过女友的生活费，但是我女友坚定的和我一起坚持了下来。交往期间女友不作，我们的支出也是相互的，基本节日互相送礼物，她妈断生活费期间我帮助她，我前公司拖欠工资时她帮助我</p>\n<h2>自我判断</h2>\n<p>女友在学校开始实习后因为没钱拿还要处理各种琐事一直心情也不太好，外加她妈妈会说你什么时候挣钱我的义务在你毕业就已经结束之类的话导致女友这半年多来很惆怅。她妈妈基本每天晚上都要与其视频，如果我在她需要找一个安静的地方与妈妈通话。女友妈妈经常告诫女友现在社会没有爱情，每次女友想正常友好的沟通都会被妈妈挂电话/翻旧账/自己养育女儿耗费多少钱而打断。我很心疼女友，我不想其这么割裂但是我们没有更好的办法，女友曾无奈的表示只能靠时间去慢慢磨，我也表示我愿意等待，在等待期间我会尝试更多赚钱的路子去搞钱。至于这次分手原因我猜测大概率是女友妈妈或者一些人又向她施加了压力自己没顶住才向我说了分手，分手后这俩天我们还会时不时聊两句像往常一样的叮嘱话语。</p>\n<h2>发问诉求</h2>\n<p>女友生活在长时间被安排的人生中，自己难免会做出坏决定或者做不出决定。但是在交往期间她有想逃脱想独立的意愿，她更需要的是一股带她成长、独立的力量。我个人是倾向双方冷静一段时间后我去提复合，但是如何面对女友妈妈这个是复合时逃不过的话题。我诚恳希望有过相似经历的 v 友能给我一些建议。谢谢大家🥺</p>",
    "publish_time": "2023-11-01 16:02:33",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  }
]