[
  {
    "title": "一个人在海底捞过生日是怎么样的体验？",
    "url": "https://www.v2ex.com/t/989704",
    "summary": "smallpampan: <p>11 月的南京，梧桐落叶是浪漫的，此时的微风并没秋意萧瑟，显得温柔惬意，漫无目的、随意走在梧桐大道，十分安逸。</p>\n<p><img alt=\"image.png\" class=\"embedded_image\" rel=\"noreferrer\" src=\"https://p6-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/40fa6a46c36f4c9b82d03f2797daf3d4%7Etplv-k3u1fbpfcp-jj-mark:0:0:0:0:q75.image#?w=1280&amp;h=2279&amp;s=340652&amp;e=jpg&amp;b=31170a\" /></p>\n<p>时间线拨到一人流浪到南京的第二天，上午还在中山陵景区的梧桐大道散步，谁知道下午就被突袭的冷雨淋得满身湿透，遂即回酒店休整洗澡换衣服。</p>\n<p>所以为什么要一个人去海底捞过生日呢？</p>\n<p>回酒店后感觉寒意入体，就想着去吃火锅，那就决定吃海底捞吧。至于过生日，完全是因为生日期间在海底捞可以满 200 减 30 ！然后故事就发生了</p>\n<p>在此我完全没计划要给自己做一个怎么样的生日，加之从小极少过生日，所以对庆祝生日这件事情一直都不感冒，以至于在这次体验中，留下深刻影响。</p>\n<p>我选择了离酒店最近的新街口海底捞，并出门前提前拍号。可能是生日的原因，今天有点运气在身上（除了被雨淋湿全身以外），刚到海底捞门店，也刚好排到我的号，直接可以直奔餐桌！因为排号，我在路上还在想，如果还没到我，我就提前暴露出今天生日，让工作人员提前安排，享受一把生日的待遇哈哈，结果还是直接进去了。</p>\n<p>由于我是一个人来，我坐下后，服务员马上给我安排了一个小朋友陪我一起吃饭，除了脑袋大一点，不会吃以外，这位小朋友是很不错的，这也是我第一次一个人去海底捞吃火锅。</p>\n<p><img alt=\"image.png\" class=\"embedded_image\" rel=\"noreferrer\" src=\"https://p6-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/682593de266345a0a5e30565ebd255a1%7Etplv-k3u1fbpfcp-jj-mark:0:0:0:0:q75.image#?w=1706&amp;h=1278&amp;s=282816&amp;e=jpg&amp;b=c0b8a9\" />\n本着省钱的目的，并且利用我的生日权益，我就跟服务员询问：“今天过生日的话，会有什么优惠吗？”，小哥哥一脸惊喜地说：“当然，可以送你小礼品，还会为你准备长寿面”。所以我的目的达到了，这下主食和零食都有了，我满意地点了点头。</p>\n<p>谁知服务员又接着说，“我们给你唱一首生日歌庆祝一下吧，一个人也需要有仪式感”。我当然连忙回绝，就算朋友来吃饭，我估计也不敢想在海底捞过生日被祝福，更何况现在就我自己一个人，无法想象一个人被一群海底捞社牛服务员围着唱歌，加上别人在围观的场面，那我就直接社死了吧哈哈哈。</p>\n<p>正当我吃到一半时候，我相邻两桌轮着过生日，对的，合着大家都奔着来海底捞过生日的。我听了一遍遍邻座的生日歌“给所有的烦恼说嗨嗨！”，甚至还拉起横幅！邻座都是年轻的小姐姐们，这种氛围好欢快，形成反差的是我对面的不会说话的朋友，让我不得不羡慕。</p>\n<p><img alt=\"image.png\" class=\"embedded_image\" rel=\"noreferrer\" src=\"https://p9-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/8f6e1d08c648458a850f50e6f83eddf1%7Etplv-k3u1fbpfcp-jj-mark:0:0:0:0:q75.image#?w=1706&amp;h=1278&amp;s=307068&amp;e=jpg&amp;b=886c48\" /></p>\n<p>服务员也观察到我一直看她们唱生日歌了，可能看我可怜，然后又来怂恿我，说要给无论如何给我唱歌庆祝，经不住服务员的热情，我动摇了。为什么不呢？我一个人也可以开心过生日，我也可以把这天当作一个特殊的日子，我也可以想她们一样，找一个借口让自己欢快一下，为什么不体验别人过的生活呢？然后我欣然同意了。</p>\n<p>服务员征得我同意然后离开准备，这期间我竟然有点激动，有点期待，连在涮肉时拿筷子的时候都有点发抖，有点不敢想象，一会我可能被围着唱歌成为焦点？那我需要做什么？表现淡定还是开心？说实话，长这么大，在我记忆中我正式过的生日只有三次，一次是前女友、一次前前女友，还有一次就是大学期间，为什么记记得这么清楚？因为这三块蛋糕的形状我还记得。虽然早已对过生日不报期待了，但不知道为何紧张起来了？我只需想体验一下而已。</p>\n<p>正当我吃的差不多结束后，服务员悄咪咪从后面走来，端着了一碗长寿面，一个熊猫蛋糕。小蛋糕是我事先不知道的，还给我点上了蜡烛，那可是今年的第一个生日蛋糕！这样突如其来的小惊喜，导致多巴胺一下子被促进分泌，差点让我成熟稳重的我不知所措，脸瞬间感到发烫，鼻子又点酸酸，但还是被我一寒口气把情绪都给咽回去了。就在生日歌刚开始的时候，相邻的两桌小姐姐也注意到一个人的我，因此此一起加入庆祝行列，大家一起对我唱着歌，一起跟着拍子鼓掌，这个着实又让我感动到了。由于过于激动，我现在忘了在吹蜡烛的环节，我许了什么愿望。那就一律按照早日暴富的愿望处理吧！！</p>\n<p><img alt=\"image.png\" class=\"embedded_image\" rel=\"noreferrer\" src=\"https://p1-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/f4463ca03f92467eb7586e66aae0b595%7Etplv-k3u1fbpfcp-jj-mark:0:0:0:0:q75.image#?w=1170&amp;h=655&amp;s=428419&amp;e=jpg&amp;b=835d44\" />\n生日歌唱完后，又有一个邻座的小姐姐赠送了一块她们的蛋糕。是呀，一群人过生日原来是这样的，感谢当时在场的所有人，让我体验到了，那种紧张激动，让在场的我忘却社恐、忽略了尴尬，更多的是不知所措的感动，强忍落下的热泪，正当自己处于祝福中心，我也可以值得去享受来自大家的歌声祝福、接受陌生人的善意 并享受其中。勇敢享受生活，热爱自己，大概就是这样吧！这就是我一个人在海底捞过生日的最大体验。\n<img alt=\"image.png\" class=\"embedded_image\" rel=\"noreferrer\" src=\"https://p3-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/bcacdc555f54491eae6dfc440228643c%7Etplv-k3u1fbpfcp-jj-mark:0:0:0:0:q75.image#?w=1706&amp;h=1278&amp;s=322707&amp;e=jpg&amp;b=cbc3b6\" />\nPS：左边是小姐姐送的蛋糕，右边是海底捞准备的蛋糕</p>\n<p>直到喧闹过后，走出海底捞，回归安静自在的我。我没有做什么，没有给家里人打电话，微信里面也没有关于收到生日快乐的祝福，也并没有感觉到失望或者不开心。但与往年不同的是，我跟自己说了一句：祝自己生日快乐。</p>",
    "publish_time": "2023-11-08 01:43:18",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  }
]