[
  {
    "title": "毕业参加工作后，老家一堆人借钱。",
    "url": "https://www.v2ex.com/t/1049681",
    "summary": "ShihanW: <p>毕业参加工作后，老家一堆人找我借钱，两个童年的发小，各自借了几千，到约定还钱的时候找不见人，微信，电话统统无法联系，过几天有一个居然主动找我，没想到开口还是借钱，借八百月底先还一千，之前失约我生气怼了几句，对方居然当场翻脸，撂话说还的起不要催，以后不会再找我借一毛钱，保持距离啥的。网上人家常说，借钱后可能就无法做朋友，对于这个结果，我提前做了心里准备，但还是有点吃惊，几千块就能让人推翻十几年的“友谊”形成陌路，也许是我把感情看太重了。另一个失踪的发小，当初车贷到期，老婆产子住院缺钱的的时候，如何信誓旦旦的保证，现在看就是一个笑话，不靠谱的人，永远都不会靠谱。</p>\n<p>龙年春节前，弟弟结婚，彩礼钱不够，父亲找我要了两万，说不是补贴家里用，而是算借给弟弟结婚用，我给了。婚后弟弟表现真是让人无法置评，班不好好上，存粹是父亲一个人养活他夫妻俩。有次我看不下去和弟弟电话沟通谈及为张罗婚事父亲欠了很多钱，以及以他名义借两万的事情，他表示并不知情，对于这笔钱，我还能不能要回来，或者说我想拿回来给父亲的钱，这合情合理吗？</p>\n<p>婚礼举行，我请假回家几天期间，大伯找我借钱，理由是好不容易考下来驾驶证，想买辆车开开，运点农产品什么，可是他们家，大堂哥有一辆微型货车，二堂哥一辆微型货车+SUV ，我拒绝了，因为真的再拿不出大几万块。婚礼完毕送我到车站的大堂哥表示贷款压力太大希望我借点钱缓解缓解。</p>\n<p>我返杭不久，有天准备下班回出租屋，父亲电话过来说，舅舅打算买辆车，全款不够，向他开口借两万，他已经被婚礼掏空，舅舅就想找我，我寻思你借钱直接找我，怎么让我爸来问我，让他代借呢？父亲表示以前家里很穷，他借了村里的高利贷，还不上，债主过来把年猪牵走，是舅舅拉了一把，如果是别人开口他不会理财，唯独舅舅，对我们家有恩，希望我还这个人情，我当时就答应了，不知道他喝了酒还是什么，隔天又三番四次打电话过来问我答不答应，听着像规劝又像命令，搞得我很烦，最后舅舅主动联系我，转了钱才结束。其他借钱的人，像表弟什么的，就不说了，借一千五还一千，说什么刚交车险手头紧，后面再借都拒绝了，原本热情的关系，瞬间变得冰冷。</p>\n<p>过年回家期间，好像三姑六姨，街坊邻居，认识的每个人都在打听我的工资，热情地让我不自在，好像我是被锁定的猎物一般，那种感觉，特别是得知大学生毕业，工资也就几千块，露出警觉又怀疑的表情的时候。</p>\n<p>唯一不关心我工资，也不想要我钱的人，恐怕就只有外婆了，真正对我好，不计回报的人。</p>\n<p>夜深人静的胡思乱想，浪费大家几分钟的时间阅览。</p>",
    "publish_time": "2024-06-15 04:04:46",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  },
  {
    "title": "6 千块配了台无 GPU 的开发用 PC, 大佬们帮我把把关",
    "url": "https://www.v2ex.com/t/1049688",
    "summary": "Avafly: <p>我是纯小白, 以前没有配过主机, 都是买的笔记本. 这次要买一台主机开发用, 预算 6 千公司报销. 显卡以后会购买所以不算在这 6 千内.</p>\n<p>自己找了个整机配置, 抄作业然后小改了下, 下面是我的配置单. 希望各位大佬帮忙把把关看下有没有什么冲突的 (比如电源太小主板不兼容啥的, 我怕犯低级错误). 然后如果有更好的推荐也请不要吝啬, 谢谢了!</p>\n<table>\n<thead>\n<tr>\n<th>配件</th>\n<th>型号</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>CPU</td>\n<td>AMD R7 7700x</td>\n</tr>\n<tr>\n<td>内存</td>\n<td>三星 DDR5-5600 (16GB) x 4</td>\n</tr>\n<tr>\n<td>主板</td>\n<td>微星 MAG B550M 迫击炮 WiFi</td>\n</tr>\n<tr>\n<td>硬盘</td>\n<td>三星 980 M.2 NVMe 1TB</td>\n</tr>\n<tr>\n<td>电源</td>\n<td>还没看, 总之要 600W 的电源</td>\n</tr>\n<tr>\n<td>散热</td>\n<td>ALSEYE M120D PLUS</td>\n</tr>\n</tbody></table>",
    "publish_time": "2024-06-15 08:07:58",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  }
]