[
  {
    "title": "朋友孩子毕业 2 年多没找工作，我应该怎么帮？",
    "url": "https://www.v2ex.com/t/1017030",
    "summary": "syh2: <p>事情是这样的，朋友的小孩毕业 2 年多了，一直没有找工作（暂时不知道是没找，还是找不到）\n朋友小孩是普通本科院校毕业的（海外），读的是工商管理里面的 [国际贸易] 。</p>\n<p>刚毕业的时候说考公务员，为了保留应届生身份，不能交社保（意思是不能签劳动合同，只能实习），然后可能有考几次吧，一直没上岸，然后就不了了之，后面就一直在家。</p>\n<p>过年前的时候和孩子大吵了一架，意思是孩子天天在家不出去找工作，吃老本之类，可能想刺激一下孩子，说了很难听的话，说再不去找工作，就把门锁换了以后都不给回来之类的，伤到孩子的自尊心了。</p>\n<p>现在跟我提起这个事情，我想帮，但是好像也无从下手，主要有以下几个问题：</p>\n<ul>\n<li>\n<p>我不知道 [国际贸易] 适合做什么工作（ GPT 推荐 “进出口公司的贸易专员，大型跨国公司的供应链管理岗位，或者贸易咨询公司的咨询顾问等”可以做，不知道有没有朋友懂的）</p>\n</li>\n<li>\n<p>毕业那么长时间，应该是没有应届生身份了，没有工作经验，走社会招聘的话，怎么能找到对口的专业？</p>\n</li>\n<li>\n<p>现在不像以前，托关系找工作打声招呼就行了，现在大公司都要走正规面试流程，即使是关系户，最起码学历，经验条件都要符合才行，直接安排工作应该是不可能的了，我找人内推去大公司，感觉机会也不大</p>\n</li>\n<li>\n<p>朋友孩子虽然一直没上过班，但是有实习过，做过阿里巴巴之类的，说不喜欢（好像说觉得性格不合适），感觉朋友孩子可能不太能吃苦，甚至有点挑工作，目前实际情况好像也很难有得挑。</p>\n</li>\n</ul>\n<p>综合分析下来，我目前只能去一些招聘网站看看，然后想办法帮忙看看怎么丰富简历之类，有没有朋友有好的想法，或者有不同的建议或者观点的，很欢迎评论跟我讨论，我也没说这个忙我一定能帮得上，但是还是希望朋友孩子能尽快找到合适的工作吧。</p>\n<p>欢迎大家理性讨论这个话题，多给点建议，抱拳了</p>",
    "publish_time": "2024-02-21 00:30:50",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  },
  {
    "title": "待在一家公司十二年，快 35 了，该何去何从",
    "url": "https://www.v2ex.com/t/1017090",
    "summary": "seanwhy: 先说下自身情况吧：计算机行业（非互联网） C++程序员，马上 35 周岁，私企（效益拉跨），坐标杭州，已婚一孩，有一房两车，无贷，现金流因为拆迁有个 300w 。<br />公司离家五公里内，怎么开车都不堵，十五分钟肯定能到。自己一年 20 个左右，五险一金基数公司按基数低的交（我也无所谓），媳妇稍微比我少点，但企业福利好，其实算上公积金是要比我好的。两人都不卷，对孩子也没卷的想法，所以都无 996 ，照常上下班，公司请假也卡的不严。<br />从毕业就进了这家公司，主攻 C++、前端也涉猎，善搬砖。个人不太上进，也许看透了人员进进出出吧，也没多余的晋升想法，就一直做个大头兵，但至少能撑住公司一条业务线。<br />疫情这几年，就感受到了公司在走下坡路，基本年终都不发了。今年更甚，全员降薪，想跑路（找的再差也不能比我现在还差吧，我资薪要求很低了）但看了下惨淡的就业市场，还有通勤，请假的考量，感觉快 35 了，基于我个人情况（无面试经历、表达能力欠缺），找到待遇好的肯定会加班。<br />我是继续苟着吗？还是要不甘心的放手去找待遇更好的工作，但面临更大的转换成本和压力？各位 V 友给我出出意见，挺迷茫的。",
    "publish_time": "2024-02-21 10:25:01",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  },
  {
    "title": "写一句你所知的计算机界名言名句。",
    "url": "https://www.v2ex.com/t/1017108",
    "summary": "Margelator: \"Any application that can be written in JavaScript, willeventually be written in JavaScript.\"  ——Jeff Atwood<br />“任何能够用 JavaScript 实现的应用系统，最终都必将用 JavaScript 实现。”  ——杰夫·阿特伍德",
    "publish_time": "2024-02-21 10:46:18",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  }
]