[
  {
    "title": "差点挂了",
    "url": "https://www.v2ex.com/t/1034302",
    "summary": "timjunk: <p>可能有些标题党了，但我刚刚真的觉得我怕不是要折了。。。</p>\n<p>刚刚坐在椅子上，伸手去捡地上的东西，右手手臂根部扭了一小下，有点痛(是那种内痛，但其实也没感觉有多扭到，但就是痛了一小会。也没有特别痛，但比这个手伸到椅子下这个行为预期的痛感要稍微强一些，也要持久一些)，坐在椅子上扭几下手臂想缓一缓，结果感觉有贫血的感觉，越来越强烈，脑袋放空，身体没甚么力气，眼睛出现雪花，视野缩窄(不是变黑，而是单纯的看不太见，很难描述，反正就是很难看见东西但视野没变黑)，然后感觉有点恶心，有喘不上气的感觉，我感觉不太妙，有种之前运动过度，喘不上气，感觉恶心，感觉好象要死了的感觉，不是初中时正常运动的喘，而是上大学多年不运动后骑完脚踏车忽然停下来的那种喘不上气。很担心是不是要猝死了...</p>\n<p>我觉得不妙，就颤颤巍巍的从椅子上爬回床上躺下来，耳朵开始耳鸣，有很明显的嗡嗡叫，浴室里的抽风机的噪声很明显的变小了。我躺在床上尝试稳定心跳，不过我没有感觉心律不整。</p>\n<p>躺在床上一会之后，耳鸣消失了，那种贫血的感觉减少了，也喘的上气了，我又缓了一会儿，然后从床上起来，站在地上，又有了贫血的感觉，不过这种感觉是常见的站起来的贫血感，可能大约 10-20 秒左右就渐渐恢复视力了，脑袋也不会感觉很怪了。</p>\n<p>右手靠近嘎吱窝那边有一点点拉伤的感觉。</p>\n<p>坐下来想了想，心里有些后怕，肯定得做做身体检查之类的。</p>\n<p>忽然想到我好象应该测一下心律和血氧，不过很可惜，刚刚手上没有带手环，我是等状况好很多，甚至是写完刚刚那上面那堆东西之后才想起来要测血氧的。结果是 95-97%，心律大约是 75-80</p>\n<p>如果你要问我最近的作息的话，那确实是相当奇怪了。差不多每天都是凌晨 4-5 点睡，这学期没有早课，所以基本中午 11 点左右起床。今天因为是假日，我是下午 1 点左右起床的，昨晚因为有一只大飞蛾非到我房间里面，我不太敢睡... 那隻飞蛾后来飞到浴室里面，我就赶紧把门关了假装它不存在... (然后那只飞蛾就不见了，浴室里再也没看到，房间里也没看到，我浴室的门下方有漏缝所以其实那只飞蛾可以从那边钻出来。我用纸箱稍微堵了一下，但可能有漏缝。我把牙刷拿出来了，但漱口杯没有)</p>\n<p>把上面写的那串东西丢给 chatGPT ，居然就回了个\"听起来挺吓人的。\"，就离谱。这 chatGPT 200%是变傻了。\nbing 跟我说有可能是血压有问题。llama3 8b instruct 说是过度呼吸或者血管迷走性晕厥，反正跟血压有关。llama3 70b 和 claude sonnet 也说是血压。\n因为我的小米手环只能测心率和血氧，我就上亚马逊买了个血压仪，但就算我是高贵的 prime 会员，最快也要两天后才能送到。查了一下附近的药店买同样的血压仪价格直接翻倍，就离谱。 </p>\n<p>但高血压低血压这种事不是大多数发生在中老年吗？我不懂呀，我 tm 只是个才 20 岁出头的大学牲啊。不健身不抽烟不喝酒不吸毒，压力低吃的多作息混乱... 几年前做健检的时候是有查处过一次心率比正常人稍微慢那么一丢丢，但应该不是大问题...</p>\n<p><img alt=\"\" class=\"embedded_image\" rel=\"noreferrer\" src=\"https://i.imgur.com/V5GR35W.png\" />\n<img alt=\"\" class=\"embedded_image\" rel=\"noreferrer\" src=\"https://i.imgur.com/NLO37wB.png\" />\n<img alt=\"\" class=\"embedded_image\" rel=\"noreferrer\" src=\"https://i.imgur.com/xA0yGKx.png\" />\n<img alt=\"\" class=\"embedded_image\" rel=\"noreferrer\" src=\"https://i.imgur.com/xacOJTh.png\" />\n<img alt=\"\" class=\"embedded_image\" rel=\"noreferrer\" src=\"https://i.imgur.com/K8nTNIq.png\" /></p>",
    "publish_time": "2024-04-21 09:08:42",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  }
]