[
  {
    "title": "差点挂了",
    "url": "https://www.v2ex.com/t/1034302",
    "summary": "timjunk: <p>可能有些标题党了，但我刚刚真的觉得我怕不是要折了。。。</p>\n<p>刚刚坐在椅子上，伸手去捡地上的东西，右手手臂根部扭了一小下，有点痛(是那种内痛，但其实也没感觉有多扭到，但就是痛了一小会。也没有特别痛，但比这个手伸到椅子下这个行为预期的痛感要稍微强一些，也要持久一些)，坐在椅子上扭几下手臂想缓一缓，结果感觉有贫血的感觉，越来越强烈，脑袋放空，身体没甚么力气，眼睛出现雪花，视野缩窄(不是变黑，而是单纯的看不太见，很难描述，反正就是很难看见东西但视野没变黑)，然后感觉有点恶心，有喘不上气的感觉，我感觉不太妙，有种之前运动过度，喘不上气，感觉恶心，感觉好象要死了的感觉，不是初中时正常运动的喘，而是上大学多年不运动后骑完脚踏车忽然停下来的那种喘不上气。很担心是不是要猝死了...</p>\n<p>我觉得不妙，就颤颤巍巍的从椅子上爬回床上躺下来，耳朵开始耳鸣，有很明显的嗡嗡叫，浴室里的抽风机的噪声很明显的变小了。我躺在床上尝试稳定心跳，不过我没有感觉心律不整。</p>\n<p>躺在床上一会之后，耳鸣消失了，那种贫血的感觉减少了，也喘的上气了，我又缓了一会儿，然后从床上起来，站在地上，又有了贫血的感觉，不过这种感觉是常见的站起来的贫血感，可能大约 10-20 秒左右就渐渐恢复视力了，脑袋也不会感觉很怪了。</p>\n<p>右手靠近嘎吱窝那边有一点点拉伤的感觉。</p>\n<p>坐下来想了想，心里有些后怕，肯定得做做身体检查之类的。</p>\n<p>忽然想到我好象应该测一下心律和血氧，不过很可惜，刚刚手上没有带手环，我是等状况好很多，甚至是写完刚刚那上面那堆东西之后才想起来要测血氧的。结果是 95-97%，心律大约是 75-80</p>\n<p>如果你要问我最近的作息的话，那确实是相当奇怪了。差不多每天都是凌晨 4-5 点睡，这学期没有早课，所以基本中午 11 点左右起床。今天因为是假日，我是下午 1 点左右起床的，昨晚因为有一只大飞蛾非到我房间里面，我不太敢睡... 那隻飞蛾后来飞到浴室里面，我就赶紧把门关了假装它不存在... (然后那只飞蛾就不见了，浴室里再也没看到，房间里也没看到，我浴室的门下方有漏缝所以其实那只飞蛾可以从那边钻出来。我用纸箱稍微堵了一下，但可能有漏缝。我把牙刷拿出来了，但漱口杯没有)</p>\n<p>把上面写的那串东西丢给 chatGPT ，居然就回了个\"听起来挺吓人的。\"，就离谱。这 chatGPT 200%是变傻了。\nbing 跟我说有可能是血压有问题。llama3 8b instruct 说是过度呼吸或者血管迷走性晕厥，反正跟血压有关。llama3 70b 和 claude sonnet 也说是血压。\n因为我的小米手环只能测心率和血氧，我就上亚马逊买了个血压仪，但就算我是高贵的 prime 会员，最快也要两天后才能送到。查了一下附近的药店买同样的血压仪价格直接翻倍，就离谱。 </p>\n<p>但高血压低血压这种事不是大多数发生在中老年吗？我不懂呀，我 tm 只是个才 20 岁出头的大学牲啊。不健身不抽烟不喝酒不吸毒，压力低吃的多作息混乱... 几年前做健检的时候是有查处过一次心率比正常人稍微慢那么一丢丢，但应该不是大问题...</p>\n<p><img alt=\"\" class=\"embedded_image\" rel=\"noreferrer\" src=\"https://i.imgur.com/V5GR35W.png\" />\n<img alt=\"\" class=\"embedded_image\" rel=\"noreferrer\" src=\"https://i.imgur.com/NLO37wB.png\" />\n<img alt=\"\" class=\"embedded_image\" rel=\"noreferrer\" src=\"https://i.imgur.com/xA0yGKx.png\" />\n<img alt=\"\" class=\"embedded_image\" rel=\"noreferrer\" src=\"https://i.imgur.com/xacOJTh.png\" />\n<img alt=\"\" class=\"embedded_image\" rel=\"noreferrer\" src=\"https://i.imgur.com/K8nTNIq.png\" /></p>",
    "publish_time": "2024-04-21 09:08:42",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  },
  {
    "title": "浪费 V 友几分钟时间阅读，这次商业化失败的原因有哪些呢，能得到什么教训呢，我没想清楚。",
    "url": "https://www.v2ex.com/t/1034285",
    "summary": "ShihanW: <p>这些天整理重构了一下子之前复活的微信机器人的代码，一开始是参考别人写的项目代码，模块系统属于 CommonJS 规范，我在入门 JS 的时候，直接学的 ES6 ，所以对该系统不是很熟系，重构成 ES6 后相信后续开发会愉快不少。</p>\n<p>我把源码发布在<a href=\"https://github.com/WShihan/webot\" rel=\"nofollow\">github</a>上，与其他成熟的项目对比，它很小，主要功能聚焦在对话上，能接入 chatgpt 对话，还能在微信内设置 AI 角色来调教输出结果。</p>\n<img alt=\"image-20240416141835574\" class=\"embedded_image\" rel=\"noreferrer\" src=\"https://md-1301600412.cos.ap-nanjing.myqcloud.com/pic/typora/%E8%8B%B1%E8%AF%AD%E8%A7%92%E8%89%B2.jpeg\" />\n<p>我有心想给它拓展一些功能，但是好像都没找到合适的需求点。我原本要解决的问题是，在手机上使用生成式 AI ，特别是 chatgpt ，没有电脑方便，要么科学上网后通过官方 app ，要么打开浏览器上官网使用，这两种看起来都不是很优雅（很懒）地使用方式，如果只是对话的话，集成到即时通信软件（比如微信），我觉得是一个很好的解决方案，诸如此类像同义千问，就被集成到钉钉里，还有 IDE 里的一堆 AI 插件。不必再多下载一个 app ，多开一个网页，直接在已有软件上对话，多流畅啊。</p>\n<p>后面开发上线，只有我一个人用，感觉有点浪费，因为注册之后 openai 会给你免费 5 美元额度，正常频率的话能用一段时间，但是存在有效期，想着过期还蛮可惜，于是我把机器人发布在校内表白墙上，不成想用的人还真不少，额度提前刷光了，为此我还找第三方付费。</p>\n<p>用的人多，那我能不能付费后，再将接口转发供给他们调用呢，（只能在微信里使用）然后我收取一些费用，不奢望它使人财富自由，若是能平衡服务器租用和大模型的费用，我也知足了。</p>\n<p>商业逻辑清晰后，我便匆匆地制作了一个 MVP ，发布初步定价¥2 元/月，不付费用每用户每日限定五次对话。意想不到的是，上线后付费的人可以说是寥寥无几，而且原本免费使用的人群也逐渐减少，现在是一个半死不活的状态。哪里出现了问题，至今没有搞清楚。</p>",
    "publish_time": "2024-04-21 02:12:15",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  },
  {
    "title": "应届生找不到工作的话有没有什么非编程类的工作能做的？有没有生活经验丰富的老哥给点建议",
    "url": "https://www.v2ex.com/t/1034320",
    "summary": "FlyingBackscratc: <p><strong>快毕业了，到目前看校招是寄了。</strong></p>\n<p>我目前心态倒是还行，因为我倒不感觉自己真会饿死，毕竟学历还是在这摆着，还可以，技术也还凑合。目前所有谈到的能给岗位的工作，要不然就是工资比较低，我感觉我教育投资这么多，找个低工资的工作亏了。要不然就是工资开的高，但是明确说了我们加班很多的，说实话我是想正常过双休的。所以只能说是工资给低了不愿意去，高的又找不到这样。</p>\n<p><strong>最近突然有个想法是，能不能先找个非编程类的工作干着，比如送外卖啊，卖手抓饼啊，当服务生啊这类的。</strong></p>\n<p>因为我感觉自己有个问题是跟社会脱节比较远。比如一直是感觉自己成绩好，技术牛逼这种的，家里也有没逼我出去赚钱，我是感觉有空余时间多学习比出去打工划算的，所以就从上大学开始就一直在学校里，也没说出去接触什么社会。实际上现在感觉这套东西纯粹是自己陷入乌托邦幻想了，以为自己牛逼，你不去接触真实的群众，阶层滑落现在是很容易就发生的事情，本来也没说谁比谁高级。</p>\n<p>我现在的想法是我的学历技术在这，相对于没学历没技术的老哥们来讲肯定是有优势了，但是老哥们了解社会比我多。我想能不能找个贴近老哥们工作的真实社会的工作，多了解了解社会，总归是有好处的。就算校招里面这次找到了个体面的工作，走精英路线了，每天过体面人上人的生活，少这一层了解我感觉总归从做人角度也是缺失的，不是好事。</p>\n<p>有没有老哥给提提建议，有没有什么能临时做的工作的种类，比较好入行的，还能接触真实社会的。跑外卖或者开滴滴这两个是直接就能想到的，但是想跑滴滴的问题是没车，跑外卖的话感觉好像不怎么跟人打交道啊。</p>\n<p>工地搬砖这种我是不太行。进厂打螺丝的话，我没啥了解，不知道现在是不是说找个厂就能找到的。而且这种工作如果是准备短期做，比如做两个月或者三个月的，进厂签合同有支持这种短期合同的？</p>\n<p>卖手抓饼，咱又没有推车，没有生产资料，还得预先投资买一套，感觉不太合适</p>",
    "publish_time": "2024-04-21 11:44:12",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  }
]