[
  {
    "title": "今年是不是很困难的一年？",
    "url": "https://www.v2ex.com/t/1034815",
    "summary": "Variazioni: 18 年入职，在北京工作了两年，然后转远程工作回济南，在家工作到现在。<br />六年间公司从来没有延迟发过工资，然而这个月居然延迟发工资，还不知道哪天能发。<br />刚买车手头没啥存款，迟一个月发工资可能贷款就还不上，身背 6000 房贷+2500 车贷瞬间就慌了。<br />济南本地的工作，薪水都好少，稍微高一点的都在高新区或者市中心，通勤太远。而且作为一个 30+的程序员，面试八股文早就忘干净了。<br />负责公司产品的部分核心功能，虽然现在能稳定运行，但是交接是个很头疼的事。<br />在纠结是要陪公司熬过这一段时间，还是赶紧走人。",
    "publish_time": "2024-04-23 09:25:35",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  },
  {
    "title": "关于铁路的买票问题，我有一个点子不知该不该讲",
    "url": "https://www.v2ex.com/t/1034821",
    "summary": "Chad0000: <p>一趟列车不需要有一个唯一的终点或始发站，相反：</p>\n<ul>\n<li>它挂着一堆始发地和目的地不同的车厢（只要顺路即可）</li>\n<li>每个车厢的终点是确定的，这样有相同目的地的旅客就会被分配到同一车厢</li>\n<li>列车到站，本站的车厢直接分离，然后再挂上本站出发的车厢继续前进</li>\n</ul>\n<p>优点：</p>\n<ul>\n<li>旅客不再关注车次，只需要关注从始发到终点站，也注是你的车厢号码和时间</li>\n<li>不需要再换乘：你的车厢会在某站挂载到另外一个列车上</li>\n<li>无所谓什么全程不全程的，只要在铁路网上的站点，你基本上都能“直达”</li>\n</ul>\n<p>缺点：</p>\n<ul>\n<li>动态挂载车厢方案需要考验，站点停靠时间更长</li>\n<li>不方便共享餐厅这样的大一些的设施</li>\n<li>跨车厢有走失风险（不方便服务人员）</li>\n<li>\n小众目的地会浪费车厢<ul>\n<li>可以通过更小的车厢降低成本</li>\n<li>可以通过更低的发车频繁降低成本</li>\n<li>可能合并若干个目的地到一个车厢</li>\n</ul>\n</li>\n</ul>\n<p>以上方案如果和地铁打通，那么就意味着从家门到家门基本上无需换乘了。</p>\n<p>非专业人士，欢迎拍砖。</p>",
    "publish_time": "2024-04-23 09:36:46",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  },
  {
    "title": "失恋崩溃中，求骂醒！",
    "url": "https://www.v2ex.com/t/1034891",
    "summary": "Coolha: <p>刚失恋，脑子一团乱，来发文一方面是自己想梳理下，另一方面也是想听听 V 友意见。</p>\n<p>背景：</p>\n<ol>\n<li>\n<p>她是做运营的，我是做后端研发的，我工作 5 年，她工作 3 年，我俩是工作后通过同事组局认识的。我俩在一起 468 天。</p>\n</li>\n<li>\n<p>平时总吵架，开始时（ 0-6 个月）我展开自我反思，觉得自己确实有问题，比如情绪不稳定，会向她索取情绪价值，会没有安全感。所以每次我都会，道歉+阐述自己哪里有问题+后续如何改正，事后我反思的点我确确实实改了（自我成长）。</p>\n</li>\n<li>\n<p>开始时我们两个人都在北京一家互联网公司 K ，在一起 4 个月的时候她去了另一家互联网公司 B ，我看她已经稳定下来了我去了互联网公司 M 。结果在一起 6 个月的时候她又去了杭州互联网公司 A 。这个事情是我俩的分水岭，一方面开启了长期异地的生活，另一方面我俩吵架她开始尝试想要分手。</p>\n</li>\n<li>\n<p>她去杭州之后，我紧接着也开始面杭州，也拿到了互联网公司 A 的两个 BU 的 offer ，不够都需要我降薪 去，其中一个国际化业务需要我降薪 5k 去，她认为降薪接受不了，所以大吵一架之后我把 offer 拒了。</p>\n</li>\n<li>\n<p>后面在一起的中间这段时间（ 8-14 个月）我每周末去杭州陪她，中间用过一段时间南航的随心飞，但是更多的也是自己花钱买的票。这期间还有一个心里比较有疙瘩的事情，她 9 月份刚去杭州的时候说和老板说好了，前 3 个月在杭州团队磨合，后面两地办公两周北京一周杭州，于是我在北京租了个两室一厅（她北京办公地和我公司在一起），不过后面一拖再拖，到最后现在 4 月底了也没有回北京，我能理解这个是老板说的算的事情，但是这毕竟是你先告诉我的，你多多少少要给我个态度，比如说主动和老板说说，比如主动和我聊聊这件事情，而不是就放在那不管了，甚至我提起还会觉得我在施压，觉得我有问题。</p>\n</li>\n<li>\n<p>最后就是每次吵架了，前期吵架我确实有问题上面有提到过，中期吵架我还能找到自己的问题，比如有一次她去西安出差，让我周末也一起去，我周五晚上下班做高铁过去，到了都快 12 点了，结果她告诉我她在做 spa ，让我去找她，但是那会儿我工作一天了，又做了好几个小时高铁，我真的很累很累，于是我没忍住甩了脸子，满脸的不开心（其实我希望她哄哄我），结果大闹了一场，最后结论是我见不得她好，低气压。</p>\n</li>\n<li>\n<p>后期（ 14-16 个月）的时候，每次吵架我基本就知道自己几乎没问题了，比如昨天晚上，她白天工作不顺利，这个我知道，甚至我白天也一直在哄她，提供情绪价值，我会给她提供建议，看她没有采取的意思我也就不再说了，改成安抚和开导，她处理完告诉我怎么处理的，我就一顿夸。另一边我昨天工作也不顺利，有个线上 case 迟迟没有查出来，还有需求当天是 ddl ，还有很多人来咨询问题，总之不堪重负，晚上回家的路上又被大雨淋了。因为一般下班后我们会打视频（异地嘛只能这样），雨中我就打了视频，本来想求安慰，结果接通那一刻我的心就凉了，因为她满脸不高兴，我知道她肯定是累了，我就找了个接口说雨太大到家再给她打。晚上到家后又打了过去，床上躺了一会儿，她说自己不开心想要我给她提供情绪价值（明说），我说我今天也很累，也想要有个人关心关心我（这一天她几乎没关心过我一句），因为我这句话就爆炸了（她脾气比较大），就把我挂了，挂了之后我很生气，微信发了句，要懂得珍惜，这句话刺痛到了她，加上她心情不好，就开始了一顿输出，然后分手删除，拉黑。</p>\n</li>\n</ol>\n<p>其实聊到这我心里基本有答案了，只能说一切命中早已标号了几个，曾经享受过的美好，都要等价还回去。</p>\n<p>欢迎 V 友们给我建议，好的不好的，我都虚心接受，谢谢大家🙏</p>",
    "publish_time": "2024-04-23 11:25:26",
    "source": {
      "name": "v2ex_hot",
      "desc": "v2ex 最热主题",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/v2ex.png"
    }
  }
]