[
  {
    "title": "不读代码也能做技术决策？试试可塑性开发吧",
    "url": "https://www.infoq.cn/article/rj51sC6SmKa6wFaocqrZ",
    "summary": "<p></p><h2>开发人员为什么要阅读代码</h2><p></p><p>&nbsp;</p><p>他们之所以要阅读代码，是因为代码是真相所在。他们也会在其他多种情况下阅读代码。当他们想要学习如何使用API时，他们会阅读。当他们需要找到一个地方添加新功能时，他们会阅读。当他们在查找导致bug的根本原因时，他们会阅读。当他们在查找构建配置不能正常工作的原因时，他们会阅读。当他们在查找测试失败的原因时，他们会阅读。</p><p>&nbsp;</p><p>在开发过程中，人们普遍都依赖阅读代码。事实上，开发人员在这方面花费了大量的时间。多项研究表明，通常超过一半的开发时间都花在阅读代码上。</p><p>&nbsp;</p><p>阅读代码在日常开发工作中根深蒂固，以至于人们认为它是理所当然的。毕竟，他们为什么不能这么做呢？关于编程的一个普遍观点是，代码就像一本书，我们会像读写普通书籍一样读写代码。然而，代码并不完全像是一本书。一个关键的区别是代码通常比一般的书的内容要多得多。假设一个系统有25万行代码，这相当于64本《哈姆雷特》，而快速阅读，比如每天8小时，2秒一行，大约需要一个月的时间，而这还不是全部。《哈姆雷特》的角色有限，情节也可以被简明扼要地概括出来，但一个软件系统却几乎没有可以摆脱掉的代码。只是阅读一次代码很少能够完全了解系统。由于软件系统的本质是相互交织的，要理解它，就必须考虑到所有的内部联系，并将其作为一个整体来理解。另外，一个软件系统的变化速度一直比我们通过阅读来了解它的速度要快得多。因此，不管是从质量还是数量上讲，我们面临的问题都不同于读书。</p><p>&nbsp;</p><p>如果我们后退一步就会发现，虽然情况各不相同，但动机是一样的：开发人员通常想要足够了解系统的一些东西，以边确定下一步要做什么。他们阅读代码是因为他们想要做出决定。这和读《哈姆雷特》是完全不同的，和阅读天文学课本也不一样。</p><p>&nbsp;</p><p>从这个角度来看，阅读代码只是一种从系统中获取信息的策略。只要存在一种方法，就会有另一种方法。实际上，关于系统的一切——无论是代码、配置、日志还是数据库中的数据——都只是数据，而数据最好是使用工具来处理。</p><p>&nbsp;</p><p>当然，在过去的几十年里，各种各样的分析工具并不少见。然而，即使在今天，阅读代码仍然是从系统中获取信息的主要手段。你可能会问：“那又怎样？”</p><p>&nbsp;</p><p>毕竟，正是这种活动让我们的行业变得如此有价值：大多数系统帮助人们对他们永远不会看到的数据做出决定，而开发人员有能力创造这种魔力。我们只需要把我们的能力应用在我们自己的问题上！</p><p>&nbsp;</p><p>“好吧，但该如何做？”</p><p>&nbsp;</p><p>软件系统还有一个我们需要考虑的特性：它们是高度上下文相关的。两个系统可能是针对同一个领域，使用完全相同的技术构建，但仍然完全不同。几年前，我们做了一个实验，试图重现这样的场景。伯尔尼大学的若干学生团队被要求构建相同的小应用程序，并且必须使用相同的库。他们需要满足的需求是一样的，并以相同的方式进行验收测试。在经过了7周的开发之后，我们对他们的系统内部进行了研究。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/12/12dda41616b2c1492668144811b88c78.png\" /></p><p></p><p>&nbsp;</p><p>这张图中有7个系统，对于每个系统，我们用黑色表示类，用红色表示方法，用蓝色表示属性以及它们之间的相互依赖关系。从图中可以看出，尽管这些团队受到了高度约束，但仍然产出了不同的结构。系统的内部工作方式受到许多因素的影响，而这些因素远远超出了技术的范畴。</p><p>&nbsp;</p><p>正是由于这种上下文性质，一般性工具在实践当中从未真正起到作用。它们可以生成漂亮的图片，但不会影响人们做出决定的方式。为了让决策具有相关性，需要考虑到上下文信息，而通用工具根本无法感知到这些。例如，上面的可视化是通用的，因为它适用于任何系统。描述软件的一般性质是有用的，但对于处理与系统相关的特定问题是没有用的。</p><p>&nbsp;</p><p>另一种选择是创建自定义工具，以上下文为基础，并提供与之匹配的体验。工具的主要焦点应该是用一种易于理解的方式来显化问题，这样解决方案通常很快就会出现，我们称之为可塑性开发（Moldable Development）。</p><p>&nbsp;</p><p>让我们来看一个具体的例子。</p><p>&nbsp;</p><p></p><h2>示例——特性切换推理</h2><p></p><p>&nbsp;</p><p>依赖关系在开发人员的意识中占据着重要的位置。他们添加依赖，删除依赖，管理依赖，并不断地打破依赖循环。这是一个普遍的问题。不过，并非所有的依赖都是平等的，有些比其他的更有趣，有些比其他的更明显。</p><p>&nbsp;</p><p>当我在2021年QCon Plus大会上<a href=\"https://www.infoq.com/presentations/moldable-development/\">通过实例介绍可塑性开发</a>\"时，我展示了一个由系统设置和特性切换导致的依赖关系的例子。从中可以看到，当特性切换在一个组件中定义并在另一个组件中使用时，两者之间会出现依赖关系。</p><p>&nbsp;</p><p>最近，我和同事有机会一起了解了Open edX的特性切换。Open edX是一个用Python编写的开源系统。下面的可视化图用红色突出显示了树图（TreeMap）上所有使用了特性切换的地方，树图是一种通过嵌套矩形显示层次数据的可视化图。在本例中，树图显示了系统的文件夹和文件。使用了至少一个特性切换的文件用红色突出显示。可以看出，这是一个非常依赖特性切换的系统。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/55/55daf21ac1df5190f269d48a3196f639.png\" /></p><p></p><p>&nbsp;</p><p>特性切换最基本的形式是使用布尔值。当然，在一个系统中会有许多布尔值，但其中只有少数用于特性切换。通常，定义和使用特性切换要么是依赖模式，要么是依赖库。我们当时发现有三种基于不同库的表示特性切换的方法。因此，为了绘制上面的可视化图，我们首先必须创建一个能够理解这些上下文库的专用工具。</p><p>&nbsp;</p><p>我们使用了<a href=\"https://gtoolkit.com/\">Glamorous Toolkit</a>\"，一个可塑性的开发环境。Glamorous Toolkit主要帮助开发人员用较低的成本创建定制工具。下面是一个使用这个工具包进行代码分析的示例。在左侧窗格中，我们可以看到一个实时的notebook页面，其中包含了一个查询，用于查找遗留的切换机制。在中间的窗格中，我们可以看到一个特性切换列表。在右边，我们可以看到一段显示特性切换的Python源代码。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/02/0270867b48c69aba32558dd51912810e.png\" /></p><p></p><p>&nbsp;</p><p>在我们的例子中，有一个特性切换是这样定义的：</p><p>&nbsp;</p><p><code lang=\"java\">HIDE_ACCESS_DENIALS_FLAG = LegacyWaffleFlag(\n    waffle_namespace=COURSE_BLOCKS_API_NAMESPACE,\n    flag_name='hide_access_denials',\n    module_name=__name__,\n)</code></p><p>&nbsp;</p><p>从名字可以看出来，这是用于在系统中定义变量的一种遗留机制，目的是为了方便进行迁移。当然，在迁移之前，首先需要找到违规的地方。为了找到它们，我们需要一个可以理解这个框架的工具。notebook中的查询可以捕获到这些信息：</p><p>&nbsp;</p><p><code lang=\"java\">Gt4EdxGlobals toggleModel allEdxToggles select: #isLegacy</code></p><p>&nbsp;</p><p>这个查询依赖了已有的切换模型，并基于之前设定的模型逻辑标志来选择它们。我们专门为Open edX系统创建了这个模型和逻辑。</p><p>&nbsp;</p><p>这个场景捕获到了更多的东西。首先，notebook对软件工程就像它对数据科学一样有用。其次，分析由依赖了基于系统自定义模型的自定义视图的检查器提供支持。例如，在右侧，我们可以看到一个叫作Gt4EdxToggleDefinition的类实例检查器。这是专门为分析而创建的模型中的一个实体。</p><p>&nbsp;</p><p>在有了一个可以捕捉系统事实的模型之后，我们就可以去发现不容易被发现的问题。在本节的开头，我们讨论了由特性切换导致的依赖关系，下图是它们在我们系统里的样子。在图的左边，我们可以看到顶层模块的可视化，以及由特性切换导致的依赖关系。单击其中一个箭头就会显示导致这种依赖关系的特性切换。在最右边，我们可以看到使用特性切换的细节。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/ba/ba6086b1db43a1db9b127b8e7ecef117.png\" /></p><p></p><p>&nbsp;</p><p>例子中展示了获取一个特性切换并将其保存在一个上下文变量中：</p><p>&nbsp;</p><p><code lang=\"java\">context = { \n  ... \n  'enable_account_deletion': configuration_helpers.get_value(\n            'ENABLE_ACCOUNT_DELETION', ...)\n  ... }</code></p><p>&nbsp;</p><p>系统的openedx组件使用了特性切换，但它是在lms组件中定义的，因此两者之间存在一个隐藏的依赖关系。这只是其中的一个例子。</p><p>&nbsp;</p><p>本节展示了几个在开发过程中可能出现的典型的问题。例如，如果我们想要拆分系统，就需要知道隐藏的依赖关系是怎样的。我们希望总是能够回答任何有关系统的问题。在我们的示例中，我们通过静态分析来回答这些问题，但可塑性开发思想适用于软件系统的任何方面，不管是静态的还是其他的——我们从一个问题开始，创建一个定制的工具，并解释结果，从中找到行动的路径。最后，我们发现我们可以在不阅读代码的情况下对系统进行推理。</p><p>&nbsp;</p><p>事实上，通过定制工具来指导决策的想法与当前的实践状态相差甚远。乍一看，这一提议似乎是一种浪费。毕竟，这是否意味着开发人员将花费大量的时间来创建和完善工具，从而导致生产力下降？简单地说，不会。事实上，情况恰恰相反，我们过一会儿再来讨论这个。</p><p></p><h2>Glamorous Toolkit——可塑性开发环境</h2><p></p><p>&nbsp;</p><p>在上面的例子中，我们使用Glamorous Toolkit对一个用Python编写的系统进行了分析。Glamorous Toolkit是一个可塑性开发环境，用于降低创建定制工具的成本。例如，创建一个自定义视图通常只需要几分钟的时间。Glamorous Toolkit提供了统一编程、数据科学和知识管理的体验。它是一个基于Pharo的Smalltalk系统，更关键的在于，我们可以通过多种方式对其进行编程和定制。</p><p>&nbsp;</p><p>Glamorous Toolkit本身也是一个示例，我们也是遵循可塑性开发的思想创建了它。它的基础发行版中已经包含了数千个小工具。我们是怎么知道的？这是一个好问题，就像任何关于系统的问题一样，我们可以通过定制工具来回答它。在本例中，我们将可以使用Glamorous Toolkit编写一个关于Glamorous Toolkit的简单查询。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/4e/4e7355071cf16bb226cde1ce9bc76500.png\" /></p><p></p><p>&nbsp;</p><p>在截图中，我们可以看到左边的notebook中有一段代码：</p><p>&nbsp;</p><p><code lang=\"java\">#gtView gtPragmas</code></p><p>&nbsp;</p><p>执行这个脚本会在右侧的检查器中显示结果。在这个例子中，结果是一个叫作过滤器的东西，它知道如何显示代码中的实际位置，还知道指标概要。我们可以看到有1984个方法。这些方法定义了检查器所显示的自定义视图。例如，指标视图的定义是这样的：</p><p>&nbsp;</p><p><code lang=\"java\">gtMetricsFor: aView\n\n^ aView columnedList\ntitle: 'Metrics';\nitems: [ {'Number of methods' -&gt; self amountOfMethods.\n'Lines of code' -&gt; self linesOfCode.\n'Lines per method' -&gt; self linesOfCodePerMethod} ];\ncolumn: 'Metric' text: #key;\ncolumn: 'Value' text: [ :assoc | assoc value asString ]</code></p><p>&nbsp;</p><p>为什么我们会有这个视图？因为我们曾经想知道我们有多少个自定义视图。可塑性开发流程通常从一个问题或假设开始，然后我们会问什么样的工具能够提供答案的概要，如果我们没有合适的工具，就创建一个。我们对所有关于系统的问题都这么做。而且，这些工具通常只使用一次。</p><p>&nbsp;</p><p>“这是什么蠢事？创建一个工具，只使用一次？”是的。这只是一个成本问题，如果成本足够低，它实际上比手动阅读代码更划算。这并不像看起来的那么牵强。这个流程与数据科学中的流程类似，在数据科学中，人们会为每个问题创建自定义描述。</p><p>&nbsp;</p><p>“那么，怎样的东西才算是工具？”对象的自定义视图是一种工具，自定义调试器是一种工具，自定义搜索是一种工具，自定义API浏览器是一种工具，自定义日志分析器也是一种工具。所有这些都是工具，而工具包环境的职责是确保用较低的成本来塑造它们。有了这些，编程流程就会发生根本性的变化。</p><p>&nbsp;</p><p>“不过，重复利用工具不是更加经济吗？”如果你可以重用你的定制工具，那就这样去做。例如，Glamorous Toolkit默认发行版提供的1984个定制视图是可重用的。但不要在一开始就考虑重用，而是考虑摊销成本，这样可以让你在创建工具之前不必从经济性角度去考虑问题。</p><p>&nbsp;</p><p>“工具一定要是定制的吗？”看看我们的例子，如果我们不理解用来定义系统设置和特性切换的框架的细节，就无法回答与它们相关的问题。事实上，在这个系统中有不止一个这样的框架。软件开发中的大多数决策都与外部无法预测的特定情况有关。如果你的问题不够具体，可能就是没有用的。如果你发现自己正在使用的工具与在其他系统中使用的一样，那么这个工具很可能无法起到应有的作用。</p><p>&nbsp;</p><p>我们来看一个常见的查看构建日志的场景。我们可以看到三个窗格。在第一个窗格中，我们可以看到构建状态嵌入在知识管理系统的页面中。在第二个窗格中，我们可以看到各个阶段的图表。所选的构建失败了，图表显示问题出在最后一个阶段。选择最后一个阶段将显示构建执行的详细步骤，其中一个步骤失败了。当我们查看步骤内部时，立即发现了红色高亮显示的错误。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/58/58d88d3bdb330e61191b2b58c628c0e0.png\" /></p><p></p><p>&nbsp;</p><p>在这个例子里，错误信息是这样的：</p><p>&nbsp;</p><p><code lang=\"null\">Error: Expected version v0.8.1839 does not match the actual v0.8.1838</code></p><p>&nbsp;</p><p>这个错误不是普遍性的错误，而是与我们构建系统的上下文相关。因此，要高亮显示它，视图必须了解上下文。事实上，我最近看到过这个错误，但没有被高亮显示，因为之前没有遇到过。很快，我用几行代码给它加了高亮：</p><p>&nbsp;</p><p><code lang=\"null\">('Error: Expected version' asPParser token\n, #endOfLine asPParser negate star token , #endOfLine asPParser)\n==&gt; [ :tokens | \n(aText from: tokens first start to: tokens second stop)\nhighlight: Color red ]</code></p><p>&nbsp;</p><p>环境中的任何东西都可以而且应该与上下文相结合。当然，如果环境已经能够快速创建自定义体验，那会有很大帮助。在我们的示例中，你可能会注意到，我们没有使用单独的工具来收集关于构建的信息。IDE中的“I”是“集成”的意思。如果要集成环境，就不应该离开环境去寻找信息。相反，我们希望信息自己来到我们身边，以便让我们能够通过适合的方式操作它们。这就是可塑性开发的精髓。</p><p>&nbsp;</p><p>为了让这个变得实际，环境必须降低工具的创建成本。这就是为什么我们不把环境看作现成的工具，而把它看作一种由交互式和可视操作符组成的语言，它们可以以多种方式组合在一起。Glamorous Toolkit提供了许多这样的小部件，我们可以将它们拼凑起来形成上下文体验。</p><p>&nbsp;</p><p></p><h2>可塑性开发的意义</h2><p></p><p>&nbsp;</p><p>现如今，开发人员将大部分时间花在阅读代码上。然而，他们很少去谈论这件事情。正如Felienne Hermans之前发表的关于<a href=\"https://www.infoq.com/news/2021/12/reading-code/\">阅读代码</a>\"的文章中所提到的那样，阅读代码实际上从未受到过任何挑战。当你学习一门新语言或问题已经被展现出来时，阅读代码是一个很好的策略，但当我们需要处理更大的问题时，它就不奏效了。</p><p>&nbsp;</p><p>可塑性开发对将阅读代码作为一种从系统中收集信息的手段提出了挑战。可塑性开发提供了一种系统性的方法，依赖于创造可以概括系统的专门性体验。在本文中，我们详细介绍了一个场景，在这个场景中，我们在不依赖阅读代码的情况下了解系统。当然，这只是一个适合放在本文中展示的例子。因为开发人员每天要做很多决定，每一个决定都可以通过自动的、上下文相关的概要来推动。</p><p>&nbsp;</p><p>我们谈论的是开发预算中最大的一部分，也就是我们现在正在以一种隐性且未经优化的方式在使用的部分。好消息是，这代表着一个巨大的机会——如果我们对其施加显著的影响，将直接影响整个开发过程。我们对行业决策中的繁琐部分进行自动化。我们通过创造专门的体验来概括数据，通过这种体验，人们无需看到原始数据就可以做出决策。这是一种神奇的技能，涉及到社会的方方面面，我们只需要把它应用到工作中。这个流程如下图所示。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/98/980d0847a99b811aeff38a2751daa3c6.png\" /></p><p></p><p>&nbsp;</p><p>这一切都始于一个假设，或至少是一个明确的与系统相关的问题。我们希望通过工具来收集有关系统的信息。一旦有了结果，就可以对它们进行解释。如果我们对解释的结论有信心，就会采取行动。如果没有，就加以改进并进行重试。这不是什么新鲜事物，这是一种科学的方法。可塑性开发的独特之处在于，鉴于软件是高度上下文化的，我们无法确切地预测人们将遇到的问题，因此我们不能提供现成的工具。对于一个给定的假设，我们很可能还没有准备好合适的工具。在这种情况下，我们应该自己创建一个合适的工具，就是这样。</p><p>&nbsp;</p><p>可塑性开发需要采用新技术来降低创建定制工具的成本。为了展示这种开发方法在实践中的工作原理和系统的可解释的程度，我们开发了Glamorous Toolkit，并将其开源。不过Glamorous Toolkit只是一项技术，而可塑性开发是一种通用的方法，我们相信它可以成为软件工程的基础。</p><p>&nbsp;</p><p>可塑性开发也需要专门的技能，最明显的就是创建定制工具的技能，这与创建自定义可视化图的数据科学家的工作没有太大区别。但这还不够，最重要的技能是形成假设和做出决策。虽然掌握技术方面的东西可以像学习其他技术一样，但具体问题的制定是一种只能通过时间来培养的技能。</p><p>&nbsp;</p><p>一旦掌握了技术和技能，就打开了无限的可能性。我们通过沃德利图来理一理。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/93/93e612b3ec7d8139d9f83d832c1836ca.png\" /></p><p></p><p>&nbsp;</p><p>技术人员和非技术人员都面临做出系统决策的挑战，这些挑战总是与具体的问题相关。通常，这些决策是基于对系统进行手动检查得出的组合视图而做出的。考虑到系统的规模比通过手动检查能够收集到的信息要大得多，因此手动获得的视图总是不完整的，而且经常是错误的。另一种方法是自动生成视图。当然，为了使视图有价值，需要对它们进行特定的定义，而这需要进行特定的编码。只有当工具也变得具有可塑性，这一切才有可能。</p><p>&nbsp;</p><p>与创建定制工具相关的工作不仅不会增加开发成本，反而会降低成本。因为预算已经花在人工上了，将部分能量转换为编码优化了手动工作，最终的总成本更低。</p><p>&nbsp;</p><p>我们可以将可塑性开发视为降低成本的一种方法，光是这一点就值得了。然而，现如今，做出决策的速度和质量是最重要的。定制视图不仅降低了最大的成本，还让公司能够更快、更准确地做出决策，这是最大的潜力所在。</p><p>&nbsp;</p><p>以我们最近合作的一家公司为例。几年来，他们一直试图优化用于关键营销活动的数据管道的性能，但都没有成功。当他们第一次介绍他们的系统时，画了一个包含四个大组件的架构图。经过更仔细的检查发现，事实上，他们的系统有五个大组件。这里我们不讨论数据沿袭的细粒度细节，我们要讨论的是对系统的粗粒度理解。实际上，他们并不知道这个系统是由什么组成的。这听起来很荒谬，对吧？构建这个系统的人怎么会不知道这个呢？而这与那些拥有遗留系统的大多数公司的情况也没有太大不同。我们一次又一次地遇到这样的团队，他们自以为了解系统，结果却发现实际情况截然不同。一般来说，如果决策是基于手动制作的图表做出的，我们就可以假设它们是不完整的，或者，更糟的是，它们是错误的。</p><p>&nbsp;</p><p>系统随着时间的推移而演化，最初的知识会随之过时。在这种情况下，我们不能依靠记忆。相反，我们希望能够通过自动的方法来了解当前的系统。以较低的成本获得针对问题的准确观点，就有可能可以提出更多的问题，从而形成新的反馈循环。</p><p>&nbsp;</p><p>这些问题本质上是技术问题，但具有非技术的意义。软件系统越来越多地记录和自动化组织的关键知识。访问和改变系统的能力将是未来十年竞争优势的关键来源。</p><p>&nbsp;</p><p>作者简介：</p><p>Tudor Gîrba是一个软件环保主义者和<a href=\"https://feenk.com/\">feenk</a>\"的首席执行官，他与一个了不起的团队合作，致力于让系统的内部变得可解释。他的大部分工作都包含在<a href=\"http://gtoolkit.com/\">Glamorous Toolkit</a>\"中——一个支持<a href=\"http://moldabledevelopment.com/\">可塑性开发</a>\"的可编程环境。</p><p>&nbsp;</p><p>原文链接：</p><p><a href=\"https://www.infoq.com/articles/moldable-development/\">https://www.infoq.com/articles/moldable-development/</a>\"</p>",
    "publish_time": "2022-11-02 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "“企业级零代码黑客马拉松”决赛圆满落幕",
    "url": "https://www.infoq.cn/article/e2fc1750cb8fe535e863103db",
    "summary": "<p></p><p>2022年10月28日至29日，由普华永道中国和明道云主办，InfoQ与艾瑞咨询联合推广，思迈特软件、集简云、Zion和中国计算机学会（CCF）青年计算机科技论坛联合支持的“企业级零代码黑客马拉松”决赛圆满落幕。10支决赛队伍现场比拼，在24小时内创造出极具创新性、创造力、商业价值的零代码数字化解决方案。</p><p></p><p></p><p></p><p></p><h3>博采众长的评委阵容</h3><p></p><p></p><p>为了客观、公正、多维地评价决赛作品，大赛组建了涵盖企业咨询、零代码APaaS、BI、无代码前端开发和无代码集成领域的10人评委阵容，集各家之所长。</p><p></p><p>评委阵容包括来自普华永道中国的风险控制与服务合伙人陈彦、普华永道中国数智重塑部财务数字化转型合伙人蔡耿青，来自明道云的CEO任向晖、CTO金可伟、CPO薛宗铭和CMO雷明灿，艾瑞咨询的技术副总裁郝欣诚，思迈特软件的副总裁吴晓，Zion的创始人兼CEO陆继恒，以及集简云的CEO陈迪。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/6f/6fed35258cecc3f1e433069b7baa7bbe.png\" /></p><p>评委团队正在观看作品演示</p><p></p><p></p><h3>一日为期，释放潜能</h3><p></p><p>10支队伍，16位零代码极客，限时24小时，产出企微助手、离散制造型企业全流程管理、粮油店进销存管理、集团型企业CRM、新农村信息统筹平台、工厂疫情管理、智库型企业业务三要素管理等垂直解决方案。经过最后每组8分钟的现场汇报后，评委们围绕应用完整度、解决方案能力、创新度、简洁度和易用性维度，选出前三名优秀作品。</p><p></p><p>一等奖</p><p>作品名称：企微助手</p><p>队伍名称：奥创1号</p><p>来自公司：上海奥谱创网络科技有限公司</p><p></p><p>在选手引导下，观众与作品现场扫码互动，让所有人亲身经历了整套方案的运转流程、用户端体验和闭环逻辑。方案完整性、简洁与易用性属全场之最。集简云CEO陈迪表示，这套在24小时内构建的应用，已经足够成熟，可以作为商业软件售卖了。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/d6/d608d118f50a811404b7c52bc038062c.png\" /></p><p>第一名队伍的作品演示画面</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/e3/e39e34c020b271cc49c3626e7f5cc1dc.jpeg\" /></p><p>明道云评委代表任向晖、普华永道中国评委代表陈彦和蔡耿青与奥创1号队伍颁奖合影</p><p></p><p>二等奖</p><p>作品名称：ACIS</p><p>队伍名称：选我肯定队</p><p>来自公司：上海橙木智能科技有限公司</p><p></p><p>当BOM表（物料清单）被一键展开和一键收起时，全场人都为之惊叹鼓掌。原本还写在明道云产品规划路线图上的功能，选手仅用现有功能就做出来了，并且交互体验极其优雅简洁。整个离散制造企业的全流程管理系统在高完成度的基础上，嵌入公司现场管理的数据BI大屏，足以见得队伍在赛前已经有深厚的行业管理和工具使用经验。滴水石穿，非一日之功。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/5c/5cedaa18cb50b47bbdb443209b521ee2.png\" /></p><p>第二名队伍的作品演示画面</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/75/75154400430a50378f990f264fa04ddd.jpeg\" /></p><p>思迈特软件副总裁吴晓、Zion CEO陆继恒与选我肯定队颁奖合影</p><p></p><p>三等奖</p><p>作品名称：粮油小店ERP</p><p>队伍名称：First Place</p><p>来自公司：棒糖科技（杭州）股份有限公司</p><p></p><p>作品背景取自我们身边的柴米油盐。表哥家的粮油店多年来缺乏数字化管理，连赚了还是亏了都不知道。队伍为表哥打造的粮油小店ERP，小而美。抓住小店经营的关键要素，把应用做得极其简洁易用，仅用明道云移动端APP即可完成。小姑娘轻描淡写地一句“OK”，让观众都感受到产品自信，相信表哥的粮油店会越办越好。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/9f/9fa909c67f6e0a0acbcfff45b2cf3878.jpeg\" /></p><p>第三名队伍的作品演示画面</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/c6/c68fd9e2e5a89c19d7adecd458de4200.jpeg\" /></p><p>集简云CEO陈迪与First Place队伍颁奖合影</p><p></p><p>在有限时间内，十支参赛队伍均倾尽全力完成作品，大部分作品的开发速度、复杂程度连明道云的资深实施顾问都难以企及。</p><p></p><p>来自上海电气数科的数科纵横队创作出集团型CRM，针对大型集团内部多组织、多业务的复杂需求，构建一套完整的流程闭环。浙江移动衢州分公司的衢移网络自研队打造“出行管家”，帮助需要频繁出差的业务人员快速查询各地疫情风险地区和防控政策，上报健康数据。来自上海弘牧信息的李可崔牛队创造的“房东东”收租应用，在用明道云实现后端数据处理的基础上，使用Zion创造租客端小程序，让房东和租客的线上协作更省心、自助。</p><p></p><p>除了前三名队伍现场赢取“苹果全家桶”奖品和奖杯以外，其余参赛队伍也获得大赛优秀奖和明道云礼盒，满载而归。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/ff/ff10d9eced394a03b257fc9ccd6a91d3.jpeg\" /></p><p>大赛优秀奖队伍合影</p><p></p><p></p><h3>结语</h3><p></p><p>受疫情影响，企业级零代码黑客马拉松大赛赛程贯穿2022，从春到秋。感谢所有初赛选手的热情参与，让我们看到百花齐放的作品和零代码的无限可能；感谢所有决赛选手坚持到底的韧性，陪伴大赛一起画上圆满的句号。</p><p></p><p>期待在未来，我们能看到更多用零代码技术创作出来的解决方案，落地至真实的商业和社会环境，解决实际问题，为社会带来一点改变。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/f1/f1810be8d3ea9b6b0c26d7c798bb98a5.png\" /></p><p></p>",
    "publish_time": "2022-11-02 09:52:55",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "允度软件CEO陈冲：组一个下半辈子的朋友局",
    "url": "https://www.infoq.cn/article/wIFZ5SWOccBvL9G6vsgd",
    "summary": "<p>嘉宾简介：陈冲，允度软件 CEO，<a href=\"https://tgo.infoq.cn/join\">TGO 鲲鹏会</a>\"（上海）负责人。</p><p></p><p>2003 年毕业，毕业后的前 10 年一直在写代码，从民企程序员一路做到外企技术总监。写代码的最高光时刻是 2012 年参与<a href=\"https://www.infoq.cn/article/NjuBjKw2daCjtHzqejcj\">高通</a>\" Vuforia Cloud AR 的产品发布，发布会上面向全球直播展示的第一个项目就是陈冲本人开发的，这个项目也给公司带来 200 万美金的高通订单。</p><p></p><p>2013 年陈冲开始创业，2015 年创立允度软件，现在给几家大型企业和上市公司提供软件服务和人力外包，并自主研发了金氮股权投资管理系统，帮助 <a href=\"https://www.infoq.cn/article/UXJczpcgXisBVx0r5gWF\">VC/PE</a>\" 解决企业内部项目流程文档风控管理。</p><p></p><p></p><h1>加入小组：组一个下半辈子的朋友局</h1><p></p><p></p><p>陈冲是 2018 年加入 TGO 鲲鹏会，最开始被分到上海七组，加入后 9 个月大家只聚了 2 次，聚的人也不太多，聊的话题和分享的内容也只停留在表面。</p><p></p><p>直到一次小组组长会议，组长老白没时间，就让陈冲代参加。这次会议给陈冲留下深刻印象，讲师详细讲述了一个优秀小组应有的样子。这次组长会议之后，陈冲意识到小组原来是一个可以无话不谈、深度链接，就像大学寝室室友一样亲密无间的组织。小组成员每个月见面，分享自己的工作和生活，说一些心底话，时间越久彼此间的感情越深。</p><p></p><p>自从陈冲知道成立小组最终的目的后，他就特别想把自己的小组建设好。组长会议结束，陈冲就立即与老白和朱攀进行商量，得知他们也特别想建立一个这样的小组后，便与其他组员一起订立了特别严格的小组章程，吸纳志同道合的人，自己的小组也变得越来越健康。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/97/97644e058a283decd7927d812595839b.jpeg\" /></p><p></p><p>陈冲认为，小组里的成员要一起走很长时间，要成为彼此下半辈子的朋友。并且这样的朋友，对于陈冲自己和其他组员都是特别需要的。因为他所在小组的大部分组员是 CEO，在创业路上很孤独，有些事情是对客户、同事、家人都不能聊的。而 TGO 鲲鹏会小组的出现，对于像陈冲这样的科技领导者而言就是一个安全而又温暖的港湾。</p><p></p><p></p><h1>充分信任秘诀：全情投入 敞开心扉</h1><p></p><p></p><p>全情投入和敞开心扉的深度交流，是小组组员间实现充分信任的关键。</p><p></p><p>2019 年陈冲等成员重组小组，建立上海二组后，一年组织 12 场活动，组员的平均参与率达到 90% 以上，其中有 5、6 位组员全年活动都不缺席。只有一直在组织、参与小组活动，大家才会把小组的事情放在优先级最高的位置。</p><p></p><p>全情投入的同时，还需彼此敞开心扉进行深度交流。只有把自己心底的事情聊出来，做深度交流，大家的关系才能更进一步。如果每个人说的话，都好像是在面试别人或者跟投资人沟通，大家的关系就会变得比较浅。</p><p></p><p>上海二组大多数成员都是 CEO，交流工作时会把公司里最棘手的问题拿出来谈，在聊生活时也会分享家庭里的快乐或是冲突，经常是一个人的故事引发一群人共鸣。通过敞开心扉的交流，大家建立起更深层的信任。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/bd/bdba3a6d43c8e018b7995b4d4f7593d0.jpeg\" /></p><p></p><p>只有一起扛过枪的兄弟，才会是最好的兄弟。“我们虽然没有一起扛过枪，但是我们交流过很多内心深处的话题。”</p><p></p><p></p><h1>分享感动：两件事情印象最为深刻</h1><p></p><p></p><p>过年的时候，通常只有亲戚才会来家里做客。2020 年春节，上海二组的组员到陈冲家里拜年，这件事令他特别难忘。“我们的关系已经上升了一个 Level，也一定是关系已经好到一定程度才会这样做。”</p><p></p><p>还有一件事情令他难忘。上海二组有三位组员特别喜欢发表自己的意见，其中就包括陈冲，今年上海疫情期间，他的一些看法与另外两位组员不太一致，就在群里发生了一些激烈的争论，不过后来大家都冷静了下来。陈冲觉得之所以能这么争论，是因为大家的关系特别好，才能这样吵而不散。</p><p></p><p>如果大家关系不好的话，第一是不会争论到那种程度，第二是过了一段时间大家就会觉得价值观不同，关系逐渐变淡。</p><p></p><p>而发生在上海二组的这场争论，不仅没有让大家疏远，彼此关系反而又上了一个台阶。这次事件让他们知道，即使一些观点不同，相互之间也能求同存异，一起继续往前走，线下见面时继续饮酒谈笑，交流自己心底的事。</p><p></p><p></p><h1>成为“连接者”：让 1+1&gt;2</h1><p></p><p></p><p>陈冲的职业生涯一直在做乙方，天然的就具有帮甲方解决问题的意愿和能力，得到甲方认可并获得信任，会让陈冲特别开心。</p><p></p><p>因此，无论是在 TGO 鲲鹏会还是在工作生活中，陈冲都经常扮演一名“连接者”的角色。比如，帮助 TGO 小伙伴找免费或接近免费的办公室，帮助他人做创业上的业务对接、找投资人，或是小孩上学之类的很多事情。</p><p></p><p>成为“连接者”，让陈冲从中获得巨大的满足感和成就感。“帮助遇到问题的人，或者帮助两个在寻找机会的人，由于我对他们的信任传递，让合作变为可能，最终产生 1+1&gt;2 的效果，我会认为自己在这个世界上有了更大的作用。”</p><p></p><p></p><h1>上海足球队：从抗拒到享受乐趣</h1><p></p><p></p><p>陈冲最开始对组建上海足球队是抗拒的，因为大家都已经很久没踢球了，每周的比赛会很难凑齐人；不过后来陈冲也想到积极的一面，就算只有 3-5 位学员来踢球的话，大家也可以互相熟识，进而产生一些火花。TGO 鲲鹏会上海足球队就在这样的背景下成立了。</p><p></p><p>第一次组织足球比赛，算上陈冲，TGO 鲲鹏会学员一共才只来 3 人。因为至少要凑齐 10 人才能开赛，陈冲又从身边的朋友里拉来了 9 个人，顺利完成第一场足球比赛。</p><p></p><p>第一场比赛之后，陈冲就想组织第二场、第三场。喜欢迎难而上、不轻言放弃的他，想看看 TGO 上海足球队到底能搞成什么样子。后来随着报名参加比赛的人越来越多，足球队活动的频率也大大增加，学员们的积极性日渐高涨。</p><p></p><p>“一些两年没踢球的人，现在都可以每周参加足球队的比赛。”踢球不仅让大家结识更多 TGO 学员，还可以锻炼身体、收获快乐，组建足球队给陈冲带来了很多正面反馈。</p><p></p><p>TGO 鲲鹏会也是一个“拍照组织”，每次比赛结束后都需要大合影。为了更好的体现球队的专业范儿并将拍照仪式感拉满，疫情期间赋闲在家的陈冲，就在 TGO 上海的群里发了球衣赞助邀请，立刻就有三家企业响应，最后上海足球队的球衣赞助在不到 13 分钟的时间里就敲定了。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/47/473da6630861bf615f440755ef5cf2b6.png\" /></p><p></p><p>大家有了球衣后都非常开心，提高了球队的认同感，参加比赛的积极性也更加高涨。大家赛前、赛后发的朋友圈，不仅让 TGO 上海足球队更具影响力，也让赞助商的品牌得到了很好的展示。</p><p></p><p></p><h1>未来展望：让陪伴很长 让链接更深</h1><p></p><p></p><p>TGO 鲲鹏会作为科技领导者同侪学习社区，陈冲希望在未来的很长一段时间里，学员都能在组织内学到很多知识。为此 TGO 鲲鹏会（上海）每个月都会组织一些学习活动，确保大家能收获一些新认知或新知识。</p><p></p><p>人与人之间的连接是社区的另外一大功能。陈冲现在会花更多时间在学员的连接上，除了学习活动外，TGO 鲲鹏会（上海）还会经常组织足球赛、博弈论、飞盘等休闲娱乐活动。“我通过更积极、更有规律地去组织各类型活动，让大家可以更好地彼此认识、连接与相互成就。”</p><p></p><p>陈冲坚信，TGO 鲲鹏会是一个投入越多收获越多的地方。他希望所有的学员都能更多地投入到 TGO 组织的活动中，更多地投入到自己小组活动中，不论是学习活动还是休闲活动。一两年之后，大家就会在潜移默化中收获很多东西，包括学到知识、听到经验分享、结识到更多优秀的人。</p><p></p><p>陈冲所在的上海二组，愿景是“成为东半球影响人数最多的 TGO 小组”。不仅要实现学员间、学员与外部间的深度链接，而且他也特别希望“TGO 鲲鹏会现在所有的运营人员，也能一直陪大家走很远！”</p>",
    "publish_time": "2022-11-02 10:14:28",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]