[
  {
    "title": "如何防范算法漏洞对AI系统带来的恶意攻击？",
    "url": "https://www.infoq.cn/article/XmlhizwQHwaFbGaa4Orr",
    "summary": "<p>人工智能 (AI) 可以追溯到古代，当时的哲学家们编造出了许多关于人造实体如何被赋予人类智能或意识的寓言、神话和谣言。随着大数据、机器学习、神经网络技术的不断演进，<a href=\"https://www.infoq.cn/article/32z1tIzmV5tk0OKxL1C5\">AI技术</a>\"逐渐从遥远的寓言和神话中走入真实世界。</p><p>&nbsp;</p><p>近几十年来，AI一直处于技术进步的前沿，它被广泛应用于安防监控、<a href=\"https://mp.weixin.qq.com/s?__biz=MzU1NDA4NjU2MA==&amp;mid=2247578037&amp;idx=1&amp;sn=b6122e54795efd556f414f0bdfd931f1&amp;chksm=fbeb087acc9c816cf5167dc5dd985fe1bf8c3c81cec6d7d83e3bd7f4b91b6cc1fc95ec5e3880&amp;scene=27#wechat_redirect\">自动驾驶</a>\"、金融预测、医疗诊断、视频游戏等领域。</p><p>&nbsp;</p><p>一些AI成果包括人脸识别、<a href=\"https://www.infoq.cn/article/5pH0rXdhS0zG0ACPyY8v\">自然语言处理</a>\"、语音识别、文本生成、语言翻译、药物开发等已经深刻改变了人们对健康、生活、学习和其他方面的看法。毫无疑问，在未来，许多企业将依靠人工智能来提高效率和工作流程。</p><p>&nbsp;</p><p>但是，在AI推动生产效率的提升和产业的<a href=\"https://www.infoq.cn/article/3dePZg9FS9v3ms7WVwXo\">数字化转型升级</a>\"的同时，它所带来的技术风险和隐私伦理问题同样值得警惕，黑客也在利用AI技术开发软件程序并执行隐形攻击。</p><p>&nbsp;</p><p>更重要的是，AI 技术本身也存在安全漏洞。当前主流的深度神经网络等技术具有的“黑箱属性”，导致 AI 算法存在不可解释性。这也就意味着 AI 技术在算法安全性上存在着不确定因素，可能会在产业应用落地中出现各种安全隐患和风险。</p><p>&nbsp;</p><p>当身处数字化转型升级的各个产业正在享受这一波新的智能化技术红利的时候，AI 安全问题，就如同网络安全、信息安全一样，被提上产业数字化建设的日程表了。</p><p>&nbsp;</p><p>那么，如何部署AI技术才会更安全？我们该如何防范利用算法漏洞对AI系统进行的恶意攻击？在训练AI模型时，如何保障数据的隐私和安全？带着这些问题，我们采访到了瑞莱智慧RealAI公司首席执行官田天，请他来与我们聊一聊AI安全领域面临的挑战以及应对之策。</p><p>&nbsp;</p><p>以下为访谈实录，经编辑：</p><p>&nbsp;</p><p></p><blockquote>InfoQ：目前AI领域面临的安全威胁都有哪些？</blockquote><p></p><p>&nbsp;</p><p>田天：前几年大家更多关注的是，人工智能如何在场景中应用起来，去提升生活质量以及生产效率等等。但是近年来随着人工智能开始应用在很多高价值关键场景，比如金融、交通等领域，很多安全隐患开始逐步体现出来。我们关注到至少有三方面存在比较重大的安全隐患：</p><p></p><p>第一，模型算法本身的安全性、可靠性问题。现阶段人工智能的发展很多都是基于深度学习、深度神经网络。随着<a href=\"https://www.infoq.cn/article/PXDDY9kZpYwz819SqkGJ\">神经网络</a>\"模型结构越来越复杂，模型越来越大，参数越来越多。其实反过来讲，神经网络模型也是一个越来越复杂、越来越难以理解的黑盒模型。然而黑盒模型就有可能存在一些难以被发现的错误逻辑，或者说结构性的算法漏洞、算法后门，黑客可以利用这些漏洞发起攻击。</p><p></p><p>以目前大规模落地的人脸识别系统为例，人脸识别系统依靠海量人脸数据进行特征提取、训练，进而进行识别，整个过程为黑箱模式，缺乏可解释性，黑产分子可利用漏洞进行多种模式的绕过与攻击。例如对抗样本攻击，在人脸照片上添加少量干扰或将对抗补丁打印制作后由真人佩戴，就能欺骗人脸识别系统。除了人脸识别系统，<a href=\"https://www.infoq.cn/article/mCULd4WW6Vi7LfXpYVVy\">自动驾驶</a>\"汽车搭载的感知系统也同样能够被攻击，比如障碍物上加装干扰因素，改变表面颜色、修改形状，就可能误导感知算法，让车辆无法感知到障碍物，这些都是算法层的安全漏洞，存在巨大的安全隐患。</p><p></p><p>第二，数据安全。人工智能的发展离不开大数据，要构造能力更强的人工智能，需要更多、更关键以及更高价值的数据。但是高价值数据往往与个人隐私信息，甚至商业机密信息相绑定。那么在落地AI的过程中，就可能在数据应用或者流通环节造成信息泄露。比如近些年愈演愈烈的电信诈骗，源头就来自于个人信息泄露，诈骗分子利用非法渠道获取的隐私数据伪造身份信息实行欺诈。所以，如何在保证发挥人工智能作用的同时，确保数据使用的安全，这是非常关键的问题。</p><p></p><p>第三，技术的应用可控问题，简单来讲就是AI滥用问题。因为人工智能是一个能力非常强的工具，但是工具就具有两面性质，可以被用于造福人类的场景，反过来也可能被不正当的利用。比如最典型的深度合成技术，也就是我们熟知的“AI换脸”，这项技术能够升级影视制作、广告营销等场景中的内容制作效率和质量，并为一些全新场景提供了技术可能，例如虚拟主播。但这项技术目前却被大规模的滥用，比如通过<a href=\"https://mp.weixin.qq.com/s?__biz=MzU1NDA4NjU2MA==&amp;mid=2247565007&amp;idx=1&amp;sn=6a527690c9aeed95c0622089ee5361eb&amp;chksm=fbeb4700cc9cce16a9e36196e3d9a297eff73222400057f4137afe73431cbabbbe60f1447b17&amp;scene=27#wechat_redirect\">“AI换脸”技术</a>\"进行色情视频生成、编造虚假新闻等。一些黑产分子甚至通过使用软件程序低成本地合成带有各种动作的人脸视频，结合注入攻击手段后便可以轻易欺骗线上人脸识别系统，进而从事诈骗行为。我们认为防范AI滥用，也是整个人工智能应用环节必须要关注到的安全风险。</p><p>&nbsp;</p><p></p><blockquote>InfoQ：现在大家对抗性机器学习的受关注热度比较高，什么是对抗性机器学习，常见的对抗性机器学习的场景有哪些？</blockquote><p></p><p>&nbsp;</p><p>田天：对抗性机器学习最典型的是针对深度学习、深度神经网络的对抗，也就是上个问题中算法安全部分我们提到的。深度神经网络其实是非常复杂的模型，而复杂模型本身就是一个黑盒，黑盒的设计者、开发者也不知道模型内部结构、算法的运算逻辑是怎样的。对抗机器学习包含攻击手段与防御手段。攻击端就是利用攻击手段去寻找模型设计过程中存在的缺陷或漏洞，相当于找模型什么时候会出错。防御侧则是在发现隐患或漏洞后，通过对抗训练、外部接入保护措施等方式，来提升整个模型的安全性，保证模型在受到攻击后的安全运行。</p><p></p><p>其实，在人工智能应用的各个场景中，广泛存在着对抗机器学习的问题。典型的比如图像领域的人脸识别、图像分类以及目标检测，都存在算法安全问题，像上面提到的通过特定的攻击方式能够让模型失效，因此需要通过对抗学习的方式来提升安全性。除此，语音识别、推荐系统，甚至自然语言处理等等，各个场景都存在着对抗。另外按照攻击类型来分，可分为有目标攻击和无目标攻击等不同类型。所以整个对抗机器学习是一个非常大的技术体系，需要进行专门研究。</p><p>&nbsp;</p><p></p><blockquote>InfoQ：我们花费大量的人力、物力研发出了一个模型以后，是不是攻击者也要付出很大的代价来攻击它？</blockquote><p></p><p>&nbsp;</p><p>田天：对于攻击者来说，如果要做白盒攻击，就需要获得被攻击模型的所有信息，包括网络结构、参数等等，这其实是非常难、成本很高的一件事情。退而求其次，如果去做黑盒攻击，实施起来相对就会容易一些，一类被称为查询攻击的方法是需要去持续请求被攻击模型，获得该模型在特定样本上给出来的反馈结果，另一类被称为迁移攻击的方法，甚至可以不用在实施真正的攻击前去请求被攻击模型。所以攻击技术也在演化，相当于是很多人在尝试去降低攻击的成本，而且随着技术的开源化、工具化，攻击的难度和成本肯定是逐步降低的。</p><p>&nbsp;</p><p></p><blockquote>InfoQ：目前对抗性机器学习对于AI和机器学习系统造成的主要危害有哪些？</blockquote><p></p><p>&nbsp;</p><p>田天：主要危害在于让算法出错，使AI系统无法给出正确的结果。以人脸识别为例，比如刷脸闸机，正常情况下，只有存有身份信息获得授权的人员才能通过。但是利用算法漏洞，我作为一个未授权人员通过在面部添加特定干扰，就能让系统出错通过闸机。这相当于产品的基本功能失效了，存在明显的危害。</p><p>&nbsp;</p><p></p><blockquote>InfoQ：在自动驾驶领域，比如很多车企之前就曝光因自动驾驶系统失控发生多起安全事故，威胁到驾驶员的人身安全，对于这种现象您怎么看？</blockquote><p></p><p></p><p>田天：自动驾驶的很多安全问题也源自于算法本身的不可靠、鲁棒性差。一方面在于，自动驾驶系统本身的鲁棒性就比较差，在特殊的场景下，或者一些极端情况下很容易出错另外，还有可能被人利用算法漏洞恶意发起攻击，与上面人脸识别的问题类似，攻击者修改目标物体的颜色、形状等，就能让自动驾驶车辆的摄像头，甚至激光雷达失效，目前这类攻击成功率是非常高的。</p><p>&nbsp;</p><p></p><blockquote>InfoQ：针对这样的安全隐患，我们有哪些防范措施？</blockquote><p></p><p>&nbsp;</p><p>田天：针对这个问题，我们在做两方面的工作。以网络安全作为对比，随着互联网的发展，互联网领域存在很多网络安全隐患，因此出现了一系列工具来增强网络系统的安全性，比如大家比较熟悉的杀毒软件、防火墙。</p><p></p><p>类似的，我们在做针对AI系统的杀毒软件和防火墙。这里的“杀毒软件”是我们推出的业内首个人工智能安全平台RealSafe，通过内置一系列攻击算法和防御算法，提供从模型安全测试到模型安全加固一站式能力。例如一套人脸识别系统，接入到平台后，可以调用攻击算法模块对系统自动进行模拟攻击，平台会输出安全性评分报告，借此得知系统模型在什么样的情况下容易受到攻击。在发现安全隐患之后，针对每一种漏洞或攻击风险，平台搭载了对应的防御模块，通过对抗训练或者其他方式来增强模型的安全性。</p><p></p><p>另外，我们也开发标准化的<a href=\"https://www.infoq.cn/article/1Aa1zHVGfIF6hmukKGX5\">AI安全</a>\"防火墙。比如现阶段的人脸识别系统存在一系列的模型和算法漏洞，容易受到攻击，我们在现有人脸识别流程中前置防火墙模块，识别请求先过防火墙，防火墙来判断里面输入数据中是否存在攻击。如果没有攻击，正常进入后面的识别环节，如果有攻击就直接拒绝，保证系统不受攻击，更加安全。</p><p>&nbsp;</p><p></p><blockquote>InfoQ：您说的AI安全平台以及防火墙这样的工具，目前的效果是怎么样的，如果要给这个效果从1-10打分，您会打几分？</blockquote><p></p><p>&nbsp;</p><p>田天：安全问题进入AI时代，最明显的特征就是深度神经网络增强了AI的自我学习和升级迭代能力，而这种能力自然也被攻击者所掌握。所以，AI时代谈安全，其实不仅仅是谈“魔高一尺道高一丈”的问题，更是谈“魔”和“道”谁对谁的感知能力更强，谁更有预见性和主动权的问题。针对这样的新特点，瑞莱智慧人脸识别防火墙RealGuard具备两个最主要的优势：一是对人脸识别物理和数字世界的全景式安全态势感知能力，始终力争让“道”走在“魔”的前面，这其中的底气来源于瑞莱智慧依托清华多年来对人工智能安全算法、对构建第三代人工智能的科研攻坚。二是对攻击防御的高准确率，目前，RealGuard可以针对对抗样本攻击、面部替换攻击、表情操纵攻击等新型人脸识别安全风险，做到全覆盖防御。如果说要对效果进行打分，那我更愿意用产品的客观运行数据说话，RealGuard目前针对攻击的拒绝率达到98%以上。</p><p>&nbsp;</p><p></p><blockquote>InfoQ：这两款产品目前的应用进展如何，有取得哪些成效？</blockquote><p></p><p>&nbsp;</p><p>田天：目前这两款产品已经在金融、政府等领域落地。比如在金融领域，我们与多家国有行、股份制银行合作，提供人脸识别系统的安全检测与加固服务；在政府领域，我们与公安部门合作，提供监控视频智能化方案，基于攻防加固提升监控系统的安全性；包括我们与多家整车厂商合作，提供自动驾驶安全解决方案。</p><p>&nbsp;</p><p></p><blockquote>InfoQ：经过多年的发展，您认为人工智能安全的研究发展到了哪个阶段？</blockquote><p></p><p>&nbsp;</p><p>田天：现在这个领域已经走出实验室，进入到产业化的阶段。随着近年来安全事件的层出不穷，以及政策监管的重视，市场迫切需要针对AI应用的安全产品。其实包括我们在内，国内外近年来也陆续出现一些团队开始从事这一领域，布局商业化的AI安全产品，推出相关的软件、系统、硬件等等。尤其今年来看，产业已经开始进入快速发展的落地期，金融、公安等重点领域都开始落地。</p><p>&nbsp;</p><p></p><blockquote>InfoQ：您觉得未来AI安全将会朝哪个方向发展，有哪些技术值得关注？</blockquote><p></p><p>&nbsp;</p><p>田天：第一，AI对抗攻防技术必须要持续研究。因为攻击和防御是一个持续升级的过程，新的攻击手段会不断地产生，因此也需要不断研究新的防御手段；</p><p></p><p>第二，对合成技术的安全问题需要加大关注。因为随着技术的不断成熟，合成类内容在清晰度、流畅度、逼真度等各方面都有大幅提升，已经超越了人眼分辨的极限，真假难辨的背后是对社会信任的冲击，危害性在不断增强，因此必须依靠技术手段对这类伪造内容进行判别以及溯源；</p><p></p><p>第三，需要去发展与人工智能相适应的隐私保护技术，确保人工智能应用过程中，对敏感数据的保护，不泄露数据。并且，这三方面需要去并行发展。</p><p>&nbsp;</p><p>嘉宾简介：</p><p></p><p>田天，清华大学人工智能博士，机器学习、知识聚合领域专家，现任瑞莱智慧RealAI公司首席执行官。在清华大学期间师从人工智能领域泰斗、清华大学人工智能研究院名誉院长张钹院士和清华大学人工智能研究院基础理论研究中心主任朱军教授，期间在贝叶斯机器的理论、模型和应用领域取得了一系列成果，在NIPS、ICML、AAAI、PAMI等人工智能领域的顶尖会议期刊上发表数十篇高水平论文，在AI领域拥有发明专利数十项。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "publish_time": "2022-11-26 00:21:21",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "构建长久可持续的良性数据库生态，要有个“打持久战”的准备 | 对话沃趣科技联合创始人",
    "url": "https://www.infoq.cn/article/yFOt2TMt3059jcveccck",
    "summary": "<p>未来十年将会是<a href=\"https://www.infoq.cn/theme/145\">基础软件</a>\"发展的黄金十年，也将是基础软件逐渐支撑起行业数字化转型的关键十年。与此同时，基础软件的研发周期长、研发难度大、应用广泛，是组织、企业、团队技术力量的重要象征。</p><p>&nbsp;</p><p>目前，国内数据库市场百花齐放，据权威机构统计截至2022年，国内共有200多款数据库产品，相比于作为操作系统和中间件这另外两大基础软件，数据库这个赛道异常火热。</p><p>&nbsp;</p><p>那么，数据库未来发展方向又在哪里？影响国产<a href=\"https://www.infoq.cn/theme/145\">基础软件发展</a>\"的因素又有哪些？企业面对数据库选型时该如何做决策？对于多云异构、跨云流转等数据库行业共性问题，沃趣科技的解决方案又是什么？InfoQ希望借助此次采访，为以上问题找到答案。</p><p>&nbsp;</p><p>杭州沃趣科技股份有限公司创建于2012年，是一家专注为企业用户提供基于高性能、高可用、可扩展的开放数据库云平台解决方案的国产厂商。公司创始团队为原阿里巴巴数据库及运维团队核心骨干，为行业客户提供数据库云产品及软硬件一体化解决方案。</p><p></p><h2>入局基础软件赛道，做生不如做熟</h2><p></p><p>&nbsp;</p><p></p><blockquote>InfoQ：您能跟我们介绍下您的从业经历以及创业背景吗，为什么会选择基础软件领域来创业？</blockquote><p></p><p>&nbsp;</p><p>李建辉：我个人的经历有两段，第一段是毕业后去了阿里，2003年进入阿里，2012年从阿里出来，在阿里工作了10年左右，这10年的工作经验围绕的都是基础设施、基础软件这方面。但在阿里的最后两三年，我认为做基础软件技术已经发展到头了，所以那时我们就想出来自己做一些事，重新接触一些用户需求。当然，我们走了以后，阿里的基础软件发展也很迅速。</p><p>&nbsp;</p><p>刚开始从阿里出来后，我们也想做一些不同的事，但实际上自己的基础能力以及同事资源等等各方面因素，最终还是把我引导到了<a href=\"https://www.infoq.cn/article/yL6WxAPUzoZDL42dMgFb\">基础软件</a>\"方向。</p><p>&nbsp;</p><p>第二段经历是从2012年到2022年，我出来创业也做了10年左右。大家在实践中不断地学习总结，总结出了一句很朴素的话：做生不如做熟，主要原因是因为从一开始到现在，我们团队人员所有的经历，更多的是在这个领域。当然，过程中有很多契机在促进我们更好地发展，包括最近几年AI、5G、IoT等技术的蓬勃发展，也很大程度上促进基础软件迎来新生机。</p><p>&nbsp;</p><p></p><blockquote>InfoQ：您从阿里出来以后，当时的基础软件市场现状是怎样的？</blockquote><p></p><p>&nbsp;</p><p>李建辉：为什么我们会笃定基础软件赛道呢？因为从一开始出来我们看到，在基础软件方面，传统市场相对于互联网公司，差距还是比较大的。我们出来以后看到的问题是，大量的传统企业在使用落后的商业软件，抛开<a href=\"https://www.infoq.cn/article/TWdMTS6gaPx6qPIgxNuq\">开源</a>\"、自研软件不谈，很多商业软件在生产力、生产价值上来讲都是偏低的，所以我们认为这方面有很多事能做，希望以我们微薄之力为基础软件的发展添砖加瓦。</p><p></p><h2>数据架构一直在演进，做好一款数据库并非易事</h2><p></p><p>&nbsp;</p><p></p><blockquote>InfoQ：数据库并不是一项新技术，经过多年的发展，数据架构经历了哪些迭代和演进？</blockquote><p></p><p>&nbsp;</p><p>李建辉：我认为<a href=\"https://www.infoq.cn/article/L6xzt3obrPFXtia69j01\">数据架构</a>\"的很多问题，与业务发展有关，同时又与业务软件发展有关。业务发展是什么样的一个模式呢？可能最开始的业务是集中式业务，就像大家要去办银行业务，只有一个地方可去，就是银行柜台或者银行网点。但是，随着手机发展起来，业务模式、App变了以后，业务规模就会变大，随时随地面临各种挑战。所以当业务变了以后，就会带动业务软件跟着变。比如原来银行的业务软件只要做好柜员系统、网点交易系统就够了，但是实际上，业务变了以后会导致整个业务开发模式的变化，进而带来整个数据结构的变化。</p><p>&nbsp;</p><p>同样，业务变了以后，就意味着基础数据结构也要跟着变，由最开始的集中式大型数据库，变成自动化程度更高、伸缩扩容弹性更大的数据库。</p><p>&nbsp;</p><p>我认为整个变化模式，是由前向后推导的，当然后端也可以向前推导，当我们把后端<a href=\"https://www.infoq.cn/article/K30UQfJt7TqDVLDgjIK2\">数据库</a>\"做得更强壮，前端的业务能够开展得更自由。所以从这个角度来看，业务模式决定了业务软件，业务软件又决定了基础软件的变革，基础软件反过来做得很好，又能释放前端的整个业务价值，那么做业务的人更能施展拳脚。所以现在整体上，整个数据架构的模式在朝着柔性、弹性、灵活、自由，随时供应，随时满足的这种商业模式发展。</p><p>&nbsp;</p><p>所以，要做出一款能满足上述诸多要求的数据库，并不是件容易事。</p><p>&nbsp;</p><p></p><blockquote>InfoQ：在过去的十多年里，云从一个概念发展成为主流的架构。目前，公有云、私有云和混合云都已经进入到中大型的企业的IT环境里。在这样一个复杂的、异构混合多云的环境里面，找到一个集成的、直接服务于业务的数据库是很难的，那么，什么样的数据库是符合上述条件的数据库呢，企业在选择数据库的时候应该更优先考虑哪些因素？</blockquote><p></p><p>&nbsp;</p><p>李建辉：我认为一个生产系统或者一个快速发展的系统，从目前情况来看，在选择数据库时最主要的需求是，业务开发人员对于什么数据库的掌握程度高，或者什么数据库对于未来业务发展的阻力小。这样的选择会导致一个跟以前不一样的结果：以前业务开发选择数据库时基本上很单一，即固定的厂商选择固定的数据库，比如长期做Oracle就选<a href=\"https://www.infoq.cn/article/o6Azoc6yAATTsNPioss9\">Oracle</a>\"，长期做SQL Server就选SQL Server。但现在对于业务开发方以及最终用户来说，选择的时候是有困难的，困难在于商业数据库后面的成本以及发展阻力问题。</p><p>&nbsp;</p><p>那用户应该怎么选？用户首先应该立足于自己业务发展本身去选择数据库。在选择的时候，可能说脱离了老牌强大且功能丰富的商业数据库以后，挑战就归到用户和业务开发方，当然也会归到数据库供应商身上，大家会承担更多选择以及运维的压力。当你做了一个正确的选择的时候，或者做了几个承受压力的选择的时候，这个收益是显而易见的，成本会大幅度下降。</p><p>&nbsp;</p><p>所以，如果用户原本使用一个Oracle就满足了自身业务发展，那么就选Oracle。但是，随着业务的发展，如果原来一个Oracle就能解决所有问题，现在却需要借助<a href=\"https://mp.weixin.qq.com/s?__biz=MjM5MDE0Mjc4MA==&amp;mid=2651143467&amp;idx=1&amp;sn=dbf0db2f6d54df4bc27dfdec0bf861e0&amp;chksm=bdb8c5788acf4c6eb69a3037ae6f776fd2f7a5a5b79c39db64ad59c0581d3d26814d0cae5394&amp;scene=27#wechat_redirect\">MySQL</a>\"、Redis至少两种数据库，甚至第三种数据库的组合来解决这个问题，业务确实更累了，但这个问题也容易解决——谁干更多的活，谁接受更多的挑战，谁就应该拿收益。</p><p>&nbsp;</p><p>原来很多传统的数据库大厂拿到的收益，尤其是以Oracle为典型代表的收益，会与业务开发商有一个价值重新分配的过程。通过价值重新分配又能促进软件厂商的能力朝前发展，我们基础平台厂商的基础赛道也会获得收益，往前发展。实际上就是借助业务发展我们是不是能够让一些新兴的基础软件厂商获得相应的收益。在这个过程中，你能扛事，愿意努力，就能重新分到软件上相应的收益。我认为挑战是必须接受的，可能是比原来的世界更丰富、更复杂，但是一定是有收益的。</p><p>&nbsp;</p><p>更具体点，对于企业<a href=\"https://www.infoq.cn/article/lqSvRZ7AB3NtjYpH79Rk\">数据库选型</a>\"来讲，如果企业的业务规模很大，整个业务系统都可以改成了微服务分布式，如果业务规模中等，就选择一个接近于Oracle的，比如开源的或者国产的数据库，再用一点点适当的技术去补偿它。如果业务规模很小，那就选与Oracle高度接近的，或者业务规模大就大改，业务规模小就小改。但如果架构不改或者“躺平”，就可能错过后面业务发展以及软件升级、基础架构升级的机会。</p><p>&nbsp;</p><p>从现在来看，微服务化、开放式的业务，包括向云而生是不可避免的趋势。集中式架构完全要用Oracle这种架构的模式，我认为是一去不复返的。</p><p>&nbsp;</p><p></p><blockquote>InfoQ：但是一些企业还会觉得如果这样去改了，会冒一定的风险。小企业如果改完了数据架构后，并不是很容易操作，又没有技术人员去运维，可能还不如不改，他们会不会有这样的顾虑？</blockquote><p></p><p>&nbsp;</p><p>李建辉：我认为要从两个维度来看待这个问题，第一，从企业本身来看，如果数字化转型能给企业带来巨大收益，那这条路是必须走的。</p><p>&nbsp;</p><p>第二，站在个人发展的角度，也是必须要走这条路。如果作为技术人员不去促进这个事情发展，那么就可能没有发展的机会了。当然，其中可能会有这样的情况，有些企业IT系统很小，对数字化依赖并不是很大，这个时候就不能一概而论。但是从整体大趋势上来讲，数字化改革，数字孪生肯定是逃不掉、必然要往前走的趋势。</p><p></p><h2>适配工作做不好，上云后处处是坑</h2><p></p><p>&nbsp;</p><p></p><blockquote>InfoQ：沃趣科技在做自己产品的时候，在其他一些运行环境中时需要与操作系统、中间件等组件做哪些适配工作？</blockquote><p></p><p>&nbsp;</p><p>李建辉：虽然国产软件、国产系统以及云计算在往前发展，但其实中间存在一些问题。举例来说，比如整个IT科技怎么发展，我的比较浅薄的建议是，从业务发展角度来看，从用户友好角度来看，业务应该模块化，比如IBM做算力、Oracle做数据库、EMC做存储，大家要进行专业化分工，并且定义好接口，这样大家就能够很好地配合起来。但是，在国内做接口化、做模块化的时候又面临另一个挑战，因为现在做的云计算的整个商业模式并不是一个非常好的模式，所有都是云上的东西，意味着大家无法进行模块划分。比如我是做整个云平台数据库基础设施的，但问题在于云计算厂商并不给你接口，他希望这些事情自己全做掉，所以说是有挑战、有压力的。</p><p>&nbsp;</p><p>中等规模的企业可能能够往上发展，但是像我们这种中小规模的IT公司能够做专业化、垂直化的道路，就依赖于一个接口的问题。关于接口问题，我认为传统的IOE、传统的海外IT做得非常好，大家每个人把自己最专业的一方面做好，然后再慢慢往上延伸，而并不是一开始就全部是云，里面所有的事情都由云来搞定。这对于用户下一步选择，对于IT下一步的发展是有不确定性的。很多用户上了云的第二、三年就会出现问题。</p><p>&nbsp;</p><p>云计算虽然好，但是更应该有充分的云市场、充分的销量，大家有互相的沟通、配合，各把各的事做好，各把各的接口做好。但实际上国内整个云包括公有云、私有云，对于模块化的对接市场并不友好，这是我们所面临的压力。意味着所有做中间件、数据库的厂商，都是在云的压力之下生存。</p><p>&nbsp;</p><p>好在，近几年这种情况有所改善，比如阿里提出来合作集成、被集成，各个云厂商也在朝这一步走。当利润变薄以后，大家想把所有的事情都做下来是有压力的。因为国内的IT一旦做起来以后，最开始并不是特别模块化、专业化的模式，而是赢者通吃，希望一两家把所有的事情吃掉，这对用户来说并不友好。他不可能为小用户定制，很多中小用户用起来会非常难受。为大用户定制，可能前两年还挺友好，到第三年以后定制的费用又变得非常高昂。这种商业模式不是一个能持久的模式。</p><p></p><h2>下一步，数据库会往哪个方向走？</h2><p></p><p>&nbsp;</p><p></p><blockquote>InfoQ：近年来，有一些新的技术比如分布式、云原生，慢慢地融入到数据库中。您推测未来数据库会朝哪个方向发展，一定是分布式和云原生吗？</blockquote><p></p><p>&nbsp;</p><p>李建辉：从现在整个发展情况来看，我认为数据库在未来五年，可能会进入一个求真务实的阶段，但这个求真务实的阶段会变成一个怎么用国产的数据库解决的问题，至于国产的数据库到底是分布式，还是集中式并不重要。因为现在的问题在于大家找不到抓手，老的数据库实在也换不掉，于是就开始讲分布式。</p><p>&nbsp;</p><p>但是分布式的数据库应用场景到底有多少？从我们来看并不多，只有头部1%左右的用户用得到。但实际上大量、很务实的问题在于，牵扯国计民生的大量行业、机会，会出现在国产化的阵营里头。大家既要搞国产化，又要把老的业务切过来，还要搞分布式，我认为难度很大。所以，我们求真务实一点，老老实实让用户能以比较低的成本把老的Oracle换掉，什么好换就上什么，我认为最近几年可能会进入这种状态。</p><p>&nbsp;</p><p>当然，也有些大厂可能将分布式、国产化一起搞定。但是作为一般厂商，或者专业厂商，是要循序渐进地走。但是站来务实和落地的角度来讲，99%的市场需要的是国产替换而不是分布式，所以既然现在阶级压力很大，大家业务压力也很大，我认为要务实一点，先把Oracle换掉，不管大小，尽量用简单易于落地的架构把它换掉，而不是用高大上的、面向未来的架构把它换掉，面向未来的架构是下一桶金，我们这一桶做完以后再做下一桶。</p><p>&nbsp;</p><p></p><blockquote>InfoQ：您认为，我们目前的国产数据库与Oracle、PostgreSQL这样的国外巨头相比，有哪些薄弱环节？我们该如何建立起一个良性数据库生态？</blockquote><p></p><p>&nbsp;</p><p>李建辉：我认为生态的问题就在于大厂是否开放。现在看起来生态好了很多，整个华为的生态很开放，阿里的核心数据库也慢慢地走向开源，我认为生态是越来越开放了。但是另外一个问题是与国际接轨的问题，假设我们把MySQL定义为不能用的产品以后，就意味着我们也可能会和国际脱轨，因为当大家互相不承认以后，就很可能会发生这个问题。现在已经有行业把MySQL定义为不信任的数据库，以前没有定义它是可信的，也没定义它属于纯商业的，只是说也能用，不算信创，也不算是不可控，可能是介于中间。但是现在一旦把MySQL划到不可控，就意味着大家脱钩，这就很难再去判断这个问题了，需要看整个行业的方向是什么样的。</p><p>&nbsp;</p><p>从我们从业来看，毕竟有一些用户基于业务发展以及成本考虑，多多少少付点钱，也不改业务，还是选择长期用商业的。有部分用户没那么激进，没有能力全部换成自主可控，但是我愿意按照国际趋势发展，不愿意全部用Oracle、SQL Server这种全商业的，于是我就选一个开源的。但是这种需要得到政策层面以及行业层面的认可，不能加分但也不减分，然而如果定义成减分，从技术层面大家可能就会出现脱离。因为如果去研究PostgreSQL，或者公司做MySQL，没有市场或者市场受影响了，如果继续研究，没有用户买单，我肯定不会去研究，而是要做更国产化的东西。</p><p></p><h2>做基础软件，开源是必经之路吗？</h2><p></p><p>&nbsp;</p><p></p><blockquote>InfoQ：您认为国产数据库未来是否一定要走开源这条路？为什么？</blockquote><p></p><p>&nbsp;</p><p>李建辉：我认为开源是一个非常好的模式，开源的模式能够让伙伴们加入其中，能够让整个生态往前走。所谓的生态包括我们这样的做数据库基础设施的生态，也包括软件开发生态。比如东软或者某个做ERP的，当然希望整个数据库生态是开放的，开放意味我的业务价值能得到保障，对于大家来说是友好的。</p><p>&nbsp;</p><p>整个数据库生态开放依赖于特别大的大厂对这件事的处理方式。如果大厂是封闭的，大家就都需要找其他数据库，无法形成配合。如果大厂是开放的，大家就能一起走，进而就会形成数据库软件的新的收益模式，它可能会通过订阅，通过数据库服务来收取长远且合理的费用。有很多新型的数据库软件在收取长远且合理的费用方面做得挺好，比如MongoDB，比较友善、合理地去收取专业的技术服务费，Red Hat、Linux也是开源的，你也可以随便用。收取技术支持费是一个能够把规模做得很大，而且很长远、生态又很健康的一个模式。</p><p>&nbsp;</p><p>我认为现阶段应该朝着软件是开源的、整个服务是专业化的、订阅化的这种模式往下走，这是一个长久可持续的模式。因为这样能够建立不同的梯队，对于资金不足的用户，可以完全采用免费的方式做；对于有部分资金的用户，可以采用买专业服务公司的方式做；对于资金好的、质量要求高的用户，可以采用买原厂服务、定制开发的方式去做。</p><p>&nbsp;</p><p></p><blockquote>InfoQ：聊到开源，就避不开开源社区。开源社区和商业公司都有着自己的管理模式，商业公司在管理开源软件和开源社区时，有哪些可以借鉴的经验？</blockquote><p></p><p>&nbsp;</p><p>李建辉：从软件本身来讲，只有两种模式，一种是纯粹的商业版，比如我们做的是商业版，我们基础的设施平台就是商业版的东西。另一种是开源，开源的本身从软件角度来讲，是希望这些商业公司不断地去发现问题并去修改问题。因为只有这样，他们自己的整个软件才会向前发展。对于开源公司，他们有专业的服务公司，开源版和商业版都在做。</p><p>&nbsp;</p><p>嘉宾简介：</p><p>&nbsp;</p><p>李建辉，沃趣科技联合创始人，现任沃趣科技首席运营官，负责公司运营成本控制，新产品的市场开拓，商业模式的尝试创新，以及公司层面的产品战略合作。李建辉拥有16 年 Linux 系统管理经验，曾在阿里巴巴从事系统、存储、维护、管理工作 9 年。</p>",
    "publish_time": "2022-11-26 00:28:47",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "Uber Freight近实时分析架构，晚点取消的比例下降了0.4%",
    "url": "https://www.infoq.cn/article/dGwDNMwj9YuRJj6efdl7",
    "summary": "<p><a href=\"https://www.uberfreight.com/\">Uber Freight</a>\"是Uber的一个<a href=\"https://www.uber.com/en-IT/blog/uber-freight-carrier-metrics-with-near-real-time-analytics/\">平台</a>\"，致力于为托运人和承运人提供连接服务。为托运人提供可靠的服务对Uber Freight来说至关重要，这也就是为什么他们要开发承运人记分卡（Carrier Scorecard），其中包含了准时取货/送货、跟踪自动化和晚点取消等指标。关键在于他们要在Carrier App上近乎实时地显示这些信息，而且提供这种服务的架构必须足够快，快到可以满足这些指标需求。</p><p>&nbsp;</p><p>这个<a href=\"https://www.infoq.cn/article/ylturXyuzcx1d4GQLDKq\">架构</a>\"的要求是数据新鲜度、延迟、可靠性和准确性。一旦运单完成或退回，将以较低的延迟更新绩效分数。每个承运人都可以在低延迟的情况下在应用中查看自己的绩效分数。数据的处理和服务具有较高的可靠性，如果发生了故障，整个系统可以进行优雅的恢复。性能指标必须得到精确的计算。</p><p>&nbsp;</p><p>在设计和实现最终的架构之前，他们考虑了一些潜在的解决方案，特别是在聚合指标方面。这些潜在的解决方案包括使用<a href=\"https://www.mysql.com/\">MySQL</a>\"进行动态聚合和使用MySQL进行数据预聚合。这两种解决方案都有一些缺点，主要的问题是需要批量插入或更新记录，以确保历史数据被正确更新。他们考虑的另一个解决方案是使用两张<a href=\"https://it.wikipedia.org/wiki/OLAP\">OLAP</a>\"数据库表，一张存储原始数据，然后使用事件触发器异步函数来更新另一个表中的指标，但是这个解决方案是不可伸缩的，特别是在写入流量很高的情况下。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/99/9951143413201b3fc5338eb6c6f3b297.png\" /></p><p></p><p><a href=\"https://www.uber.com/en-IT/blog/uber-freight-carrier-metrics-with-near-real-time-analytics/\">最终的架构图</a>\"</p><p>&nbsp;</p><p>最终的<a href=\"https://www.infoq.cn/article/od3c6fSHCrVVtcLjmdlx\">架构</a>\"使用了<a href=\"https://kafka.apache.org/\">Kafka</a>\"、<a href=\"https://flink.apache.org/\">Flink</a>\"和<a href=\"https://pinot.apache.org/\">Pinot</a>\"。后端服务生成的Kafka事件通过Flink来聚合。聚合的数据被摄取到Pinot中，它使用Kafka的实时摄取来保留最后三天的数据，历史数据被摄取到HDFS中。</p><p>&nbsp;</p><p>Apache Pinot提供了JSON、排序列和<a href=\"https://docs.pinot.apache.org/basics/indexing/star-tree-index\">星树</a>\"等索引优化技术，以加速查询的性能。快速查询为承运人提供了更好的交互体验。为了实现250毫秒的表查询延迟，他们在Pinot表上创建了两种索引——<a href=\"https://docs.pinot.apache.org/basics/indexing/inverted-index\">倒排索引</a>\"和<a href=\"https://docs.pinot.apache.org/basics/indexing\">排序索引</a>\"。倒排索引可以将带有WHERE子句的查询速度提高10倍，根据承运人的惟一ID对索引进行排序，将表的大小减小了一半，这也减小了查询延迟。</p><p>&nbsp;</p><p>Neutrino是用于访问Pinot数据集的查询网关，它是<a href=\"https://prestodb.io/docs/current/overview.html\">Presto</a>\"的另一种部署方式，其中协调器和Worker运行在不同的主机上，可以独立执行查询。Neutrino接受<a href=\"https://www.infoq.cn/article/WmH0WXhqsWqpHDm6PpjC\">PrestoSQL</a>\"查询，并将其翻译成Pinot查询语言。Neutrino前面添加了Redis缓存，可以存储聚合指标最多12小时，缓存命中率超过了90%。</p><p>&nbsp;</p><p>根据<a href=\"https://www.infoq.cn/article/CzZVxqt00YFa5hMehi4r\">Uber</a>\"的观察发现，自从它开始向Freight司机提供绩效信息以来，所有关键指标都有了显著提升——晚点取消的比例下降了0.4%，准时取货的比例提高了0.6%，准时卸货的比例提高了1%，自动跟踪的比例提高了1%。这些绩效改进在2021年估计节省了150万美元的成本。</p><p>&nbsp;</p><p>原文链接：</p><p><a href=\"https://www.infoq.com/news/2022/11/uber-freight-analysis/\">https://www.infoq.com/news/2022/11/uber-freight-analysis/</a>\"</p>",
    "publish_time": "2022-11-26 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "投入上百人、经历多次双11，Flink已经足够强大了吗？",
    "url": "https://www.infoq.cn/article/XHuvlsYrPhxhvFOcHjDs",
    "summary": "<p></p><blockquote>采访嘉宾 ｜ 王峰（莫问）作者 ｜ Tina</blockquote><p></p><p>&nbsp;</p><p>作为最活跃的大数据项目之一，Flink 进入 Apache 软件基金会顶级项目已经有八年了。</p><p>&nbsp;</p><p>Apache Flink是一款实时大数据分析引擎，同时支持流批执行模式，并与 Hadoop 生态可以无缝对接。2014 年，它被接纳为 Apache 孵化器项目，仅仅几个月后，它就成为了 Apache 的顶级项目。</p><p>&nbsp;</p><p>对于 Flink 来说，阿里有非常适合的流式场景。作为Flink的主导力量，阿里从2015年开始调研 Flink，并于2016年第一次在搜索场景中上线Flink。在落地的同时，阿里对 Flink 进行大量的修改和完善，让其适应超大规模业务场景。2017年，阿里已成为Flink社区最大规模用户，<a href=\"https://www.infoq.cn/article/kgjitfdbhxwi53qfry3j\">Flink团队</a>\"也达上百人。这其中的一些早期改进，阿里在2018年的文章《<a href=\"https://developer.aliyun.com/article/665060\">Flink已经足够强大了吗？阿里巴巴说：还不够</a>\"》中已有详尽解读。</p><p>&nbsp;</p><p>2019年，阿里宣布收购了Flink背后的企业，并正式开源内部 Flink 版本 Blink，贡献了超百万行代码，极大地推动了社区的良性发展。在2021年双11中，Flink承载的实时计算峰值达到了每秒 40 亿条记录，数据体量也达到 7 TB 每秒，相当于一秒钟需要读完 500 万本《新华字典》。</p><p>&nbsp;</p><p>这几年，Flink社区在国内外技术会议上不断宣传推广，让Flink得到大量采用，各种应用场景也变得更加广泛，生态快速发展。Flink已经变得强大，其设计目标也不再仅仅是流计算引擎，而是让绝大部分数据分析师都可以利用 Flink 流批一体 API 搭建实时数据集成、分析、风控和在线机器学习场景解决方案。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/be/be694e0d4c1253ea8a2873fbb7a098ce.png\" /></p><p></p><p>&nbsp;</p><p>2022年11月26-27日，<a href=\"https://flink-forward.org.cn/\">Flink Forward Asia 2022</a>\"于线上召开，这是一次总结最近发布的重要功能的机会。这一次，Flink流式数仓功能更加成熟，CDC也能够接入多种数据库......InfoQ趁此机会，采访了Apache Flink 中文社区发起人、阿里巴巴开源大数据平台负责人王峰（花名莫问），解读Flink核心技术的进展，并了解Flink的未来规划。</p><p>&nbsp;</p><p></p><h2>从流计算到流批一体计算</h2><p></p><p>&nbsp;</p><p></p><blockquote>打败Storm和Spark Streaming之后，Flink成为了流计算的唯一标准，技术上已经没有了竞争对手。</blockquote><p></p><p>&nbsp;</p><p>Flink 诞生之初能够快速打败上一代流计算引擎 Storm，凭借的是“有状态的流计算”这个核心理念和特色。 通过合流式计算和状态管理两项技术，Flink不仅提供了高性能的纯流式计算，同时也在框架层通过分布式一致性快照技术，为用户提供了数据精准一致性保证。在莫问看来，这是 Flink 出道后迅速成为流计算领域新主流的关键原因。</p><p>&nbsp;</p><p>虽然 Spark Streaming 通过借助强大的 Spark 生态也能够成为一些流计算场景的选择，但其本质依然是基于 Spark Batch 引擎构建的，非纯流执行模式还是会限制其执行性能和流语义表达。</p><p>&nbsp;</p><p>而在批计算方面，Flink已经完成绝大部分工作，并日益成熟。“目前Flink已经能够完整跑通批处理标准测试集 TPC-DS，而且性能也非常不错，已经达到主流批处理引擎水平，接下来 Flink 在批处理的成熟度上会持续完善和打磨，并结合自身流处理的天然优势，力求给用户带来业界最好的流批一体计算体验。”</p><p>&nbsp;</p><p>为什么我们需要流批一体？为什么基于 Flink 的流批一体更有技术优势？</p><p>&nbsp;</p><p>我们先从业务视角看待这个问题，早期企业基本都是离线业务，基于批处理一天运行一次报表，但数字世界在不断进化演进，对实时的需求会越来越多。实时风控、实时BI统计、实时推荐、实时监控，这些都不能等到晚上进行（到了晚上可能商品已经卖完了，用户也走了），实时化的数据分析才能给用户带来价值。逐渐离线和实时就会成为两条平行割裂的链路，并随着实时数据业务量占比持续提升，会有越来越多的任务要重复开发两遍，开发者会开始面临开发效率问题。</p><p>&nbsp;</p><p>此外，实时和离线链路割裂还会存在业务口径一致性的问题，在之前的技术方案下，实时和离线相当于用了两套工具干活，使用不同的语言、不同的引擎，数据口径也无法一致，这样的分析结果就会干扰业务决策，甚至会误导决策失误。</p><p>&nbsp;</p><p>这时候流批一体自然而然就成为了解决实时离线割裂的“新手段”。用一套计算引擎开发出的实时离线两个业务流程，天然是一致的，不会存在误差。尤其在一些高时效的业务场景中，如搜索、推荐、广告，数据平台中的营销分析，对流批一体的需求自然就会比较高。而且，在搜索推荐场景中，还能将 Flink 流批任务与在线任务混部到一起，共用一个资源池，进行统一调度，从而最大化利用服务器资源，这在业界也是比较先进的实践方式。</p><p>&nbsp;</p><p>流批一体新架构能够带来的收益是明显的，但也并不是说它就是“放之四海而皆准”的一种技术架构。莫问认为，“如果当前数据业务基本都在离线数仓，尚未有一定规模的实时化业务，那也没有必要过早去做流批一体改造，因为这样收益并不大。当实时业务量日益成为主流，相对离线占比日益增大，或者对数据一致性有越来越强一致的要求的话，那么流批一体架构就是面向未来的必然选择。”</p><p></p><p>&nbsp;</p><p></p><h2>流式数仓：基于流批一体的新数仓架构</h2><p></p><p>&nbsp;</p><p></p><blockquote>流批一体是一个技术理念。&nbsp;</blockquote><p></p><p>Flink 在 SQL 层提供了流批一体语义表达能力，即用户可以写一套 SQL，从而同时用在实时和离线两个场景，从而得到全增量一体化的数据开发体验。</p><p>&nbsp;</p><p>这是流批一体理念的终点吗？显然还不够。因为在数据存储链路上，还是存在很大的复杂性，例如：在实时链路上，Flink 需要将数据写入 Kafka 等流式存储中，在离线链路上，Flink 往往要将数据写入到 Hive/Iceberg/Hudi 等批式存储中。两条存储链路是割裂的，用户依然要同时维护两条数据链路，造成较大的管理难度。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/c2/c2cea7b4f8a4846bddef3a4484e6ad9f.png\" /></p><p></p><p>&nbsp;</p><p>然而目前我们要同时维护两套存储的原因主要是业界目前没有一个较为生产可用的流批一体存储，同时支持高效的流读、流写、批读、批写能力，用户为了满足不同业务需求（时效性，可分析性等）只能通过多条链路的组合来拼接，甚至还要在不同存储间同步数据，这必然会让整个链路变得日益复杂。</p><p>&nbsp;</p><p>那目前业界是否已经存在可用的流批一体存储来解决这个问题呢？大家可能会想到Apache Hudi的这个主流湖存储项目，Hudi 也确是目前业界流批一体存储能力上相对最完善的技术，但 Hudi 在存储结构的设计上，并不适合大规模更新。因此，Flink 社区下一个阶段的重点方向就是要去解决这个用户痛点，将流批一体理念进一步完善，提供真正可用的流批一体存储技术，从而基于流批一体计算和存储推出完整的流式数仓新架构，这也是2021 年底 Flink 社区推出 Flink Table Store独立子项目的背景。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/64/64f0cae8e4c6ab53a60e454397524109.png\" /></p><p></p><p>&nbsp;</p><p>2022年，Flink Table Store&nbsp;已经完成了从 0 到 1 的孵化，并发布了 2 个release 版本，除了阿里巴巴，包括字节跳动在内的多家公司都已经参与了这个项目的贡献，并有不少公司开始试用。Flink 社区接下来的重点演进方向就是流式数仓新架构，为用户提供更加简洁、实时化的数仓架构，并提供更加一体化的体验，这也是 Flink 多年来倡导的流批一体理念的完整落地场景，流批一体计算和存储的完美结合。</p><p>&nbsp;</p><p>在今天的<a href=\"https://flink-forward.org.cn/\">Flink Forward Asia 2022</a>\"上，莫问给大家展示了一个完整的产品化 Demo，基于阿里的实时计算平台，在 TPC-H 业务背景下跑通了完整的流批一体数据处理和分析流程，包括从数据库源头开始的Flink CDC 数据入湖（写入Table Store）、Flink SQL 实时流式分析（订阅&nbsp;Table Store）以及批量数据订正和实时交互查询，给大家呈现了一个完整的流式数仓新架构成果。此外，Flink 流式数仓架构也是开放的体系，支持对接其他一切具备流批一体能力的存储系统，例如阿里云的 Hologres，阿里也在内部完成了 Flink SQL + Hologres 的企业级自研流式数仓产品，不久也将正式对外发布。</p><p>&nbsp;</p><p></p><h2>基于 Flink 的全增量一体化数据集成</h2><p></p><p>数据集成是实时流处理平台中非常重要的一个应用场景，这在 Garnter 2022年 1 月发布的流处理平台市场引导报告中也可以得到印证，从全球市场看大概 1/3 的流处理场景是和实时数据集成相关的，即通过流处理能力将各种不断变化数据源中的数据同步到分析数据库，数据仓库和数据湖中，从而确保用户可以实时分析到最新的数字世界。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/27/27c3b5eb630448b0e34fa5bd2bb88482.png\" /></p><p></p><p>&nbsp;</p><p>随着实时化数据分析技术的普及，用户的数据同步需求也在进一步升级，期望能够使用一套一体化的全量数据同步工具，一键实现数据同步。但在传统数据集成技术体系下，全量和实时数据同步往往需要两套工具（基于批和流的），并且用户需要在两套工具之间进行协同，因此要真正实现全增量同步流程的无缝对接并保证数据一致性，这个难度和挑战是非常大的。但如果能够利用上 Flink 流批一体融合特性，那实现全增量一体化的实时数据集成就变得可行了。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/37/37f9596f24baff474f4e5037f6ace7a1.png\" /></p><p></p><p></p><p>此外，Flink 本身也具备了丰富的 Connector 生态，能够连接业界各种主流存储，以及优秀的分布式集成框架，包括容错和分布式一致性快照等能力。因此在 Flink 的基础上做全增量一体化数据集成，相当于“站在巨人肩膀上”，会更快更容易。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/ed/ed532959fac005f4fc3b2a70f2828ac0.png\" /></p><p></p><p>&nbsp;</p><p>这就是 Flink CDC 项目诞生的背景，其大量借助了 Flink 自身的优势，利用流批一体执行模式实现了全增量同步自动切换，基于 Flink Checkpointing 能力实现了数据同步断点续传特性，并基于增量快照一致性读取算法保证了数据同步全程对在线数据库无锁操作，这样对生产业务不会产生任何影响。</p><p>&nbsp;</p><p>作为流批一体的另一个创新应用场景，CDC项目发展速度也非常快，网易、腾讯、Oceanbase、哔哩哔哩、Xtransfer等公司都参与了社区贡献，GitHub Star 目前已经突破 3000，生态上支持了很多主流数据库，包括 MySQL、Oracle、PostgreSQL、MongoDB、TiDB、PolarDB 和 OceanBase 等。莫问表示，Flink CDC 会进一步利用 Flink社区的创新成果，接入更多的数据源，成为新一代全增量一体化的数据集成引擎。</p><p>&nbsp;</p><p></p><h2>云原生时代的Flink</h2><p></p><p>&nbsp;</p><p>随着云原生的普及，越来越多的企业应用进行了容器化迁移，并通过K8s进行编排管理。最近几年，大数据领域的Spark、Kafka等都开始支持K8s，使得大数据应用从传统的Yarn时代转变为云原生时代。</p><p>&nbsp;</p><p>Flink社区很早以前就开始基于云原生来设计了，包括Flink的资源调度、流式Shuffle，都是天然适合云原生的。Flink作为一个流式计算引擎，数据的Shuffle不需要落盘，都是流式的进行数据传输，分布式计算之间数据的流动都是通过网络加内存，不依赖本地盘，因此天然就是存算分离的架构。另外，Flink自带了一个状态存储，计算的算子和状态访问是一体的，在算子内部就支持状态访问，这个其实也在朝着存算分离方向去演进，也就是说Flink随时可以关掉RocksDB服务，把状态数据SnapShot到持久化的HDFS或者是云存储上。</p><p>&nbsp;</p><p>Flink作为云原生架构下的产物，本身也一直朝着云原生架构去设计，社区在五六年前就开始做Flink on K8s。<a href=\"https://developer.aliyun.com/article/718812\">支持K8s之后</a>\"，对Flink有很大的帮助，比如部署不依赖Hadoop了：只要有K8s，就可以部署Flink，也没有任何依赖。运维方案也非常标准化，K8s的运维体系也会运维Flink。同时，Flink也可以基于容器来进行部署，容器给Flink带来了更好的隔离性，包括任务之间的隔离、多租户的管理，甚至下一步做Serverless，也会更加自然和容易。</p><p>&nbsp;</p><p>在云原生的发展趋势下，自适应性非常重要。更好的资源弹性让业务的波动也变得更加灵活，而云上的资源也是海量的，用户可以根据业务的需求不断弹性调资源规模。特别是Serverless的环境下，用户甚至不需要去考虑机器资源了。Flink自身也会去增加更多的自适应的能力，实现自动化的任务并发管理和状态数据管理，从而让Flink能更好地使用云上的弹性机制。</p><p>&nbsp;</p><p>Apache Flink 正在蓬勃发展，并在广大的大数据分析生态中变得不可或缺，逐渐成为了企业数据战略的关键支柱。但对于一些传统企业来说，如果没有很强大的大数据技术团队，用开源软件自建一个数据分析平台还是比较困难的。所以提供产品化服务，降低技术门槛，也是阿里云 Flink 技术团队正在做的事情。</p><p>&nbsp;</p><p>阿里云已经推出了一款云原生的实时计算 Flink 产品，提供了以 Flink SQL 为核心的开发运维平台，将阿里内部积累的 Flink 生产运维经验和企业级能力都通过产品化的形式开放给广大中小企业，提供实时数仓、实时数据集成、实时风控和实时特征工程等解决方案，帮助数字化企业加速大数据技术实时化升级。</p><p>&nbsp;</p><p>另外，阿里云提供的Flink产品也采用了最先进的 Serverless 架构，用户只要按需购买计算资源就可以运行方便使用 Flink，让实时计算更加普惠。莫问表示，未来几个月之内，基于 Flink 的多云 PaaS Serverless服务也将在全球范围公测，作为推动 Flink 社区不断技术创新的核心研发团队，阿里云希望把Flink 技术生态进一步推向全球。</p><p>&nbsp;</p><p>采访嘉宾简介：</p><p>王峰，花名“莫问”，阿里巴巴研究员，2006 年北航毕业加入阿里巴巴，目前负责阿里云开源大数据平台，并担任阿里巴巴开源委员会大数据与 AI 方向副主席。2015 年开始将萌芽状态的 Apache Flink 引入中国，基于 Flink 推动阿里大数据进入全链路实时化时代，并以此为标杆效应带动了 Flink 在全球各个行业的快速普及和发展，让 Flink 成为了大数据实时计算领域的事实标准。阿里积极拥抱开源，也主动贡献开源。迄今，阿里已累计对外开源了上百个优秀项目，在GitHub上Star总数超百万。</p><p>&nbsp;</p><p>活动推荐：</p><p>Flink Forward 是由 Apache 官方授权的 Apache Flink 社区官方技术大会，通过参会不仅可以了解到 Flink 社区的最新动态和发展计划，还可以了解到国内外一线厂商围绕 Flink 生态的生产实践经验，是 Flink 开发者和使用者不可错过的盛会。本届Flink Forward Asia<a href=\"https://live.infoq.cn/room/1629\"> 正在直播</a>\"，可扫描图片二维码观看：</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/1c/1c8e6c25a9ed0192dede134e18cd3c74.jpeg\" /></p><p></p>",
    "publish_time": "2022-11-26 10:59:29",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]