[
  {
    "title": "Rust 1.65引入泛型关联类型，向高级类类型迈进了一步",
    "url": "https://www.infoq.cn/article/ULQrMu8BgYDmTCEFpHOZ",
    "summary": "<p>最新版本的Rust引入了一个功能强大的新语言特性，叫作泛型关联类型，允许开发人员为trait中的关联类型指定泛型。其他值得注意的新特性还包括let-else语句，以及对跳出标记块的支持。</p><p></p><p>经过6年的开发，泛型关联类型（GAT）可以被认为是trait类型构造函数的一种形式，可以用来定义关联类型的泛型、寿命或常量泛型。</p><p></p><p>这个特性（关联类型构造函数）解决了高级类类型最常见的用例之一，与其他形式的高级类类型多态相比，它是对类型系统的一个相对简单的扩展，并向前兼容将来可能引入的更复杂的高级类类型多态。</p><p></p><p><a href=\"https://www.infoq.cn/article/j7oW4G2WULtf8SbhGag9\">Rust</a>\"中的关联类型是定义通用trait的一种机制。例如，在下面的例子中有一个叫作Graph的trait，它的节点和边使用了两个关联类型。</p><p></p><p><code lang=\"cpp\">trait Graph {\n    type N;\n    type E;\n\n    fn has_edge(&amp;self, _: &amp;Self::N, _: &amp;Self::N) -&gt; bool;\n    fn edges(&amp;self, _: &amp;Self::N) -&gt; Vec\n}\n</code></p><p></p><p>使用关联类型提高了代码的可读性。Graph的客户端确实可以使用它，而不需要每次都指定其关联的类型是什么，这对于泛型类型来说是必需的。例如：</p><p><code lang=\"cpp\">fn distance(graph: &amp;G, start: &amp;G::N, end: &amp;G::N) -&gt; i32 { ... }</code></p><p></p><p>现在，GTA引入了一种方法来指定本身就是泛型的关联类型。例如：</p><p></p><p><code lang=\"cpp\">trait LendingIterator {\n    type Item&lt;'a&gt; where Self: 'a;\n\n    fn next&lt;'a&gt;(&amp;'a mut self) -&gt; Option<'a>&gt;;\n}<'a></code></p><p></p><p>将其与标准Iterator的定义进行比较：</p><p><code lang=\"cpp\">pub trait Iterator {\n    type Item;\n    ...\n    fn next(&amp;mut self) -&gt; Option\n    ...\n}</code></p><p></p><p>如你所见，LendingIterator使用Item&lt;'a&gt;而不是非泛型的Item相关类型，并将Self约束为类型'a。这意味着next函数将返回一个从self借用的项。</p><p></p><p>虽然乍一看有些神秘，但GAT是一个非常强大的抽象概念，许多crate已经在不稳定版本中使用了它。此外，由于GAT还不稳定，许多crate的进一步开发被阻塞。可以使用GAT构建的一些特性包括：用于从DB加载数据的零拷贝接口、通用构建模式、表示非拥有值等等。值得注意的是，在某些情况下，GAT被不安全的代码替代，并且GAT可以减少对不安全代码的使用，对于这些情况，Rust不再提供任何安全性保证。</p><p></p><p>如前所述，GAT并不是Rust 1.65唯一值得注意的新特性。特别值得一提的还有新的let-else语句和使用break跳出代码块。</p><p></p><p>let-else语句是let的扩展，它试图匹配模式，并在找不到匹配时提供要执行的else块，例如从函数中提前返回或panic。</p><p></p><p>由于循环块支持任意时候跳出循环，标记的break让已经使用只执行一次的loop块来实现的行为变得更完整了。现在，你还可以标记一个块，然后使用break &lt;块标记&gt;语句跳转到这个标记块的末尾。</p><p></p><p>如果你对Rust 1.65的详细变更感兴趣，请查看官方发布说明。</p><p></p><p>原文链接：</p><p><a href=\"https://www.infoq.com/news/2022/11/rust-generic-associated-types/\">https://www.infoq.com/news/2022/11/rust-generic-associated-types/</a>\"</p><p></p><p>相关阅读：</p><p><a href=\"https://www.infoq.cn/article/wdRX0deAbrI0yl8R4OsC\">前端又开撕了：用Rust写的Turbopack，比Vite快10倍？</a>\"</p><p><a href=\"https://www.infoq.cn/article/RgA0yves4Q1FHI9dJlry\">微软首席工程师Nick Cameron：Rust要想取得更大的成功，需要解决这十大挑战</a>\"</p>",
    "publish_time": "2022-11-28 09:29:09",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "从博士论文到被各大厂应用，Alluxio 如何走过7年创业路",
    "url": "https://www.infoq.cn/article/RW9VBsZDdBNtIAKPrGzf",
    "summary": "<p>今年2月，<a href=\"https://www.infoq.cn/article/zCdZAZp3xcFPtP2T4Md0\">Alluxio </a>\"宣布以实现收入同比增长 3 倍的成绩结束了2022财年。“这个财年的业绩进一步表明了市场需要更好的方法来访问大规模分析和 AI/ML 应用程序中的数据，尤其是在分布式混合云和多云环境中。”Alluxio 创始人兼CEO 李浩源表示。</p><p>&nbsp;</p><p>事实上，从当初一个论文项目到如今被市值最大的十家公司中的七家使用，李浩源用了九年的时间。那么，Alluxio 这样一个基础软件领域的创企，是如何从零成长至取得如今成绩？Alluxio 又会如何应对当前动荡的市场呢？</p><p>&nbsp;</p><p></p><h2>起步：另辟蹊径的数据架构</h2><p></p><p>&nbsp;</p><p>2000年初期，大数据伴随着互联网的蓬勃发展应运而生，从而衍生出整个数据科技的发展。从宏观角度看，数据科技可以分成两层：上层的计算和下层的存储。一直以来，存储占据了整个数据生命周期的绝大部分。</p><p>&nbsp;</p><p>2013年，北大毕业后来到伯克利攻读博士学位的李浩源在准备毕业论文时，自然而然地想要做存储相关的选题。但在调研了存储行业的发展历程后，李浩源发现，这个行业每5～10年就会发生一次革新，新产品取代上一代产品。同时，存储市场极其分散，没有一家企业的市场份额能占到25%以上，也没有一款产品的数据存储量能占整个全球数据量的5%以上。</p><p>&nbsp;</p><p>有鉴于此，在存储领域做到改变行业的颠覆性创新，在可预见的未来几乎是不可能的。”李浩源说道，“但是，我们可以把存储里面的数据管理好，让这些数据更好地来服务上层数据应用，从而提高整个社会效率。”</p><p>&nbsp;</p><p>带着这个想法，李浩源提出了一种新的架构，即将虚拟分布式文件系统（Virtual Distibuted File Syestem）作为计算层和存储层之间的新层，为上层 Spark、Presto、Tensorflow、Pytorch 等计算框架提供服务。</p><p>&nbsp;</p><p>这就是李浩源的博士论文《虚拟分布式文件系统》研究的主题。这个项目在当时被称为 Tachyon，也是如今 Alluxio 的前身。</p><p>&nbsp;</p><p>伯克利大学一直有<a href=\"https://www.infoq.cn/topic/opensource\">开源</a>\"的传统，李浩源顺应了这一传统，在第一时间将这个项目开源。开源后，李浩源发现整个技术演进路线的确在往其预想的方向发展，项目也有了越来越多的用户，收到了越来越多业界的正向反馈。</p><p>&nbsp;</p><p>不过，要想实现更宏大的愿景就需要更加体系化的公司化运营，因此，2015年，李浩源选择了创业。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;</p><p>创业初期，很多事情都要李浩源亲力亲为，但最重要的还是按照规划把产品打磨到1.0版本。“我们要把代码写好，大家对代码有了反馈后去进行支持或回应，把产品打磨的越来越好。”李浩源说道。</p><p>&nbsp;</p><p>2016年，Alluxio 1.0 版本正式发布，这是首个以内存为中心的虚拟分布式存储系统，统一了数据访问的方式，在上层计算框架和底层存储系统之间搭建了桥梁。</p><p>&nbsp;</p><p>与此同时，Alluxio 开源社区也在不断发展。社区日常管理由PMC（项目管理委员会）负责。而在有了更多用户后，李浩源开始把更多时间用在与用户和开发者交流上，希望参与进来的人可以为社区做出贡献。据悉，Alluxio 目前在 GitHub 上的贡献者已超过 1,200 人，社区 Slack 频道成员接近 10,000 人。</p><p>&nbsp;</p><p></p><h2>开源助力商业化</h2><p></p><p>&nbsp;</p><p>产品逐渐成熟后，Alluxio 开始进入商业化阶段。早期没有客户时候的商业化很难，但好在Alluxio 的开源社区获得了一些行业和社区的认可，因此当这些开发者有需求的时候便会主动找到Alluxio。李浩源也很重视与潜在用户的交流，帮助解决用户具体痛点，建立信任后再进行更大的合作。这样的方式，帮助 Alluxio 完成了早期用户积累。</p><p>&nbsp;</p><p>Alluxio的商业化模型与其他开源产品差不多，都是在开源版本基础上添加商业化功能，并以付费的企业版输出，企业版根据客户使用的节点情况收取费用。</p><p>&nbsp;</p><p>据悉，&nbsp;Alluxio企业版在全球市场客单价从几十万美元到数百万美元规模不等，客户多集中在科技、金融、电信等行业。李浩源此前表示，Alluxio 90%的客户都是全球五百强，产品已经得到很好的市场验证。</p><p>&nbsp;</p><p>随着企业的发展，李浩源开始将精力放在为公司的整体发展和方向做出决策，以确保制定最为有效的战略，让公司成长为一家全球领先的企业。</p><p>&nbsp;</p><p>实际上，自 Alluxio 创立以来，数据生态系统发生了巨大的变化，越来越多的企业开始上云。与在传统数据仓库中提供托管分析工作不同，云中的数据服务变得更加遥远（如从 S3 传输）、孤立（如分布在多个不同的区域或存储服务中），并且通常在性能上存在很大差异。</p><p>&nbsp;</p><p>为此，在2019年的纽约AWS 峰会上，Alluxio 发布了大版本2.0，针对多云增加了多项功能，包括支持跨本地和任意数量云进行自动数据分层等，还为云计算优化数据访问、与 AWS Elastic Map Reduce (EMR) 服务集成等。</p><p>&nbsp;</p><p>而最近发布的<a href=\"https://xie.infoq.cn/article/1add84ca9a4750f34e2e60fbc\">2.9版本</a>\"增加了跨环境集群同步功能，支持横向扩展的多租户架构，显著改进在Kubernetes上部署的工具集和指南，增强Alluxio的易管理性，并通过优化S3 API 和 POSIX API 实现安全性和性能提升。</p><p>&nbsp;</p><p>如今，全球头部互联网企业Facebook、Airbnb、Uber、阿里巴巴、腾讯和字节跳动等已经在生产环境里部署了 Alluxio 的软件系统；全球前六名的云厂商中有五家云厂商已经嵌入了 Alluxio 的技术；全球前两名的芯片厂商英特尔、英伟达也在使用&nbsp;Alluxio。</p><p>&nbsp;</p><p>同时，Alluxio 也正在全球扩大目标市场规模和研发运营覆盖范围，其中包括大力拓展国内市场业务，将北京设立为中国区总部，并成立本地化的研发团队。今年9月，Alluxio 还与北京大学计算机学院签署产学研合作框架协议。</p><p>&nbsp;</p><p></p><h2>如何“过冬”</h2><p></p><p>&nbsp;</p><p>作为创业公司，Alluxio 在科研方面一直在进行大量投入，员工人数相比之前也实现了三倍增长，并且还在进一步扩大公司执行管理团队等。这些投入的背后主要来自Alluxio自身快速增长的营收和投资人的支持。</p><p>&nbsp;</p><p>一方面，Alluxio在前年营收实现了同比3.5倍的增长，去年实现3倍增长。另一方面，Alluxio一步步兑现甚至超额完成预期也得到了投资人坚定支持，比如 a16z 一直在加磅 Alluxio。</p><p>&nbsp;</p><p>不过当前受疫情影响，资本进入“寒冬”，全球企业都在面临着一场生死“大考”，Alluxio 也不例外。对此，李浩源的应对之道就是“练内功”。</p><p>&nbsp;</p><p>“在市场动荡的情况下，企业更多还是要做好核心根基。正所谓‘集中力量练内功’，本质上就是把核心产品做得更好，为你的核心客户带来更多的价值，让已有客户更满意，在此基础之上再扩张。”李浩源补充道，“这也是Alluxio 一直以来的发展策略。”</p><p>&nbsp;</p><p>&nbsp;</p><p></p><h2>结束语</h2><p></p><p>&nbsp;</p><p>未来，Alluxio 将继续加强对大规模数据分析、人工智能技术的支持，通过加强与 Kubernetes&nbsp; 的整合等方式，优化用户使用体验。而对于其进一步深入扩展全球市场能做出什么样的成绩，李浩源很有信心。</p><p>&nbsp;</p><p>“兵来将挡，水来土掩，面对未来的种种困难，只要一一处理就好了。”李浩源说道。</p><p>&nbsp;</p><p>&nbsp;</p>",
    "publish_time": "2022-11-28 11:48:20",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "奈雪的茶：一杯奶茶中的数字化“秘密”",
    "url": "https://www.infoq.cn/article/VNTgMY30plY1K5o7jAcN",
    "summary": "<p>奶茶圈究竟有多“卷”？有数据统计，截止 2021 年，全国的奶茶店数量已经超过 40 万家。消费者的选择越来越多，行业的竞争压力越来越大，比起以价格取胜，稳定的口感、服务和供应链变成茶饮品牌间竞争更重要的砝码。</p><p></p><p>拿一杯奶茶来说，里面有水果、茶叶、鲜奶、配料等各种不同的食材，消费者在购买时，对甜度、温度、配料比等又有完全不同的需求。如果全靠店员手工制作，即便是出自同一家店，口感也很难保持稳定，更别提做到全国统一。</p><p></p><p>在这背后，<a href=\"https://www.infoq.cn/theme/161\">供应链</a>\"的稳定性同样重要。试想这样一个场景，奶茶店力推新品，却因为备料不足很快售罄——对门店来说，这会使得新品的推广效果难以评估；对消费者来说，满心期待却悻悻而归，消费体验就会大打折扣。</p><p></p><p>在最新一期的 InfoQ《超级连麦. 数智大脑》中，<a href=\"https://www.naixue.com/\">奈雪的茶</a>\"技术中心高级总监李道兵表示，过去，门店配货主要都是由门店自己订货，其中的问题在于，店长的主观判断很容易出错，乐观的店长会囤积太多的原料，导致其他门店无货可售，马虎的店长会对同一商品的不同原料配比错误，导致原料在门店呆滞报废。整体来看，都浪费了大量的销售机会。</p><p></p><p>数字化解决的问题，不仅仅在于能比中位值的员工提供更好的决策。数字化更大的用处，是扫除连锁扩张的一个大障碍，就是<a href=\"https://time.geekbang.org/\">人才</a>\"匮乏。连锁品牌每扩张一家门店，就需要寻找同时有排班、订货、生产计划技能，以及有服务意识的管理组，而且还必须在当地，这个难度很大。而奈雪的茶的数字化目标，就是解决掉排班、订货和生产计划的问题，在连锁扩张中只需要找到有服务意识的人，这就大幅度降低了难度。</p><p></p><p>除此之外，门店店员的培训成本，也是连锁餐饮经营面临的核心挑战。通常来说，把一个新员工培养成熟练工，至少需要 1-2 个月时间，其中不少时间还是脱产培训。但是，数据统计，餐饮门店员工在职平均时长只有 1 年左右，脱产培训成本不低，而且新员工的出品品质还不稳定。</p><p></p><p>因此，奈雪的茶自 2018 年开始布局<a href=\"https://xie.infoq.cn/article/b05f695fc335f6498582ed0f5\">数字化转型</a>\"。一方面，是为了剔除人为的不稳定因素，保持商品品质、服务和供应链的稳定性、可靠性；另一方面，也是为了降低对人的强依赖，降低门店运营成本，同时把人力解放出来，为消费者提供更优质的服务。</p><p></p><p>具体来说，奈雪的茶在前端门店配置了自主研发的自动和半自动化制茶设备，从煮茶到加料，人与机器协作一气呵成，实现了流程的标准化、自动化；在后端，通过自研的数字运营系统，可以做到自动订货，从公司全局视角进行统一调配，实现物料供应的精准化，降低销售机会损失，以及库存资金占用。</p><p></p><p></p><blockquote>本期 InfoQ《超级连麦. 数智大脑》，由奈雪的茶技术中心高级总监李道兵，对话极客邦科技创始人兼 CEO 霍太稳（Kevin），和 InfoQ 极客传媒数字化主编高玉娴，一起探讨奈雪的茶一杯奶茶中的数字化“秘密”。内容有删减，感兴趣的同学可进入“霍太稳视频号”或“InfoQ 视频号”观看直播回放。  </blockquote><p></p><p></p><h2>用 AI 在门店管理中减少人为失误，提升人效</h2><p></p><p></p><h4>问：2018 年奈雪开始布局数字化转型战略，促使我们去做数字化的动因是什么？</h4><p></p><p></p><p>李道兵：归根结底，是餐饮连锁业为什么需要数字化？过去大家并不太关注这件事，直到用户运营变得越来越重要，餐饮门店的营业额开始大幅受到用户复购的影响。比如一个门店，品牌有了，所在地区的用户群也有了，能否触发用户的购买欲，让他想起来去买一杯奶茶，就成为了提升营业额的关键。</p><p></p><p>商品品质的提升、价格的设定都是过去商家本身比较擅长的。但是，就触发购买欲这一点，没有用户运营、用户体系，几乎做不到。这就是促使越来越多的连锁品牌进行数字化转型的重要原因。</p><p></p><p>当然，除了用户运营之外，餐饮连锁的日常运营还有很多地方需要数字化手段去做支持。比如，门店如何去扩张？如果只有 5 家、10 家门店，老板自己盯着就可以了；如果有 20-30 家门店，找几个得力店长可能也够了；但是，当门店达到数百家，就需要利用数字化的手段解决管理的问题。</p><p></p><h4>问：今年奈雪的门店总数已经超过 900 家，我们在门店经营管理过程中，遇到的核心痛点有哪些？</h4><p></p><p></p><p>李道兵：首先，还是门店扩张的问题。和自动贩卖机这种轻量级的运营模式不同，门店的迁移、扩张是非常重成本的。比如，好的店铺位置往往非常稀缺，很多时候可能要等半年到一年才有空缺，这是时间成本。而等到店铺位置之后，还要装修、配置设备、招聘员工、进行员工培训等等，其中的前期投入成本非常高。</p><p></p><p>其次，是门店管理的问题。门店管理组的能力，往往决定了一个门店运营的好坏。而随着门店扩张，比如当一个企业开了 300 家店，其实很难找到 300 个合适的店长，并且这些店长还必须跟城市、区域去匹配。我们不可能在三线城市开一家店，还要从一线城市调一个店长过去，店长的薪资水平还没有达到能让一个店长举家搬迁的吸引力。</p><p></p><p>第三，是门店店员培训成本的问题。对于很多餐饮企业来说，每个店员的平均在职时间并不长，差不多一年就要轮换一次，甚至更多，假设一个店员在店里只工作了 12 个月，培训就要用 1-2 个月的时间，其中的培训成本就是非常高的。</p><p></p><h4>问：这些问题怎么用数字化的办法解决？</h4><p></p><p></p><p>李道兵：对于奈雪的茶来说，数字化要解决的第一个问题就是怎么降低门店对店长个人能力的要求，第二个问题是降低店员培训的成本。</p><p></p><p>尤其是对店长来说，理想的状态是，假如他没有那么高的技术水平、管理水平，也能当好店长。举个例子，店长的一个重要职责就是排班，通过评估一段时间内的营业额，匹配对应的人手规模，以及这些人手分别需要在什么时间段上下班。一方面是确保效率，另一方面还要避免工时浪费。</p><p></p><p>除此之外，店长另一个重要工作就是订货。如果货定少了很快就会售罄，消费体验不好；如果货定多了，仓库肯定放不下，会造成非必要的库存。拿奈雪的茶来说，我们不但卖茶饮，还卖面包，面包几乎每天只出炉一次，售卖的数量是有限的。所以，每种面包每天应该做几个，店长心里要有数，不能等到发现当天卖得好再想着要货。这就是我们在门店经营中遇到的实实在在的挑战。</p><p></p><p>现在，对我们来说，最重要的技术手段就是 <a href=\"https://www.infoq.cn/news/VitTKb0zLljDj4QTPMpw\">AI</a>\"。最近几年，AI 就像是一个“榔头”，它能够把我们所找到的所有“钉子”都试着敲一遍。尽管不是在每个领域都能起到作用，但在能起到作用的领域效果还是很明显的。</p><p></p><p>比如，虽然 AI 现在还很难预测某款产品会卖得好。但是，至少我们能做的就是在公司决定推某个新产品的时候，帮助门店实现物料和效率的最大化。</p><p></p><p>同样是推一个新品，不同区域的销量表现不一样，即便是同一区域的不同门店，效果可能也不完全一致。这就意味着，我们在针对新品物料做门店配送的时候，需要根据销量预测，进行相应的匹配，而不是进行均匀分布。当然，也不是直接按历史销售额做匹配，还可以做得更精细化，通过对销量本身的预测，比如，某个店周围的人群特征可能直接影响新品销量，这个门店就可以多追新，多配新品物料。</p><p></p><p>在这个过程中，所有的物料分配标准、货品的配置，都是由系统自动算出来的，而不需要店长拍脑袋决策。</p><p></p><p>霍太稳：也就是说，当餐饮连锁扩张到几百家门店之后，就面临一个问题——如何为店长赋能，通过数字化的手段，包括前后端的协同，让管理组的能力实现复制，让门店的管理经验变成“可插拔”的事情。</p><p></p><p>比如，现在很多连锁门店在做<a href=\"https://xie.infoq.cn/article/1b45e5aa434202b7817ca1aa4\">智能排班</a>\"，其实就是通过数字化计算门店店员的合理调配，包括在哪个时间段需要店员更多一些，哪个时间段需要的店员更少一些，这是技术更擅长的事情，可以节省很多的人力成本。对于备料也一样，每天预估备多少的面粉、茶叶、水果等等，如果都能够用算法相对比较精准地计算出来，那门店就能做到更精细化的管理，而且能大大减少对店长能力的依赖。</p><p></p><h4>问：在这个过程中，人机协同的效果怎么最大化？</h4><p></p><p></p><p>李道兵：AI对人的价值主要体现在错误操作预警、行为修正，帮助员工提升工作效率和能动性。</p><p></p><p>首先，AI 可以及时发现员工犯错，或者可能犯错的情况。如果机器判断一个员工肯定犯错，就可以直接阻止他的相关行为；如果判断员工可能犯错，就可以进行预先提醒，给出再次确认的指令，或者增加审批流程，从而防止出错概率。</p><p></p><p>其次，AI 还可以帮助提升员工效率。其中的关键就在于，找到低效的环节。盘点、收货、生产各种场景下都需要人来产生数据，而人产生数据的环节就是一个错误产生点，就需要做管控。而要提升门店的人效管理，一般就可以靠智能排班系统来解决。</p><p></p><h2>避免供应浪费，降低物料损耗率</h2><p></p><p></p><h4>问：除了门店管理的精细化，奈雪的后端供应链又是如何通过数字化支持门店更准确地制定生产和销售计划的？</h4><p></p><p></p><p>李道兵：对于连锁餐饮来说，供应链端如果出现问题，主要表现是配货不均衡。过去，门店配货的做法是由门店自己订货，这里面的问题是，店长的主观判断可能出错。比如，他们觉得接下来某个产品会卖得很好，订货数量就会增加，囤了一堆货品之后，最后却卖不出去；还有另一个问题，有的店长比较马虎，某个产品的两种原料的配比是 1:5，最后他按 1:10 配货，造成大量的浪费。</p><p></p><p>所以，我们通过供应链的数字化，主要目的是做物料端的主动配货。由于公司层面拥有全局视角，就可以从全局去做评估，经过系统去计算，给出决策建议，好处就是确保我们给某个门店定的货，恰好是他们需要的，避免不必要的浪费。</p><p></p><h4>问：除此之外，成品、半成品等物料本身的损耗率如何通过技术手段降低？</h4><p></p><p></p><p>李道兵：首先，一定要找出造成损耗的原因，针对性地解决。当然，这里面有一个前提，就是<a href=\"https://xie.infoq.cn/article/fea9b5681189605423bad1f08\">数据</a>\"一定要准确，如果数据不准或者有误差，损耗率达总指标是无法分解下去的。只有数据准了，才能找到具体在哪个环节造成了损耗，才能去改流程。</p><p></p><p>举例来说，分析后发现，是因为预测不精准，导致半成本生产多了，最后用不掉，又不能过夜，只能报损。那么，需要优化的就是预测流程。对于门店来说，数据需要精确到各个细节，比如，究竟是在下班前半小时还是一小时不煮最后一缸茶了，这些细节都要规范下来。并且，对于不同物料，规范是不一样的，没有很通用的标准。这就要求我们在数字化流程上把数据做扎实，才能去很好的去洞见问题。</p><p></p><h4>问：如何判断哪些数据是否有用？</h4><p></p><p></p><p>李道兵：判断数据是否有用，最简单方法就是回测。举个例子，某个产品在门店的售卖，一般第一天的物料供应都是充足的，所以第一天的数据是比较完整、真实的。第一步我们可以对比某个产品推出后，在不同门店第一天的销量差异，并且从中找到规律，把后续的数据放到算法模型中，持续验证。</p><p></p><p>当然，即便是因为物料不足，产品在第一天售罄了，也是有数据可用的。因为系统可以掌握某个产品在某个时间段的销售趋势，并且把它还原出来——用来测算当物料供应充足的情况下，究竟能卖多少。在这基础上，还可以分析当天供给不足的原因，用于后续的防范。</p><p></p><p>也就是说，当所有流程都实现了数字化，那么，数据就是现成的，只不过需要我们一次次去回测，找到可用的数据，同时持续优化相关的<a href=\"https://xie.infoq.cn/article/7572e279a6358b587cafbcfda\">算法</a>\"。我们不能要求所有预测都会百分百准确，最开始的算法可以做得很简单，只要它的得分是正分，比常规表现下的 80% 做得更好，那就值得推广。接下来，主要工作就是去做优化，让它比 95%、99% 的情况做得更好。这样门店的运营能力就会不断提升。</p><p></p><h2>技术不是万能的，数据准确性很重要</h2><p></p><p></p><h4>问：从前端运营到后端管理，数字化的落地，给奈雪的业务带来了哪些具体的优化和改善？</h4><p></p><p></p><p>李道兵：第一，是在做业务优化和改进的时候，可以快速去落地和试错。在没有数字化的时候，很多问题没有办法清晰呈现，因为缺少数据去做支撑。而有了数字化手段，就可以清晰定位问题，并且校验解决办法的可执行性，加快产品、流程的迭代速度。</p><p></p><p>第二，是提高门店的运营效率。拿自动制茶机为例，它非常依赖于后面一整套数字化体系的运作，具体来说可以解决我们说的门店管理组的培训问题，降低培训成本，减少店员出错的概率。过去很多人要熬夜背配方，现在不需要了，只要点一个按钮，一杯茶就做好了。</p><p></p><p>第三，是运营成本的降低。最直观的表现，就是今年奈雪的茶的产品，从以前平均 25-28 的价格，降到了 20 元以下。这背后就是因为我们通过数字化不断地优化成本，为降价留出了足够的空间。</p><p></p><p>其中，对我个人来说，感受最大的是 PDCA 循环的优化（Plan（计划）、Do（执行）、Check（检查）、Act（处理））。你要怎么发现问题？怎么才能决策？怎么让决策落地？没有数字化，很多事情是走不动的。特别是在疫情这样的大背景下，如何让企业的营运模式有<a href=\"https://www.infoq.cn/article/z9DfpZCh0femWpQ6awVp\">韧性</a>\"，当冲击来临的时候，成本能够快速降下来，这很关键。</p><p></p><h4>问：在奈雪推进数字化的过程中，遇到了什么让您印象深刻的挑战？我们又是如何克服的？</h4><p></p><p></p><p>李道兵：最大的挑战是数据准确性的问题。餐饮行业和互联网行业不一样，互联网行业的数据都是按照比较严格的流程产生的，所以数据质量比较高。但餐饮行业不同，其中有很多不可控因素。最开始我们还是过于理想化，没有意识到“凡是有人参与的地方，就会有错误”，最后导致了一些<a href=\"https://xie.infoq.cn/article/6cadb8669646d839423aa1f32\">数据质量</a>\"的问题。</p><p></p><p>在发现这个问题之后，我们开始用比较系统的方法规范员工的操作，用体系化的方法贯彻下去，在任何与人打交道，需要人去输入数据的节点，尽量实现流程标准化，操作自动化，降低对人本身的依赖。</p><p></p><p>有一点特别重要，就是关键流程都要在线上，并且一定要有一个数据池，能够把所有数据都汇集在一起。在这基础上，要有 BI 分析平台，平台还要持续监测对业务有较大影响的关键数据，持续不断地去改去优化，打磨质量管理的 PDCA 循环。</p><p></p><p>在具体的落地过程中，要擅用头脑风暴发现业务运营中的问题，定义好这些问题，并且提出改进项。换句话说，所有的架构都要围绕业务展开，形成一个持续向上优化的闭环。</p><p></p><h4>问：所以技术不是万能的，数字化的顺利推进，还需要配套的组织流程的保障？</h4><p></p><p></p><p>李道兵：是的，比如前面说的，对店长来说，可以根据 AI 给出的信息去做决策。但这个决策究竟好不好，后面我们还有一些相关的手段去追踪和闭环。我们会先拿一定数量的对照组出来做比较，比如，其中十家使用新决策新办法进行运营，其中十家保留原来的运营办法，通过比较这些门店平均数据表现，如果前者表现更好，那就继续扩大试行门店数量，通过一轮一轮的比较优化把事情做好。</p><p></p><p>在这个过程中，系统最大的好处就是提供一个闭环持续提升的方法，我们只要持续比较，就会发现 AI 在哪些地方做好了，哪些地方做砸了，做砸了的原因是什么？是少考虑了什么因素？下次能不能补齐？比如，不同区域的消费者对天气这个因素的敏感度是不一样的，同样是下雨天，不同城市的人的选择行为其实是不一样的。所以，不能用同一套逻辑套用，一定要知道里面的差别，知道 AI 出差错的地方在哪，然后才能不断迭代，系统得分才能越来越高，算法模型才能越来越精准。直到所有门店的经营状况都被优化，那这个系统和模型就自然而然被推行下去了。</p><p></p><h2>技术人也要下一线，要持续学习</h2><p></p><p></p><h4>问：奈雪的茶很早就非常重视技术研发，在我们培养数字化人才的过程中，有什么成功的经验？</h4><p></p><p></p><p>李道兵：我认为最重要的还是下一线，要能够跟业务摸爬滚打在一起，持续去调研，切实体会他们遇到的问题，真正体验他们的工作流程，这样才能清楚把握改进的点在哪。数字化转型的规划只是一个主导的方向，具体在执行中该往哪边走，很多落地的细节还是需要一点点跟一线需求结合起来，才能打磨得更好。</p><p></p><p>对于奈雪的茶来说，产品部门在其中会发挥比较重要的作用，他们类似于业务和技术之间的桥梁。甚至从某种角度上来讲，他要比业务更懂业务。当然也有一些企业会从业务线去提拔产品负责人，我觉得这也是个好主意。</p><p></p><p>除此之外，对于<a href=\"https://www.infoq.cn/article/wliPhHXvgVJrKIs52RYk\">人才培养</a>\"，我的另一个心得是，永远要“奖励优秀”。要让优秀的人有荣誉感，他们是团队里的一颗星，要让他们的工作方法被推广下去。</p><p></p><p>霍太稳：对于数字化人才，极客邦科技双数研究院“<a href=\"https://www.infoq.cn/minibook/WvG2KwN4tFfpjtTaxNve\">数字人才粮仓模型</a>\"”把他们分成了五层：</p><p><img src=\"https://static001.infoq.cn/resource/image/4f/c6/4fab60a222ayy7yy5716ab718084e9c6.jpg\" /></p><p>从上往下，最上面那层是数字思维管理者，一般是公司的一把手，CXO 这一人群，他们往往决定了公司到底要不要做数字化，能不能成功实现数字化；第二层是数字思维业务人才，包括销售、运营、营销、财务、市场、品牌、产品设计等等；第三层是业务架构人才，他们是业务的架构师，扮演的是业务和技术连接者的角色；第四层是技术架构人才，通常横跨多个技术领域，具有技术侧的全局思维；最下面一层是专项技术人才，这部分人才需要具备两类能力，一类是软件工程能力，知道开发体系怎么运转，另一类是专项技术能力，包括人工智能、区块链、大数据等。</p><p></p><p>而我们在去给这些不同类型的人才进行培训的时候，就要给他们提供不同的技能补齐。比如，对于专项技术人才，可能要提供一些 Java、Python 之类的课程；对于业务架构人才，可能要教授他一些业务的方法论等等。所以，“数字人才粮仓模型”发布以来受到了很多关注，它分享了在数字经济方面的观察以及在数字人才发展与培养方面的研究和发现，现在很多的企业都把它作为内部人才培养的一个参考指南。</p><p></p><h4>问：您对于技术领域的人才发展有什么好的建议吗？</h4><p></p><p></p><p>李道兵：第一是长见识，首先一定要去找一些比自己阅历更高的专家进行对标，通过会议、课程等方式，让自己的见识不断提升。要知道业界都在聊什么，行业需要解决的问题是什么，有了这些方向之后，你才知道自己该去学什么。</p><p></p><p>第二是持续学习。一方面，要追求一定的知识广度，另一方面，要追求一定的知识深度。在这个过程中，很重要的一点是一定是要在产业中去学习 Know-How，只有这样，你才能透过现象，深入问题的本质，并且让自己的能力和经验变得可复制。</p><p></p><p>霍太稳：如今，我们正在从消费互联网时代迈向产业互联网时代。过去，很多 2C 企业是靠“烧钱”获得用户，获得营业增长，获得竞争力的。但是，到了产业互联网时代，你会发现这样的做法已经不适用了，背后的原因就在于，2B 领域更看重 Know-How，它需要你通过更长的时间，形成更扎实的积累，要求你必须沉浸其中，反复打磨。</p><p></p><p>如果你没有这一基础认知，还拿着消费互联网时代的“锤子”去砸产业互联网市场的“钉子”，实际上很难获得什么价值。就像抓沙子一样，越努力沙子漏的越快。</p><p></p><p>所以，目前对于很多的技术人，非常重要的就是去提升自己的认知，去改变自己固有的思维，用发展的眼光去看一看产业互联网，多去关注实体经济，看看哪些技术可以在其中发挥价值，去帮实体企业提升效率，降低成本。</p><p></p><h3>嘉宾介绍</h3><p></p><p></p><p>李道兵，奈雪的茶技术中心高级总监。先后在金山、盛大云、七牛云、京东云等公司工作。曾任盛大云资深研究员，七牛云 SVP 兼首席架构师、京东云高级总监。现主要关注连锁经营和供应链的产业互联网领域。</p><p></p><p>霍太稳，极客邦科技创始人兼 CEO，InfoQ 中国创始人，极客时间创始人，TGO 鲲鹏会发起人。2007 年创立 InfoQ 中国，2014 年创立极客邦科技，2015 年发起 TGO 鲲鹏会，2017 年创立在线职业教育学习品牌极客时间，2019 年开创极客时间企业版，拓展企业服务市场。</p>",
    "publish_time": "2022-11-28 11:49:22",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]