[
  {
    "title": "一文搞懂Scrum中的工作量评估和预测",
    "url": "https://www.infoq.cn/article/6Z5T4MrjudHzLzgGJd0C",
    "summary": "<p>近年来，Scrum 世界发生了巨大的变化。这一点在工时评估（estimating）方面体现得最为明显；自这个框架诞生之日起，Scrum 从业者就一直在进行着这项艰苦的实践。许多人没有看到评估的价值。2020年，在Scrum指南中，“工时评估”一词被 “规模评估”（size）取代。有人些经常忘记评估是什么，说到底，评估只是评估。</p><p>&nbsp;</p><p>社区对于工时评估和预测所持有的观点令人担忧。我的目的不是火上浇油，而是补充一些想法，以供进一步讨论。在我看来，Scrum 世界需要这样一篇文章。这是一篇理论性文章，适合有相当Scrum知识和实践经验的读者阅读。希望这篇文章对你有所帮助。</p><p>&nbsp;</p><p>如果你做的预测总对，那你就是超级天才了。预测很少完美，原因如下：</p><p>由于存在依赖关系，所以等待时间是工作耗时的一个重要因素，受许多不可预测的事件影响。即使工作环境不复杂，人们也会高估一天能够完成的工作量。通常情况下，人们会设法尽快把复杂的工作干完，不讲条理，而且可能发生意外情况（<a href=\"https://youtu.be/WSes_PexXcA\">意外并发症</a>\"）。甚至更糟糕，后续的工作导致情况恶化，不管是否解决了杂乱无章的问题，工作耗时都会比之前多。有人称之为“<a href=\"https://en.wikipedia.org/wiki/Broken_windows_theory#:~:text=In%20criminology%2C%20the%20broken%20windows,and%20disorder%2C%20including%20serious%20crimes.\">破窗综合症</a>\"”。复杂的工作涉及许多未知的变量。缺乏专注，例如，“拿出你10秒的时间“或者”务必想尽各种办法“，原因是发布周期太长或者围绕流程瓶颈的过度计划（工作太多）。改变优先级，而又没有根据调整后的优先级更新工作量。例如，在有问题的预测会议之后，且明显不允许的情况下，又增加了一个新的优先事项。</p><p>&nbsp;</p><p>人们通常认为，预测是为了告诉大家，“什么时候可以完成？”然而问题经常会接踵而至：</p><p>我如何才能把担忧传递给别人？取得了哪些进展？还有什么风险？对于这项投资，我们什么时候才会有回报？哪些工作有潜在价值，如80:20原则，对此我们可以接受何种取舍？部分或全面降低有效性、效率和可预测性，如运行一些试验，对此我们可以接受何种取舍？我们需要通过“非生产性工作”来避免执行偏差，如试验室准备，对此我们可以接受何种进度取舍？为了掌握所需的技能，我们需要多大的投入，如培训或学徒训练？</p><p>&nbsp;</p><p>有必要考虑下“赢得游戏意味着什么？”这个问题的元问题。团队参与的是一个有可能获胜的游戏吗？如果团队能够获胜，胜算有多大？概率预测可以提供帮助，如蒙特卡罗模拟算法。</p><p>&nbsp;</p><p>尽管存在风险，但团队有时还是需要预测，因为人们担心，利益相关者会凭空定一个不可能完成的日期。有时候，团队希望有一个超出利益相关者预期的大致日期范围。有趣的是，大多数人都可以接受天气预报随着最新信息定期更新，即使我们知道那还是不准确。</p><p></p><h2>蒙特卡罗模拟</h2><p></p><p>Troy Magennis对<a href=\"https://observablehq.com/@troymagennis/introduction-to-monte-carlo-forecasting\">蒙特卡罗模拟</a>\"做了很好的解释，简而言之，它让人们可以基于数据和假设“模拟（model）”未来。概率预测可以告诉你，你能够完成多少工作，而不是你手头的工作是否符合预测。虽然对于复杂的工作来说，概率预测是一种幻象，但我们可以在掌握最新信息时重新做，让它们随着时间的推移越来越可靠。</p><p>“Monte Carlo-When”预测使用500到100万个随机数表示每个时段内介于上下限（真实数据或90%置信猜测）之间的吞吐量（每个时间段内，如冲刺，有价值事项的交付率），以及随机生成的一定范围内的事项数量，每个预测将返回一个日期范围以及相关的概率。例如，在下图所示的结果中，经过10k次模拟，在11月22日或之前有85%的可能交付50到75个事项。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/ed/ed49b24f76ebd6841f482d0266a75cdd.png\" /></p><p></p><p><a href=\"https://analytics.actionableagile.com/twig/index.html\">TWiG and ActionableAgile截图</a>\"</p><p>“Monte Carlo-How Many”预测使用随机生成的每个时段中一定范围内的吞吐量，来预测给定日期内可以完成多少事项；输出是一个日期范围、截止那个日期可以完成的事项，以及一个百分比概率。如下图所示，85%的事项将在那个日期或者之前交付。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/6c/6c74c594ef7023d15f1bf4da59b56024.png\" /></p><p><a href=\"https://analytics.actionableagile.com/twig/index.html\">TWiG and ActionableAgile截图</a>\"</p><p>&nbsp;</p><p>不管在哪种情况下，限值错误都会导致预测质量不高。例如，我们使用一个七面的骰子，点数为1、2、3、4、5、6、7，而吞吐量只有可能是3、4、5、6或7。我们也允许出现1或2，只是那可能已经超出了限制。也就是说，1、2、8或9还是可能出现，只是可能性比较小。Prateek Singh更详细地介绍了如何使用<a href=\"https://towardsdatascience.com/all-models-are-wrong-but-some-are-random-25ff1491406f\">各种模型</a>\"来生成随机数。此外，如果吞吐量不稳定，或者每个时段都几乎为零，那么蒙特卡洛模拟的质量就会大大降低。预测的本质是风险管理。它回答了这样一个问题：我们目前的计划包含多少风险？预测质量下降也就意味着风险管理不足。</p><p>&nbsp;</p><p>社区并不认可这种方法。一个项目仅执行一次。虽然概率可以帮助我们做决策，但问题是它们并不会简化决策过程。评估经常作为决策的一个指标（我们要不要做这个项目？）。在这方面，概率预测会提供什么答案吗？还是说只会提出更多的问题？这些问题很重要，但使用估计的原因与概率预测并不相同。我见过许多基于错略评估、缺少历史信息的概率预测，最终还比较准确。如果你想了解更多这方面的内容，可以看下<a href=\"https://youtu.be/kicbluukPms\">我和Troy Magennis的有关对话</a>\"。</p><p>&nbsp;</p><p>接下来，我将更详细地介绍工作量评估和预测，希望可以帮助大家了解Scrum 语境下的小恶魔。</p><p></p><h2>工作量评估技术</h2><p></p><p>在使用Scrum时，Scrum团队是自管理的，开发人员负责评估工作量，因为他们最熟悉开发工作。</p><p>&nbsp;</p><p>最流行的工作量评估技术要么是基于数据，要么是有依据的猜测。要知道，在面对复杂情况时，这些技术一般都不准确。</p><p>&nbsp;</p><p>我发现，大部分人都不擅于估计。尽管如此，人们还是可以从对话中感知到价值，当我们就工作及其挑战达成共识时，就可以做出一些假设。“理解事项”和“评估事项”是两项单独的活动，不应该混为一谈。我认为，针对单个产品待办事项的评估并不能为预测完成工作需要多少时间提供一个坚实的基础。</p><p>&nbsp;</p><p>下面是使用估计进行预测时最流行的工作量评估技术：</p><p>相对估计时间参照——将当前事项与完成历史参考事项所用的时间进行比较。分配数字值——例如，使用基于斐波那契数列的故事点，并经常搭配扑克牌方法（计划扑克）使用。T恤尺码分类法——给待办事项列表上的事项分配尺码（s、s/m、m、m/l、xl、xxl、xxxl、xxxxl）而不是数值，有时候，为了简单起见，我们会去掉一些尺码，只保留S=1、M=3、L=8、XXL=20（四舍五入）、XXXXL=60、?=100（四舍五入）。墙壁估计（Wall estimation）——通过一起在墙上放置和移动卡片来分配数字值，也称为魔法估计或沉默估计。流量计（Flow metrics）或事项计数对于一个目标或时段—— （尽可能）识别/清点待办事项列表上需要完成的事项数量或范围。适型化（Right-sizing）—— 识别出足够小的事项以供团队纳入工作计划——通常使用一种基于流的方法—— 一个事项是小号还是中号并不是那么重要。这项实践是为了弄清楚，根据完工定义，团队能否在一次冲刺中舒畅地完成一个待办事项。#NoEstimates —— 一种解释是：争取让待办列表上的事项“大小合适”且均匀分布。数一下现有已测故事或特性，展示输出进展。以“为什么”为目标，致力于简化“是什么”，即聚焦预期成果。适型化 ——&nbsp;识别出足够小的事项以供团队纳入工作计划。将事项切分到24小时的时间框里，鼓励创建试验，验证为达成目标所做的假设和猜测，了解情况以便交付。使用滚动预测来沟通不确定性。</p><p>&nbsp;</p><p>有人会认为，只清点待办列表事项而没有吞吐量数据还是一种估计，我对此表示赞同。基于已完工事项的吞吐量计数是一种预测。</p><p>&nbsp;</p><p>在上面的工作量评估方法中，只有<a href=\"https://docs.microsoft.com/en-us/previous-versions/visualstudio/visual-studio-2013/hh765979(v=vs.120)?redirectedfrom=MSDN\">墙壁估计</a>\"直接考虑了相对潜在价值。它使用价值点来评估价值（而不是工作量）。价值不是绝对的，而是相对的。客户价值只有在发布给客户之后才能实现，而其价值可能高于预期，也可能低于预期。</p><p>&nbsp;</p><p>上述所有的评估方法都会因以下情况贬值：</p><p>没有与开始日期相关的说明，如从开始之日起9周。没有识别出在制品的数量及其进展（或者没有进展）。障碍的严重性。没有根据交付风险大小对产品待办列表的事项做降序排列。没有用最好的方法来处理依赖关系。将输出与成果混淆；客户/最终用户成果是他们的行为变化。当无法获取潜在价值的风险很高时未参加发现活动，而假定所有事项都从发现移到交付使情况进一步复杂化。妄想准确，还追求更准确。</p><p>&nbsp;</p><p>以下趋势并不是很理想：</p><p>按技能评估——通常是因为<a href=\"https://youtu.be/hGJpez7rvc0\">关注资源效率胜过流程效率</a>\"。大小通胀——通常由迫于压力“提速”所致。在非典型情况下，团队在评估工作量大小时会就高选还是就低选？不用猜，很可能是就高选。在极端情况下，我称之为（评估）Bingo。不重视质量，例如，完工定义缺乏一致性——通常由迫于压力“提速”所致。别搞错了，完工定义的质量承诺很重要。不重视客户，例如，交付输出却不衡量效果——通常是由“楼内思维”过盛或远离客户所致。团队之间大小标准化，通常是因为把人当成了可替换的机器零件。根据我的经验，在很多情况下，即使产品待办列表、比较参考项和范围都相同，团队也从来无法得出相同的大小评估。清点已完成的伪产品待办事项（不提供<a href=\"https://johncolemanirl.medium.com/so-what-is-value-really-4e6fc99b32a1\">价值</a>\"的事项）作为吞吐量——通常是由使用了忽视价值的工作分解结构所致。不专注，未完工。在Scrum中，专注很重要，这主要体现在产品待办列表中的产品目标、冲刺待办列表中的冲刺目标以及Scrum价值。专注于已经开始的工作，即使那意味着分割或取消工作，如何？妄想预测无法与以前比较的工作。未能通过发现找出我们可能不应该构建的事项，有人说是70%。我们可以通过低成本的试验获得更好的想法。例如，据我所知，当Bose 发现降噪耳机时，他们其实是在寻找提高声音保真度的方法。缺少发现通常是因为领导者致力于代表团队工作；他们的观点是，“寻找更好的方法没有意义，我们有最后期限。”</p><p>&nbsp;</p><p>这篇文章不是为了帮助人们保持这种趋势，而是要介绍更好的方法。需要注意的是，本文介绍的内容并不能帮助你更好地使用故事点进行评估。</p><p>&nbsp;</p><p>本文将重点介绍的三个工作量评估选项是估计、适型化和#NoEstimates。没有哪一种方法是完美的。我还考虑了其他一些选项，但无论采用哪种方法，准确度都很低。</p><p>关于估计：估计有不同的方式。如果进行估计，最好的结果就是估计对了。而事情要用多长时间和处理时间几乎是没有关系的（<a href=\"https://observablehq.com/@troymagennis/story-point-velocity-or-throughput-forecasting-does-it-mat?collection=@troymagennis/agile-software-development\">参见Troy Magennis探讨这一主题的文章</a>\"）。估计容易出现“平均值缺陷”（萨维奇）。采用五五开的方法设定期望值好吗？独立盲估的平均值可以足够接近真相（参见<a href=\"https://anchor.fm/xagility/episodes/Reviewing-Cynefin---weaving-sense-making-into-the-fabric-of-our-world-with-Dave-Snowden-e185r3c\">Dave Snowden的Xagility播客</a>\"）。但估计很少是盲目的。如果你根本不进行估计，就可以节省时间；希望你能更快地发现/交付成果。关于适型化：如果你能更多地关心团队能否在冲刺中完成一项工作，而不是想尽办法压缩这项工作，那能节省多少时间？要考虑到PBI数量少可以减轻产品所有者的认知负荷。清点一下每个冲刺要完工交付的PBI数量（有价值、大小合适），这对于冲刺规划和目标预测很有价值。如果吞吐量断断续续或者无规律，那么我们面临的问题就会比预测严重；我们会面临“管道问题”。使用平均吞吐量也会导致“平均值缺陷”。蒙特卡洛概率预测法更可取。关于 #NoEstimates，一种解释是：清点一下每个冲刺要完工交付的PBI数量（有价值、大小合适），这对于冲刺规划和目标预测很有价值。如果吞吐量断断续续或者无规律，那么我们面临的问题就会比预测严重；我们会面临“管道问题”。基于有变化限制的吞吐量进行”滚动预测（Rolling Wave Forecast）“更可取。</p><p>&nbsp;</p><p>不管是使用估计、适型化还是#NoEstimates，有时候产品待办事项（PBI）很难拆分，所以它们仍然有价值（而不仅仅是子任务）。<a href=\"https://www.agilealliance.org/glossary/split/\">介绍如何拆分产品待办事项的指南有很多</a>\"。<a href=\"https://cucumber.io/blog/bdd/example-mapping-introduction/\">实例映射</a>\"就是一种很强大的方法；Scrum团队可以仅为这个冲刺选择一个实例，并获取反馈。当我们可以收获价值的证据不足时，即使潜在价值很高，明智的做法也是借助试验通过推测（hypotheses）来验证假设（assumptions）；#NoEstimates和Scrum with UX支持这种方法。拆分可以引发发现或是发现-交付（discover-to-deliver）。例如，拆分可能引发客户访谈和UX研究。</p><p></p><h3>部分评估方法的潜在优点</h3><p></p><p></p><p></p><h3>部分评估方法的潜在缺点</h3><p></p><p></p><p></p><h3>评估方法的其他注意事项</h3><p></p><p></p><p></p><h2>预测</h2><p></p><p>在预测工作量时，最受欢迎的方法往往是基于：</p><p>产品待办事项（PBI）完工数量/范围的过往表现，基于平均值或范围——过往的表现不能预测未来，但短时间内（如一个冲刺）还可以。</p><p>&nbsp;</p><p><img src=\"https://static001.geekbang.org/infoq/3c/3c1b82454e28dbbb46af9677c3705fce.png\" /></p><p></p><p><a href=\"https://analytics.actionableagile.com/twig/index.html\">TWiG and ActionableAgile的截图</a>\"&nbsp;——&nbsp;团队在交付，但许多天没有交付完工内容。</p><p>&nbsp;</p><p>数字值或PBI完工数大小/范围的过往表现过往的表现不能预测未来，但短时间内（如一个冲刺）还可以。对数字值做算术运算要谨慎，因为复杂性会随着产品待办事项的大小呈指数级上升，把“大象”事项纳入冲刺是有问题的。注意正在进行中的PBI的数量。有时根据燃耗/燃尽图，使用剩余工作随时间推移的“精确”/相对大小。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/61/615124a031ce84dbc59797c9aa1446b1.png\" /></p><p>燃耗/燃尽图是基于平均数的，经常被误解</p><p>&nbsp;</p><p>概率预测（使用百分比概率）用于预测一定数量（或范围）的事项在不同日期完成的不同概率；可用于短期、中期和长期预测。考虑使用参数比例或随机抽样，根据以前的工作进行建模。例如，你可能会想：这项投资感觉和以前的两项投资类似，但我们需要增加15个事项。还要考虑将所有东西整合在一起的事项的数量或范围，因为工作最终整合时并不一定那么容易——但无论如何，风险不是通过迭代、增量和持续交付得到了很好的管理吗？</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/ed/ed49b24f76ebd6841f482d0266a75cdd.png\" /></p><p></p><p><a href=\"https://analytics.actionableagile.com/twig/index.html\">TWiG and ActionableAgile截图</a>\"</p><p>概率预测用于预测在特定的时间内可以完成多少PBI——包括一个百分比概率、一个日期以及截至该日期可以完成的事项数量（或范围）；可用于短期、中期和长期预测，但它更适用于输出导向而不是目标导向。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/6c/6c74c594ef7023d15f1bf4da59b56024.png\" /></p><p><a href=\"https://analytics.actionableagile.com/twig/index.html\">TWiG and ActionableAgile截图</a>\"</p><p>&nbsp;</p><p>滚动预测证明了同时预测可能性和不确定性是门艺术。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/55/554a9be5ffc766348b15bb4620a95a74.png\" /></p><p></p><p><img src=\"https://static001.geekbang.org/infoq/f2/f2b64754e394e22823f0589b1badf25a.png\" /></p><p></p><p>&nbsp;</p><p>可以这样说，“我们采用一种经验性的方法，一次处理一个冲刺；冲刺目标并没有什么保证；真正的答案是，我们不知道，但让我们开始并快速学习吧。“你可能都不会用到“现在？”、“下一步？？”、“其后？？？”这样的字眼。</p><p>&nbsp;</p><p>在预测过程中，最令人不快的部分是，它通常不考虑我们同时进行的PBI有多少个。唉，我也经常看到一些团队，承担了超出他们通常能力的事项。</p><p>&nbsp;</p><p>如前所述，团队可以使用不同的方法来评估工作量，实现冲刺/产品目标。几乎可以肯定，预测是错的，所以它们传达的是不确定性，这是为了提醒利益相关者，他们正在使用经验性的方法，一次一个冲刺的前进，而且要经常更新预测。（希望）产品待办事项成为一件有生命力的神器。</p><p>&nbsp;</p><p>可能有人会说，最好的做法是根本不预测。他们会说：“我们只需发现并交付功能——与客户和最终用户一起评审成果。能学什么学什么。根据我们的发现采取行动。不做什么预期管理。”</p><p></p><h2>结论</h2><p></p><p>避免使用故事点方法。如果必须要使用故事点，那也只能当做一种临时性的方法。流行的做法是，将故事点方法作为团队工作量评估技术的一种补充，但它不能作为Scrum的一部分。我不喜欢这种方法。据我观察，当人们使用故事点时，经常会有破坏性的行为。我看到，人们使用故事点通胀、故事点Bingo、故事点标准化和故事点速度作为衡量绩效的指标。举例来说，高层领导希望提升速度，所以他带领团队成员拆分未完成的事项，为的是达到某种故事点速度水平。团队无法完全控制他们可以交付多少工作。因此，如果一个团队面临着提升速度的压力，那么一个中等事项被定义为大型或超大型事项的几率就会增加。避免使用平均吞吐量方法。吞吐量方法比故事点方法好一点，虽然它也不完美，但在与概率预测和吞吐量有价值事项计数一起使用时，它是一个更准确的预测基础。不过，如果事项无价值或大小不合适，那么吞吐量的可信度就会降低。吞吐量方法不是Scrum的一部分，在<a href=\"https://kanbanguides.org/\">看板指南</a>\"中也是可有可无，对于非软件行业，应考虑为不同类型的产品待办事项单独计算吞吐量，如包装 vs. 运输。用平均值来预测时间/点数/吞吐量可不是什么干事业的好方法。“老板，我们准时交货的概率是50%；这样可以吗？”考虑使用历史参考项。历史参考项包括“等待时间”，使用该方法的前提是记住了它消耗的时间，不过<a href=\"https://youtu.be/WSes_PexXcA\">意外并发症</a>\"不在考虑之列。意外并发症是指我们的遗留工作比较杂乱，间接影响了估计质量；这也是参考项用于时间估计效果不是很好的原因。尝试将有价值事项吞吐量作为概率预测的基础。对于非软件行业，应考虑为不同类型的产品待办事项单独计算吞吐量，如包装 vs. 运输。对于复杂的工作，这仍然是“雾里看花”，所以你最好加一条声明：你将随着了解的深入，在下周和下下周提供更好的预测。在进行概率预测时要警惕虚假吞吐量（无价值事项吞吐量）和散发吞吐量，特别是当所选的大多数时间段吞吐量为零时——基于不稳定的吞吐量进行概率预测会大大降低预测的质量。尝试#NoEstimates——滚动预测很好地传达了不确定性。为了避免破坏Scrum或看板（如使用Scrum团队看板指南），务必要确保所有（产品待办）事项都有价值。当有人问你，团队何时能完成某件事时，试着回答说你不知道。但你得向他解释，你使用的是基于证据的经验主义方法，并且一次一个冲刺/周/月。许多事项需要发现/Spike（探针）；你不知道会得到什么反馈，你不知道会学到什么，你也不知道要如何回应。但请注意，在许多文化中，人们都习惯于把真空填满，如果没人提供预测，其他人就会急切地等待，而且可能会一直等下去。宜以敏捷为榜样。了解问题空间。发现并交付功能——与客户和最终用户一起评审成果。能学什么学什么。根据我们的发现采取行动——设定对不确定性的预期，而不是日期，让相关人员知道，这在某种程度上是在赌博。不要总想着了解我们不知道的东西。正如一位著名的敏捷专家对我说的那样，预测让我们觉得自己在做一些有用的事；这种感觉或未满足的需求都是我们要解决的。</p><p>&nbsp;</p><p>我们经常会在估计和预测时迷失方向，忽略了价值。我们要和受影响的人一起衡量工作是否发挥了作用并适时做出调整。</p><p></p><h2>附录</h2><p></p><p></p><h3>流量计</h3><p></p><p>流量计不只是与吞吐量有关。根据Scrum团队看板指南，你还可以关注在制品、周期时间和事项年龄；在这种背景下，只看吞吐量是短视的。即使在Scrum背景下，只关注吞吐量而忽略受阻或被遗忘的产品待办事项也是很愚蠢的。</p><p>&nbsp;</p><p>Scrum团队看板指南为Scrum引入了4个指标，包括：</p><p>在制品（WIP）：已经开始但尚未结束的工作事项。团队可以使用WIP指标来展示进展，减少在制品，改进工作流程。请注意区分WIP指标和Scrum团队用于限制WIP的策略。周期时间：根据Scrum团队看板指南，周期时间是一个事项从开始到结束所消耗的日历时间（四舍五入）。事项年龄：一个事项从开始到现在所消耗的日历时间；它只适用于正在进行中的事项。吞吐量：单位时间内完成的产品待办事项数量。</p><p>&nbsp;</p><p>参见：<a href=\"https://www.scrum.org/resources/blog/how-can-scrum-kanban-help-people-solve-complex-problems\">Scrum with Kanban如何帮助人们解决复杂问题？</a>\"</p><p></p><h3>一些影响/挑战预测的技术</h3><p></p><p><a href=\"https://en.wikipedia.org/wiki/Scenario_planning\">场景规划（Scenario planning）</a>\"<a href=\"https://en.wikipedia.org/wiki/Scenario_planning\">Threatcasting</a>\"&nbsp;<a href=\"https://cynefin.io/wiki/Future_backwards\">未来回望（Future Backwards）</a>\"&nbsp;<a href=\"https://cynefin.io/wiki/Ritual_dissent\">仪式性异议（Ritual Dissent）</a>\"&nbsp;<a href=\"https://thecynefin.co/cynefin-st-davids-day-2021-1-of-3/%C2%A0\">Cynefin</a>\"<a href=\"https://en.wikipedia.org/wiki/Current_reality_tree_(theory_of_constraint\">现实树（Reality Tree）</a>\"</p><p></p><h3>工作量评估指南——其他方法</h3><p></p><p></p><h4>其他评估方法的优点</h4><p></p><p></p><p></p><h4>其他评估方法的潜在缺点</h4><p></p><p></p><p></p><h4>其他评估方法的其他注意事项</h4><p></p><p></p><p></p><p>作者简介：</p><p>John Coleman是<a href=\"https://x-agility.com/\">X-agility</a>\"和<a href=\"https://orderlydisruption.com/\">Orderly Disruption</a>\"的敏捷大厨。同时，他还是一名<a href=\"https://medium.com/@johncolemanirl\">博文作者</a>\"和播客创作者（<a href=\"https://anchor.fm/xagility\">Xagility™</a>\"、<a href=\"https://anchor.fm/agilityisland\">Agility Island</a>\"）。John是<a href=\"https://www.thinkers360.com/top-50-global-thought-leaders-and-influencers-on-agile-2022/\">Thinkers360的十大敏捷思维领袖之一</a>\"。他最擅长管理层敏捷性、真正可持续的组织敏捷性、降规模（descaling）和度量。John经常使用Scrum、看板或精益UX。他曾设计方法，供那些需要保护措施或纯粹基于价值观或原则运作的团队使用。John是看板指南的合著者，同时也是Kanplexity™的作者。他是Scrum.org的专业Scrum培训师、Prokanban.org的专业看板培训师，同时也是一名LeSS友好的Scrum培训师。</p><p>&nbsp;</p><p>原文链接：</p><p><a href=\"https://www.infoq.com/articles/sizing-forecasting-scrum/\">https://www.infoq.com/articles/sizing-forecasting-scrum/</a>\"</p>",
    "publish_time": "2022-09-10 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "国内首部人工智能法规公布，11月起实施",
    "url": "https://www.infoq.cn/article/eSdtbI54ZHfeEBpNfXW4",
    "summary": "<p>据深圳特区报近日报道，<a href=\"http://www.sz.gov.cn/cn/xxgk/zfxxgj/zwdt/content/post_10085826.html\">《深圳经济特区人工智能产业促进条例》</a>\"(下称《条例》)正式公布并拟于2022年11月1日起实施。</p><p>&nbsp;</p><p>据悉，《条例》是深圳在新兴领域的重要立法，共设七章七十三条，旨在为促进深圳人工智能产业发展提供法治保障，也为国家层面相关立法先行探路。《条例》指出，<a href=\"https://www.infoq.cn/article/WwxQa0kOxY8B7Qwyztsj\">人工智能</a>\"产业发展应当纳入深圳市国民经济和社会发展规划，明确人工智能产业发展的总体思路、发展目标、主要任务和政策措施。</p><p>&nbsp;</p><p>此外，《条例》还首次从法律层面明确人工智能及人工智能产业的界定，表示该条例所称的人工智能，是指利用计算机或者其控制的设备，通过感知环境、获取知识、推导演绎等方法，对人类智能的模拟、延伸或者扩展。而人工智能产业，是指与人工智能相关的软硬件产品研究、开发和生产、系统应用、集成服务等核心产业，以及人工智能在民生服务、社会治理、经济发展等领域融合应用带动的相关产业。</p><p>&nbsp;</p><p>有专家解读称，目前，我国在法律层面对于人工智能及人工智能产业的概念尚未作出规定，学术界对于人工智能及人工智能产业的定义也还没有统一的认识。《条例》在借鉴国内外一系列相关研究成果的基础上，从技术角度对人工智能的概念作出了规定，明确人工智能是“利用计算机或者其控制的设备，通过感知环境、获取知识、推导演绎等方法，对人类智能的模拟、延伸或扩展”。</p><p>&nbsp;</p><p>同时，考虑到随着人工智能技术的不断发展，人工智能产业边界与范围也在逐步扩展，结合深圳市正在开展的人工智能产业统计工作，《条例》明确了人工智能产业的边界，将人工智能相关的软硬件产品研究、开发和生产、系统应用、集成服务等核心产业，以及人工智能技术在民生服务、社会治理、经济发展等各领域融合应用带动形成的相关产业都纳入人工智能产业范畴。</p><p>&nbsp;</p><p>此外，建立人工智能产业统计监测制度，是企业、行业组织普遍反映的产业亟需解决的问题之一。当前人工智能尚未被列入国民经济行业分类目录，国家层面缺乏统一的人工智能产业统计口径，各地对于人工智能企业的数量、产值乃至产业规模等数据的认定标准和统计口径也各不相同。深圳亦没有出台相应制度，相关部门在产业基本情况的认定上也缺乏统一的、权威性的标准，不利于准确了解和掌握深圳市人工智能产业的基本状况，也影响对人工智能产业的精准分析和研判。</p><p>&nbsp;</p><p>因此，《条例》指出，深圳市统计部门、市产业主管部门应当会同其他有关部门，建立健全人工智能产业统计分类标准，制定和完善人工智能产业统计分类目录，有序开展人工智能产业统计调查和监测分析工作。</p><p>&nbsp;</p><p>值得一提的是，《条例》还创新性地规定市政府应当设立人工智能伦理委员会，并明确指出从事人工智能研究和应用的组织或者个人，应当遵守人工智能伦理安全规范，不得从事危害国家安全和社会公共利益、侵犯个人隐私和个人信息权益、实施价格歧视或者消费欺诈等七类行为。</p>",
    "publish_time": "2022-09-10 09:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]