[
  {
    "title": "我们可以对数字化报以多大期望值？| 第三期完整版（下）",
    "url": "https://www.infoq.cn/article/ymjYEy8q6dF3egDpuqs4",
    "summary": "<p>《行知数字中国》第三期，InfoQ邀请到了过去30年亲历过中美高科技行业、零售业、金融业和制造业等不同行业的 IT 老兵向江旭。</p>\n<p>他曾在引领科技创新潮流的硅谷深耕技术研发，回国后赶上中国蓬勃发展的移动互联网时代，又以技术管理者的身份亲历了数家企业的数字化转型历程，在一次次跨越边界、不断探索的过程中，他对”数字化转型“的理解始终如一。在本期视频中，他将结合其亲身经历，分享数字化转型和创新的经验和教训。</p>\n<p>本视频为第三期完整版的（下）集。</p>",
    "publish_time": "2022-09-16 00:06:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "赛力斯黄剑龙：宏观环境下汽⻋⾏业的发展趋势带来的⼈才挑战",
    "url": "https://www.infoq.cn/article/q6NPizU8zyQH7lcOWAA6",
    "summary": "<p>各位伙伴大家好，今天我分享的话题是在当前的宏观形势下，汽车行业的发展趋势及其面对的人才挑战。</p><p></p><p>关于汽车行业的发展趋势，很多的文章都有讲解，我今天更多的是分享在此背景下的人才发展有哪些挑战，以及我们的一些实践。</p><p></p><h1>行业变化与趋势</h1><p></p><p></p><p>首先，我认为汽车行业的变化趋势是“一半是海水，一半是火焰”。这么说是因为现在面对外部的环境变化，无论是传统汽车还是新能源汽车，又或者是汽车行业的供应商、合作方，只要身处行业之中，都会有这样的感觉，看上去充满了挑战和机会，但同时又都充满了矛盾和挣扎。</p><p></p><p>从外部环境来看，有三个要素始终是推动着整个行业发展和变化的关键力量——政策趋势、技术发展、客户需求。</p><p></p><p>政策方面，我国 2030 年要实现“碳达峰”，2060 年实现“碳中和”。无论是主观还是客观方面，减排和绿色都成为汽车企业非常重要的目标，政府在推动新能源汽车发展的过程中，也陆续地出台了很多政策成为指挥棒。</p><p></p><p>技术方面，现在的智能化、电动化趋势非常明显，科学技术的发展、人工智能的运用，汽车早已经不再是从前所说的“四个轮子加一个沙发”的物品，它已经变成了一个智能移动空间。</p><p>数字化也给所有寻求转型的车企带来了很好的方式，这也是车企转型的必经之路。</p><p></p><p>客户方面，无论是因为油价上涨还是现在信息化时代，为了方便操作以及智能化需求，越来越多的客户都选择新能源汽车，这也是外部的一个因素。</p><p></p><p>在各个车展上，如果车企不展示新技术，不展示新能源，人机交互、车载互联等，都没有办法吸引到更多的客户，虽然某些品牌的燃油车还是很多客户的选择，但是新能源汽车本身就是未来的趋势。而且现在的渗透率非常低，未来可期。</p><p></p><p>从政策到技术，到客户需求的变化，为车企带来了机会同时也带来了挑战。政策方面可以看到，我国在汽车行业发展会持续给予更多关注，投入更多资源，无论从行业本身还是人才都会有很多的支持。</p><p></p><p>因此无论是传统车企、新能源车企，还是供应商、合作方，都需要思考在这样一个必须要面对变革，进行转型的时代，所有的企业都需要回答这三个本质的问题：</p><p>●&nbsp;我们的事业是什么？</p><p>●&nbsp;我们的事业将是什么？</p><p>●&nbsp;我们的事业应该是什么？</p><p></p><p>转型和变革只是方式，不是目的，因此我们更需要思考的是到底要做什么，将做什么，应该做什么，这些问题的答案将会直接指向前进的方向，同时也会告诉我们资源配置的依据是什么。</p><p></p><p>这三个问题特别重要，很多时候大家都在说要做数字化转型，但是真的要想清楚到底应该做什么。下图是新能源车和传统车的差别，这是我的一个业内朋友总结的，这是个草稿，在这里仅仅做一个对比，目的是希望大家可以看到新能源车和传统车本质上的巨大区别。这是这种巨大区别，带来了转型的巨大挑战。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/dd/dd0b8653b635ea67d9d10bb799d9c320.png\" /></p><p></p><p>当谈到转型时，首先转的是方向，是对未来趋势的把握，同时转的也是组织打造方式，以及获取人才培养方式。转型对于企业人才结构、人才需求、人才培养方式都有非常大的影响。</p><p></p><p>人才是汽车行业转型中永远不变的话题，以新能源汽车行业的人才情况为例。</p><p></p><p>第一，政策上国策加持，新能源造成风口正盛，对人才需求量增大；</p><p>第二，“新四化”加剧人才结构性短缺；</p><p>第三，人才供应不足，缺口巨大；</p><p>第四，跨界巨头入局，人才争夺战升级。</p><p></p><p>在风口之上，所有的企业都需要人才，而人才缺口巨大，2025年净缺口为3.7万人，现在有很多的力量、注意力都进入到新能源汽车行业，未来缺口还会更大。</p><p>&nbsp;</p><p><img src=\"https://static001.geekbang.org/infoq/a4/a4c234c40035d65bc95baf6e2222c97a.png\" /></p><p></p><p>同时我们也可以看到，新能源行业的企业中，有一部分来自于传统车企转型，有一部分来自于新势力，还有一部分是合资或“跨界”加入到这个领域中。</p><p></p><p>因此在说新能源汽车的时候，已经远远超出了车本身的概念。有很多其它的势力，比如说 ICT 企业加入这个领域，这都说明了新能源汽车行业竞争非常激烈。</p><p></p><p>人才争夺方面，还是以新能源产业为例，一方面是企业用薪酬待遇、股权等吸引人才，另一方面，政府出台人才政策助力人才引进，包括大力推进的产教融合，都是在联合企业、学校一起让行业发展起来，在政府的推动下，将会有更多资源投入到制造、实体企业中。</p><p></p><p>此外，企业已经越来越注意“人才不一定为我所有，但是要为我所用”，“不一定我们在哪人才就要在哪，而是人才在哪我们就要在哪”，这就是“筑巢引凤”。</p><p></p><p>以上可以看到外部趋势和各个企业、政府对于人才的态度与政策，行业竞争激烈，无论是业务本身的竞争、客户的竞争，还是人才的竞争。</p><p></p><h1>组织与人才挑战</h1><p></p><p></p><p>接下来说一说车企面临的组织挑战与人才挑战。特别说明一下，在新能源汽车领域中有非常多的企业，我更多的是分享我亲身经历的、看到的传统车企进军新能源、转型新能源，遇到的挑战。</p><p></p><p>首先，组织方面的挑战，借用德鲁克的话，我总结为“摆脱昨天”、“推陈出新”。传统汽车行业已经经历了十几年、二十几年的发展，到今天取得了很多成果，但是要注意这些成果都是过去，尤其是面对未来的时候，一定要摆脱昨天，因为昨天的资产可能都会变成负债。</p><p></p><p>在这里也简单地给大家分享一下，公司转型的不同阶段，组织面临的挑战：</p><p></p><p>第一，组织匹配度，包括组织设计的敏捷性，组织中领导者他们面对变革时的领导力，以及管理模式、组织文化的创新等，这些都需要进行审视，甚至是优化、转化。</p><p></p><p>第二，人才结构性，行业变革对人才结构提出新要求，新技术人才的供给，人才地图越来越难画；产业工人净流出，高技能人才和新技术人才，包括校招生招引难。</p><p></p><p>第三，人才激发效果，包括干部团队的开发和管理，专家团队的引进和融合。企业会大量地引入人才，尤其是专家，这些专家往往是高精尖人才，他们的激活、融合，也是特别有挑战的；企业高级的人才越来越多，对于这些人的激励保留措施的多样性、多元化提上议程。</p><p></p><p>在这里有几个需要回答的代表性的话题：</p><p></p><h2>送外卖 VS 进工厂</h2><p></p><p></p><p>比如说前段时间非常火热的一个话题——进工厂不如送外卖，很多年轻人更愿意追求自由度高的职业，宁愿去送外卖，也不愿意进工厂，这里并不是在说谁高谁低，360行每一行都有它的重要性，每一个人都是平等的，但这其实也给我们带来一些思考，就是汽车制造业要如何吸引到更多的年轻人加入到这个新兴的充满机会的行业。</p><p></p><h2>关键岗位和关键人才是什么？</h2><p></p><p></p><p>在新行业、新领域、新赛道中，关键岗位和关键人才都发生根本性的变化，我们不能再用过去的眼光来看哪些是关键岗位，哪些是关键人才。比如，干部群体、专家群体，还有某些领域的研发群体，他们都是车企未来的关键岗位、关键人才。</p><p></p><h2>导致现在人才现状的原因是什么？</h2><p></p><p></p><p>当下我们经常会遇到这样的人才挑战：新人多，他们来自于不同的主机厂，存在融入和融合的问题；腰部力量不足，能独挡一面的骨干短缺，基础干部缺失较多，后备短缺，调查发现大概有50%后备是缺失，这特别需要关注。</p><p></p><p>人才的结构性和周期性的短缺，也为企业带来了特别大的挑战。综上所述，企业如何找到人才，如何培养他们成为真正能够敢打敢拼、创新突破，能够打下山头、开放学习、持续成长的人，是未来组织竞争的核心要素。</p><p></p><p>关于未来人才的挑战，需要从原来的“选、用、育、留”，发展到现在的“抢、融、训、稳、传”。</p><p></p><p>“抢”就是要找到关键岗位的人才和创新未来的领军人物。</p><p></p><p>“融”指的是如何让吸引到的人才融合进来，如何让企业文化更加具有包容性，能够去激励人才，就是“愿景纳人”，用愿景吸引和融合人才。</p><p></p><p>“训”指“训战”，仗怎么打，兵怎么练，要分成分级明确训练对象。不能大锅饭一锅端。</p><p></p><p>“稳”指关键人才的留存、关键梯队的建设以及稳固。</p><p></p><p>“传”指组织经验的传承，瀑布式梯队队伍的声生不息。很多企业在转型，需要大量的人才，但是不可能一直靠挖外面的人才做事情，还是需要持续地将组织经验、人才传承来实现。</p><p></p><h1>人才发展实践</h1><p></p><p></p><p>接下来为大家分享一下我经历的人才发展实践。这些实践有一些已经完成了，有一些正在做，有些还在策划中，因此仅供大家参考。相信各位伙伴有更好的方法，也欢迎大家综合起来，根据你们企业实际情况运用。</p><p></p><p>我们的企业发展经历了三个阶段。1.0时代是自主创业，主要生产汽车零件。2.0时代是开放合作，主要是跟东风集团合作，生产东风小康；3.0时代是跨界融合，联合ICT的龙头企业，生产新能源汽车，立志打造世界级精品，成为全球智能汽车品牌企业。</p><p></p><p>组织的发展历程给我们带来的思考是，企业每个阶段的跨越，不仅仅是业务产品本身的跨越，不仅仅是与谁合作的跨越，它更考验组织能力，甚至意味着组织能力的重构，尤其是从2.0时代跨越到到3.0时代，意味着组织能力、人才发展能力、梯队建设能力的跨越，包括高层领导力的变革等都特别重要。</p><p></p><p>这里我用了组织发展中经常会用的BL模型，BL模型上面就是外部环境，外部环境推动组织发生变革。使命和战略、领导力、组织文化，是真正地推动组织变革落地的关键因素。</p><p></p><p>很多时候组织做变革，一上来就做底下的层次，比如提高敬业度，或者提高员工体验，这些当然非常重要，但是首先要从变革性的因素开始做。</p><p></p><p>模型中间有一个特别重要部分，叫做“管理实践”，也就是说无论怎样推动变革，在过程中一定要形成管理实践，然后形成良性循环。</p><p></p><p>比如做流程再造就要有流程再造的管理实践；文化重新定位，就要有相应的管理实践。在这里讲的是人才发展，所以一定要在组织中形成关于人才发展在新环境之下转型性过程中所需要的人才发展管理实践。这就是在思考组织变化过程中，人才发展该如何开展的非常基础的底层逻辑。</p><p></p><p></p><p><img src=\"https://static001.geekbang.org/infoq/a0/a01a86621cac204a8412c97884b12c84.png\" /></p><p></p><p></p><p>我们的人才发展实践有四个维度：分别是愿景纳人、打造能人、后继有人、顺势培人。先简单概述一下。</p><p></p><h2>愿景纳人</h2><p></p><p></p><p>第一，企业在转型时期的使命、愿景、价值观需要强化。首先，使命、愿景、价值观在企业成立之初就已经确立下来，但是随着组织的发展、业务的发展、行业的发展，它需要进一步强化，不断地传承，这时候一定要看到组织文化的重要性，它不只是告诉大家企业要做的事，还要告诉大家应该怎么做这些事，做这些事的目的和意义是什么，企业未来将去向哪里，应该秉承什么样的价值观进行选择。</p><p></p><p>这就是赛力斯从1.0时代到2.0、3.0时代，甚至到未来4.0、5.0 时代的发展过程中非常核心的东西，它就像每个人的发展一样，无论你学习什么、怎么发展，最后都要回到你希望成为什么样的人，希望用什么样的价值观做出职业选择，做出你工作中的各种选择。我们也已经明确了未来要成为怎样的企业，秉持怎样的价值观。</p><p></p><p>第二，事业目标明确，就是刚才前面讲到的战略，方向一定要清楚。</p><p></p><p>第三，愿景驱动+能力驱动人才队伍，我们需要从上到下、从高管到基层，都能够通过能力驱动人才队伍。</p><p></p><h2>打造能人</h2><p></p><p></p><p>打造能人需要识别关键人物，我们不可能把所有人都打造出来，必须先抓住关键人员，首先要强化干部队伍，第二要发挥专家作用，第三要有效地激励“大咖”和“大神”，其中包括KOL，如何发挥他们的作用？比如很多专家级人物，或者专业高手进入企业，我们首先要解决的就是融入和价值发挥的问题。</p><p></p><p>一般有几个动作可以做：第一是建立专业的标准体系，专家们推动专业通道的建设和发展；第二是师带徒，培养后备专家；第三是专业体系建设和专业知识沉淀；第四是专业难题攻关。当企业充分地发挥专家的能力和价值时，其实也是在培养着后备的同时激励着专家本人。</p><p></p><h2>后继有人</h2><p></p><p></p><p>后继有人就是聚焦人群，确立梯队策略。我们经常讲仗怎么打、兵怎么练，组织要有自己的人才梯队，保证人才供给，要有造血功能，对于同样的梯队全景图，一定要确定重点在什么地方，不能所有的梯队都打造，所有的训练营都开展，一定要聚焦关键人群。</p><p></p><h2>顺势培人</h2><p></p><p></p><p>“势”既是前面讲到的外部环境的大势，又是每一个人的优势，也是数字化的趋势。</p><p></p><p>组织在未来人才发展过程中不能生拉硬扯，不能强行灌输，一定要顺势而为，我们开展了优势的探寻和运用，这是很好的组织效率提升的方式，也是很好的激励员工发挥潜能的重要动作。</p><p></p><p>赛力斯也在打造自己的HR教练团，培养内部教练；并通过社群式的学习，建立所有人向所有人学习的文化，所谓的学习型组织不在于课程有多少，而在于真的能够打造出互相学习、互相影响的文化。</p><p></p><p></p><p><img src=\"https://static001.geekbang.org/infoq/b4/b4fce796d0a73a5e0d6296c9c5944419.png\" /></p><p></p><p>接下来给大家分享几个具体的动作。</p><p></p><h4>后继有人——这是我刚才提到的聚焦人群，确定梯队策略</h4><p></p><p></p><p>下图是人才梯队的逻辑图（示例），在这里组织需要根据当前业务需求，组织者现状能力的诊断，确定出梯队发展的重点，不能眉毛胡子一把抓。</p><p></p><p>当下梯队发展重点在高层领导力、新任、后备还有大学生。高层主要针对的是意识变革的能力；新任就是腰部力量的融入和转身，包括内部提拔整改，以及外部引入；腿部的后备人员非常重要；企业不可能总在社会上抢人，需要自己培养人才，大学生对于企业来说是造血，要帮助他们完成从学校到职场的跨越，融入公司的文化与工作当中。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/95/95ea2ab2cc3e8f61fbeea1285b37461f.png\" /></p><p></p><h4>后继有人——高层领导力发展设计</h4><p></p><p></p><p>高层领导力训练框架（示例），也是每个企业都会做的，实际上在现代环境中，很难简单地梳理出高层领导力的维度，再围绕它开展培训，而是需要知、思、行的过程，这里结合了领导力五个层次理论，把“知、思、行”结合在一起，同时首先要诊断企业领导力来源在什么地方，然后每个管理者基于他的角色、使命、所分管的内容，有针对性地提升领导力，不要千篇一律地提高领导力，尤其是高层领导力。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/fc/fcbf979593a8fd45ddc2ec6806e3687e.png\" /></p><p></p><h4>后继有人——中层后备</h4><p></p><p></p><p>中层后备的培养有以下特点：</p><p>一、搭建舞台，针对后备不一定要给他们灌输很多的东西，不需要给他们大量的课程体系，更重要的是给他们搭建舞台。</p><p></p><p>比如针对后备有专门的微信群，公司的高管都在里面，我们会定期设计一些任务，让大家在微信群里面展示出来，而且是真刀真枪的，不是喊口号的，这个就是给大家搭建舞台。大家可以将自己的工作、提案都发布在这里面，互相激励、互相学习。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/8d/8d5e6287ba4a16bd696a76eb48cc2311.png\" /></p><p>&nbsp;</p><p>二、战训结合。原来都说训战结合，我们是战训结合，一定要以战为主线，训是在过程中给大家赋能。</p><p></p><p>三、长和统。“长”就是通过 IDP，把个人和组织目标结合在一起；“统”是统一所有资源，人的成长不是靠简单几门课或者在工作中做任务就可以完成的，它需要多方统一支持，如业务负责人、HR、教练等等的共同支持。</p><p></p><h4>顺势培人——优势探询、社群学习、“乐”在其中</h4><p></p><p></p><p>下图左半部分是某一期高潜人员班所做的优势探询，从中可以看到他们优势的分布，我们也进行了优势的应用。</p><p></p><p>同时我们也开展了社区学习，举办了多期卓有成效的管理者读书会，每一次读书会都是团队教练的过程，到目前已经做了很多期，很多同学都自愿参与其中，而且反馈效果也非常好。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/5a/5acfe56ece3010bccf78ffc750dd52de.png\" /></p><p></p><p>另外，在培训学习过程中，也用了很多其他方式，比如我是乐高认真玩的教练，所以我也会用乐高的方式带领大家探索，在玩的过程中反思、学习，这就是我们会用的很多方式，它不仅是翻转课堂、行动学习，而是多方面整合在一起。</p><p></p><h4>顺势培人——HR教练团队</h4><p></p><p></p><p>HR的教练团队是要顺应每一个干部、每一个学员成长所需要的支持，比如，上级做的就是给员工工作安排、指导，导师为其传授经验，HR教练给予一些反馈，其实这就是721，721就是既有工作的挑战，又有知识的输入，同时还能得到反馈。</p><p></p><p>HR教练团队还在打造过程中，是我们面对未来，打造未来学习氛围非常重要的部分。&nbsp;同时也是在训练HR团队，让他们真的具备教练的能力、教练的视野，能够有更好的方式辅导所有的业务部门的负责人。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/55/55c4f99b8617e5d21363b07aa01b8528.png\" /></p><p></p><h4>顺势培人——数字化学习</h4><p></p><p></p><p>数字化学习每个公司都在用，这张示意图，就是对应前面的721，也对应前面关于HR教练的部分。“挑战”就是来源于上级布置的任务，“课程”来源于导师或者外部、内部课程，“反馈”来源于内部教练。</p><p></p><p>这三个要素组成了所有人学习、成长必备的要素。同时也可以看到数字化就像外面那个圈，它不仅仅是技术，更是思维方式、文化氛围。</p><p></p><p>未来的组织应该叫数字化学习型组织，这里面要理解了什么叫学习型组织，怎么样达到学习型组织，还有什么叫数字化，什么叫数字化学习？这些都是需要去思考的话题。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/19/19e0f91c2cc7e23743e225c0c8f08618.png\" /></p><p></p><p>我对外部趋势的理解、我们面临的挑战、实践经验就分享到这里，最后我想引用一句话——让平凡人做出不平凡的事，无论在什么行业，什么企业，要做的都是把所有人打造成不平凡的人，让他们共同协作，为组织做出不平凡的事。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/9e/9e7926882dc833bdaf80644024cb033c.jpeg\" /></p><p></p><h3>关于极客时间企业版</h3><p></p><p></p><p>极客时间企业版由极客邦科技倾力打造，是企业级一站式数字技能学习平台，是具备好内容、好产品、好服务的“三好平台”，助力企业打造行业领先的数字人才团队，驱动企业的数字化转型与高质量发展。</p><p></p><p>自 2019 年以来，极客时间企业版已服务近 3000&nbsp;家技术驱动型企业，覆盖银行、金融科技、保险、互联网、移动通信、软件、工业制造、教育等行业客户。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/e3/e3c148931b18c1c7305e2fa67698f7ba.jpeg\" /></p><p></p>",
    "publish_time": "2022-09-16 09:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "BSN面向海外正式发布Spartan网络：支持用户获得链上所有数据",
    "url": "https://www.infoq.cn/article/ZmCKKVkbJqIcAhR6Eb89",
    "summary": "<p>&nbsp;</p><p>2022年9月6日，BSN（区块链服务网络）国际宣布BSN Spartan网络正式上线。Spartan网络是一个由“无币公链”组成的公共基础设施网络，面向海外推出，旨在为全球企业，特别是传统领域企业提供无币化的区块链服务。</p><p>&nbsp;</p><p>“世界上几乎99%的IT系统不会使用基于虚拟货币的公有链，因为他们不想使用不受监管和不稳定的虚拟货币，而Spartan网络提供了一个集成了无币公链的基础设施，任何传统IT系统都可以通过Spartan网络以更加便捷、更具成本效益的方式使用区块链技术。”&nbsp;红枣科技CEO何亦凡表示。</p><p>&nbsp;</p><p>据悉，本次上线的测试版集成了三条无币公链，包括无币以太坊、无币Cosmos和无币Polygon EDGE，未来还将陆续有更多的无币公链加入进来。用户在GitHub免费下载安装后，即可匿名在Spartan网络上建立虚拟数据中心，并使用法定货币或稳定币在无币公链上支付GAS费用。需要注意的是，Spartan网络仅面向海外用户，国内用户无法建立数据中心。</p><p>&nbsp;</p><p>根据介绍，在Spartan的任何完整节点上，用户可以获得由不同终端用户生成的所有公共数据。</p><p>&nbsp;</p><p>传统的IT系统是建立在独立的非公共数据库上的，每个公司都有自己独特的数据存储机制和结构，系统之间数据交换的成本非常高。即使是公共数据，用户也必须到各种网站下载和收集数据。随着数字化需求的不断增加，这一过程正变得不可接受。</p><p>&nbsp;</p><p>Spartan 试图利用区块链来改变这一问题。数据只是逻辑上隔离的，只要相互提供许可就可以进行交换。Spartan 网络上的所有数据中心将能够轻松地共享数据，用户只需连接到Spartan网络，数据将通过任何设备从任何地方同步和访问。</p><p>&nbsp;</p><p>那么，Spartan 与传统公链有什么区别呢？根据介绍，这主要体现在以下三方面：</p><p>&nbsp;</p><p>成本控制。成本控制是传统产业的关键任务，因此成本必须是可预测的。然而，传统公共链为正常交易而需要消耗的加密货币是有价值波动的，并且这种波动是不可预测的（虚拟货币的价值浮动）。由于这种波动性，几乎没有传统产业使用区块链技术建立业务（成本不可控）。Spartan网络推出的非加密货币公共链，用户通过法定货币/稳定币购买NTT，NTT不能在账户钱包间互相转移，接下来使用NTT在Spartan链上购买各链的gas，如此打掉价值炒作的可能，使得成本可控。（注：NTT，不可交易代币，是在 BSN Spartan 网络默认链上发行的网络不可转让实用代币。）</p><p>&nbsp;</p><p>安全性。当用户与集中式系统交互时，向系统发起的所有请求和输入的所有信息都由系统的后端拥有和控制。这种集中式架构允许操作员轻松地修改任何数据，并且用户难以验证数据的真实性和准确性。Spartan 网络利用区块链共识机制，防止数据在上传到链后被秘密篡改，并允许用户轻松验证任何数据。Spartan 还严格实施分权治理，所有新的或变更的治理规则都由各方协商一致表决。</p><p>&nbsp;</p><p>多样性。单个公链通常会遇到各种性能瓶颈，从而导致链上事务的处理周期较长。Spartan 网络则是一个多链生态系统，每个链之间的数据交换是通过链间服务实现的。同时，不同的链框架各有特点，往往各有所长。根据BSN的规划，未来不同的行业领域可能会适用不同产业链，用户可以根据需要选择。</p><p></p><p>&nbsp;</p><p>目前，汇丰银行、英皇集团、美心集团和兰桂坊集团等传统企业已经开始在业务中使用Spartan网络。</p><p>&nbsp;</p><p>富士旗下咨询公司FUJIFILM Business Innovation Hong Kong&nbsp;通过Spartan网络把电子文档通证化，帮助客户实现数字化转型，而传统公链会存在数据环境的高风险和Gas fee过高的问题。兰桂坊集团则将餐厅的POS交易系统与兰桂坊会员系统进行了连接，以此实现数据交互的自动化。</p><p>&nbsp;</p><p>BSN 认为，无论从业务需求、应用场景还是商业模式等角度，未来都会有大量企业使用公共信息化系统，最终会形成互联网的公共层。但实现该阶段还有不小的挑战。</p><p>&nbsp;</p><p>首先，公共的基础设施要极其便宜，也需要不断降低应用门槛，无论是经济门槛还是开发门槛。其次，开发者需要通过大规模高并发来优化产品，但大部分的链没有经历大规模并发的考验。再者，大家需要建立链的真正的分布式治理，但目前大部分联盟链都是私链。最后，企业已经习惯互联网的中心化网络环境，对公共IT系统可信、公开透明、不可篡改等特征会给业务逻辑、商业模式、经济模型等带来的革命性影响缺乏认识。</p><p>&nbsp;</p>",
    "publish_time": "2022-09-16 09:31:28",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "POC、Scrum和低质量软件的解决方案",
    "url": "https://www.infoq.cn/article/yJYF6ZQI9RB4zkGqE65O",
    "summary": "<p></p><p></p><blockquote>注：本文纯属个人观点，不代表我的公司。谨将本文献给我的导师Marcel May。</blockquote><p></p><p>&nbsp;</p><p>我并不是故意要把POC和<a href=\"https://www.infoq.cn/topic/scrum\">Scrum</a>\"与低质量的软件联系在一起，它们的流行确实令人生畏，但我们应该客观地考虑构建高质量软件涉及的所有因素。准确地说，POC和Scrum并没有本质上的缺陷会导致它们成为低质量软件的促成因素，但经常会产生导致低质量软件的副作用。</p><p>&nbsp;</p><p>虽然它们不是唯一的因素，但正是因为它们本身并没有缺陷，当我们意识到它们的副作用时，发现它们是最容易和最值得解决的因素之一，所以我们现在关注它们是有意义的。我们将在以后的文章中讨论其他因素。</p><p>&nbsp;</p><p>本文分为两个主要部分：在第一部分中，我们将仔细研究什么是质量以及如何量化它。如果你对定义不感兴趣，可以直接跳到第二部分。在第二部分中，我们将讨论POC和Scrum如何影响质量以及如何解决这些问题。</p><p>&nbsp;</p><p>在本文的其余部分，为了简洁起见，我将把“高质量”称为“质量（Quality）”，用了大写的Q。</p><p></p><h2>第一部分：量化质量</h2><p></p><p>&nbsp;</p><p>质量不是对完美的无止尽追求。如果我们有量化质量的方法，就有可能实现我们的质量目标。在我看来，质量包含了三个层次，我们需要分别量化每一层。</p><p></p><h4>质量是可靠性的度量</h4><p></p><p>&nbsp;</p><p>人们普遍认为质量是“产品的可靠性”。正如古典科学所认为的，\"可靠性\"是指在相同的条件下持续得到相同结果的属性。在这个经典的观点中，构建质量解决方案意味着我们需要构建出永不失败的产品。具有讽刺意味的是，以这种方式理解可靠性会损害质量，而不是提升质量。以构建永不失败的产品为目标只会导致极其难以维护的复杂系统，导致质量随着时间的推移而下降。经典的可靠性的问题在于错误地假设了我们可以控制所有的条件，而实际上我们并没有（硬件故障、网络延迟、外部服务节流，等等）。我们需要对可靠性的含义进行扩展，以适应条件不一致的情况：质量不仅是软件产品启动和运行时的可靠性度量，也是软件产品发生故障时的可靠性度量。</p><p>&nbsp;</p><p>要实现这一层次的质量，我们需要考虑两种情况：对于解决方案的每个组件/服务，它们好的场景和最坏的场景是什么。</p><p>&nbsp;</p><p>要量化这一层次的质量，我们需要确定我们想要的可用性、恢复时间目标（Recovery Time Objective，RTO）和恢复点目标（Recovery Point Objective，RPO），这样我们就能清楚地知道我们的系统能够满足的可接受范围。</p><p>&nbsp;</p><p>简而言之：高可用性设计、优雅地失败以及在可接受的范围内实现第一层次的质量。</p><p></p><h4>质量是简单性（优雅）的度量</h4><p></p><p>&nbsp;</p><p>可靠性是质量的核心，但靠可靠性还不足以体现整个质量的概念。试想一下：如果你有两台机器，它们具有完全相同的功能和可靠性指标，那么机器越简单质量就越好。</p><p>&nbsp;</p><p>质量和性能指标可以一致，但它们不是同一个东西。随着时间的推移，更简单的产品更容易开发、操作和维护。</p><p></p><p><img src=\"https://imgopt.infoq.com/fit-in/1200x2400/filters:quality(80)/filters:no_upscale()/articles/poc-scrum-quality/en/resources/3image1-1661177949658.jpg\" /></p><p>&nbsp;</p><p>第二个层次的质量可以通过解决方案组件是否有可以由需求直观解释的目标来量化。在本文的第二部分中，我们将讨论复杂性，并将为你提供如何让你的项目变得更简单的实用建议。我们先来完成质量的量化定义，我们还剩下一个层次要讨论。</p><p></p><h4>质量是UI如何表现产品功能的度量</h4><p></p><p>&nbsp;</p><p>UI可能会有一个装饰层（颜色、字体等），视觉上的吸引力是很重要的，但我在这里从一个更全面的角度来谈论UI——把UI看作是向用户呈现产品功能的良好程度。你的产品可能是一组API，那么UI可能就是一个门户，用户可以在其中获得示例请求/响应并测试端点。UI也可以是一个命令行界面，或者被嵌入到用户的系统中（如Teams/Slack等等），或者所有这些方法的组合。创建一个高质量的后端是一回事，以一种让用户能够简单有效使用功能的方式来表示后端功能是另一回事。优质的产品以用户体验为中心。</p><p>&nbsp;</p><p>要在这一层构建高质量的产品，你要不断训练你的思维，从用户的角度思考解决方案。记住，技术最终是为人类服务的。</p><p>&nbsp;</p><p>你可以通过执行用户测试来量化这一层，聚合并分析客户满意度驱动因素，并根据这些有形的结果衡量你的解决方案。</p><p></p><h2>第二部分：POC和Scrum——复杂性的出现和加剧</h2><p></p><p>&nbsp;</p><p>随着时间的推移，复杂性会呈指数级增长，所以越早缓解它越好。如果仔细观察一下，你会发现复杂性始于过早地将POC转为开发管道。Scrum的短Sprint通常会创造一种环境，有助于对不断变化的需求（这些需求让开发人员很难在项目过程中确定优先级并实现质量目标）做出反应。正如我在这篇文章的引言中提到的，这并不是POC和Scrum固有的，一旦意识到了，我们就可以解决这些问题。</p><p></p><h4>POC——允许混乱</h4><p></p><p>&nbsp;</p><p>POC（概念验证）的主要目的是证明一个新想法在概念上是可能的。POC与实现细节无关。一个人可以骑马去办公室，以此来证明它比开车节省时间，但即使这种POC是成功的，也并不意味着骑马去办公室是最好的方式或唯一的方式（更不用说验证简单性、用户体验或边缘情况）。不过，这种POC的价值在于“提供了一种比开车更快到达办公室的方法”，所以我们可以把这个概念提升到一个新的层次，寻找替代方案，并比较结果。</p><p>&nbsp;</p><p>需要注意的是，将“寻找解决方案”的过程与“寻找最简单的解决方案”的过程结合起来是违反直觉的。通常情况下，我们解决问题的第一次尝试并不是解决问题的最简单方法。看看你以前的POC，你很可能会发现有“额外的连接”可以被移除。一个成功的POC并不意味着可以马上开始开发，我们需要尝试替代方案，在交付其中一个POC并进入下一阶段之前尝试多个POC。</p><p>&nbsp;</p><p>不过，证明“新颖的想法是可行的”并不是我们进行POC的唯一方法。POC是学习/感受新技术的一种方法，其中的风险是我们可能在新技术上浪费了时间，然后在清理这些混乱之前进入开发阶段。这就是经常出现“技术债务”的地方。</p><p>&nbsp;</p><p>解决这个问题的办法不是少一些混乱，实际上恰恰相反，我们需要更多混乱！很多时候，我们无法清理这些混乱，因为我们通常没有足够的时间去完全掌握新技术。基于开源代码库部署现有的解决方案，创建一个沙盒，这是一种很好的方式，但你应该继续在沙盒中，直到能够映射所有的结果和它们的原因，当你离开沙盒环境时，就可以移除任何不需要的部分。</p><p>&nbsp;</p><p>“考虑替代方案和清理/简化”阶段有时是由开发人员（作为POC工作的一部分）完成的，但在快速交付的压力下，这一阶段往往被压缩或跳过。考虑到当今大多数解决方案的复杂性，这个重要的阶段变得势在必行，因此是时候给它专门的时间，并将其作为项目生命周期的一部分。POC必须经历一个PONC阶段，然后才能变成开发管道。</p><p></p><h4>PONC——保证收拾残局</h4><p></p><p>&nbsp;</p><p>PONC（无复杂性验证）是让简单性/质量走上正轨的护栏。在这个阶段，你希望从POC转向开发管道之前简化并消除POC中的复杂性。</p><p>&nbsp;</p><p>我在<a href=\"https://www.infoq.com/articles/containers-considerations/?itm_source=infoq&amp;itm_campaign=user_page&amp;itm_medium=link#:~:text=what%20exactly%20is%20simplicity%3F\">之前的一篇文章</a>\"中已经写过关于复杂性和简单性的文章，当每个组件的目的很容易在与需求的联系中识别出来时，就实现了简单性。当实现相对于需求来说太过复杂，复杂性（“非直观的复杂性”）就出现了。PONC旨在解决这两个问题。</p><p>&nbsp;</p><p>将PONC付诸实践。</p><p>&nbsp;</p><p>指定你的需求。把它们写下来，与你的团队分享，不要基于模糊的需求来解决问题，因为这可能会导致你解决不存在的问题。考虑前面讨论过的替代方案。比较结果，写下你选择这个实现而不是其他实现的原因*。实现一个解决方案可能都会有几种方法，特别是当涉及到云的时候，前期的技术选择是构建高质量软件的最重要因素。从POC中移除与需求不直接相关的内容。如果你只有基本需求（因为你还处于项目的开始阶段），那就不要害怕移除所有与这些需求无关的内容，即使只剩下很少的内容。只要坚持好的原则（<a href=\"https://docs.microsoft.com/en-us/archive/msdn-magazine/2014/may/csharp-best-practices-dangers-of-violating-solid-principles-in-csharp\">SOLID</a>\"/<a href=\"https://12factor.net/\">12-factor</a>\"），然后去掉其他的东西——你可以在需求变得清晰的时候再添加。使用托管服务来减少基础设施的责任。只要有可能，就向右移动，从IaaS到PaaS，到无服务器，再到SaaS。如果你做不到这一点，那就把阻碍你的技术障碍记录下来。科技在不断发展，这些障碍可能在未来会被消除，所以了解到底是什么阻碍了你会很有用。“这是我们习惯的做法”并不是坚持IaaS的好理由。如果你的解决方案可以从拆分服务中受益，那么现在是时候这么做了（例如，一些部分可以迁移成无服务器架构，一些可以迁移到PaaS，另一些可以保留为IaaS……等等）。</p><p>&nbsp;</p><p>如果你正在重新实现一个现有的系统，请格外注意不要陷入“第二系统效应”（过度工程，因为你想要旧系统中拥有的所有功能。第二系统效应一词在Fred Brooks的<a href=\"https://item.jd.com/12401749.html\">《人月神话》</a>\"一书中首次出现）。清楚你想要实现什么，这样你就可以在一段时间内保持简单性（像上面描述的那样，指定需求总是很关键的）。</p><p>&nbsp;</p><p>（*当我提到你应该“写下来”或“记录”替代方案/结果时，我并不是说你应该写三页纸的文档——一行重点突出的句子就足够了，通常比一份很长的文档更好。例如，你可以这样写：“我们选择了一个Web应用程序，因为Azure函数不支持Ruby”——如果将来你回头来看你的解决方案，向看看早期的技术决策，并在当初的理由不再成立时需要做出修改，这些信息已经足够了。）</p><p>&nbsp;</p><p>即使在你认为你的POC不需要简化的情况下，你仍然可以从与团队进行“如果”这样做而不是那样做的PONC讨论中受益。当你能够清楚地说明为什么一个解决方案不能进一步简化时，它会让你相信自己正在正确的轨道上。</p><p></p><h4>Scrum——一个没有设计者的伟大设计</h4><p></p><p>&nbsp;</p><p>让我们来看看积极的方面——Scrum将整个项目定义为“用户项目”，这很好，因为它可以帮助我们实现第三个层次的质量。“用户故事”不断提醒我们要从用户的角度来看待产品。</p><p>&nbsp;</p><p>但消极面如下所述。</p><p>&nbsp;</p><p>1. “无第零个Sprint”的方式通常会导致开发者将他们混乱的POC变成MVP。</p><p>&nbsp;</p><p>教科书对第零个Sprint的描述似乎各不相同。一些Scrum教科书/Scrum Master反对第零个Sprint，因为它违背了Scrum的基本前提，即“每个Sprint都应该产生一个价值”。其他的则采取更务实的方法，并接受第零个Sprint（只要你将它称为“启动Sprint”）。关于你是否可以/应该有第零个Sprint，网上有一个很长的讨论，但无论你的立场是什么，在你清楚需求和了解所有潜在的解决方案之前，请不要急于着手解决问题。</p><p>&nbsp;</p><p>事实上，我相信我们可以通过扩展我们对“价值”的看法（这里的“价值”指的是Scrum规则中“每个Sprint都应该产生的价值”）来实现“第零个Sprint”和“无第零个Sprint”两个目标。</p><p>&nbsp;</p><p>你会惊讶地发现，通过向产品负责人展示你的早期工作成果能给<a href=\"https://www.scrum.org/\">Scrum团队</a>\"带来多大的好处。尽早获取他们的反馈不仅能让你更接近他们的愿景，还能让开发团队使用正确的业务术语，而不是每个人都使用自己的术语，因为这些术语对不同的开发人员来说可能意味着不同的东西。</p><p>&nbsp;</p><p>将“价值”的范围降到一个MVP或一件功能性产品，这对质量是有害的，因为这将迫使开发人员在有机会掌握所有需求之前过早地做出技术决策。当需求在随后的Sprint中变得清晰时，改变这些早期的技术决策通常是非常困难的，这导致开发人员添加越来越多的变通方法来满足需求，而不是通过使用正确的技术来解决它们。一开始缺少MVP，然后在Sprint中进行修补，这样只会导致糟糕的产品质量。如果质量是一个人，他/她会对在第一个Sprint就把一个混乱的POC变成最终部署到生产中的MVP感到惊恐。</p><p>&nbsp;</p><p>（我想借此机会邀请Scrum指南的创建者在他们的Scrum指南中阐明“价值”，加入可视化原型和架构构件，这些构件可以分享给产品所有者并收集他们的反馈。这将让想要正确实现Scrum的开发人员变得轻松一些。）</p><p>&nbsp;</p><p>最后，这里有一些东西可能可以帮你驾驭“第零个Sprint”，具体取决于你的项目/团队的成熟度和项目交付的时间线。</p><p>&nbsp;</p><p>在某些情况下，<a href=\"https://www.gv.com/sprint/\">设计Sprint</a>\"可以给你带来很大的好处。虽然它们的结果不一定是可发布的（如Scrum所期望的），但在某些情况下，它们可以提供很多价值。如果你在完成架构讨论/POC/PONC之前必须创建一个MVP，可以考虑创建一个（完全或部分）带有模拟后端（例如使用<a href=\"https://www.infoq.cn/topic/Azure\">Azure</a>\" <a href=\"https://docs.microsoft.com/en-us/azure/api-management/mock-api-responses?tabs=azure-portal\">APIM</a>\"）的MVP，这样你就可以在后续改变后端技术，同时给产品所有者/测试人员机会接触到具体的东西。</p><p>&nbsp;</p><p>2. 第三层对Scrum的关注给第一层和第二层带来了违背质量的风险。</p><p>&nbsp;</p><p>第一层和第二层的质量（想想灾难恢复、保持简单性，等等）就像其他非功能性需求（NFR）一样，在紧急交付项目的压力下，通常会被剥夺优先级。将NFR放在产品待办事项列表中是一个很好的实践（如果可能的话，还可以将其中一些放到你的“完成定义”中），这肯定会带来透明度，并将极大地促进Scrum团队对这些事项的讨论。但你仍然面临一个挑战，你需要优先考虑实现这些事项。这说起来容易做起来难，尤其是在Scrum这样的敏捷环境中。</p><p>&nbsp;</p><p>敏捷的主要目标是将你从阻止你对变更做出响应的僵化的项目计划中解放出来，这非常好，因为它保证你不会偏离利益相关者对其产品的设想。然而，变化是不可避免的，如果你不响应这些频繁发生的变化，敏捷性的主要目标就会被削弱。其副作用是你将经常优先考虑这些变更，而不是质量相关的工作。当可能不会从每个单独的Sprint中注意到它的反应性，但如果你把视野放大到整个项目，你会发现你处在一个反应性的环境中，在这个环境中，NFR的优先级需要特别的关注才能被发现。没有两个Scrum团队是相同的，所以我不知道是否有关于如何在各个层次上优先考虑质量的通用规则，但既然你已经意识到这一点，我相信你是在项目中优先考虑质量的最佳人选。</p><p></p><h2>结论</h2><p></p><p>&nbsp;</p><p>在本文中，我们讨论了质量的三个层次以及如何量化每一层。较差的质量始于早期，在把POC变成开发管道之前，应该先进行PONC。Scrum帮助我们在第三层实现质量，但我们需要有一个策略，并在第一层和第二层特别关注质量的优先级。</p><p>&nbsp;</p><p>作者简介：</p><p>Alaa Tadmori是<a href=\"https://www.infoq.cn/topic/Microsoft\">微软</a>\"云解决方案架构师。他是云计算模型的早期采用者和爱好者。Alaa相信我们今天构建的解决方案正在塑造我们的世界，而这也将是孩子们的世界，所以我们每天都有责任让我们的世界变得更美好。不工作的时候，Alaa喜欢和家人呆在一起，阅读非小说类书籍。</p><p>&nbsp;</p><p>原文链接：</p><p><a href=\"https://www.infoq.com/articles/poc-scrum-quality/\">POCs, Scrum, and the Poor Quality of Software Solutions</a>\"</p><p></p><p>相关阅读：</p><p></p><p><a href=\"https://www.infoq.cn/article/Vd3rNRQjziCvDrxl93SC\">我同情所有的 Scrum 团队，因为他们经常被指导得死去活来</a>\"</p><p><a href=\"https://www.infoq.cn/article/6Z5T4MrjudHzLzgGJd0C\">一文搞懂 Scrum 中的工作量评估和预测</a>\"</p><p>&nbsp;</p>",
    "publish_time": "2022-09-16 11:14:26",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "在数字化语境下，低代码这次能破除争议吗",
    "url": "https://www.infoq.cn/article/lqvpIfkpbiv6Q7vO7N2A",
    "summary": "<p>事实上，业界对<a href=\"https://xie.infoq.cn/article/08efa20723118ce8bdd6165eb\">低代码</a>\"的讨论和争议，已经不是第一次。从1980年低代码的概念首次被提出以来，每隔几年低代码都会引发一番热议。而近两年，低代码的再次卷土重来，似乎有越烧越旺的趋势。背后的原因和企业数字化转型的强需求有关，在数字化的语境下，低代码开发的确有它存在的意义。</p><p></p><p>比较直观的感受是，企业在推进<a href=\"https://www.infoq.cn/video/ymjYEy8q6dF3egDpuqs4\">数字化转型</a>\"的过程中需要快速试错和验证，业务变化越来越快，要求相关的应用系统同频进行调整、更新和迭代，而传统开发模式下几年上一套系统、更新几个功能的频次显然满足不了这样的需求；</p><p></p><p>其次，还有另一个关键矛盾——相较于互联网公司，技术人员在传统企业的占比偏低，这些有限人员在面临海量且定制化的开发需求时，很难做到高效支持——换句话说，在传统企业，开发资源与数字化需求很难匹配。</p><p></p><p>而低代码，恰恰能够解决这一系列问题。</p><p></p><h1>不只消减技术栈复杂度，还有沟通复杂度</h1><p></p><p></p><p>“我们在<a href=\"https://www.infoq.cn/article/UlxmUYElHHjTsU55rFUP\">制造</a>\"业看到一个非常普遍的现象，就是生产部门有很多的需求，但IT部门顾不上他们，基本上把所有精力都放在研发端和营销端，中间的生产端就变成了瓶颈。所以，生产端的人员怎么用低代码满足自己的需求，这就变成提升生产质量和效率非常关键的一点。”日前，西门子Mendix公司中国区总经理王炯在接受InfoQ等媒体采访时表示。</p><p></p><p>西门子Mendix公司中国区售前总经理兼首席架构师阮铭认为，由于低代码“去复杂度”的第一性原理，它一方面可以让技术人员的开发效率变高，另一方面还可以降低非技术人员搭建和配置系统应用的门槛，让业务人员也可以参与到开发环节中来，更灵活地满足自身需求。</p><p></p><p>当然，他还强调，低代码去的不只是技术栈复杂度，还有沟通的复杂度。</p><p></p><p>数字化转型过程非常强调业务与技术的融合，业务部门与技术部门的交互会越来越多，并且在一些企业，二者之间还会存在产品经理、项目经理等角色。由于话语体系和关注重点的差异，不同角色和部门之间的沟通，始终是一道难题。</p><p></p><p>以上海汽车集团股份有限公司旗下的上汽乘用车（以下简称“上汽乘用车”）为例，据王炯介绍，以前上汽乘用车遇到的一个挑战，就是人力资源部门给IT部门讲了需求，但IT部门不理解，或者需求一直在变化，这带来很大的沟通成本。而基于与西门子低代码开发打造的iFactory（智能工厂），这个问题得到很大程度上的解决。</p><p></p><p>比如，在构建“智能工厂<a href=\"https://www.infoq.cn/article/8eOkku2uTuU3qVFvwqhA\">精益</a>\"人力资源管理系统”的过程中，上汽乘用车内部并没有IT部门的大规模参与，人力资源部门反而成为了该系统项目的核心主力。通过低代码平台，人力资源部门相关人员自己就可以通过拖拉拽的方式，根据自己的业务要求快速完成系统配置，并且由于对自身业务流程和需求非常清楚，整个开发和迭代过程更加高效，即便遇到问题也能很快完善。</p><p></p><p>不过话说回来，要让整个流程保持顺滑，技术栈的简化也很重要。对于技术人员来说，可以借助低代码的强拓展性和连接性，把底层多个数据、多套系统、多种技术进行融合；而对于非技术人员来说，通过低代码开发平台上的“预制件”，以及二维图形化的呈现方式，也能够更好地理解和使用技术。</p><p></p><p>如此一来，就能够一定程度上解决企业高频变化的数字化需求和应用软件开发资源有限的问题。尤其是在面对一些突发状况时，这种高效应对的能力会显得极为重要。比如，在疫情影响的特殊时期，整个汽车产业都面临着零部件供应短缺的窘境，“缺件车”越来越普遍，如果不能对这些产品做有效管理，可能让整个生产管理陷入混乱。</p><p></p><p>针对这一情况，上汽乘用车利用西门子低代码平台只用2周时间就开发上线了“缺件车管理系统”，所有的缺件信息、零件号、库位号、返修计划、返修控制报交等信息全部在系统中统一管理，避免了手工统计、人工处理可能造成对信息错误、过程难以控制等问题。</p><p></p><p>据了解，截止目前上汽乘用车基于西门子低代码开发已经实现了包括智能工厂精益人力资源管理系统、缺件车管理系统、ME工时系统、QMS质量管理系统等多个系统的上线。除了新应用的开发，随着企业数字化转型的推进，原有核心系统（如ERP）的功能需求也在不断变化，比如，过去的系统功能几乎都是标准化的，但企业在数字化过程中会出现大量定制化需求。对此，上汽乘用车同样也在利用低代码实现对系统的重新打造，不断满足前台业务部门的需求。</p><p></p><h1>不是为了替换传统技术栈，而是盘活它们</h1><p></p><p></p><p>王炯强调，低代码不是要替代传统的开发模式，也不会替换企业现有的技术栈，而是通过打通系统孤岛，盘活技术栈，让原有的系统迎来“第二春”。</p><p></p><p>据他介绍，在西门子低代码的服务体系中有很多保护企业原始投资的理论基础。比如“双模IT”，西门子低代码强调的理念是，让<a href=\"https://xie.infoq.cn/article/394129641f5b64a4a31d23c7d\">ERP</a>\"、QMS等稳态系统保持不变，只对面向前端的敏态业务应用做快速迭代，同时保持二者的数据和界面连通。</p><p></p><p>“稳态系统改起来可能特别困难而且二次翻修成本投入又大，但企业又希望很快响应业务需求，这时候就可以用低代码快速地把MVP（最简化可实行产品）做出来，先去试行一段时间，真的有价值再做夯实，等有效性满足后再做到一致性。”王炯强调。</p><p></p><p>还以上汽乘用车为例，基于其数字化转型战略，公司在IT的整体架构层面除了要构建“<a href=\"https://xie.infoq.cn/article/8f6cdf96ec510cc0552e7aeb7\">工业互联网</a>\"平台”和“<a href=\"https://www.infoq.cn/article/6zQ0Y_d3shLpeVu7mHhx\">工业大数据</a>\"平台”外，还需要将企业内部各板块如：“智慧供应链”、“<a href=\"https://www.infoq.cn/article/8EjU56MwtgBcwB8ML8AT\">智能工厂</a>\"”以及“数字化营销”高效连通起来。但是，仅仅就工业互联网平台的构建，就有很多技术细节要处理。</p><p></p><p>“工业互联网不同于消费互联网，需要有IT和OT的融合，融合的时候要采集大量的数据。如何把数据标准化，将多种硬件进行链接，这很重要。”阮铭表示，“在上汽乘用车的工业互联网战略框架中，包括顶层的ERP、MES，底层的自动化和现场设备等等。而低代码的价值，是把底层数据采集起来后，一方面在中间层次发力，执行现场设备监控；另一方面在上层发力，帮助连通ERP和MES等核心系统。”</p><p></p><p>事实上，数据的打通是企业进行数字化转型的基本前提，但是和上汽乘用车一样，传统企业中普遍存在大量零散数据和烟囱式系统，导致他们难以形成端到端的交互能力。</p><p></p><p>再比如成立于1992年的中山贤邦制衣厂（以下简称“中山贤邦”），由于过去的设计、生产、销售等环节长期割裂，导致公司层面无法掌握消费者的偏好，获客越来越难，同时成本也无法把控。据了解，中山贤邦原本的报价数据都是通过Excel进行人工记录，由每个跟单员自己进行订单的跟进，很多时候某个客户是不是真的能带来收益完全没办法判断。</p><p></p><p>为了这一问题，中山贤邦借助<a href=\"https://www.infoq.cn/video/r72rLYoxRokKcPUTfdcT\">西门子低代码</a>\"开发平台开发了PLM系统，系统上线后，不仅全部报价流程都在系统上完成，并且通过与原有ERP系统的对接，还实现了对数据的统一管控和管理，包括支撑企业部分客户管理、供应商管理，快速响应客户需求、筛选优质客户群体、实现企业流程监管和数据分析。</p><p></p><p>举例来说，当跟单员收到客户的询价需求后，可以在系统中进行物料配置，自动生成报价和板式，直接从系统下载就可以方便地发给客户，客户确认后通过系统流程到开发组进行做板，做板完成后跟单员和客户沟通验证直至满足客户要求。过程中不断在系统中更新和调整物料，财务管控部门可以直接在系统上做出成本统计报表，用图表的形式展示给管理层以便决策。</p><p></p><p>阮铭总结了低代码平台在企业数字化转型过程中的三个核心价值：一是用户体验，即满足前端千人千面的业务需求，支持移动原生；二是持续创新，通过降低技术门槛，帮助企业实现数字化创新快速试错，降低创新成本和技术外采比例；三是数据驱动，即通过汇聚所有信息化系统、打通多种类型资源，帮助企业实现跨域的全面分析。</p><p></p><p>“这样一来，企业在开展很多业务的过程中就不需要再过多关注技术底座，可以把更多精力放到业务上，去拉通各个业务端到端的链条，实现业务价值的最大化。当技术本身不再成为一个挑战和羁绊，思维和业务模式就会成为企业最核心的东西。”阮铭向InfoQ记者强调。</p><p></p><h1>不是取代开发者的工具，而是赋能业务数字化的平台</h1><p></p><p></p><p>那么，为什么拥有那么多显而易见的优点，低代码仍然受到质疑？其实背后也并不是全无原因。</p><p></p><p>比如，谁才是低代码的使用者，这一直是一个争议点。有不少人会对低代码存在这样的感官，认为它贬低了传统开发人员的价值，甚至可能对开发者的工作取而代之。但事实上，低代码的主要受益人群应该是终端用户，并且，他们能够完成的也只是最简单的组件重组和配置，其中，“预制件”的准备以及相对复杂的应用开发仍然需要由开发人员完成。</p><p></p><p>所以，我们看到西门子低代码提供的实际上是两套开发环境。一套是面向业务人员的浏览器版本Studio，操作者可以在其中拖拉拽，搭建简单的、小快灵的、部门级别的应用；另一套是面向技术人员的线下版本Studio Pro，可以和<a href=\"https://xie.infoq.cn/article/1b1522c203fde2b71633343da\">VSCode</a>\"、<a href=\"https://www.infoq.cn/article/puu0qdBYDbrWFbuaUeUT\">Eclipse</a>\"等开发环境融合在一起，开发更加复杂的“高代码”应用。</p><p></p><p>换句话说，低代码平台的价值需要通过业务和技术双方的协作来实现，二者在其中发挥的作用并不相同，具体的需求也不一样。</p><p></p><p>当然，也正是因为如此，仅靠低代码事实上解决不了所有问题——在一些特定场景，可能仍然需要依赖传统开发模式的介入。但有些企业无法认识到这一点，过高的期待导致对低代码的价值评估并不那么准确。所以，在企业考虑是否接受低代码时，合理的管控预期非常重要。</p><p></p><p>再比如，低代码平台虽然看起来只是一种开发工具的引入，但带来的可能是企业内部整个开发流程甚至工作模式的改变，而这种改变的影响范围和成本投入都是巨大的。所以，企业想要用好低代码，一定不能只把它视为技术工具，还需要组织和流程层面的多重保障和推动。</p><p></p><p>对此，作为技术提供方，西门子低代码已经做好了长期布局和陪伴的准备。阮铭表示，西门子低代码在中国市场采取的是“三步式”进阶策略——即低代码的社交化、个性化和智能化。</p><p></p><p>其中，社交化强调将低代码从个人IT实践延展为集团式语言和技术暗号，从而真正为企业级组织重塑整体人员的IT行为模式；个性化着力行业企业技术栈的原生基础，无论组织机构的核心系统差异，西门子低代码都能实现进行衔接及融合；智能化则是对人工智能（AI）辅助开发流程的概括，覆盖性能调优、页面绘制和逻辑编排，赋予开发人员前瞻性架构理念。</p><p></p><p>以智能化为例：“通常来说，一个系统项目涉及数百个功能点，这时候AI起到的作用就是帮助用户快速理解，把不同的功能点分配到不同的日志、优先级和到不同的开发框架。”据阮铭介绍，从2017年到现在，西门子低代码总结了500多万个逻辑，并且通过<a href=\"https://www.infoq.cn/article/T1dDiyzXguAG9KTNEkIj\">深度神经网络</a>\"可以对其中的数据不断训练，对于开发速度和开发效果的支持会持续叠加和优化，“比如，前面开发了四五个小的功能点，平台就会提示接下来是不是要创建一个报表应用和决策点分支，也就是说，低代码平台在里面是有预测性的。”</p><p></p><p>所以，究竟低代码在如今的数字化语境下能真正破除业界的争议吗？必须肯定的是，这是低代码一次关键的机会。虽然它不是万能的，但相关的产品和技术数十年来一直在持续升级，对于企业数字化创新而言，它能提供足够的想象空间。</p><p></p><p>不过同样要强调的是，企业需要的是能够真正深入业务场景，具有领域知识的低代码平台，而不是简化开发的工具——这类低代码一定不是以取代技术从业者作为目的，而是赋能业务人员，让数字化业务灵活高效地运转、验证、迭代。反之，对于企业而言，也必须以实际需求为出发点，在充分梳理流程的基础上找准低代码的切入点。</p>",
    "publish_time": "2022-09-16 12:38:24",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]