[
  {
    "title": "从HBase到TiDB：我们如何实现零停机在线数据迁移",
    "url": "https://www.infoq.cn/article/2qQNTBGeLLbyQFt9cm7H",
    "summary": "<p></p><blockquote>本文最初发布于<a href=\"https://medium.com/@Pinterest_Engineering?source=post_page-----43f0fb474b84--------------------------------\">Pinterest Engineering</a>\"技术博客，InfoQ经翻译授权发布。</blockquote><p></p><p></p><h2>迁移背景与动机</h2><p></p><p>在Pinterest，Hbase一直是我们最关键的存储后端之一，持续为众多线上存储服务提供支持，涵盖Zen（图数据库）、UMS（宽列数据存储）和Ixia（近实时二级索引服务）。HBase生态系统具备一系列突出优势，例如在大容量请求中保障行级强一致性、灵活的模式选项、低延迟数据访问、<a href=\"https://www.infoq.cn/topic/Hadoop-ten-years\">Hadoop</a>\"集成等，但也由于运营成本高、过于复杂和缺少二级索引/事务支持等问题，而明显无法满足未来三到五年内的客户实际需求。</p><p></p><p>在评估了十余种不同的存储后端选项，向三种入围方案导入影子流量（将生产流量异步复制至非生产环境）并开展深入性能评估之后，我们最终决定将TiDB选为这场统一存储服务角逐的胜出者。</p><p></p><p>如何将统一存储服务的支持职责顺利移交给<a href=\"https://www.infoq.cn/profile/E47A66A843E94F/publish\">TiDB</a>\"，无疑是一项需要数个季度才能完成的艰难挑战。我们需要将数据从HBase迁移至TiDB，重新设计并实现统一存储服务，将Ixia/Zen/UMS的API迁移至统一存储服务，再把各类离线作业由HBase/Hadoop生态系统迁移至TiSpark生态系统——而且整个过程中，现有业务的可用性和延迟SLA均不能受到影响。</p><p></p><p>在本篇博文中，我们将首先探讨不同数据迁移方法及其各自利弊。之后，我们再深入探究如何将数据从HBase迁移至TiDB，这也是Pinterest第一次以零停机方式迁移一个每秒14000次读取查询、400次写入查询的4&nbsp;TB大表。最后，我们将共同验证这套新方案能否实现99.999%的数据一致性，并了解如何衡量两个表之间的数据一致性。</p><p></p><h1>数据迁移策略</h1><p></p><p>一般来讲，零停机时间数据迁移的实施策略可以概括为以下几点：</p><p>假定已有数据库A，需要将数据迁移至数据库B，则首先开始对数据库A和B进行双重写入。将数据库A的转储数据导入至数据库B，并解决与实时写入间的冲突。对两套数据集进行验证。停止向数据库A写入。</p><p></p><p>当然，具体用例肯定各有不同，所以实际项目中往往会包含一些独特的挑战。</p><p></p><p>我们综合考量了各种数据迁移方法，并通过以下权衡筛选最适合我们需求的选项：</p><p>从服务向两个表（HBase和TiDB）执行双重写入（以同步/异步方式写入2个数据源），并在Lightning中使用TiDB后端模式进行数据摄取。</p><p></p><p>这种方式最简单也最易行。但TiDB后端模式提供的传输速率仅为每小时50 GB，因此只适合对较小的表进行数据迁移。</p><p></p><p>获取HBase表的快照转储，并将来自HBase&nbsp;cdc（变更数据捕捉）的数据流实时写入至kafka主题，而后使用lightning工具中的本地模式对该转储执行数据摄取。接下来，即可从服务层执行双重写入，并应用来自kafka主题的全部更新。</p><p></p><p>应用cdc更新时往往会引发复杂冲突，因此这种方法的实施难度较高。另外，我们此前负责捕捉HBase cdc的自制工具只能存储键，所以还需要额外的开发工作才能满足需求。</p><p></p><p>另一种替代方案，就是直接从cdc中读取键，并将存储在另一数据存储内。接下来，在面向两个表的双重写入启动后，我们从数据源（HBase）读取各键的最新值并写入TiDB。这种方法实施难度很低，不过一旦通过cdc存储各键的异步路径发生可用性故障，则可能引发更新丢失风险。</p><p></p><p>在评估了各项策略的利弊优劣之后，我们决定采取下面这种更加稳妥可靠的方法。</p><p></p><h2>迁移工作流</h2><p></p><p></p><h3>术语定义：</h3><p></p><p>客户端：与thrift服务对话的下游服务/库</p><p>服务：用于支持在线流量的thrift服务；在本次迁移用例中，服务指的是Ixia</p><p>MR Job：在map reduce框架上运行的应用程序</p><p>异步写入：服务向客户端返回OK响应，无需等待数据库响应</p><p>同步写入：仅在收到数据库响应后，服务才向客户端返回响应</p><p>双重写入：服务以同步或异步方式同时写入两个基础表</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/ad/adc11aa8d11574d2509cf01a5d7cbb10.png\" /></p><p></p><p></p><p><img src=\"https://static001.geekbang.org/infoq/ff/ff7aade57742bdafb323bd28594b09c7.png\" /></p><p></p><h3>实施细节</h3><p></p><p>由于HBase为无模式（schemaless），而TiDB使用严格模式，因此在着手迁移之前，需要先设计一个包含正确数据类型和索引的schema。对于我们这个4&nbsp;TB大小的表，HBase和TiDB&nbsp;schema之间为1：1映射，也就是说TiDB架构会通过map reduce作业来分析HBase行中的所有列和最大列大小，之后再分析查询以创建正确的索引。下面来看具体步骤：</p><p>我们使用hbasesnapshotmanager获取HBase快照，并将其以csv格式存储在S3内。各CSV行使用Base64编码，以解决特殊字符受限的问题。接下来，我们在本地模式下使用TiDB&nbsp;lightning对这一csv转储执行摄取，而后进行base64解码，并将行存储至TiDB内。摄取完成且TiDB表上线后，即可启动对TiDB的异步双写。异步双写能够既保障TiDB的SLA，又不影响服务SLA。虽然我们也为TiDB设置了监控和分页，但此时TiDB仍然以影子模式运行。使用map reduce作业对HBase和TiDB表执行快照保存。各行会首先被转换为一个通用对象，再以SequenceFiles的形式存储在S3内。我们使用MR Connector开发了一款自定义TiDB快照管理器，并在HBase中使用hbasesnapshotmanager。使用map reduce作业读取各sequencefiles，再将不匹配的行写回至S3。从S3中读取这些不匹配的行，从服务中读取其最新值（来自HBase），再将这些值写入至辅数据库（TiDB）。启用双重同步写入，同时向HBase和TiDB执行写入。运行步骤3、4、5中的协调作业，每天比较TiDB与HBase内的数据奇偶性，借此获取TiDB与HBase间数据不匹配的统计信息并进行协调。双重同步写入机制不具备回滚功能，无法解决对某一数据库的写入失败。因此必须定期运行协调作业，确保两个表间数据一致。继续保持对TiDB同步写入，同时对HBase启用异步写入。启用对TiDB的读取，此阶段中的服务SLA将完全取决于TiDB的可用性。我们将继续保持对HBase的异步写入，尽可能继续保持双方的数据一致性，以备发生回滚需求。彻底停止写入HBase，弃用HBase表。</p><p></p><h2>如何处理不一致问题</h2><p></p><p>由后端不可用导致的不一致</p><p>在Ixia服务层构建的双写框架无法回滚写入操作，这是为了防止因任一数据库不可用而导致局部故障。在这种情况下，就需要定期运行协调作业以保持HBase与TiDB双表同步。在修复此类不一致时，主数据库HBase为数据源，因此一旦出现HBase表写入失败、但TiDB表写入成功的情况，则协调过程会将这部分数据从TiDB中删除。</p><p></p><p>双重写入和协调过程中，因竞态条件引发的不一致</p><p>如果事件按以下顺序发生，则可能导致将旧数据写入TiDB：（1）协调作业从HBase表读取；（2）实时写入将数据同步写入至HBase，异步写入至TiDB；（3）协调作业将之前读取的值写入TiDB。</p><p>此类问题可以通过多次运行协调作业来解决，每次协调都能显著减少此类不一致数量。在实践中，对于支持每秒400次写入查询的4&nbsp;TB表，只需要运行一次协调作业即可在HBase与TiDB之间达成99.999%的一致性。这项一致性指标的验证源自对HBase和TiDB表转储值的二次比较。在逐行比较之后，我们发现两表的一致性为99.999%。</p><p></p><h2>成效</h2><p></p><p>我们看到，第99百分位处的读取延迟降低至三分之一到五分之一。在本用例中，第99百分位的查询延迟从500毫秒下降至60毫秒。实现了写后读取一致性，这也是我们希望通过替换Ixia达成的重要目标之一。迁移完成后，整个架构更简单、涉及的组件数量更少。这将极大改善对生产问题的调试流程。</p><p></p><h2>挑战与心得</h2><p></p><p></p><h3>内部TiDB部署</h3><p></p><p>由于我们没有使用TiUP（TiDB的一站式部署工具），所以Pinterest基础设施中的整个TiDB部署流程成了我们一次宝贵的学习经历。之所以没有选择TiUP，是因为它有很多功能都跟Pinterest内部系统相互重叠（例如部署系统、运营工具自动化服务、量化管道、TLS证书管理等），而综合二者间差异的成本会超出使用收益。</p><p></p><p>因此，我们决定继续维护自己的TiDB版本代码仓库和构建、发布与部署管道。集群的安全管理绝非易事、涉及大量细节，如果我们自己不努力探索，就只能把这些工作一股脑交给TiUP。</p><p></p><p>现在我们拥有了自己的TiDB平台，构建在Pinterest的AWS基础设施之上。我们可以在其中实现版本升级、实例类型升级和集群扩展等操作，且不会引发任何停机。</p><p></p><h3>数据摄取</h3><p></p><p>在数据摄取和协调过程中，我们也遇到了不少现实问题。感谢Pingcap在各个环节中提供的全力支持。我们也为TiDB代码库贡献了一些补丁，这些成果已经由上游社区完成了合并。</p><p></p><p>TiDB lightning 5.3.0版本不支持自动刷新TLS证书，而且由于缺少相关日志而难以调试。Pinterest的内部证书管理服务则每12小时刷新一次证书，所以期间总会发生一些失败的摄取操作，只能依靠pingcap来解决。好在证书自动刷新功能现已在TiDB 5.4.0版本中正式发布。Lightning的本地模式会在数据摄取阶段消耗大量资源，并影响到同一集群上运行的其他表的在线流量。为此，Pingcap与我们开展合作，对Placement Rules做出了短期和长期修复，因此支持在线流量的副本已经不会受到本地模式的影响。TiDB MR Connector需要进行可扩展性修复，才能把4&nbsp;TB表的快照保存时间控制在合理范围。此外，MR Connector的TLS也有改进空间，目前这些改进贡献已经完成了提交及合并。</p><p></p><p>在调优和修复之后，我们已经能够在约八小时之内摄取4&nbsp;TB数据，且每轮协调和验证运行只需要七小时左右。</p><p></p><h3>Ixia</h3><p></p><p>在本轮迁移中，我们的表由ixia负责支持。期间，我们在异步/同步双重写入和查询模式变更中遇到了几个可靠性问题。由于ixia本身的分布式系统架构非常复杂，导致thrift服务（ixia）极难进行调试。感兴趣的朋友请参阅我们的<a href=\"https://medium.com/pinterest-engineering/building-scalable-near-real-time-indexing-on-hbase-7b5eeb411888\">其他博文</a>\"以了解更多细节。</p><p></p><h2>鸣谢</h2><p></p><p>这里，我们要感谢Pinterest存储和缓存团队的各位前成员和现同事，谢谢大家在这场将最新NewSQL技术引入Pinterest存储堆栈的攻坚战中做出的卓越贡献。</p><p></p><p>我们还要感谢<a href=\"https://www.infoq.cn/profile/864AB02AC11ACA/publish\">Pingcap团队</a>\"为种种复杂问题提供的持续支持、联合调查和根本原因分析（RCA）。</p><p></p><p>最后，我们要感谢各位客户在此次大规模表迁移过程中表现出的耐心和支持。谢谢您的理解与配合！</p><p>&nbsp;</p><p>原文链接：</p><p><a href=\"https://medium.com/pinterest-engineering/online-data-migration-from-hbase-to-tidb-with-zero-downtime-43f0fb474b84\">https://medium.com/pinterest-engineering/online-data-migration-from-hbase-to-tidb-with-zero-downtime-43f0fb474b84</a>\"</p>",
    "publish_time": "2022-08-22 00:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "进入数字经济时代，产品经理需要具备什么思维和技能？",
    "url": "https://www.infoq.cn/article/2Zc5zKlXjzSbYa4ZaS0O",
    "summary": "<p></p><blockquote>8 月 18 日，由极客邦科技旗下 InfoQ 技术大会举办——首届 PCon 全球产品创新大会在北京富力万丽酒店拉开序幕，极客邦科技创始人兼 CEO 霍太稳作为开场嘉宾，带来了主题为《数字经济时代的产品经理》的内容分享，以下为演讲整理。</blockquote><p></p><p><img src=\"https://static001.infoq.cn/resource/image/ba/e6/ba20f2f7ba296d2f906624a1cdbb70e6.png\" /></p><p></p><h3>极客邦科技举办的首届产品经理大会</h3><p></p><p>大家好，我是霍太稳，极客邦科技创始人兼 CEO。很高兴今天来做本场大会的开场分享：数字经济时代的产品经理。在进入主题之前，我先简单地做个自我介绍：</p><p>2007 年，我从国外引进全球领先的技术社区 InfoQ 。</p><p>2009 年，从国外引进软件开发者大会 QCon，一直秉承一个理念即为中国的技术开发者提供最先进的技术理念和最优质的技术内容。</p><p>2015 年，我创立了 TGO 鲲鹏会，为科技领导者提供同侪学习与成长的社区服务。</p><p>2017 年，我们上线了 IT 技术学习平台——极客时间个人版，将公司在过去十多年技术社区积累下来的优质专家资源和技术实践的干货内容形成专业的课程，汇聚在学习平台上，为开发者们提供职业发展需要的新知识、新技能、新方法。</p><p>2019 年，应众多企业客户的要求，我们上线了极客时间企业版，为企业提供一站式数字技术学习 SaaS 平台服务，助力企业搭建数字人才团队，快速提升员工的数字技能，为企业数字化战略的成功落地实施提供人才保障。</p><p>通过这样一条时间线，基本上把极客邦科技公司有哪些业务给大家做了完整的展示。也能从中看出我们服务的人群之前更多强调技术的重要性，而现在进入数字化时代，随着我和团队服务的个人和企业数量的增多，愈发感受到每个人的综合能力，或者叫复合型能力开始受到前所未有的重视，咱们在座的产品经理就是其中集大成者。</p><p>因此，极客邦科技的 InfoQ 技术大会团队希望为产品经理们办一个专场的大会，即 PCon 全球产品创新大会。今年是首届推出，面向产品经理、增长运营等角色。会议的设计理念传承了团队在过去十几年举办大会的智慧和经验，内容包含国内外知名产品设计理念解读，以及有趣的产品经理成长历程分享。</p><p></p><h3>“以产品当笔，与世界对话”</h3><p></p><p>“以产品当笔，与世界对话”这句话来自《俞军产品方法论》。从世界上第一个产品经理——宝洁公司的一名员工提出“一人负责一个品牌”的理念，其实更接近是品牌经理，他的主要职责是负责这个品牌的市场定位、营销推广、渠道建设等等。到后来随着时代的变迁和演进，软件为王时代、互联网、移动互联网、到新消费时代，现在我们处在数字经济时代，以及大家都在谈的后疫情时代，我们会发现，产品经理这个角色也不断进化。</p><p>需要从宏观经济和微观场景去深刻理解用户的真实需求，还要求产品经理脑子里的用户概念，不仅仅是自然人，而是一个个具体需求的集合，等等。所以，借用俞军的这句颇具情怀的话，既表达了我们对产品经理的致敬，也同时表达了我们对产品经理寄予了厚望。</p><p>这次在策划 PCon 会议的时候，我们也找业界的专家做了调研，听听行业的人有什么感受，同时也给我们的会议专题策划带来了一些思路。</p><p>1.&nbsp;产品创新不是口号，我想在座的各位平时在公司里也会经常听到老板说：“我们要创新！” 他们的想法是，在已有的业务量上做增量，更多地去找新的业务方向。但实际上，在产品工作中，现在更多的是做微创新，因为也很难做到颠覆式的创新；</p><p>2. 我们自己也能感受到，现在人口红利在消褪，当然，这是针对 ToC 的产品。但利弊是共存的，尤其是做 ToB 业务的产品经理，可以结合目前国家提的数字化转型方针，和 SaaS 化趋势，可以多关注产品的创新，突破固有的思维模式，突破舒适圈，在 ToB 领域有更多的新成果；</p><p>3.&nbsp;目前国内产品的嗨点已经走向了互联网的深洞，前几年基本上是有商业元素在推动，但是现在需要回归本质，回归价值，回归原始，追求舒适，追求解决用户最基本的需求，要慢下来；</p><p>4.产品经理也要关注大的趋势，不能闭门造车，创新要紧跟国家战略，看经济形势，这样可能会走得更远；其实看看用友、金蝶等企业的 ToB 产品发展历程，就能理解；</p><p>5.这是我今天希望跟大家重点介绍的一点，我们都知道国家在十四五规划当中有一整个篇章专门讲数字经济，也出台了若干政策持续多方面地推动产业的数字化转型。那么对于产品经理来说，抓住数字转型这波浪潮，保持自我学习与成长，会有更广阔的发展空间。</p><p></p><h3>PMF 是产品经理的必修课</h3><p></p><p><img src=\"https://static001.infoq.cn/resource/image/db/45/dbb1c34d1a43b5f132fa63de73c34845.png\" /></p><p></p><p>我注意到今年2022年，全球领先的云和 SaaS 投资机构 Bessemer 在最新的报告中，首次提出 Centaur 半人马兽的概念。以 1 亿美元 ARR（年度订阅性费用）为基准线定义了 Centaur 半人马兽的标准，这是卓越 SaaS 初创公司成功的真正标志。</p><p>此前的独角兽（估值超过 10 亿美元的一级市场公司），已经不足以成为衡量企业成功的标准，只能证明公司有融资能力。该报告指出 2022 年是半人马兽之年，将会有更多的半人马兽公司诞生。</p><p>Centaur 半人马兽企业的 1 亿美元 ARR 说明了2件事：</p><p>1.公司实现了&nbsp;&nbsp;Product-Market-&nbsp;Fit</p><p>2.企业拥有可扩展的&nbsp;GTM&nbsp;策略和不断增长的客户群</p><p>PMF 是产品经理的必修课，也代表了越来越重要的复合型能力。在过去移动互联网飞速发展的十几年间，以中国市场需求引领的大量创新产品此起彼伏，也培养了大量的产品经理。但是 PMF 这一个词的背后其实意味着好几套知识体系和能力，这也是今天我希望和大家重点分享的。</p><p></p><h3>进入数字经济时代，产品经理需要具备什么思维和技能？</h3><p></p><p><img src=\"https://static001.infoq.cn/resource/image/44/51/44ded24375faeaa4aef6139af7170a51.png\" /></p><p></p><p>根据极客邦科技双数研究院今年发布的数字人才粮仓模型，产品经理在企业架构当中属于数字思维业务人才，需要具备数据思维、数字工具的应用能力，以及高效的网络协同能力。这是比较宏观的维度。</p><p>具体从微观层面展开来看。这是我们公司极客时间教研团队在服务和调研了大量企业之后，萃取出来的产品经理技能图谱。大家可以看到几个大类的技能领域包括：市场调研、产品规划、产品管理、专业工具。</p><p><img src=\"https://static001.infoq.cn/resource/image/3b/ae/3b205e1efbb0ebf4230365b81fdab7ae.png\" /></p><p></p><p>为了方便大家能看清这棵技能图谱树，我把每个局部放大，可以看到每个大的技能领域的具体技能点。比如在市场调研方面，需要有很多维度的视角和分析能力；在产品规划方面，也需要有从宏观概念定义到具体指标制定的思维能力和实践能力。</p><p>运营增长自不必多说，这是近年最受关注的能力；当然还有专业工具的应用能力，会用数字化工具才能高效地分析数据，用数据做决策，更好地与同事、产业链合作伙伴协同，这些都是数字经济时代产品经理需要掌握的技能。</p><p><img src=\"https://static001.infoq.cn/resource/image/5b/4f/5bc0815c043e0f3ce861b45f88166f4f.png\" /></p><p></p><p>从企业对产品经理岗位的定位角度，就会参考技能图谱，再根据员工从事工作的经验、在企业人才梯队的位置等进行分层，对应到不同层级的对应的岗位职责。</p><p>相应的，对不同层级的产品经理的知识技能等方面的任职资格也不尽相同。级别越高的产品经理，从软技能、硬技能、知识储备、方法论，以及思维等各个方面都要求得更多。</p><p>从这两张详细的产品经理任职资格表我们其实基本上也能描绘出产品经理进阶的学习路径。这也是极客时间教研团队的专业能力。很多企业，尤其是在做数字化升级或转型的企业越来越重视产品经理的培养。</p><p><img src=\"https://static001.infoq.cn/resource/image/6e/02/6edce412f2abe0ccab5b90a441355302.png\" /></p><p></p><p>我们在过去 3 年里服务了超过 3000 家企业的数字人才培养服务，这里摘取了部分企业客户的产品经理培训主题给大家参考。</p><p>明显地能够看到，产品经理已经不仅仅是互联网公司的“香饽饽”，也开始受到传统行业企业的重视和青睐。这些行业包括：银行、金融、通信、制造、汽车等等。很多人说互联网进入下半场，开始唱衰产品经理。我希望大家从我的分享之中看到更多积极的信号。</p><p>给大家看一个具体的产品经理培训的项目案例。从项目背景来看，这是一家典型的国企。他们为产品经理定制了一套完整的体系化培训，赋能产品经理技能提升同时打造产品竞争力，实现员工和企业共同成长的目标。通过三个月的线上自主学习+线下集中研学+实战演练的体系化学习，产品经理们从用户画像和产品创意，到产出 MVP 产品方案，策划运营增长方案，到最终形成可落地的商业计划。</p><p>从这个培训项目大家能够看到什么？产品经理的角色和产品经理的能力正在成为大量企业提升自己产品在数字经济时代竞争力的关键岗位和关键能力！</p><p><img src=\"https://static001.infoq.cn/resource/image/ba/0e/baab2aa3d6bc3e5b3656f64a97413b0e.png\" /></p><p></p><p>很荣幸极客时间个人版目前已经服务了 25 万人学习产品经理相关的课程；极客时间企业版已经服务了上千家企业的近 18 万员工学习产品经理相关课程。非常期待在座的各位将来都能成为我们服务的用户和客户，我们一同学习提升数字化技能，成为新时代的高价值人才。</p><p><img src=\"https://static001.infoq.cn/resource/image/25/83/25a5a354c6cbe40738b7bef085474f83.png\" /></p><p></p><p>因为数字经济时代发展需要的数字人才有非常大的缺口，各行各业的发展都需要具备数字思维和数字技能的人才，产品经理也是其中重要的组成部分。我们有充分的理由相信，只有保持学习数字技能，产品经理是数字经济时代最炙手可热的人才。</p><p></p><h3>极客邦科技- 以 KaaS 模式推动数字人才全面发展</h3><p></p><p><img src=\"https://static001.infoq.cn/resource/image/aa/f9/aaf352dd6f3d1e92e36634c896a4fef9.png\" /></p><p></p><p>最后给大家简单介绍一下我们公司，极客邦科技。今年我们公司升级了使命为“推动数字人才全面发展”，同时把极客邦科技旗下的所有资源通过产品和服务的形式提供给客户。&nbsp;KaaS 模式让知识可以像服务一样被生产、被发现。在服务者（包括企业和讲师）与消费者之间有效地运转起来，形成各方都能享受到优质服务、高质量的数字技术知识和技能的良性闭环。</p><p><img src=\"https://static001.infoq.cn/resource/image/49/c1/498150878472df847c725fdac71831c1.png\" /></p><p></p><p></p><p>从解决方案的角度大家能更好地理解。这是我们面向企业提供的“数字化领先”一体化解决方案。为企业提供数字转型战略及业务架构轻咨询服务，到以“研测学考评”一体化平台服务为核心的数字人才培养，再到通过媒体和技术生态服务助力企业打造技术品牌影响力，以及从长期发展视角为企业提供业务增长等各方面的咨询服务。这一切仍然是围绕推动数字人才全面发展这一核心展开，目标是推动企业数字化转型成功，助力数字中国早日实现。</p><p>说在最后，预祝本次大会圆满成功，也祝大家都能通过本次产品创新大会收获满满！</p>",
    "publish_time": "2022-08-22 10:43:36",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "石油公司是如何“玩转”AIoT的？",
    "url": "https://www.infoq.cn/article/7vTfCLYoKzuIZTjdLGk0",
    "summary": "<p>我国最深的油井，是位于塔里木油田的“满深10井”，具体钻井深度达到9186米——比从珠穆朗玛峰峰顶打到山脚的深度还要多出300多米。可以想见，在这样钻探风险和施工难度极大的超深地层勘探油气储藏，是“全球少有、国内独有”的钻完井工程难题，需要在技术创新上不断实现新的突破，才能推动我国超深层油气勘探开发水平跻身世界前列。</p><p></p><p>而正是因为石油作业环境的这种特殊性，从钻井、开采再到运输、加工，石油工业场景中很多高危或者不适合人工完成的工作，逐步都实现了机器换人。这使得石油行业的整体<a href=\"https://www.infoq.cn/article/UlxmUYElHHjTsU55rFUP\">工业自动化</a>\"程度相对其它传统制造业要更为完善，也是目前<a href=\"https://xie.infoq.cn/article/0d03d3d6af148de471cf242ea\">AIoT（人工智能物联网）</a>\"在石油行业应用比较普遍的原因。</p><p></p><p>举例来说，通过“物联网+大数据+人工智能”，可以对地下数千米的智能钻机进行远程控制、实时监测，对散点分布的作业区设备进行智能巡检、安全预警，对油气生产过程进行资源调配、故障诊断，对深不可测的地下勘探进行更精准的预测和定位.....</p><p></p><p>AIoT的落地，正在加速以上这些智慧油田基本场景的实现——尤其是在全球环境变幻莫测的当下，对于我国这样一个石油资源并不算丰富的国家来说，这意义重大。</p><p></p><p>某能源领域技术专家（以下使用化名“孙杰”）告诉InfoQ，我国的石油资源相对紧缺，加上区域分散、地质复杂，使得石油的生产成本居高难下。“比如中东国家的石油80%集中在浅层和中深层，在地下2000多米就能开采到石油，在国内，每口井至少得挖3500米以上才能采到油，这意味着要花更多的钱、用更多的成本。所以，我们必须不断使用新技术来提高石油的产量，降低人工和成本的投入。其中，AIoT所强调的智能化运营恰恰能很好满足目前石油行业在降本增效等等这些方面的需求。”</p><p></p><h1>AIoT可以解决哪些石油生产难题</h1><p></p><p></p><p>据孙杰介绍，AIoT主要可以解决石油生产过程中的几个核心问题：第一，监控实时化；第二，管理高效化；第三，分析智能化。</p><p></p><p>首先，基于AIoT的相关技术，可以在各个关键环节放置数据采集的装备，经过数据传输和分析，从而对设备进行实时监控，实现安全预警。“比如在加油站油品输送的过程中，跑冒滴漏会引发事故。但人一般不可能实时地去盯着管道阀门看，这时候，通过传感器监测管道的压力并实时传输到后台，如果发现压力数值异常，就可以及时采取应对措施，而不用等到管道出现问题再处理，同时还能减少人工操作的纰漏。”</p><p></p><p>除了利用传感器等装备进行数据传输和监测，防止气体泄露的另一个措施是使用<a href=\"https://xie.infoq.cn/article/de7e472c35d3607b776f8009d\">无人机</a>\"进行智能巡检。据孙杰介绍，在管线运行过程中，如果出现密封环松动或者破损，会造成大量气体泄漏，严重的甚至会导致爆炸等安全事故，对安全运输产生危害。</p><p></p><p>而无人机可以预先航线规划，在管线正上空50m~80m进行仿地飞行，通过交替飞行方式，持续对管线地表进行甲烷浓度监测。具体来说，由于配备了三轴增稳云台，可以使监测激光光束持续稳定指向被测区域，最低能检测的浓度达到5ppm.m。并且，无人机是实时监测被测区域，以坡形图显示，搭配H20t可见光，可以形成红外热成像。在巡检任务结束后，无人机还能自动生成巡检报告——包含报警点位置、报警浓度及现场照片等等。“总的来说，通过无人机巡检不仅精确度比人眼更好，巡检效率也更高，通常一天下来可以巡检几个来回。”孙杰强调。</p><p></p><p>其次，石油生产的第二个特点，是要求设备不中断运行。孙杰向InfoQ举例，假设钻机在地下钻探的过程中停止运行，不仅会影响钻井施工的正常进行，而且还会造成巨大的经济损失。这意味着，对设备的检测、维修维护工作一定要前置，不能等事故发生再亡羊补牢。过去，这个工作主要由有经验的老师傅完成，如果钻头出现异响，无论是轴承磨损还是卡钻、损坏，都要依赖他们的经验去判断具体问题，决定是否要更换钻头。</p><p></p><p>不过，这样的问题处理对人的经验和能力培养周期非常长，时间成本也很高。“现在有了AIoT这些技术，我们已经可以把老师傅们的经验转变成<a href=\"https://www.infoq.cn/article/dbLYT47GWIIccobhQap5\">算法模型</a>\"，让机器去识别判断设备问题，进行预测性检修，通过对钻井环境、设备等数据的实时采集、实时传输、实时分析，辅助管理者做判断，从而缩短决策的响应时间，提高管理效率。”</p><p></p><p>值得强调的是，其中的数据从采集、汇总到分析，同样都不是靠人工去完成，而是按照固定的数据标准自动进行的。孙杰强调，这就是AIoT的第三个应用价值——实现分析的智能化。</p><p></p><p>“过去通过人工去做汇总和分析，平均时长需要两到三个小时，甚至有时候一天之后才能得到分析的结果。但基于智能化的预测和分析，所有工作都是实时、自动进行的。”孙杰举例，“比如领导想要知道单井或者是某个作业区的产量，只需要根据预先设置的参数，把相关参数输入到对应模型中，去让机器自动分析再输出结果——通常，这在几分钟或者几十秒内就能输出所需要的分析报表，非常方便管理者及时决策。”</p><p></p><h1>落地AIoT需要构建什么样的基础设施</h1><p></p><p></p><p>但是，解决这些生产问题的背后，并不仅仅是AI、IoT和数据的简单叠加。虽然石油行业的自动化程度整体高于其它传统制造，在落地AIoT的过程中，也同样有很多的旧困难和新挑战要应对，需要全新的基础设施作为依托。</p><p></p><p>首当其冲的挑战，来自于数据收集。石油野外作业条件恶劣，对于设备和人来说是一样的。这意味着，架设在设备和环境中收集数据的<a href=\"https://www.infoq.cn/article/4MD03KvNOx2Ebt7UUL8j\">传感器</a>\"要能扛住这些潜在的“威胁”——比如，放置在管线中的传感器就要耐腐蚀，放置在海上钻井中的传感器就要防水，如果是在温度比较高的地区还要耐高湿。“除了使用特殊的材料，我们通常还会做一些保护盖或者插入式的设计。另外，如果是在海里，传感器还要符合环境保护标准并且定期维修更换，避免污染海域环境。”孙杰解释道。</p><p></p><p>与此同时，在数据采集过程中，关键还要打通不同设备之间的数据壁垒，从而实现数据的可视化。孙杰表示，和大多数传统制造行业一样，石油行业所使用的设备往往也来自不同品牌、不同型号，也就是说，它们的数据协议和格式并不相同。对此，解决办法就是使用数据转化的盒子——类似于不同品牌手机充电器的转接头——可以在数据采集的过程中，对不同的数据协议进行解析，然后按照统一标准自动进行汇总和呈现。</p><p></p><p>第二个挑战，来自于数据传输。通常来说，制造企业的厂区分布一般比较集中，但石油生产受限于地理条件，作业区不仅位置非常分散、流动性强，而且通常都在比较偏僻的区域，至少距离城市中心数几十公里。如果把所有数据传输到统一的数据中心，非但成本高，而且效率还低。“以前，我们只能通过一些采集器和专用网线去传输这些数据，其实速度非常慢。另外因为是在野外，网线要拉很长，而且都暴露在外面，网线的老化速度非常快，这也会造成网络传输的不稳定。”孙杰表示。</p><p></p><p>随着<a href=\"https://xie.infoq.cn/article/d405746948670885e22137d11\">边缘计算</a>\"技术的日趋成熟，这个问题正在得到解决。“比如，通过在不同井区布置微型数据中心，我们可以把作业现场的数据分别传输到里面做处理，速度上基本可以做到实时。”孙杰进一步解释，“但是，微型数据中心对数据的承载量又是有限的。所以，当数据量超过一定规模，还需要把数据先传输到就近的中心，再采用专线的形式汇总到总部的数据中心。”</p><p></p><p>第三个挑战，来自于数据计算。随着智能化运营的有序开展和迭代演进，石油井区能够收集以及需要收集的数据规模将越来越大，数据类型也会越来越多。比如，AI可以用来提高石油勘探的准确性，但是，勘探的位置都在未经挖掘的地下，还需要结合<a href=\"https://xie.infoq.cn/article/ee5ba1da546aed28cb3688ce2\">数字孪生</a>\"进行三维建模——而这个数据量非常之大。举例来说，构建一个数十平方公里的高精度三维数字模型，数据量可能就会可达到TB甚至PB级。</p><p></p><p>孙杰表示，对这么大的数据量级进行处理分析，需要使用高性能计算才能真正提高计算的精确度。同时存储这些大量的数据，也需要耗费相当的成本——所以，考虑经济性和高效性，通常可以对数据进行分类分级管理。</p><p></p><p>“针对不同类型的数据，我们会进行存算分离。”孙杰举例，“比如说，跟生产相关、需要进行实时计算、追踪的数据，就可以传输到高性能计算设备进行实时处理，而像前期做地质勘探测绘用的数据，就可以直接存储起来，不用做实时计算。”</p><p></p><h1>新技术的引进和使用会有哪些“坑”</h1><p></p><p></p><p>当然，技术本身的发展有它的周期，技术与人的磨合也需要一定的时间，这是客观规律。从农耕时期人类使用工具满足衣食需求，到工业时代机械帮助人类实现大规模生产，再到信息时代计算机成为人类智力创造的重要辅助——每一个技术在最初出现的时候，都会先经历一个“混沌期”。</p><p></p><p>以AI、IoT、大数据等技术为核心的智能时代同样如此。两个极端表现是，要么盲目“迷信”新技术，要么抵触抗拒新技术。孙杰表示，这两个“坑”他们都踩过。</p><p></p><p>“作为传统行业，我们一开始会觉得很多科技公司的技术很强，认为他们一定可以帮助我们利用AI这样的技术提高生产效率和经营水平。但后来我们慢慢发现，只依靠先进技术是不行的，他们的技术如果脱离实际应用场景是没法发挥价值的。就相当于你拥有了一把很厉害的锤子，但没有要砸的钉子，这个锤子就没有价值。”孙杰强调，技术一定要与具体的业务场景融合，要解决问题而不能停留在炫技的层面。</p><p></p><p>所以，技术引进之前的业务需求调研非常重要。“在项目前期，我们的技术人员通常会深入到油田作业现场，在那里用一到两个月左右的时间做深度调研，然后把一线的反馈整理成需求文档；据此进行初步的原型技术开发，并提供给一线人员进行试用；试用的过程如果发现问题，再不断地去完善。”孙杰表示。</p><p></p><p>在这个过程中，核心的一个难点在于，如何把业务需求转换成技术语言——比如，放在AIoT的场景下，就是如何把专家的经验转换成计算机的算法模型，来优化提高钻井效率。</p><p></p><p>以石油钻井为例：数据来源于钻井过程的各个环节，种类繁多、数量巨大；并且，钻井过程中的钻井参数以及地下环境等信息具有复杂性、多样性以及不确定性（如：地下环境、地质参数等），这使得钻井决策更多地依赖于专家经验，而不是科学的决策。</p><p></p><p>“为了提高决策的科学性，我们的钻井专家人员和技术人员对钻井过程做了很多优化工作，提出了很多的优化模型和改进方法。”孙杰指出，“尤其是随着钻井行业数据量的不断增长，传统的数据处理模型对于非结构化数据的处理具有一定的局限性，因此如何利用更先进的技术和管理手段，收集、整合、优化石油钻井各类数据，把人的经验变成更优化的计算模型，对于提高钻井效率具有重要意义。”</p><p></p><p>在孙杰看来，在这个过程中，<a href=\"https://gtlc.infoq.cn/2022/beijing\">技术与业务</a>\"沟通协作是非常重要。如果缺少一线工人的经验输入，靠技术自己去给应用数据做标注、打标签那可能就会漏洞百出。但是，另一个难点在于，技术与业务之间的话语体系存在鸿沟，可能会让这个协作的过程并不那么“丝滑”。</p><p></p><p>“比如石油工人跟你说钻机、三向分离器、油品、录井、测井等等这些很专业的业务术语，技术人员就可能一窍不通；而技术人员跟他们讲云计算、虚拟化、<a href=\"https://xie.infoq.cn/article/547275996f5d919af4daa32b9\">容器</a>\"，他们也可能听不懂。”孙杰表示，“这时候，就需要双方坐下来彼此倾听，业务告诉技术他们的工作流程是怎么样的，技术告诉业务这个技术是怎么解决问题的。有时候，甚至可以用一些通俗易懂的比喻，比如，我们给工人解释公有云和私有云的区别时，就会告诉他们，如果是自己买材料在家做饭就相当于私有云，如果是直接到饭馆吃就相当于公有云。通过一些形象的例子，他们就会更容易理解。”</p><p></p><p>但是，孙杰也坦言，即便是如此，仍然无法避免会有个别一些人抵触和抗拒新技术。“这种时候，我们的办法是让他们去直接体验新技术的好处。就像智能手机出现的时候，也有人拒绝，但是当他看到周围的人不只能用手机打电话、发短信，还能买机票、发视频、看电影、打车、订外卖，就会慢慢改变。”</p><p></p><p>除了潜移默化的影响，企业层面的文化重塑、制度规范和技能培养也很重要。“比如，我们会在内部定期组织相关的技术沙龙，也有网上的视频学习课程，这些都是为了让工人更好地了解新技术；另外，也会通过绩效对工人进行考核，比如使用新技术或者更先进的解决方案，最终实现了成本降低、效率提升，就可以获得一定的创新奖金等等；并且，从<a href=\"https://time.geekbang.org/\">技能培养</a>\"上我们还会定期组织一些技术创新大赛，通过树立榜样和典型，不断影响更多的人。”</p><p></p><p>“总的来说，AIoT给石油行业带来的好处是实实在在的，除了生产运营上的降本增效，也能通过智能化运营平衡供需，提高能源的利用效率。科技发展日新月异，我们相信AIoT将为油气企业数字化转型升级装上加速器。”孙杰总结道，“当然，在产业依托技术不断演进的过程中，我们仍然要坚持的是业技融合协同创新，既要仰望星空也要脚踏实地，要让技术走进实际的业务场景，才能把数字化转型落到实处。”</p>",
    "publish_time": "2022-08-22 10:55:59",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]