[
  {
    "title": "不读代码也能做技术决策？试试可塑性开发吧",
    "url": "https://www.infoq.cn/article/rj51sC6SmKa6wFaocqrZ",
    "summary": "<p></p><h2>开发人员为什么要阅读代码</h2><p></p><p>&nbsp;</p><p>他们之所以要阅读代码，是因为代码是真相所在。他们也会在其他多种情况下阅读代码。当他们想要学习如何使用API时，他们会阅读。当他们需要找到一个地方添加新功能时，他们会阅读。当他们在查找导致bug的根本原因时，他们会阅读。当他们在查找构建配置不能正常工作的原因时，他们会阅读。当他们在查找测试失败的原因时，他们会阅读。</p><p>&nbsp;</p><p>在开发过程中，人们普遍都依赖阅读代码。事实上，开发人员在这方面花费了大量的时间。多项研究表明，通常超过一半的开发时间都花在阅读代码上。</p><p>&nbsp;</p><p>阅读代码在日常开发工作中根深蒂固，以至于人们认为它是理所当然的。毕竟，他们为什么不能这么做呢？关于编程的一个普遍观点是，代码就像一本书，我们会像读写普通书籍一样读写代码。然而，代码并不完全像是一本书。一个关键的区别是代码通常比一般的书的内容要多得多。假设一个系统有25万行代码，这相当于64本《哈姆雷特》，而快速阅读，比如每天8小时，2秒一行，大约需要一个月的时间，而这还不是全部。《哈姆雷特》的角色有限，情节也可以被简明扼要地概括出来，但一个软件系统却几乎没有可以摆脱掉的代码。只是阅读一次代码很少能够完全了解系统。由于软件系统的本质是相互交织的，要理解它，就必须考虑到所有的内部联系，并将其作为一个整体来理解。另外，一个软件系统的变化速度一直比我们通过阅读来了解它的速度要快得多。因此，不管是从质量还是数量上讲，我们面临的问题都不同于读书。</p><p>&nbsp;</p><p>如果我们后退一步就会发现，虽然情况各不相同，但动机是一样的：开发人员通常想要足够了解系统的一些东西，以边确定下一步要做什么。他们阅读代码是因为他们想要做出决定。这和读《哈姆雷特》是完全不同的，和阅读天文学课本也不一样。</p><p>&nbsp;</p><p>从这个角度来看，阅读代码只是一种从系统中获取信息的策略。只要存在一种方法，就会有另一种方法。实际上，关于系统的一切——无论是代码、配置、日志还是数据库中的数据——都只是数据，而数据最好是使用工具来处理。</p><p>&nbsp;</p><p>当然，在过去的几十年里，各种各样的分析工具并不少见。然而，即使在今天，阅读代码仍然是从系统中获取信息的主要手段。你可能会问：“那又怎样？”</p><p>&nbsp;</p><p>毕竟，正是这种活动让我们的行业变得如此有价值：大多数系统帮助人们对他们永远不会看到的数据做出决定，而开发人员有能力创造这种魔力。我们只需要把我们的能力应用在我们自己的问题上！</p><p>&nbsp;</p><p>“好吧，但该如何做？”</p><p>&nbsp;</p><p>软件系统还有一个我们需要考虑的特性：它们是高度上下文相关的。两个系统可能是针对同一个领域，使用完全相同的技术构建，但仍然完全不同。几年前，我们做了一个实验，试图重现这样的场景。伯尔尼大学的若干学生团队被要求构建相同的小应用程序，并且必须使用相同的库。他们需要满足的需求是一样的，并以相同的方式进行验收测试。在经过了7周的开发之后，我们对他们的系统内部进行了研究。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/12/12dda41616b2c1492668144811b88c78.png\" /></p><p></p><p>&nbsp;</p><p>这张图中有7个系统，对于每个系统，我们用黑色表示类，用红色表示方法，用蓝色表示属性以及它们之间的相互依赖关系。从图中可以看出，尽管这些团队受到了高度约束，但仍然产出了不同的结构。系统的内部工作方式受到许多因素的影响，而这些因素远远超出了技术的范畴。</p><p>&nbsp;</p><p>正是由于这种上下文性质，一般性工具在实践当中从未真正起到作用。它们可以生成漂亮的图片，但不会影响人们做出决定的方式。为了让决策具有相关性，需要考虑到上下文信息，而通用工具根本无法感知到这些。例如，上面的可视化是通用的，因为它适用于任何系统。描述软件的一般性质是有用的，但对于处理与系统相关的特定问题是没有用的。</p><p>&nbsp;</p><p>另一种选择是创建自定义工具，以上下文为基础，并提供与之匹配的体验。工具的主要焦点应该是用一种易于理解的方式来显化问题，这样解决方案通常很快就会出现，我们称之为可塑性开发（Moldable Development）。</p><p>&nbsp;</p><p>让我们来看一个具体的例子。</p><p>&nbsp;</p><p></p><h2>示例——特性切换推理</h2><p></p><p>&nbsp;</p><p>依赖关系在开发人员的意识中占据着重要的位置。他们添加依赖，删除依赖，管理依赖，并不断地打破依赖循环。这是一个普遍的问题。不过，并非所有的依赖都是平等的，有些比其他的更有趣，有些比其他的更明显。</p><p>&nbsp;</p><p>当我在2021年QCon Plus大会上<a href=\"https://www.infoq.com/presentations/moldable-development/\">通过实例介绍可塑性开发</a>\"时，我展示了一个由系统设置和特性切换导致的依赖关系的例子。从中可以看到，当特性切换在一个组件中定义并在另一个组件中使用时，两者之间会出现依赖关系。</p><p>&nbsp;</p><p>最近，我和同事有机会一起了解了Open edX的特性切换。Open edX是一个用Python编写的开源系统。下面的可视化图用红色突出显示了树图（TreeMap）上所有使用了特性切换的地方，树图是一种通过嵌套矩形显示层次数据的可视化图。在本例中，树图显示了系统的文件夹和文件。使用了至少一个特性切换的文件用红色突出显示。可以看出，这是一个非常依赖特性切换的系统。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/55/55daf21ac1df5190f269d48a3196f639.png\" /></p><p></p><p>&nbsp;</p><p>特性切换最基本的形式是使用布尔值。当然，在一个系统中会有许多布尔值，但其中只有少数用于特性切换。通常，定义和使用特性切换要么是依赖模式，要么是依赖库。我们当时发现有三种基于不同库的表示特性切换的方法。因此，为了绘制上面的可视化图，我们首先必须创建一个能够理解这些上下文库的专用工具。</p><p>&nbsp;</p><p>我们使用了<a href=\"https://gtoolkit.com/\">Glamorous Toolkit</a>\"，一个可塑性的开发环境。Glamorous Toolkit主要帮助开发人员用较低的成本创建定制工具。下面是一个使用这个工具包进行代码分析的示例。在左侧窗格中，我们可以看到一个实时的notebook页面，其中包含了一个查询，用于查找遗留的切换机制。在中间的窗格中，我们可以看到一个特性切换列表。在右边，我们可以看到一段显示特性切换的Python源代码。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/02/0270867b48c69aba32558dd51912810e.png\" /></p><p></p><p>&nbsp;</p><p>在我们的例子中，有一个特性切换是这样定义的：</p><p>&nbsp;</p><p><code lang=\"java\">HIDE_ACCESS_DENIALS_FLAG = LegacyWaffleFlag(\n    waffle_namespace=COURSE_BLOCKS_API_NAMESPACE,\n    flag_name='hide_access_denials',\n    module_name=__name__,\n)</code></p><p>&nbsp;</p><p>从名字可以看出来，这是用于在系统中定义变量的一种遗留机制，目的是为了方便进行迁移。当然，在迁移之前，首先需要找到违规的地方。为了找到它们，我们需要一个可以理解这个框架的工具。notebook中的查询可以捕获到这些信息：</p><p>&nbsp;</p><p><code lang=\"java\">Gt4EdxGlobals toggleModel allEdxToggles select: #isLegacy</code></p><p>&nbsp;</p><p>这个查询依赖了已有的切换模型，并基于之前设定的模型逻辑标志来选择它们。我们专门为Open edX系统创建了这个模型和逻辑。</p><p>&nbsp;</p><p>这个场景捕获到了更多的东西。首先，notebook对软件工程就像它对数据科学一样有用。其次，分析由依赖了基于系统自定义模型的自定义视图的检查器提供支持。例如，在右侧，我们可以看到一个叫作Gt4EdxToggleDefinition的类实例检查器。这是专门为分析而创建的模型中的一个实体。</p><p>&nbsp;</p><p>在有了一个可以捕捉系统事实的模型之后，我们就可以去发现不容易被发现的问题。在本节的开头，我们讨论了由特性切换导致的依赖关系，下图是它们在我们系统里的样子。在图的左边，我们可以看到顶层模块的可视化，以及由特性切换导致的依赖关系。单击其中一个箭头就会显示导致这种依赖关系的特性切换。在最右边，我们可以看到使用特性切换的细节。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/ba/ba6086b1db43a1db9b127b8e7ecef117.png\" /></p><p></p><p>&nbsp;</p><p>例子中展示了获取一个特性切换并将其保存在一个上下文变量中：</p><p>&nbsp;</p><p><code lang=\"java\">context = { \n  ... \n  'enable_account_deletion': configuration_helpers.get_value(\n            'ENABLE_ACCOUNT_DELETION', ...)\n  ... }</code></p><p>&nbsp;</p><p>系统的openedx组件使用了特性切换，但它是在lms组件中定义的，因此两者之间存在一个隐藏的依赖关系。这只是其中的一个例子。</p><p>&nbsp;</p><p>本节展示了几个在开发过程中可能出现的典型的问题。例如，如果我们想要拆分系统，就需要知道隐藏的依赖关系是怎样的。我们希望总是能够回答任何有关系统的问题。在我们的示例中，我们通过静态分析来回答这些问题，但可塑性开发思想适用于软件系统的任何方面，不管是静态的还是其他的——我们从一个问题开始，创建一个定制的工具，并解释结果，从中找到行动的路径。最后，我们发现我们可以在不阅读代码的情况下对系统进行推理。</p><p>&nbsp;</p><p>事实上，通过定制工具来指导决策的想法与当前的实践状态相差甚远。乍一看，这一提议似乎是一种浪费。毕竟，这是否意味着开发人员将花费大量的时间来创建和完善工具，从而导致生产力下降？简单地说，不会。事实上，情况恰恰相反，我们过一会儿再来讨论这个。</p><p></p><h2>Glamorous Toolkit——可塑性开发环境</h2><p></p><p>&nbsp;</p><p>在上面的例子中，我们使用Glamorous Toolkit对一个用Python编写的系统进行了分析。Glamorous Toolkit是一个可塑性开发环境，用于降低创建定制工具的成本。例如，创建一个自定义视图通常只需要几分钟的时间。Glamorous Toolkit提供了统一编程、数据科学和知识管理的体验。它是一个基于Pharo的Smalltalk系统，更关键的在于，我们可以通过多种方式对其进行编程和定制。</p><p>&nbsp;</p><p>Glamorous Toolkit本身也是一个示例，我们也是遵循可塑性开发的思想创建了它。它的基础发行版中已经包含了数千个小工具。我们是怎么知道的？这是一个好问题，就像任何关于系统的问题一样，我们可以通过定制工具来回答它。在本例中，我们将可以使用Glamorous Toolkit编写一个关于Glamorous Toolkit的简单查询。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/4e/4e7355071cf16bb226cde1ce9bc76500.png\" /></p><p></p><p>&nbsp;</p><p>在截图中，我们可以看到左边的notebook中有一段代码：</p><p>&nbsp;</p><p><code lang=\"java\">#gtView gtPragmas</code></p><p>&nbsp;</p><p>执行这个脚本会在右侧的检查器中显示结果。在这个例子中，结果是一个叫作过滤器的东西，它知道如何显示代码中的实际位置，还知道指标概要。我们可以看到有1984个方法。这些方法定义了检查器所显示的自定义视图。例如，指标视图的定义是这样的：</p><p>&nbsp;</p><p><code lang=\"java\">gtMetricsFor: aView\n\n^ aView columnedList\ntitle: 'Metrics';\nitems: [ {'Number of methods' -&gt; self amountOfMethods.\n'Lines of code' -&gt; self linesOfCode.\n'Lines per method' -&gt; self linesOfCodePerMethod} ];\ncolumn: 'Metric' text: #key;\ncolumn: 'Value' text: [ :assoc | assoc value asString ]</code></p><p>&nbsp;</p><p>为什么我们会有这个视图？因为我们曾经想知道我们有多少个自定义视图。可塑性开发流程通常从一个问题或假设开始，然后我们会问什么样的工具能够提供答案的概要，如果我们没有合适的工具，就创建一个。我们对所有关于系统的问题都这么做。而且，这些工具通常只使用一次。</p><p>&nbsp;</p><p>“这是什么蠢事？创建一个工具，只使用一次？”是的。这只是一个成本问题，如果成本足够低，它实际上比手动阅读代码更划算。这并不像看起来的那么牵强。这个流程与数据科学中的流程类似，在数据科学中，人们会为每个问题创建自定义描述。</p><p>&nbsp;</p><p>“那么，怎样的东西才算是工具？”对象的自定义视图是一种工具，自定义调试器是一种工具，自定义搜索是一种工具，自定义API浏览器是一种工具，自定义日志分析器也是一种工具。所有这些都是工具，而工具包环境的职责是确保用较低的成本来塑造它们。有了这些，编程流程就会发生根本性的变化。</p><p>&nbsp;</p><p>“不过，重复利用工具不是更加经济吗？”如果你可以重用你的定制工具，那就这样去做。例如，Glamorous Toolkit默认发行版提供的1984个定制视图是可重用的。但不要在一开始就考虑重用，而是考虑摊销成本，这样可以让你在创建工具之前不必从经济性角度去考虑问题。</p><p>&nbsp;</p><p>“工具一定要是定制的吗？”看看我们的例子，如果我们不理解用来定义系统设置和特性切换的框架的细节，就无法回答与它们相关的问题。事实上，在这个系统中有不止一个这样的框架。软件开发中的大多数决策都与外部无法预测的特定情况有关。如果你的问题不够具体，可能就是没有用的。如果你发现自己正在使用的工具与在其他系统中使用的一样，那么这个工具很可能无法起到应有的作用。</p><p>&nbsp;</p><p>我们来看一个常见的查看构建日志的场景。我们可以看到三个窗格。在第一个窗格中，我们可以看到构建状态嵌入在知识管理系统的页面中。在第二个窗格中，我们可以看到各个阶段的图表。所选的构建失败了，图表显示问题出在最后一个阶段。选择最后一个阶段将显示构建执行的详细步骤，其中一个步骤失败了。当我们查看步骤内部时，立即发现了红色高亮显示的错误。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/58/58d88d3bdb330e61191b2b58c628c0e0.png\" /></p><p></p><p>&nbsp;</p><p>在这个例子里，错误信息是这样的：</p><p>&nbsp;</p><p><code lang=\"null\">Error: Expected version v0.8.1839 does not match the actual v0.8.1838</code></p><p>&nbsp;</p><p>这个错误不是普遍性的错误，而是与我们构建系统的上下文相关。因此，要高亮显示它，视图必须了解上下文。事实上，我最近看到过这个错误，但没有被高亮显示，因为之前没有遇到过。很快，我用几行代码给它加了高亮：</p><p>&nbsp;</p><p><code lang=\"null\">('Error: Expected version' asPParser token\n, #endOfLine asPParser negate star token , #endOfLine asPParser)\n==&gt; [ :tokens | \n(aText from: tokens first start to: tokens second stop)\nhighlight: Color red ]</code></p><p>&nbsp;</p><p>环境中的任何东西都可以而且应该与上下文相结合。当然，如果环境已经能够快速创建自定义体验，那会有很大帮助。在我们的示例中，你可能会注意到，我们没有使用单独的工具来收集关于构建的信息。IDE中的“I”是“集成”的意思。如果要集成环境，就不应该离开环境去寻找信息。相反，我们希望信息自己来到我们身边，以便让我们能够通过适合的方式操作它们。这就是可塑性开发的精髓。</p><p>&nbsp;</p><p>为了让这个变得实际，环境必须降低工具的创建成本。这就是为什么我们不把环境看作现成的工具，而把它看作一种由交互式和可视操作符组成的语言，它们可以以多种方式组合在一起。Glamorous Toolkit提供了许多这样的小部件，我们可以将它们拼凑起来形成上下文体验。</p><p>&nbsp;</p><p></p><h2>可塑性开发的意义</h2><p></p><p>&nbsp;</p><p>现如今，开发人员将大部分时间花在阅读代码上。然而，他们很少去谈论这件事情。正如Felienne Hermans之前发表的关于<a href=\"https://www.infoq.com/news/2021/12/reading-code/\">阅读代码</a>\"的文章中所提到的那样，阅读代码实际上从未受到过任何挑战。当你学习一门新语言或问题已经被展现出来时，阅读代码是一个很好的策略，但当我们需要处理更大的问题时，它就不奏效了。</p><p>&nbsp;</p><p>可塑性开发对将阅读代码作为一种从系统中收集信息的手段提出了挑战。可塑性开发提供了一种系统性的方法，依赖于创造可以概括系统的专门性体验。在本文中，我们详细介绍了一个场景，在这个场景中，我们在不依赖阅读代码的情况下了解系统。当然，这只是一个适合放在本文中展示的例子。因为开发人员每天要做很多决定，每一个决定都可以通过自动的、上下文相关的概要来推动。</p><p>&nbsp;</p><p>我们谈论的是开发预算中最大的一部分，也就是我们现在正在以一种隐性且未经优化的方式在使用的部分。好消息是，这代表着一个巨大的机会——如果我们对其施加显著的影响，将直接影响整个开发过程。我们对行业决策中的繁琐部分进行自动化。我们通过创造专门的体验来概括数据，通过这种体验，人们无需看到原始数据就可以做出决策。这是一种神奇的技能，涉及到社会的方方面面，我们只需要把它应用到工作中。这个流程如下图所示。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/98/980d0847a99b811aeff38a2751daa3c6.png\" /></p><p></p><p>&nbsp;</p><p>这一切都始于一个假设，或至少是一个明确的与系统相关的问题。我们希望通过工具来收集有关系统的信息。一旦有了结果，就可以对它们进行解释。如果我们对解释的结论有信心，就会采取行动。如果没有，就加以改进并进行重试。这不是什么新鲜事物，这是一种科学的方法。可塑性开发的独特之处在于，鉴于软件是高度上下文化的，我们无法确切地预测人们将遇到的问题，因此我们不能提供现成的工具。对于一个给定的假设，我们很可能还没有准备好合适的工具。在这种情况下，我们应该自己创建一个合适的工具，就是这样。</p><p>&nbsp;</p><p>可塑性开发需要采用新技术来降低创建定制工具的成本。为了展示这种开发方法在实践中的工作原理和系统的可解释的程度，我们开发了Glamorous Toolkit，并将其开源。不过Glamorous Toolkit只是一项技术，而可塑性开发是一种通用的方法，我们相信它可以成为软件工程的基础。</p><p>&nbsp;</p><p>可塑性开发也需要专门的技能，最明显的就是创建定制工具的技能，这与创建自定义可视化图的数据科学家的工作没有太大区别。但这还不够，最重要的技能是形成假设和做出决策。虽然掌握技术方面的东西可以像学习其他技术一样，但具体问题的制定是一种只能通过时间来培养的技能。</p><p>&nbsp;</p><p>一旦掌握了技术和技能，就打开了无限的可能性。我们通过沃德利图来理一理。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/93/93e612b3ec7d8139d9f83d832c1836ca.png\" /></p><p></p><p>&nbsp;</p><p>技术人员和非技术人员都面临做出系统决策的挑战，这些挑战总是与具体的问题相关。通常，这些决策是基于对系统进行手动检查得出的组合视图而做出的。考虑到系统的规模比通过手动检查能够收集到的信息要大得多，因此手动获得的视图总是不完整的，而且经常是错误的。另一种方法是自动生成视图。当然，为了使视图有价值，需要对它们进行特定的定义，而这需要进行特定的编码。只有当工具也变得具有可塑性，这一切才有可能。</p><p>&nbsp;</p><p>与创建定制工具相关的工作不仅不会增加开发成本，反而会降低成本。因为预算已经花在人工上了，将部分能量转换为编码优化了手动工作，最终的总成本更低。</p><p>&nbsp;</p><p>我们可以将可塑性开发视为降低成本的一种方法，光是这一点就值得了。然而，现如今，做出决策的速度和质量是最重要的。定制视图不仅降低了最大的成本，还让公司能够更快、更准确地做出决策，这是最大的潜力所在。</p><p>&nbsp;</p><p>以我们最近合作的一家公司为例。几年来，他们一直试图优化用于关键营销活动的数据管道的性能，但都没有成功。当他们第一次介绍他们的系统时，画了一个包含四个大组件的架构图。经过更仔细的检查发现，事实上，他们的系统有五个大组件。这里我们不讨论数据沿袭的细粒度细节，我们要讨论的是对系统的粗粒度理解。实际上，他们并不知道这个系统是由什么组成的。这听起来很荒谬，对吧？构建这个系统的人怎么会不知道这个呢？而这与那些拥有遗留系统的大多数公司的情况也没有太大不同。我们一次又一次地遇到这样的团队，他们自以为了解系统，结果却发现实际情况截然不同。一般来说，如果决策是基于手动制作的图表做出的，我们就可以假设它们是不完整的，或者，更糟的是，它们是错误的。</p><p>&nbsp;</p><p>系统随着时间的推移而演化，最初的知识会随之过时。在这种情况下，我们不能依靠记忆。相反，我们希望能够通过自动的方法来了解当前的系统。以较低的成本获得针对问题的准确观点，就有可能可以提出更多的问题，从而形成新的反馈循环。</p><p>&nbsp;</p><p>这些问题本质上是技术问题，但具有非技术的意义。软件系统越来越多地记录和自动化组织的关键知识。访问和改变系统的能力将是未来十年竞争优势的关键来源。</p><p>&nbsp;</p><p>作者简介：</p><p>Tudor Gîrba是一个软件环保主义者和<a href=\"https://feenk.com/\">feenk</a>\"的首席执行官，他与一个了不起的团队合作，致力于让系统的内部变得可解释。他的大部分工作都包含在<a href=\"http://gtoolkit.com/\">Glamorous Toolkit</a>\"中——一个支持<a href=\"http://moldabledevelopment.com/\">可塑性开发</a>\"的可编程环境。</p><p>&nbsp;</p><p>原文链接：</p><p><a href=\"https://www.infoq.com/articles/moldable-development/\">https://www.infoq.com/articles/moldable-development/</a>\"</p>",
    "publish_time": "2022-11-02 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "“企业级零代码黑客马拉松”决赛圆满落幕",
    "url": "https://www.infoq.cn/article/e2fc1750cb8fe535e863103db",
    "summary": "<p></p><p>2022年10月28日至29日，由普华永道中国和明道云主办，InfoQ与艾瑞咨询联合推广，思迈特软件、集简云、Zion和中国计算机学会（CCF）青年计算机科技论坛联合支持的“企业级零代码黑客马拉松”决赛圆满落幕。10支决赛队伍现场比拼，在24小时内创造出极具创新性、创造力、商业价值的零代码数字化解决方案。</p><p></p><p></p><p></p><p></p><h3>博采众长的评委阵容</h3><p></p><p></p><p>为了客观、公正、多维地评价决赛作品，大赛组建了涵盖企业咨询、零代码APaaS、BI、无代码前端开发和无代码集成领域的10人评委阵容，集各家之所长。</p><p></p><p>评委阵容包括来自普华永道中国的风险控制与服务合伙人陈彦、普华永道中国数智重塑部财务数字化转型合伙人蔡耿青，来自明道云的CEO任向晖、CTO金可伟、CPO薛宗铭和CMO雷明灿，艾瑞咨询的技术副总裁郝欣诚，思迈特软件的副总裁吴晓，Zion的创始人兼CEO陆继恒，以及集简云的CEO陈迪。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/6f/6fed35258cecc3f1e433069b7baa7bbe.png\" /></p><p>评委团队正在观看作品演示</p><p></p><p></p><h3>一日为期，释放潜能</h3><p></p><p>10支队伍，16位零代码极客，限时24小时，产出企微助手、离散制造型企业全流程管理、粮油店进销存管理、集团型企业CRM、新农村信息统筹平台、工厂疫情管理、智库型企业业务三要素管理等垂直解决方案。经过最后每组8分钟的现场汇报后，评委们围绕应用完整度、解决方案能力、创新度、简洁度和易用性维度，选出前三名优秀作品。</p><p></p><p>一等奖</p><p>作品名称：企微助手</p><p>队伍名称：奥创1号</p><p>来自公司：上海奥谱创网络科技有限公司</p><p></p><p>在选手引导下，观众与作品现场扫码互动，让所有人亲身经历了整套方案的运转流程、用户端体验和闭环逻辑。方案完整性、简洁与易用性属全场之最。集简云CEO陈迪表示，这套在24小时内构建的应用，已经足够成熟，可以作为商业软件售卖了。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/d6/d608d118f50a811404b7c52bc038062c.png\" /></p><p>第一名队伍的作品演示画面</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/e3/e39e34c020b271cc49c3626e7f5cc1dc.jpeg\" /></p><p>明道云评委代表任向晖、普华永道中国评委代表陈彦和蔡耿青与奥创1号队伍颁奖合影</p><p></p><p>二等奖</p><p>作品名称：ACIS</p><p>队伍名称：选我肯定队</p><p>来自公司：上海橙木智能科技有限公司</p><p></p><p>当BOM表（物料清单）被一键展开和一键收起时，全场人都为之惊叹鼓掌。原本还写在明道云产品规划路线图上的功能，选手仅用现有功能就做出来了，并且交互体验极其优雅简洁。整个离散制造企业的全流程管理系统在高完成度的基础上，嵌入公司现场管理的数据BI大屏，足以见得队伍在赛前已经有深厚的行业管理和工具使用经验。滴水石穿，非一日之功。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/5c/5cedaa18cb50b47bbdb443209b521ee2.png\" /></p><p>第二名队伍的作品演示画面</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/75/75154400430a50378f990f264fa04ddd.jpeg\" /></p><p>思迈特软件副总裁吴晓、Zion CEO陆继恒与选我肯定队颁奖合影</p><p></p><p>三等奖</p><p>作品名称：粮油小店ERP</p><p>队伍名称：First Place</p><p>来自公司：棒糖科技（杭州）股份有限公司</p><p></p><p>作品背景取自我们身边的柴米油盐。表哥家的粮油店多年来缺乏数字化管理，连赚了还是亏了都不知道。队伍为表哥打造的粮油小店ERP，小而美。抓住小店经营的关键要素，把应用做得极其简洁易用，仅用明道云移动端APP即可完成。小姑娘轻描淡写地一句“OK”，让观众都感受到产品自信，相信表哥的粮油店会越办越好。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/9f/9fa909c67f6e0a0acbcfff45b2cf3878.jpeg\" /></p><p>第三名队伍的作品演示画面</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/c6/c68fd9e2e5a89c19d7adecd458de4200.jpeg\" /></p><p>集简云CEO陈迪与First Place队伍颁奖合影</p><p></p><p>在有限时间内，十支参赛队伍均倾尽全力完成作品，大部分作品的开发速度、复杂程度连明道云的资深实施顾问都难以企及。</p><p></p><p>来自上海电气数科的数科纵横队创作出集团型CRM，针对大型集团内部多组织、多业务的复杂需求，构建一套完整的流程闭环。浙江移动衢州分公司的衢移网络自研队打造“出行管家”，帮助需要频繁出差的业务人员快速查询各地疫情风险地区和防控政策，上报健康数据。来自上海弘牧信息的李可崔牛队创造的“房东东”收租应用，在用明道云实现后端数据处理的基础上，使用Zion创造租客端小程序，让房东和租客的线上协作更省心、自助。</p><p></p><p>除了前三名队伍现场赢取“苹果全家桶”奖品和奖杯以外，其余参赛队伍也获得大赛优秀奖和明道云礼盒，满载而归。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/ff/ff10d9eced394a03b257fc9ccd6a91d3.jpeg\" /></p><p>大赛优秀奖队伍合影</p><p></p><p></p><h3>结语</h3><p></p><p>受疫情影响，企业级零代码黑客马拉松大赛赛程贯穿2022，从春到秋。感谢所有初赛选手的热情参与，让我们看到百花齐放的作品和零代码的无限可能；感谢所有决赛选手坚持到底的韧性，陪伴大赛一起画上圆满的句号。</p><p></p><p>期待在未来，我们能看到更多用零代码技术创作出来的解决方案，落地至真实的商业和社会环境，解决实际问题，为社会带来一点改变。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/f1/f1810be8d3ea9b6b0c26d7c798bb98a5.png\" /></p><p></p>",
    "publish_time": "2022-11-02 09:52:55",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "允度软件CEO陈冲：组一个下半辈子的朋友局",
    "url": "https://www.infoq.cn/article/wIFZ5SWOccBvL9G6vsgd",
    "summary": "<p>嘉宾简介：陈冲，允度软件 CEO，<a href=\"https://tgo.infoq.cn/join\">TGO 鲲鹏会</a>\"（上海）负责人。</p><p></p><p>2003 年毕业，毕业后的前 10 年一直在写代码，从民企程序员一路做到外企技术总监。写代码的最高光时刻是 2012 年参与<a href=\"https://www.infoq.cn/article/NjuBjKw2daCjtHzqejcj\">高通</a>\" Vuforia Cloud AR 的产品发布，发布会上面向全球直播展示的第一个项目就是陈冲本人开发的，这个项目也给公司带来 200 万美金的高通订单。</p><p></p><p>2013 年陈冲开始创业，2015 年创立允度软件，现在给几家大型企业和上市公司提供软件服务和人力外包，并自主研发了金氮股权投资管理系统，帮助 <a href=\"https://www.infoq.cn/article/UXJczpcgXisBVx0r5gWF\">VC/PE</a>\" 解决企业内部项目流程文档风控管理。</p><p></p><p></p><h1>加入小组：组一个下半辈子的朋友局</h1><p></p><p></p><p>陈冲是 2018 年加入 TGO 鲲鹏会，最开始被分到上海七组，加入后 9 个月大家只聚了 2 次，聚的人也不太多，聊的话题和分享的内容也只停留在表面。</p><p></p><p>直到一次小组组长会议，组长老白没时间，就让陈冲代参加。这次会议给陈冲留下深刻印象，讲师详细讲述了一个优秀小组应有的样子。这次组长会议之后，陈冲意识到小组原来是一个可以无话不谈、深度链接，就像大学寝室室友一样亲密无间的组织。小组成员每个月见面，分享自己的工作和生活，说一些心底话，时间越久彼此间的感情越深。</p><p></p><p>自从陈冲知道成立小组最终的目的后，他就特别想把自己的小组建设好。组长会议结束，陈冲就立即与老白和朱攀进行商量，得知他们也特别想建立一个这样的小组后，便与其他组员一起订立了特别严格的小组章程，吸纳志同道合的人，自己的小组也变得越来越健康。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/97/97644e058a283decd7927d812595839b.jpeg\" /></p><p></p><p>陈冲认为，小组里的成员要一起走很长时间，要成为彼此下半辈子的朋友。并且这样的朋友，对于陈冲自己和其他组员都是特别需要的。因为他所在小组的大部分组员是 CEO，在创业路上很孤独，有些事情是对客户、同事、家人都不能聊的。而 TGO 鲲鹏会小组的出现，对于像陈冲这样的科技领导者而言就是一个安全而又温暖的港湾。</p><p></p><p></p><h1>充分信任秘诀：全情投入 敞开心扉</h1><p></p><p></p><p>全情投入和敞开心扉的深度交流，是小组组员间实现充分信任的关键。</p><p></p><p>2019 年陈冲等成员重组小组，建立上海二组后，一年组织 12 场活动，组员的平均参与率达到 90% 以上，其中有 5、6 位组员全年活动都不缺席。只有一直在组织、参与小组活动，大家才会把小组的事情放在优先级最高的位置。</p><p></p><p>全情投入的同时，还需彼此敞开心扉进行深度交流。只有把自己心底的事情聊出来，做深度交流，大家的关系才能更进一步。如果每个人说的话，都好像是在面试别人或者跟投资人沟通，大家的关系就会变得比较浅。</p><p></p><p>上海二组大多数成员都是 CEO，交流工作时会把公司里最棘手的问题拿出来谈，在聊生活时也会分享家庭里的快乐或是冲突，经常是一个人的故事引发一群人共鸣。通过敞开心扉的交流，大家建立起更深层的信任。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/bd/bdba3a6d43c8e018b7995b4d4f7593d0.jpeg\" /></p><p></p><p>只有一起扛过枪的兄弟，才会是最好的兄弟。“我们虽然没有一起扛过枪，但是我们交流过很多内心深处的话题。”</p><p></p><p></p><h1>分享感动：两件事情印象最为深刻</h1><p></p><p></p><p>过年的时候，通常只有亲戚才会来家里做客。2020 年春节，上海二组的组员到陈冲家里拜年，这件事令他特别难忘。“我们的关系已经上升了一个 Level，也一定是关系已经好到一定程度才会这样做。”</p><p></p><p>还有一件事情令他难忘。上海二组有三位组员特别喜欢发表自己的意见，其中就包括陈冲，今年上海疫情期间，他的一些看法与另外两位组员不太一致，就在群里发生了一些激烈的争论，不过后来大家都冷静了下来。陈冲觉得之所以能这么争论，是因为大家的关系特别好，才能这样吵而不散。</p><p></p><p>如果大家关系不好的话，第一是不会争论到那种程度，第二是过了一段时间大家就会觉得价值观不同，关系逐渐变淡。</p><p></p><p>而发生在上海二组的这场争论，不仅没有让大家疏远，彼此关系反而又上了一个台阶。这次事件让他们知道，即使一些观点不同，相互之间也能求同存异，一起继续往前走，线下见面时继续饮酒谈笑，交流自己心底的事。</p><p></p><p></p><h1>成为“连接者”：让 1+1&gt;2</h1><p></p><p></p><p>陈冲的职业生涯一直在做乙方，天然的就具有帮甲方解决问题的意愿和能力，得到甲方认可并获得信任，会让陈冲特别开心。</p><p></p><p>因此，无论是在 TGO 鲲鹏会还是在工作生活中，陈冲都经常扮演一名“连接者”的角色。比如，帮助 TGO 小伙伴找免费或接近免费的办公室，帮助他人做创业上的业务对接、找投资人，或是小孩上学之类的很多事情。</p><p></p><p>成为“连接者”，让陈冲从中获得巨大的满足感和成就感。“帮助遇到问题的人，或者帮助两个在寻找机会的人，由于我对他们的信任传递，让合作变为可能，最终产生 1+1&gt;2 的效果，我会认为自己在这个世界上有了更大的作用。”</p><p></p><p></p><h1>上海足球队：从抗拒到享受乐趣</h1><p></p><p></p><p>陈冲最开始对组建上海足球队是抗拒的，因为大家都已经很久没踢球了，每周的比赛会很难凑齐人；不过后来陈冲也想到积极的一面，就算只有 3-5 位学员来踢球的话，大家也可以互相熟识，进而产生一些火花。TGO 鲲鹏会上海足球队就在这样的背景下成立了。</p><p></p><p>第一次组织足球比赛，算上陈冲，TGO 鲲鹏会学员一共才只来 3 人。因为至少要凑齐 10 人才能开赛，陈冲又从身边的朋友里拉来了 9 个人，顺利完成第一场足球比赛。</p><p></p><p>第一场比赛之后，陈冲就想组织第二场、第三场。喜欢迎难而上、不轻言放弃的他，想看看 TGO 上海足球队到底能搞成什么样子。后来随着报名参加比赛的人越来越多，足球队活动的频率也大大增加，学员们的积极性日渐高涨。</p><p></p><p>“一些两年没踢球的人，现在都可以每周参加足球队的比赛。”踢球不仅让大家结识更多 TGO 学员，还可以锻炼身体、收获快乐，组建足球队给陈冲带来了很多正面反馈。</p><p></p><p>TGO 鲲鹏会也是一个“拍照组织”，每次比赛结束后都需要大合影。为了更好的体现球队的专业范儿并将拍照仪式感拉满，疫情期间赋闲在家的陈冲，就在 TGO 上海的群里发了球衣赞助邀请，立刻就有三家企业响应，最后上海足球队的球衣赞助在不到 13 分钟的时间里就敲定了。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/47/473da6630861bf615f440755ef5cf2b6.png\" /></p><p></p><p>大家有了球衣后都非常开心，提高了球队的认同感，参加比赛的积极性也更加高涨。大家赛前、赛后发的朋友圈，不仅让 TGO 上海足球队更具影响力，也让赞助商的品牌得到了很好的展示。</p><p></p><p></p><h1>未来展望：让陪伴很长 让链接更深</h1><p></p><p></p><p>TGO 鲲鹏会作为科技领导者同侪学习社区，陈冲希望在未来的很长一段时间里，学员都能在组织内学到很多知识。为此 TGO 鲲鹏会（上海）每个月都会组织一些学习活动，确保大家能收获一些新认知或新知识。</p><p></p><p>人与人之间的连接是社区的另外一大功能。陈冲现在会花更多时间在学员的连接上，除了学习活动外，TGO 鲲鹏会（上海）还会经常组织足球赛、博弈论、飞盘等休闲娱乐活动。“我通过更积极、更有规律地去组织各类型活动，让大家可以更好地彼此认识、连接与相互成就。”</p><p></p><p>陈冲坚信，TGO 鲲鹏会是一个投入越多收获越多的地方。他希望所有的学员都能更多地投入到 TGO 组织的活动中，更多地投入到自己小组活动中，不论是学习活动还是休闲活动。一两年之后，大家就会在潜移默化中收获很多东西，包括学到知识、听到经验分享、结识到更多优秀的人。</p><p></p><p>陈冲所在的上海二组，愿景是“成为东半球影响人数最多的 TGO 小组”。不仅要实现学员间、学员与外部间的深度链接，而且他也特别希望“TGO 鲲鹏会现在所有的运营人员，也能一直陪大家走很远！”</p>",
    "publish_time": "2022-11-02 10:14:28",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "端云协同，打造万物智能化新未来",
    "url": "https://www.infoq.cn/article/JZw9tHzimGleWBq65lN6",
    "summary": "<p>近年来，云计算、大数据、人工智能等技术的高速发展对社会生产生活带来愈加深刻的影响。数量和规模快速增长的数据中心，拥有庞大算力和海量存储的集群，每天都在为各行各业运行类型繁多的服务和应用并创造惊人的价值。</p><p>&nbsp;</p><p>另一方面，移动互联网的全面普及极大推动了智能终端的进步。今天接入移动网络的智能终端数以十亿计，未来甚至可能达到千亿量级。虽然这些终端承载的应用日趋复杂，但受限于设备尺寸、能耗与成本等因素，其本地算力、存储空间并不能无限提升，以至于成为应用体验持续提升的瓶颈。</p><p>&nbsp;</p><p>面对这样的矛盾，行业意识到充分利用云端能力的优势赋能终端，打造端云协同的一体化服务才是最终实现万物智能化未来的解决之道。现如今，端云协同已经成为开发社区竞相研究的前沿技术方向，OPPO 也在积极探索端云一体，并帮助开发者在该领域快速成长。10 月 29 日举办的主题为“云无界、端无边”的 2022 OGeek 技术峰会便是 OPPO 为关注端云协同技术的开发者打造的一个交流平台。</p><p>&nbsp;</p><p>“OGeek Day”是由 OPPO 数智工程系统主办的行业技术沙龙品牌，旨在为技术爱好者搭建一个技术交流和分享的开放平台。沙龙主要围绕“科技为人、以善天下”的品牌使命，聚焦于为智能终端提供安全高效的数据、算力、算法、云服务方面的前沿技术，打造技术互动的行业生态，探索技术在行业应用的实践、突破及未来发展方向。2022 年 10 月 29 日、30 日，2022 OGeek 技术峰会在 InfoQ 视频号进行直播，与各位开发者一起探讨音视频、云渲染、AIoT、一站式应用开发等热门技术的演进方向，共建端云协同生态。</p><p>&nbsp;</p><p><a href=\"https://www.infoq.cn/video/JoHS1jkJfkQPM6f9xoDR\">2022 OGeek 技术峰会的主论坛</a>\"特别邀请到了来自 OPPO、英特尔、阿里云、亚马逊云科技的多位专家，为大家描绘了一幅美好的“端云协同”技术蓝图。以下为精华内容整理：</p><p></p><h2>一、端云智能协同，守望万物互融未来</h2><p></p><p>&nbsp;</p><p>在端云协同的语境中，终端厂商扮演着非常重要的角色。那么终端厂商该如何发挥云计算的作用，又该如何看待云与终端的关系，充分利用云的能力为终端赋能？OPPO 云计算中心总经理鲍永成为我们解答了这个问题。</p><p>&nbsp;</p><p>在打造端云协同生态的道路上，OPPO 首先发力智能云建设方向。OPPO 为实施全球化战略，更好地服务全球亿级活跃用户，需要打造遍布各洲的云基础设施，实现高效率的资源交付、业务部署并保障业务高质量运行。</p><p>&nbsp;</p><p>如今，OPPO 智能云服务于搜索、软件商店、游戏、金融、电商等互联网业务，以及芯片、IoT等领域，月活用户突破 5 亿，数据规模超过 EB 级别。在智能云建设过程中，OPPO 团队打造了高并发、高可靠、高扩展性的全球混合云，拥有了从底层的计算存储网络到中间件、数据库、接入层、智能运维的完整的云服务体系，实现了云、大数据和人工智能的融合。在全球混合云平台的基础上，OPPO 开始打造端云协同的新一代智能云，突破云端与终端原有的交互模式，实现无边界、一体化的端云融合。</p><p>&nbsp;</p><p>新一代 OPPO 智能云包含实时通信、云渲染、端云智能大脑、端云存储和 IoT 平台几大核心技术底座，使智能云成为终端的算力、存储和互联平台。基于这样的平台，OPPO 能够为用户提供大量创新性的服务，例如云端相册视频实时播放、云游戏一点即玩、基于实时云渲染的超写实数字人、 3D云创作、虚拟现实的泛终端服务等，满足用户日益增长的工作、娱乐需求。</p><p>&nbsp;</p><p>OPPO 智能云正在向更贴近终端的方向持续演进，OPPO 将以泛终端智能云为无处不在的元终端提供多样化、个性化、智能化的服务，实现端云协同、万物互融的愿景。</p><p>&nbsp;</p><p>相比终端厂商，云计算厂商更关注云“创新业务”的技术探索。比如阿里云目前非常重视边缘云的创新业务探索与端云一体技术的研究，阿里云还同<a href=\"https://www.infoq.cn/article/HHPHzeKSlWI5vW8U3kpD\"> OPPO </a>\"展开了紧密合作，共同打造端云协同的产品化落地方案。</p><p>&nbsp;</p><p>随着 5G 和新技术相关产业的发展和演进，越来越多的业务场景从中心云下沉到边缘云，或者从终端上移到边缘云。边缘云能够为客户实现成本下降、用户体验提升和业务革新的价值。在本届峰会的主论坛上，阿里云智能边缘云产品负责人佘俊泉解析了阿里云在该领域的实践：</p><p>&nbsp;</p><p>阿里云边缘云矩阵由 CDN 和 ENS 两大产品线组成。其中，边缘应用托管服务 ENS 是 IaaS 产品形态，发展四年来先后定义和统一了边缘云标准、完成了全国省市的全域节点覆盖，并规模落地了众多场景方案。阿里云边缘云采用统一的轻量化产品技术架构提供了计算、网络、存储、安全、中间件的产品能力，构建了 IaaS+PaaS 的边缘云组合产品矩阵。在端云协同场景中，阿里云边缘云主要能够为客户提供三大差异化价值：</p><p>突破终端的兼容性、性能等限制，达成业务降本提效目标；分布式部署和调度，通过海量边缘云节点极大提升终端用户体验；将流量分发和互动控制在边缘，有效降低带宽成本。</p><p>&nbsp;</p><p>在具体实践中，阿里云边缘云在云化机顶盒、云游戏和云渲染场景中都发挥了预期的作用。云化机顶盒方案帮助用户节省了机顶盒更新换代的成本，云游戏方案有效降低了大型 3D 手游的硬件运行门槛，云渲染方案则在淘宝“造物节”帮助手淘用户获得了实时虚拟互动的体验。此外，阿里云边缘云在交通、公共事业、新零售等领域也在不断挖掘应用场景，推动各行业架构升级。阿里云还与 OPPO 合作，成为了“云端一体”战略共生合作伙伴，在元宇宙时代加速走向虚实共生的数字化新纪元。</p><p>&nbsp;</p><p></p><h2>二、“硬件创新”将引领云计算的未来</h2><p></p><p>&nbsp;</p><p>云计算技术的发展与硬件技术的持续创新是分不开的。随着物联网、边缘计算的普及和端云协同理念的推广，行业对底层硬件技术提出了更高的需求。本届峰会主论坛上，以英特尔为代表的多家硬件厂商从硬件研发和创新的角度展望了未来云计算产业的底层演进路径。</p><p>&nbsp;</p><p>在端云协同的大环境中，分布式计算资源非常普遍，大量数据需要在边缘生成和处理。与此同时，异构计算的需求增长需要更多样化的处理器与加速器组合。面对这样的需求，英特尔做了许多技术探索，并取得了战略性技术突破，英特尔中国区云与行业解决方案集团互联网行业总经理胡凯对于英特尔在该领域提出的解决方案做了详细介绍，他提到，“英特尔不仅在继续发展至强、酷睿、凌动等处理器产品线，还提供了 GPU、IPU 等专用加速器”。</p><p>&nbsp;</p><p>随着全球对降低碳排放、减少碳足迹的目标逐渐形成共识，数据中心是碳排放的重要源头之一，为减少云计算产业的碳足迹，硬件厂商需要持续创新来提升服务器集群的能耗比。英特尔的新一代处理器都采用了更先进的制造工艺与一系列节能技术来节约电力、提升运行效率，英特尔公司还与合作伙伴共同研发了数据中心的液冷方案和行业标准。</p><p>&nbsp;</p><p>另外，在云计算场景中，安全性是尤为重要的课题。大量用户的个人数据、知识产权、商业信息存储在云端，任何信息泄露或恶意使用事件都会造成灾难性后果。与此同时，大规模数据中心非常重视稳定性、可管理性与可维护性指标，需要尽可能减少运维成本和服务器离线时间。对此，英特尔公司开发了 SGS 安全指令技术来加密敏感数据，并通过服务器能效管理、智能健康检测、智能问题发现与分析等手段保障云端集群可用性。</p><p>&nbsp;</p><p><img src=\"https://static001.infoq.cn/resource/image/8a/2d/8a7f753d37709448955e6d4a1e2a0d2d.png\" /></p><p></p><p>在本届峰会主论坛上，亚马逊云科技首席架构师费良宏介绍了亚马逊云科技的软硬一体解决方案 Nitro System，通过定制的加密芯片、专为云计算构建的虚拟机管理程序、专用 SSD 与板卡等手段结合运用，打造了新一代云计算服务器平台。Nitro System 可以简化集群管理难度、提升存储容量、减少网络延迟和抖动、提供安全可靠的服务器运行环境，进而满足客户对安全性、可维护性、可用性的更高需求。</p><p>&nbsp;</p><p>此外，亚马逊云科技升级了自主的 Graviton 处理器，涵盖了常见的 CPU 负载实例，最新的 Graviton 3 处理器在性能和性价比方面都有明显优势。还针对机器学习的推理和训练需求研发了 inferentia 与 trainium 加速芯片，在实践中体现出了显著的能耗比优势。</p><p>&nbsp;</p><p>总体来看，硬件产品如今已经广泛应用在了云端基础设施与边缘计算场景中，并在制造业、零售企业、金融行业等领域构建了大量智能解决方案。其中，人工智能芯片产品为端云协同的 AI 应用提供了强大的算力支持，配套的软件环境也为开发者创造了门槛更低的开发环境。</p><p>&nbsp;</p><p>未来的云计算需要更高的速度、更好的安全性与更突出的性价比，这也是英特尔等厂商持续为云产业量身定制软硬件、不断迭代进化的动力源泉。</p><p></p><p></p><h2>三、\"音视频+”是端云协同实践的主战场</h2><p></p><p>&nbsp;</p><p>音视频是互联网内容和流量的主要载体。随着网络通信技术的发展，互联网音视频的存在形式也出现了根本变化。本届技术峰会主论坛上，OPPO 音视频技术总监郑晓川为我们解读了端云协同新形势下，互联网实时音视频技术的发展图景，介绍了 OPPO 实时音视频平台 ORTC 的概况，并展望了未来实时音视频的繁荣生态。</p><p>&nbsp;</p><p>3G、4G 时代，音视频应用以直播、点播为主，终端单纯接收内容。后 4G 时代及 5G 技术成熟后，音视频应用向实时音视频形式迭代，出现用户创作内容、多端互联互动、端云实时互动等特点。</p><p>&nbsp;</p><p><img src=\"https://static001.infoq.cn/resource/image/ce/17/ce4542aeeb17ea06a9487305d37ebb17.png\" /></p><p></p><p>未来，实时音视频互动将在社交娱乐、互动游戏、企业通讯、医疗、教育、金融和元宇宙等方向激发巨大市场潜力。</p><p>&nbsp;</p><p><a href=\"https://www.infoq.cn/article/vkHROQzRXNkX5uooNGgl\">OPPO</a>\" 对实时音视频技术非常重视，并建设了 ORTC 平台。早期的 ORTC 是为了满足 OPPO 手机之间的屏幕共享与远程操作需求而生，这也是 ORTC 的初代架构。第一代架构基于开源的 WebRTC 框架构建，深度整合大量自研技术，实现了 99.9% 的接通率、60% 的穿透成功率、200ms 以内的延时。在此基础上，ORTC 2.0 通过 SFU+MCU 的架构打造了端边云一体的平台，实现了全球范围的服务覆盖和稳定的服务质量。</p><p>&nbsp;</p><p>在 ORTC 平台建设过程中，OPPO 注意到行业新兴的虚拟场景对端云协同的需求日益增长。ORTC充分利用云端算力弥补终端性能不足的缺陷，通过实时云渲染技术将计算卸载到云端，并通过 ORTC 的超低延时串流在终端呈现内容，为用户提供高精度的虚拟场景。OPPO 将 ORTC 升级为端云协同的实时云渲染平台，从而满足云手机、云游戏等场景的需求。</p><p>&nbsp;</p><p><img src=\"https://static001.infoq.cn/resource/image/c0/65/c0c1fa2cb4464980343yy2cace2ef565.png\" /></p><p>图：ORTC平台能力全景</p><p>&nbsp;</p><p>ORTC 平台分为最底层的 IaaS 基础资源层、中间的 CPaaS 平台能力层与上层的多场景解决方案。平台覆盖了音频质量保障、AI 降噪、高并发、低延时等基础能力，加入了会议录制、白板协作、多端接入等场景能力，进一步扩展了捏脸换装、虚拟人空间库等元宇宙能力。</p><p>&nbsp;</p><p>未来，ORTC 平台将会在智能家居、远程医疗、数字孪生、云端虚拟空间、CloudXR 等业务场景探索落地可能性。平台将进一步强化边缘计算、GPU 虚拟化、分布式渲染、低延时传播等能力，为上述场景构建技术底座。</p><p>&nbsp;</p><p></p><h2>四、从“IoT 平台技术架构演进”看端云协同</h2><p></p><p>&nbsp;</p><p>据相关机构预测，2026 年全球 IoT 市场规模将从目前的 6000 亿美元增长到 1.1 万亿美元，设备总量也将从 250 亿增长到 400 亿级别。OPPO 作为面向消费者的终端设备企业，对 IoT 市场，尤其是智能家居生态投入了大量资源，打造了自主的 IoT 平台。本届技术峰会主论坛的最后，OPPO 智能物联云技术总监夏舰波带来了这一主题的深度解析。</p><p>&nbsp;</p><p>2021 年，全球智能家居产品出货量近 9 亿部，国内市场约 2.2 亿。虽然市场容量巨大，但国内头部厂商竞争颇为激烈，各厂商都开发了私有协议，不同厂商之间的产品难以互联互通，形成了各自封闭的生态孤岛。在这样的环境中，用户购买来自不同厂家的智能家居产品就需要安装多个 APP 进行控制，用户体验极为割裂。</p><p>&nbsp;</p><p>面对这样的现状，OPPO 从 2018 年开始打造一个开放的 IoT 平台，希望能够为开发者赋能，有效连接来自不同厂商的设备和应用，实现设备间的互联互通，为用户提供智美生活的体验。 OPPO 总结了国外三大巨头的 IoT 架构经验，定义了 IoT 平台的几大核心能力：设备（连接）管理+数据管理+应用使能+云云服务。</p><p>&nbsp;</p><p>值得一提的是，OPPO IoT 平台发展伊始就抱持着开放的心态与其他厂家展开合作。具体的合作过程分为云云合作、生态选品、开放赋能和智慧服务几个阶段。在“云云合作”阶段，OPPO 与 IoT 厂家共同制定互联协议，并提供低代码模型与 UI 工作台以方便开发者打造应用。</p><p>&nbsp;</p><p><img src=\"https://static001.infoq.cn/resource/image/93/a3/9336629faf295d1edc9773e27cfc4ca3.png\" /></p><p></p><p>随着云云合作的推进，OPPO 开始转向生态选品方向，围绕安全守护、智能照明等五大场景重点构建智美生活体验。OPPO 精心打磨了 HeyThings IoT 平台，极大提升了用户体验。</p><p>&nbsp;</p><p>紧接着，OPPO 开始重点攻关开放赋能方向，将 IoT 平台转向云端，面向外部厂家提供开放服务，吸引更多中小厂家参与生态建设。为此，OPPO 构建了一站式 IoT 开发服务云平台，重点打磨了 MQTT Broker、设备引擎与规则引擎三大核心组件。据悉，明年起，OPPO 将继续在IoT领域发力，力求打造更出色的IoT平台。</p><p>&nbsp;</p><p></p><h2>五、写在最后</h2><p></p><p>&nbsp;</p><p>本届 OGeek 技术峰会主论坛上，多位技术专家从多个视角解读了端云协同的技术趋势，展望了万物互联、互融、互通的美好未来。通过他们的分享，我们可以预见，在各大厂商的共同努力下，我们将拥有更美好的智慧生活体验。</p><p></p><p></p><h2>本场直播评论区互动精华</h2><p></p><p></p><h5>Q：大量用户数据、商业信息都存储在云端，信息泄露问题，从硬件层面有什么解决方案吗？</h5><p></p><p>&nbsp;英特尔中国区云与行业解决方案集团互联网行业总经理胡凯：可以用机密计算在数据进行运算的过程中始终保持数据的安全性，隐私性和完整性。机密计算通过在硬件中创建了一块可信环境的计算空间，提升了计算的安全性。英特尔通过在硬件中提供的 Secure Guard&nbsp; Extensions，即 SGX，达成了机密计算的要求。英特尔为了解决数据运行时加密问题，在 CPU 层面提供了 SGX 对加密运行环境支持，也就是说通过 SGX 在硬件层面提供了一个加密运行环境，电脑上任何软件，甚至操作系统，都触碰不到可信环境里面的明文内容。所以我们就可以放心地把想要运算的机密内容在这块可信环境里面做明文计算，这样做的优势是速度比较快，同时还能够保证运行在可信环境里的所有数据的安全性，可以保证云端用户数据和商业信息的安全。</p><p>&nbsp;</p><p>亚马逊云科技首席架构师费良宏：数据安全从来不是一个孤立的问题，不要假设存在一种简单的办法就能够达成数据安全的目的。解决数据安全需要从平台、软件、硬件、架构、网络、存储等全方位入手才有可能满足我们对安全越来越高的要求。至于通过硬件层面实现这个目标，一个潜在的答案是机密计算。例如，我们可以将数据隔离在服务器内存的加密部分中，以确保它不能被访问或篡改。其典型的使用场景就是同态加密，使用加密数据执行复杂处理的。Amazon 的 Nitro Enclaves 就是其中的一个有效的解决方案，这意味着对数据操作可以从本地转移到云端完成诸如多方计算，处理高度敏感数据的任务。今天的机密计算倾向于公有云，但同时也存在多样化的需求，例如公有云、混合和私有云的部署等。任何级别的安全都需要相对应的成本，选择成熟且经济有效的技术方案是实现数据安全的重要环节。</p><p></p><h5>Q：ORTC 平台从多终端、跨场景方面有哪些技术突破?</h5><p></p><p>OPPO 音视频技术总监郑晓川：ORTC 平台作为 OPPO 实时互动平台，诞生的第一天就致力于多终端互联互通、助力业务多场景融合互动。在技术上，作为端端互联端云互通的桥梁，首先，ORTC 构建了覆盖全球的实时网络，实现全球终端/业务就近接入，端到端时延低于 200ms；其次，ORTC 的实时网络具备完整强大的分段 QoS 机制，在上行、中转、下行、接入等各个服务链路段注入自研的 FEC、RED、动态 Nack、Pacher 等抗弱网技术，保障了全链路 70% 抗丢包、1000ms 抗抖动能力。最后，ORTC 覆盖了几乎所有的软件操作系统和硬件设备的接入 SDK，并做到了轻量化，SDK包括 安卓、iOS、C/C++、JS、Flutter、Electron、RTOS、Unity、Unreal 等等，并支持多人音视频、屏幕共享、互动白板、实时云渲染、富文本远场传输等能力，给业务插上业务场景创新的翅膀。</p><p></p><h5>Q：OPPO 与 IoT 厂家一起制定了哪些互联协议？可以仔细讲讲吗？</h5><p></p><p>&nbsp;OPPO 智能物联云技术总监夏舰波：OPPO 和美的、VIVO 一起制定了 Heythings 云云对接协议，在此基础上我们扩展支持了海信、中移动、创维、奥克斯等 IoT 厂商的设备。通过云云对接的方式，OPPO 手机可以操控更多智能家居。同时 OPPO 是 CSA 联盟和 OLA 联盟的重要成员，积极参与 matter 标准和 OLA 标准智能家居协议的制定和推进。ColorOS 13开始支持了 matter 设备的发现和操控。</p>",
    "publish_time": "2022-11-02 12:23:53",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "降本增效的当下，究竟如何定义“一站式企业应用开发平台”？",
    "url": "https://www.infoq.cn/article/SpBOGrQXJdZQSpOK8eAF",
    "summary": "<p>企业使用应用开发平台，主要诉求是提升移动研发效能，提高协作效率。但在具体实践中，不同的企业、业务线和产品之间的需求都存在着巨大差异，很多开发者称，“很难有一个平台或工具能适配所有场景、解决所有问题。”</p><p>&nbsp;</p><p>该如何解决打破这一僵局，真正打造一站式的企业应用开发平台？</p><p>&nbsp;</p><p>针对这一主题，近日举办的 2022 OGeek 技术峰会设置了<a href=\"https://www.infoq.cn/video/kgry88KKKTYvKfcPVsXJ\">“重新定义'一站式应用开发'”专场</a>\"。本专场邀请到了 OPPO 移动研发平台负责人麦峰强、蚂蚁集团无线开发工程师王磊、OPPO 云测设备开放服务平台负责人杨建波三位技术专家，他们与各位开发者们共同探讨了“一站式”应用开发平台的定义、现状、价值和未来技术演进。</p><p>&nbsp;</p><p>值得一提的是，“OGeek Day”是由 OPPO 数智工程系统主办的行业技术沙龙品牌，旨在为技术爱好者搭建一个技术交流和分享的开放平台。沙龙主要围绕“科技为人、以善天下”的品牌使命，聚焦于为智能终端提供安全高效的数据、算力、算法、云服务方面的前沿技术，打造技术互动的行业生态，探索技术在行业应用的实践、突破及未来发展方向。2022 年 10 月 29 日、30 日，2022 OGeek 技术峰会在 InfoQ 视频号进行了直播，本届峰会以“云无界、端无边”为主题，与各位开发者一起探讨音视频、云渲染、AIoT、一站式应用开发等热门技术的演进方向，共建端云协同生态。</p><p>&nbsp;</p><p>以下为“重新定义'一站式应用开发'”专场精彩内容回顾：</p><p>&nbsp;</p><p></p><h2>一、OPPO 移动研发平台实践</h2><p></p><p>&nbsp;</p><p>一站式移动应用研发平台能够显著提升开发效率、降低开发成本和运维难度。OPPO 在建设移动研发平台的过程中积累了丰富经验，OPPO 移动开发平台负责人麦峰强在本专场中带来了相关内容的分享。</p><p>&nbsp;</p><p>典型的移动应用开发平台分为研发基础设施和 DevOps 两大部分。研发基础设施一般是指开发中间件，亦即 SDK，可以为研发工作提供技术能力；基础设施分为开发框架、技术组件和工具链三部分；移动 DevOps，包含流程、监测等配套设施。移动 DevOps 与基础设施共同组成了移动应用研发平台。</p><p>&nbsp;</p><p>在一站式应用开发平台诞生之前，企业内部各团队的开发工作往往是各自为战的，这种局面也存在诸多弊端。OPPO 在开发移动应用的过程中就主要遇到了四大痛点：</p><p>&nbsp;</p><p>资源复用率低下。主要指公共、通用的技术能力复用率低下，人力重复投入。项目管理困难。项目间依赖关系很难查找，人工维护成本较高。移动开发低效。团队技术选型缺乏参考，重复投入的技术难以沉淀。产品运营分散。开发团队需对接多个平台，不同平台数据口径不一致。</p><p>&nbsp;</p><p>为解决上述问题，<a href=\"https://www.infoq.cn/article/yGfFSW7sPVRCIoKOkXiD\">OPPO </a>\"开始建设自己的一站式应用开发平台。但全新的平台体系建设并非一日之功，麦峰强将 OPPO 的实践划分经历分成了四个阶段：</p><p>青铜阶段：建设丰富 SDK 并保障安全性；白银阶段：建设 SDK 市场并建立规范；黄金阶段：开发 SDK 套件和流水线，提供一站式集成方案；铂金阶段：将移动研发平台扩展到更多领域。</p><p>&nbsp;</p><p>在青铜阶段，OPPO 面临的主要问题是各开发团队都有自己独立维护的框架和公共组件，组件安全问题也多种多样。为此平台建设团队对所有中间件做了统一梳理和规范。建设整体平台的同时，团队也对 SDK 的安全性做了相应改进和模块化、规范化建设。其中，SDK 安全性改进主要分为服务端和云服务两大维度，分别从身份鉴别、访问控制与存储安全、网络传输安全等层面进行优化和改进。</p><p>&nbsp;</p><p>在此基础上，团队以 BaaS 服务的形式形成了整体的平台架构：</p><p>&nbsp;</p><p><img src=\"https://static001.infoq.cn/resource/image/a6/75/a688e0b29dc0c88890cd6eb7a5fc5a75.png\" /></p><p></p><p>青铜阶段的工作完成后，OPPO 在实践中又发现了一些问题。一方面，虽然 SDK 很多，但开发团队经常不知道如何查找或怎样选型；另一方面，很多 SDK 版本混乱，开发团队不知道如何分辨新版本、有问题版本等。最后，大部分 SDK 缺乏文档，使用门槛很高。针对这些问题，平台建设团队开始了白银阶段的改进。</p><p>&nbsp;</p><p>白银阶段的建设思路是形成一个 SDK 市场，其作用首先是对 SDK 和 APP 建立统一的管理关系，方便搜索了解 SDK；其次是对所有 SDK 进行安全和各方面能力的排名监控。在这样的市场中进一步建立了 SDK 的整体规范，从而保证 SDK 的开发质量。此外，因为 SDK 数量增多，所以平台加入了鉴权系统来避免非法接入后端云服务，同时加入配额计费能力来完善基础设施。这一阶段的工作大大方便了开发团队的日常使用，获得了很好的反馈。</p><p>&nbsp;</p><p>但白银阶段结束后，平台建设团队又遇到了一些新问题。首先是缺框架，由于大型 APP 往往集成多个 SDK，没有统一框架意味着整体管控很困难；其次是缺触点，开发工具（如 Android Studio）与平台能力存在割裂，并非一站式架构；第三个问题是缺少 DevOps 流程，很多 SDK 之间的依赖冲突难以解决；最后，移动开发人员在工作中仍需在多个平台间切换，缺少统一的集成系统。由此进入了黄金阶段的改进工作。</p><p>&nbsp;</p><p>针对框架需求，一个很好的思路是对 SDK 做插件化处理。建设团队参考了很多业界产品进行对比分析，最终选定了谷歌提供的 AAB 方案作为底层框架，基于爱奇艺开源的 Qigsaw 进行二次开发，形成了整体方案。其中，SDK 开发框架的进程架构以 SDK core 为核心，采用了进程隔离设计。SDK 插件通过 SDK core 这一进程进入 App，SDK 插件分为动态和静态两类，其中动态加载的插件又分为四个层面：</p><p>&nbsp;</p><p><img src=\"https://static001.infoq.cn/resource/image/72/db/72ee43520886b6c647af91fc82d19bdb.png\" /></p><p></p><p>其中 provider 情况特殊，需要单独处理。结合上述设计，团队最终形成了 SDK 的整体开发框架。</p><p>&nbsp;</p><p>针对缺少触点的问题，团队建设了一个 SDK 开发工具链，实现了云调试、云测试和一键上架，可以为开发者提供很多技术服务支持。此外，<a href=\"https://www.infoq.cn/article/h2r7qLMM8QbykrUUmGaB\">OPPO</a>\" 还制定了一套包含 14 步骤的移动 DevOps 建研发流程，覆盖了从代码编写到 SDK、APP 部署和升级的完整过程。</p><p>&nbsp;</p><p>综合上述所有能力，OPPO 最终建成了一个统一的一站式开发套件：</p><p>&nbsp;</p><p><img src=\"https://static001.infoq.cn/resource/image/b3/1a/b33695744c040c7ab324d531c87cb31a.png\" /></p><p></p><p>一站式应用开发平台上线后在 OPPO 内部取得了令人满意的成效。但麦峰强表示，平台团队并不想就此止步，而是将眼光放到了未来的更广阔天地。目前，开发平台只服务到了安卓、iOS 及部分 IoT 平台。但随着 XR 探索在行业内的快速发展，麦峰强提到团队希望能将开发平台进一步扩展到 XR 领域，建设 XR 开发的完整能力，满足 AR/VR 领域中虚拟实景游戏、VR 健身、VR 会议、数字虚拟人等诸多场景的应用开发需求。为此，团队会针对 XR 领域的各类需求建设更多对应的 SDK，为公司的开发团队提供丰富的技术选项。</p><p>&nbsp;</p><p></p><h2>二、支付宝：基于场景沉淀的移动端技术架构演进</h2><p></p><p>&nbsp;</p><p>本专场中，蚂蚁集团 mPaaS 无线开发工程师刺胃（花名）为开发者们介绍了支付宝近年来基于线上线下场景沉淀的技术架构演进历程。</p><p>&nbsp;</p><p>2021 年之前，支付宝经历了十多年的高速发展，从余额宝开始，到主打线下，再然后入了小程序开放平台。这一阶段中，支付宝的用户规模、代码规模等指标都经历了爆发式增长。2021 年至今，支付宝主要的业务包括个性化、智能化首页场景，内容 Feed 流和互动渲染场景。每一个应用场景都有相应的技术组合及业务类型，所有场景背后的技术架构共同构成了支付宝今天的技术体系。</p><p>&nbsp;</p><p>过去几年来，支付宝移动端基础架构层面的主要挑战是从单体架构转向模块化架构，为上层场景化应用打造牢固基础。为此引入了支付宝独有的插件化架构，实现了完全插件化设计，性能和构建速度位于优秀水平。这一架构与蚂蚁的一站式研发平台结合，可以大幅提升场景模块的研发速度，为支付宝的场景化策略提供了技术保障。</p><p>&nbsp;</p><p>解决了基础架构问题，线下体验就成为了下一个攻关要点。为了提升下沉市场的用户线下体验支付宝做了很多工作，包括启动优化、稳定性提升、功能开启优化等。用户体验得到提升后，支付宝就可以进一步引入大规模的改进和升级了。</p><p>&nbsp;</p><p>2018 年支付宝引入小程序，核心目标就是要做开放场景，引入各领域的开发者丰富支付宝的场景生态。小程序引入后大大减缓了 App 安装包的体积增速，而支付宝针对小程序的隔离设计保障了安全隐私水平。小程序基于开放场景的架构中，底层是蚂蚁集团的小程序统一标准，小程序容器层则分为三大核心组件。对于开发者来说，开发小程序时需要考虑的主要内容只有容器层、适配层和控制层等，开发门槛相对较低。</p><p>&nbsp;</p><p>基于小程序的能力，开发者创造了很多开放场景，例如小程序+直播做成小程序直播、小程序+音视频做成短视频小程序、小程序+地图做成哈罗单车、小程序+ IM 做成智能客服等等。</p><p>&nbsp;</p><p>在内容场景中，支付宝的内容 Feed 流（Tab3 生活页面）用到了一系列底层能力，如直播能力、多媒体能力。支付宝将长期沉淀的技术能力组成了内容中台，Tab3 页面中的视频、图文和直播都是基于内容中台来推送给内容场景。</p><p>&nbsp;</p><p>每个 APP 都有自己的核心主阵地，主要通过首页来展示。如何最大化地提升首页运营价值，实现首页智能化，是智能营销场景面对的主要挑战。支付宝近年来引入的智能营销技术可以将用户页面打散成许多动态区块，每一个区块都可以对接到后台系统。基于每个页面所处的不同时空、用户个人喜好，结合一些服务端和端侧的计算结果，共同组成了用户看到的页面版面。</p><p>&nbsp;</p><p>智能营销场景使用的核心技术是蚂蚁自研的动态跨端高性能 cube 引擎。该引擎采用流式加载、并行布局、异步绘制等设计大幅提升性能，同时深度优化了包体积，并采用 Native 绘制减少 UI 的初始化损耗。</p><p>&nbsp;</p><p>智能页面在支付宝中有着广泛应用。支付宝可以根据用户喜好和习惯推送相应的内容，每个页面都可以无限下拉，做到一人千面、千人千面的效果。</p><p>&nbsp;</p><p>随着技术发展和用户需求变化，今天的移动用户更注重 App 的体验交互水平，由此产生了互动渲染这一场景需求。在互动渲染场景中，支付宝研发了互动渲染引擎，提供了更强的表现力、更好的适配性、更好的体验与更高效的链路。互动渲染引擎可以为支付宝腰封提供动画效果，或者增强 Banner 的表现力，为弹窗增加互动内容等，像支付宝一些运营活动都是基于互动引擎来展示。互动渲染引擎还包括了 AR 增强现实引擎，如支付宝可以利用该引擎实现 AR 导航。</p><p>&nbsp;</p><p>上述应用场景的建设离不开一站式研发平台的支持。在支付宝的移动研发平台中，终端基础部分的基础安全、基础多媒体、底层运行时、传输网络等共同构建出坚实的地基。在这个地基基础上支付宝研发了很多终端引擎，进而丰富一系列业务场景。平台中的工程体系则用来提升开发效率，实现一键发布。未来，随着元宇宙从概念走向现实，支付宝也将通过一站式研发平台与创新引擎技术，为用户提供全新的体验，开拓更大发展空间。</p><p>&nbsp;</p><p></p><h2>三、OPPO：云测设备开放服务平台的建设实践</h2><p></p><p>&nbsp;</p><p>随着云计算产业的发展，越来越多的移动应用开发者开始使用虚拟云端手机来进行应用的测试工作，从而节约购买大量真机设备的成本，提升开发效率并节省时间。<a href=\"https://www.infoq.cn/article/vkHROQzRXNkX5uooNGgl\">OPPO </a>\"也建设了自己的云端移动应用测试平台，主要为内外部开发团队提供支持。OPPO 设备开放服务平台负责人杨建波就为我们介绍了这一平台的建设实践，让更多开发者可以了解云测设备开放服务平台背后的原理与架构。</p><p>&nbsp;</p><p>云测平台主要指 APP 测试平台，提供远程真机、云手机的测试能力。各个厂商建设的云测平台往往会有一些区别，而 OPPO 的云测平台主要有以下特点：</p><p>&nbsp;</p><p>OPPO 自建真机机房、云手机依托于自建云平台提供手机远程调试能力；基于 OPPO 开放平台提供对外的移动服务，在开发测试阶段提供云测试服务；云测试包括：自动化兼容测试、功能测试、性能测试、稳定性测试；设备开放服务：提供真机、模拟机远程开放能力。</p><p>&nbsp;</p><p>在 OPPO 云测平台的建设初期，由于项目不够完善等原因，平台存在很多问题。首先，早期的 OPPO 云测平台对设备和版本的覆盖率不够，测试项目较少，其主要原因是现有机房真机设备不够完善，设备数量扩展存在瓶颈。平台技术架构也亟待优化，稳定性和设备并发等指标都存在瓶颈。另外，平台给外部开发者（头部开发者或者云测服务商）主要采用线下邮寄的方式提供真机设备，效率低、成本高，安全性低。 平台能力尚有欠缺，自动化测试报告内容较少，且缺乏性能测试项。最后，开发者对平台的兼容/适配工作量也很大，拖累了开发测试效率。</p><p>&nbsp;</p><p>基于上述痛点，OPPO 开发了新一代的云测设备开放服务平台：</p><p>&nbsp;</p><p><img src=\"https://static001.infoq.cn/resource/image/f0/b6/f0b9706d342efa1059ec916b045c63b6.png\" /></p><p></p><p>云测开放平台的产品架构中，自上而下分别是开放平台、平台服务和设备层。技术架构中，上层是 OneOPPO，其中包含了接入层；由接入层接入下方的核心部分。在核心层中，云服务器的公共机通过安卓控制器的 USB 端口与真机连接，并负责管理真机设备信息。公共机的协议转换程序将自身的 IP+ 端口映射到各台手机上。客户通过 ADB Connect 的 IP+ 端口就可以连上真机。云手机则是模拟机方案，采用业界主流的 ARM 服务器虚拟化设计。用户可以远程控制手机操作，安装编译 APK，进行简单测试等。</p><p>&nbsp;</p><p>云测平台对内外部用户都提供开放服务。以外部用户的接入为例，首先手机的连接信息通过 IaaS 层同步到 PaaS 层，后者包含了用户管理、设备管理和监控统计服务。外部客户通过类 API 方式获取手机信息，包括 IP+ 端口、型号等。用户通过标准 ADB 协议连入控制层，控制层通过管理服务和鉴权服务转发 ADB 协议，从而保证安全性。</p><p>&nbsp;</p><p>云端真机利用 SSH 隧道能力，在公网上通过路由层为用户分配私钥，接入控制层。控制层验证私钥，并提供对应手机的权限。为了保证安全性，这里做了很多隔离设计，例如用户不能使用 ADBshare 登录，只能进行 ADB 远程转发到对应手机，用户还需要一个远程Web操作页面来操控手机，为此 OPPO 提供了 ORTC 服务，这样用户可以在 Web 页面上直接操控手机。</p><p>&nbsp;</p><p><img src=\"https://static001.infoq.cn/resource/image/4b/42/4b4dd0250b772861b432b74b0c0d1b42.png\" /></p><p>图：云侧设备开放服务平台-基础设施</p><p>&nbsp;</p><p>如上图中的云真机的基础设施架构所示，每个机柜的每个抽屉都有多台手机。这里的无线路由器需要做无线信号隔离，因此置于屏蔽柜中。公网与机房网络互相隔离以提升安全性。真机通过 USB Hub 连接到公共机，可以使用云端的各类资源。</p><p>&nbsp;</p><p>除了真机外，OPPO 还提供了云手机方案供用户选择。云手机采用业界主流的 ARM 服务器虚拟化方案，主要使用ARM服务器来虚拟化手机的 ColorOS 系统，使用软件来模拟出一部部安卓手机。</p><p>&nbsp;</p><p>虚拟系统的存储部分则采用 OPPO 云平台的云存储能力实现。当用户销毁或重新初始化的手机想保留一部分数据时，云存储服务就可以实现这一需求。虚拟化涉及的容器编排采用 K8s 方案。操作系统采用 Ubuntu，GPU 模拟使用了数据中心级的 GPU 硬件。为了提升安全性，这里也做了很多网络隔离设计。云手机相对于云真机的一大优势是手机销毁、重建较容易，真机系统遭遇崩溃后的升级和重装效率较低。</p><p>&nbsp;</p><p>云监控是云测平台较重要的功能，主要监控物理机、Arm 服务器和容器，以及手机系统的 CPU、内存、存储。IaaS 系统对外呈现手机的资源管理和运维管理。通过完善的云监控体系，云测平台可以为用户提供稳定、安全的服务保障。</p><p>&nbsp;</p><p>云测开放平台建成后，用户可以在 Web 页面中直接操作云手机，并使用 ADB 远程调试功能。平台还提供自动化测试能力，包含功能测试、兼容测试等脚本。测试可以一键执行，结束后向用户提供报告。此外，平台的流水线能力能够在 OPPO 内部应用开发的编译阶段对其进行兼容性测试，极大降低了开发者的工作量。</p><p>&nbsp;</p><p></p><h2>四、写在最后</h2><p></p><p>&nbsp;</p><p>从三位技术大牛在本专场的分享中可以看出，企业建设一站式应用开发平台的收益往往是非常显著的，但平台建设必须充分考虑当下存在的痛点和需求，并进行针对性的架构设计。建设过程也不能一蹴而就，往往需要分阶段推进，迭代优化，才能取得最令人满意的成绩。</p><p></p><p></p><p></p><h2>本场直播评论区互动精华</h2><p></p><p></p><h5>Q：搞不明白为什么现在很多的协同平台，比如 OA，CRM 等，要设计的那么复杂？这不反而降低了效率？</h5><p></p><p>OPPO移动研发平台负责人麦峰强：一个平台的最后呈现是多方面因素综合后的结果，有商业因素，也有使用场景情况，具体要根据产品交付的用户场景来看。我们根据自己需要的场景选择符合自己的即可。</p><p>&nbsp;</p><p>蚂蚁集团无线开发工程师王磊：业务方的需求多，要抽象的能力点就需要更多。因此其实不是平台复杂，而是要根据实际业务的需求，去选择效率高的产品和技术。</p><p></p><p></p><h5>Q：一站式应用开发平台越来越多，是不是可以说明之后低级别的程序员逐渐就要失业了？</h5><p></p><p>OPPO移动研发平台负责人麦峰强：一站式平台是越来越多了，但是仍然无法替代程序员，只是帮程序员减少反复造轮子而已，提高效率。程序员这个职业本身就是一个需要不断学习不断突破的行业，一站式只是解决不必要的重复劳动，程序员该做的事情包括业务、高效代码，原来需要的后面仍然需要，低级别程序员不是被一站式淘汰了而是被时间淘汰了。</p><p>&nbsp;</p><p>蚂蚁集团无线开发工程师王磊：开发平台的变多，说明现在全社会正在进行数字化转型。随着数字化转型的需求增多，各层次的研发人员的需求也会增多的。</p><p>&nbsp;</p><p></p><h5>Q：小企业如果想做自己的一站式应用开发平台，需要具备哪些能力、硬件配置或者其他资源？</h5><p></p><p>OPPO移动研发平台负责人麦峰强：一站式开发平台规模可大可小，就看你们目前公司所处的阶段和碰到的痛点，比如我解决青铜时代就比较简单，封装公共sdk即可，服务器采用公有云即可搭建。自己自建够用即可，如果你要封装成给外部开发人员使用，那配置也要另外考虑了。</p>",
    "publish_time": "2022-11-02 12:24:01",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "从人工智能到应用智能，AIoT 在万物互联时代创造了“新可能”",
    "url": "https://www.infoq.cn/article/YPbD1WQVSdrX9XiBVjcT",
    "summary": "<p>随着5G、人工智能、传感器等技术的演进，世界正在实现万物互融。AI 与 IoT 两种强大技术的结合增加了应用的敏捷性和灵活性。AIoT 的最大优势，就是让“人工智能”走向“应用智能”。</p><p>&nbsp;</p><p>近日举办的 2022 OGeek 技术峰会设置了“AIoT，智联生活新未来”主题专场，OPPO智能视觉云服务研发负责人宋佳洋、亚马逊云科技物联网产品专家蔡裕正、OPPO智能物联架构师陈松三位技术大牛，基于端云协同的实践案例展开了 AIoT 在各场景下技术发展的讨论。</p><p>&nbsp;</p><p>值得一提的是，“OGeek Day”是由OPPO数智工程事业部主办的行业技术沙龙品牌，旨在为技术爱好者搭建一个技术交流和分享的开放平台。沙龙主要围绕“科技为人、以善天下”的品牌使命，聚焦于为智能终端提供安全高效的数据、算力、算法、云服务方面的前沿技术，打造技术互动的行业生态，探索技术在行业应用的实践、突破及未来发展方向。2022年10月29日、30日，OGeek 技术峰会在InfoQ视频号进行直播，本届峰会以“云无界、端无边”为主题，与各位开发者一起探讨音视频、云渲染、AIoT、一站式应用开发等热门技术的演进方向，共建端云协同生态。</p><p>&nbsp;</p><p>以下为<a href=\"https://www.infoq.cn/video/70L35VAv2D57ck1CQ8yP\">“AIoT，智联生活新未来”专场</a>\"的精彩内容回顾：</p><p>&nbsp;</p><p></p><h2>一、OPPO 智能视觉在智能家居中的应用</h2><p></p><p>&nbsp;</p><p>当前市面上的智能视觉家居产品已经有十余种品类，智能视觉技术在智能家居中的重要性与日俱增。于是在本专场中，OPPO 智能视觉云服务后端研发的高级工程师宋佳洋为我们深度解读了 OPPO 智能视觉技术在智能家居中的应用。</p><p>&nbsp;</p><p>在具体技术实践中，企业构建智能家居视觉产品时主要会面临三大挑战。第一，场景化的 AI 需求，像场景化原子 AI 能力的需求点较多、根据不同场景有 AI 的定制化需求等。第二，准实时推理需求日益增长。例如智能车库识别车牌自动开门，陪护机器人监测到老人心肌梗塞后快速送药等，这些需求都需要接近实时的 AI 推理能力。第三，当前的智能视觉产品缺少人与人之间的关联互动及娱乐社交属性，应用场景比较单一狭窄。</p><p>&nbsp;</p><p>针对上述挑战，宋佳洋介绍 OPPO 团队提出了对应的解决思路。首先是针对场景化的 AI 需求：</p><p>&nbsp;</p><p>根据场景化 AI 需求针对性做模型训练，其次利用机器学习平台实现分布式训练和优化。训练出的模型要有一个较好的评测机制。评测完成后要落地应用，对模型做统一封装，提供给各种应用层来接入。我们支持多种协议接入，并采用低代码的思路，根据业务的不同要求定制对应的工作流，最后根据这个工作流与<a href=\"https://www.infoq.cn/article/vkHROQzRXNkX5uooNGgl\"> OPPO </a>\"云函数计算平台结合，实现任意AI原子能力的组合式调用和推理。自动反哺。在整个 AI 应用过程中会有很多边缘场景，需要不断打磨模型，针对边缘场景优化。我们研发了异常数据统一导入和自动标注平台，异常数据导入和标注后模型会自动训练、发布版本，最终通过测试数据集生成评测结果。如果模型确实有优化就能投入实用。这样就实现了场景化AI从训练到应用再持续迭代的成果。</p><p></p><p>其次，针对准实时推理需求，OPPO 打通了 ORTC 服务，实现端侧从触发推流到云通信 200 毫秒的延迟。为提升推理性能，研发团队采用了数据预处理等方法，并对模型本身做更多优化，引入多卡联合优化。团队还利用英特尔 OMP 加速指令改进了暗光增强等场景的性能。</p><p>&nbsp;</p><p>针对智能视觉产品娱乐功能不强的现状，OPPO 推出了智能内容索引及内容创作服务，例如可以使用录制视频中的宠物片段快速生成 Vlog 等。</p><p>&nbsp;</p><p>智能终端设备的能力离不开强大的云服务提供的支持。OPPO 构建了统一的智能视觉云服务，为智能手机、智能电视、AR 眼镜等终端产品解决了算力、场景建设、安全隐私等方面的需求。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/6d/be/6d4bd870d616ab779c868991aeeef7be.png\" /></p><p>图：OPPO 智能视觉云</p><p>&nbsp;</p><p>值得一提的是，针对智能视觉产品，OPPO 还构建了智能摄像头通用解决方案。这套方案可以应用于各种场景，不同场景依赖的原子 AI 能力、联动场景及触发行为各有不同。</p><p>&nbsp;</p><p><img src=\"https://static001.infoq.cn/resource/image/52/dc/52e46483079d5135692102b3917103dc.png\" /></p><p>图：解决方案场景应用</p><p>&nbsp;</p><p>未来，这套智能视觉云服务将在不同的场景下发挥更多作用，例如在全屋智能方面带来更多创造力、在 AR/VR 的手势识别、体感、姿势识别等方面带来更多创新应用，或是通过智能视觉技术更好地呵护老人等。在智能视觉技术的帮助下，<a href=\"https://www.infoq.cn/article/yGfFSW7sPVRCIoKOkXiD\">OPPO </a>\"的智能家居产品也将为用户带来更好的体验。</p><p>&nbsp;</p><p></p><h2>二、亚马逊智能硬件新品“家庭机器人 Astro”背后的技术解密</h2><p></p><p>&nbsp;</p><p>2010 年以来，亚马逊云科技开发了很多仓储机器人、无人送货机器人、智能监控无人机等产品。去年亚马逊云科技推出了服务型机器人 Astro，可以用来监控家庭安全状况、联动控制其他智能家居产品等。亚马逊云科技物联网产品专家蔡裕正在本专场中解读了 Astro 背后的技术。</p><p>&nbsp;</p><p>如今的亚马逊云科技提供了机器学习、物联网、数据湖、数据库、数仓等能力及多达 200 种服务，包括分析服务、管理服务甚至游戏数据库服务，为开发者提供了多样化的技术底座，从而大幅减少上述时间和人力成本。</p><p>&nbsp;</p><p>以智能机器人为例，其背后涵盖了许多服务。例如开发者可以利用 AWS RoboMaker 进行云端模拟仿真，利用 Amazon SageMaker、Amazon Rekognition 实现机器学习需求等。开发者可以像积木一样堆叠或添加所需的功能。</p><p>&nbsp;</p><p>AWS RoboMaker 是亚马逊云科技的云端机器人服务。开发者可以用 RoboMaker 来开发和模拟机器人程序、控制管理多台机器人、进行固件更新或远程分析等。开发者还可以调用语音、对讲、视频等服务来为机器人快速添加功能。RoboMaker 可以生成许多随机模拟世界，构建机器人的仿真运行环境，开发者可以调整地面材质、家具摆放等参数，或模拟空中、海面等环境，或控制多台机器人进行联动测试等，进而快速收集运行数据。</p><p>&nbsp;</p><p>Alexa 也是 Astro 背后的一项关键技术。Alexa 在欧美是非常流行的语音服务，在音箱、电视、智能手机、穿戴设备、电脑、安防、电器、玩具等设备上都有应用。除硬件集成外，软件开发者也可以利用 Alexa 给客户带来新的体验，例如 TikTok 便是通过 Alexa 语音控制短视频播放等。亚马逊云科技还同 NXP、高通等硬件厂商合作，制造集成 Alexa 的 IoT 开发板，帮助智能设备厂商提升开发速度。这些开发板能够将边缘侧的算力需求交由云端完成，从而减少成本。</p><p>&nbsp;</p><p>此外，亚马逊云科技的 Kinesis Video Streams 服务能够获取存储媒体流，在云端播放、分析，或调用Rekognition服务进行场景或图像检测、人员识别，进而应用在机器人设备上。Astro 机器人的场景和人员识别能力背后都有这一服务的身影。</p><p>&nbsp;</p><p>亚马逊云科技物联网服务是 Astro 机器人背后的另一大基础设施。物联网服务可以通过连接控制服务接入云端数据分析、AI 等服务上，最后再将机器学习模型部署到设备上，形成了 AIoT 的闭环应用。在物联网服务的帮助下，Astro 机器人能够利用亚马逊云科技云端强大的机器学习能力，改善与用户的交互体验。</p><p>&nbsp;</p><p>Astro 机器人是亚马逊云科技云端技术能力在终端的一次集中体现。如今，越来越多的厂商开始使用亚马逊云科技提供的众多云端能力，为自己的智能硬件带来竞争优势。由此可以看出，终端硬件与云端能力的结合是智能硬件产品的“取胜之道”，Astro 机器人的成功经验非常值得其他厂商学习总结。</p><p></p><p></p><h2>三、极致体验：OPPO 智能家居生态实践</h2><p></p><p>&nbsp;</p><p>智能家居产业是近年的热点，因国家政策和用户需求拉动，发展速度较快。OPPO 几年前就提出了围绕智慧学习、智慧生产、智慧文娱和智慧健康这四个主题来寻求突破的技术战略。其中智能家居能够给用户带来实实在在地便利，例如语音控制能够解放双手，及时提醒功能可以避免浪费和遗忘，远程操控在外出时带来便利等。但在实践中，用户的多种智能设备可能来自不同品牌，各自需要自己的 APP 来控制，无法实现联动，体验非常割裂。这一问题的根本原因在于不同平台标准不同、底层协议不互通。OPPO 进入智能家居领域后就在设法解决这一问题。本专场中，OPPO 智能物联架构师陈松就围绕这一主题展开了分享。</p><p>&nbsp;</p><p>如今，“标准混乱”是智能家居用户体验领域的常见问题。为此，<a href=\"https://www.infoq.cn/article/h2r7qLMM8QbykrUUmGaB\">OPPO</a>\" 在“统一标准”这件事儿上做了许多努力，除了自研并对外推广 Heythings 家居互联协议外，OPPO 还对众多巨头发起的 Matter 协议做了深度支持。这意味着 OPPO 的智能家居产品能够与其他厂商兼容 Matter 协议的产品互联互通，最大程度得缓解了用户在使用过程中的“厂商绑定”尴尬。</p><p>&nbsp;</p><p>标准统一后要解决的是设备配网的体验。传统的智能家居设备初次接入家庭局域网的操作复杂且缓慢，往往让用户头痛不已。对此，OPPO 实现了设备一键闪连，并通过系统内部架构和交互流程的优化提升了系统稳定性并降低了延迟。</p><p>&nbsp;</p><p>一键闪连本质上是基于Heythings协议对Wifi网络所做的优化。值得一提的是，普通的配网流程分为 5 个步骤，Heythings 协议的配网流程也类似，有 7 步，1、5、6、7是绑定过程，2、3、4 是配网流程。“一键闪连”就是针对 2、3、4 步做的优化。</p><p>&nbsp;</p><p><img src=\"https://static001.infoq.cn/resource/image/3f/f5/3f378955d118a1ee24ae48e56e3d6af5.png\" /></p><p></p><p>需要注意的是，Wifi 协议是帧格式，分为管理帧、控制帧和数据帧。管理帧有 11 种类型，有关联的请求响应、重关联请求响应、探测请求响应、信标帧、ATIM 帧、接触认证等。Wifi 协议的 Probe 探测帧和信标帧中有一信息元素叫 Vendor Specific，允许厂商自定义数据，且这个元素在同一帧里可以重复，意味着它可以传输较多数据。一键闪连就是利用该特性来自定义交互数据，实现设备的自动发现和配网。</p><p>&nbsp;</p><p>一键闪连的流程中，配置提供端是手机 APP，配置接收端是智能设备。设备主动发出热点给 APP 探测，后者选择热点后可以通过探测帧携带经过 ECDH 密钥协商加密的配网数据发送给设备。设备解密数据就可以连接 Wifi。作为对比，普通设备配网流程需要 20 步左右，而一键闪连是一步到位。前者需要 20-30 秒，后者只需 10 秒左右，大大提升了用户体验。</p><p>&nbsp;</p><p>除了C端用户，B端开发者也对智能家居产品生态有着巨大影响。OPPO 针对开发者体验做了很多优化工作，例如开发者可以一键式同步模型和流程配置，UI 工作台可以一键生成配网页、控制页设备卡片等。 OPPO 还提供了成熟的设备 SDK 和 APP 插件，以及强大的 IoT 平台，可以极大减少开发工作量。</p><p>&nbsp;</p><p>OPPO IoT 平台的目标是实现高可用、高性能、高安全、易扩展等特性。平台业务架构分为三大业务域，各自有一系列业务能力：</p><p>&nbsp;</p><p><img src=\"https://static001.infoq.cn/resource/image/ec/c5/ec4da96d7yyd35fdbacc579e92a31ac5.png\" /></p><p></p><p>对应的技术架构采用分层设计，上层包括应用层、网关、接入层和微服务层，下层是缓存和持久化层。该架构依托于 OPPO 强大的云平台，包括自研API网关、自研消息队列OMQ、自研对象存储OCS、自研的服务治理、自动化运维和全链路监控等。</p><p>&nbsp;</p><p>APP 后端的核心模块交互，则具体描述了云云接入和直连接入两种方式的交互流程。APP 经过网关接入到云端业务服务，这里的模型转换会将 Heythings 指令转换成厂商能识别的模型、指令再接入到设备。直连的业务则经过 MQ 到消息分发再到接入服务，下发指令到设备。可以看到设备也可以上报状态，云端随之更新设备影子，用户也可以做固件升级。</p><p>&nbsp;</p><p>为实现高安全性，需要从全局考虑，包括架构设计、流程制度、生产营销等各个环节，上述架构的网关接入层有权限校验、接口鉴权，业务服务有敏感字段的加密存储和日志脱敏处理等常规设计。设备接入使用三级证书做双向认证，安全套件使用的则是 TLS_ECDH_ECDSA_WITH_AES</p><p>_256_GCM_SHA256。</p><p>&nbsp;</p><p>为实现高性能，上述架构做了全链路优化。接入层使用高性能网关，各个中间件做了调优，业务服务器使用的 CPU、网络、IO、存储、内存等都做了相应优化。业务逻辑根据具体情况做了延后处理、提前处理、并行处理、异步处理、缓存、批处理等针对性的优化。</p><p>&nbsp;</p><p>为实现高可用，IoT平台从架构设计、容量规划、安全性、项目管理与流程制度上等都有相应考虑。例如在架构设计上，OPPO 在网关接入层做了限流、RPC 超时设置，针对一些核心和非核心服务做了降级，对一些依赖服务做了熔断，以及进程隔离、线程隔离等。全链路涉及的组件还升级到同城双活和异地多活组件，同时做了异地多活的演练。</p><p>&nbsp;</p><p>OPPO 的自研协议是平台很重要的一部分。OPPO 自研的 Heythings 协议主要关注从安全传输层到域网络层、模型层、再到应用层，构建了一整套安全交互，每一层为上层提供支撑，实现安全、兼容性好、可扩展的设备交互逻辑。</p><p>&nbsp;</p><p>Heythings 的设备模型中，每个设备包含多个功能服务，每个服务下包含多个属性、方法和事件。Matter 协议的 Clusters 相当于我们的服务，其属性、方法、事件也同 Heyshings 类似。Heythings 和 Matter 设备可以建立映射来互相转换。</p><p>&nbsp;</p><p>为了提升开发者接入 OPPO 智能家居产品生态的效率，OPPO 还打造了 UI 工作台。工作台覆盖了从产品配网到操控的全流程，通过一系列组件减轻开发者负担。</p><p>&nbsp;</p><p>开发者接入时只需创建产品，在UI 工作台可以一键生成配网页、详情页。页面中的背景、样式都可以调整，开关、按钮等都可自由拖拽。</p><p>&nbsp;</p><p>设备卡片也是工作台一键生成，其快捷功能可以方便地配置。生成的卡片有小卡、中卡的选项，操控功能也能灵活切换。这样的设计不仅可以提升开发者的开发效率，也能提升用户体验。比方说，用户配网成功后，就可以进入详情页控制设备。用户可以直接在卡片上操控多种快捷功能，且卡片样式可以持续升级，并通过规则管控，做到针对不同系统自动适配。</p><p>&nbsp;</p><p><img src=\"https://static001.infoq.cn/resource/image/cf/92/cf63d63ec44ef137e82f70be85512f92.png\" /></p><p>图：卡片结构</p><p>&nbsp;</p><p>卡片的结构分为五部分。基本信息包括状态、版本号；模型信息包括设备模型相关的单位、精度、最大最小值等；布局信息包括颜色、间距、大小、字体等；逻辑信息包含交互逻辑；UI事件是指点击按钮的具体动作等。</p><p>&nbsp;</p><p>这张卡片非常灵活，一次生成之后可以到处使用，很容易实现互联互通，在手机、平板、电视、VR、车机甚至手表上都可以运行，还可以做到一致的视觉体验，可以非常灵活地升级样式。由于逻辑部分也是单独抽象出来的，所以卡片功能要调整时也可以方便地配置、升级。</p><p>&nbsp;</p><p>为了在不同系统间自动适配样式，工作台提供了规则引擎来管控。例如规则引擎可以针对老版本操作系统的旧样式生成一个版本布局，针对新版本操作系统的新样式生成另一个版本布局。通过规则引擎配置实现自动适配。</p><p></p><p></p><h2>四、写在最后</h2><p></p><p>&nbsp;</p><p>在本专场中，三位技术大牛的分享让关注 AIoT 领域的开发者们更好地了解了智能硬件和家居产品背后涉及的技术与创新，也为硬件企业开发产品提供了参考意见。从 OPPO 和亚马逊云科技 的经验来看，今天的智能硬件与云服务已经深度绑定，开发者需要从一开始就重视端侧硬件与云端的协同关系，为智能硬件产品的长期迭代升级打下牢固基础。</p><p>&nbsp;</p><p></p><p></p><h2>本场直播评论区互动精华</h2><p></p><p></p><h5>Q：智能家居的用户信息安全隐私怎么保证？</h5><p></p><p>OPPO 智能视觉云服务研发负责人宋佳洋：这是一个好问题，看来目前大家对信息隐私安全也越来越重视。总体上看，我们严格遵守国家信息安全与隐私相关法规与政策：个人信息保护法、信息安全技术智能家居通用安全规范等等。我司已通过信息安全管理体系 ISO/IEC 27001、ISO/IEC 27701 以及云安全管理体系 CSA STAR CERTIFICATION(CCM V4) 的认证。</p><p>&nbsp;</p><p>具体来讲，比如智能摄像头业务，我们集成了内部统一的 IoT Core 与 ORTC，实现账号与设备、视频流的统一管理，端到端都有统一鉴权，不会出现跨账号访问资源的情况。云端录制有统一用户授权策略，由用户选择是否开启云端 AI 功能，开启后对用户数据统一加密，自动流转，相关内容会经过我们加密服务器进行安全对称加密，密钥是账户级别的，统一由 KMS 进行管理。事件相关的 AI 推理，内容从加密服务器进行解密，获得关键帧后进行全流程自动化 AI 推理。</p><p></p><h5>Q：智能家居目前的行业痛点是让所有的智能家电都能联动起来，OPPO 从这方面是怎么考虑的？除了互联协议外，是否还存在其他解决方案？</h5><p></p><p>OPPO 智能物联架构师陈松：OPPO 会加强对 matter 协议的支持，扩展更多的品类，让用户有更多的选择；暂时没有考虑其他方案，底层协议如果不互通，设备厂商依然需要对接多家平台，成本很高，用户购买的设备可能是各个生态的，依然需要下载多个 app、体验割裂。</p>",
    "publish_time": "2022-11-02 12:24:12",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "端云上的“音视频+”：与 AI 擦出了怎样的火花？",
    "url": "https://www.infoq.cn/article/ukt2jWfS2FVcegveGCUY",
    "summary": "<p>数字经济席卷各个行业，编解码、RTC 等音视频技术和云渲染技术在短视频、游戏、数字孪生、VR／AR 等新型领域得到广泛应用。以泛娱乐社交类短视频应用为例，几乎所有功能都离不开音视频、云渲染技术。</p><p>&nbsp;</p><p>围绕这一内容，主题为“云无界、端无边”的2022 OGeek 技术峰会特别设置“端云一体化，视听新体验”主题专场，并于2022年10月29日在 InfoQ 视频号进行直播。</p><p>&nbsp;</p><p>值得一提的是，“OGeek Day”是由 OPPO 数智工程事业部主办的行业技术沙龙品牌，旨在为技术爱好者搭建一个技术交流和分享的开放平台。沙龙主要围绕“科技为人、以善天下”的品牌使命，聚焦于为智能终端提供安全高效的数据、算力、算法、云服务方面的前沿技术，打造技术互动的行业生态，探索技术在行业应用的实践、突破及未来发展方向。</p><p>&nbsp;</p><p>而在本次的<a href=\"https://www.infoq.cn/video/FqFfJTL9FqrMoKR5dsge\">“端云一体化，视听新体验”主题专场</a>\"中，OPPO 实时音视频架构师李雪松、声网视频算法工程师郑林儒、OPPO 实时音视频架构师董华三位技术大牛带来了许多干货分享，围绕 RTC、云渲染及音视频+技术在应用场景下的实践与开发者们展开了讨论。</p><p>&nbsp;</p><p></p><h2>一、OPPO 实时音频架构师李雪松：ORTC 与 AI 之间的那些事</h2><p></p><p>&nbsp;</p><p>谈到实时音视频技术，一定离不开 ORTC 这个主题。近年来，AI 技术的发展为 ORTC 带来了新的活力与可能性。在本次 OGeek 大会中，OPPO 实时音频架构师李雪松就“AI 与 ORTC 之间的关系与融合”展开了讨论。他讲到：</p><p>&nbsp;</p><p>“ORTC 是一个实时音视频平台，是负责实时音视频传输的管道。ORTC 的三大核心要素分别是音频、视频和网络传输。对于这三大要素，AI 都可以参与进来起到能力提升的效果。”</p><p>&nbsp;</p><p>首先，聊到了音频。音视频通话过程中经常会遇到背景说话、键盘音、环境音，而 AI 基于大量的语调分析，结合视频场景，可以运用深度学习技术将人声与噪音分离，能够有效抑制环境中的各种噪音。深度学习还可以把啸叫噪声与纯净语音混合作为训练样本，最终训练出“啸叫模型”，利用这种模型来进一步抑制整个传输过程中的啸叫。在回声消除阶段，还可以应用一些 AI 的网络模型，如长短记忆模型、卷积神经网络模型来建模，利用波形重构和质量评估，最终有效地消除回声。</p><p>&nbsp;</p><p>其次，又聊到了视频。视频前处理主要包括磨皮、美白、暗光增强甚至人脸贴纸等特效。磨皮的主要方法包括高反差保留算法、保边滤波算法，处理过程就是把原始的视频帧进行保边滤波，再进行高斯模糊运算，结合皮肤区域检测进行图像融合叠加，最终对图像进行锐化，输出美颜后的视频帧，从而达到美颜的效果。这些前处理算法已经很成熟了，效率较高，性能功耗要求较低，所以大部分应用在端侧。</p><p>&nbsp;</p><p>再者，聊到了“视频和网络传输”。内容感知编码是 AI 技术对视频的另一大增强技术。它主要基于人眼的感知特征，通过AI进行实时目标跟踪的变化来预测最终的编解码参数，最终对人眼感兴趣的区域进行低压缩编码，对于非感兴趣的区域做高压缩编码，从而在节约带宽的同时又不牺牲编码图像质量。使用该技术后，视频码率可以减少 90% 以上，效果非常明显。另一种名为“中心平凹视频编码”的技术也是应用了人眼的感知特征，在中心视力区域范围内关注的内容作为优先编码，周边的区域提升压缩率，这种技术在 3D、VR 场景应用比较广泛。</p><p>&nbsp;</p><p>AI 在视频中的另一大中应用是背景建模。其原理是在聚焦区域抠图，在聚焦区域外模糊处理，实现背景虚化效果。通过背景内容的提取，可以让背景内容在整个传输过程中固定为长期参考帧，修复花屏及卡顿现象。</p><p>&nbsp;</p><p>AI 在 ORTC 中还可以应用到视频增强上。视频出现过暗、过曝甚至是色彩黯淡现象时，基于卷积神经网络、深度神经网络以及循环神经网络等深度学习技术，能够从分辨率、帧率的纬度对视频进行修复、增强和重建，从而在视频的亮度和对比度、饱和度方面取得增强效果。</p><p>&nbsp;</p><p>AI 视频超分是应用广泛的技术。所谓视频超分就是将模糊、分辨率较低的图像经过 AI 运算变成高分辨率清晰图像的过程。AI对低分辨率视频通过特征提取、特征融合以及重建采样，恢复并补充丢失的信息，最终重建成高分辨率图像、视频。</p><p>&nbsp;</p><p>另外，李雪松在演讲过程中还做了国内外技术对比。谷歌最近推出了 WaveNetEQ 项目，是一个改进版的 PLC 系统，主要用于语音合成。网络传输中不可避免有丢包，音频丢包也需要丢包补偿算法来恢复，这里的补偿算法就是 PLC，而 WaveNetEQ 就是利用自回归网络和调节网络来恢复丢包恢复，提升音频质量。</p><p>&nbsp;</p><p>国内则出现了一些基于神经网络的自适应及拥塞控制的开源算法。网络传输过程中不可避免会由于网络抖动、拥塞造成网络不平滑。基于这种问题业界提出了一些网络的拥塞控制策略及自适应传输算法，能够很好地控制网络丢包、拥塞，实现更平滑的发送。</p><p>&nbsp;</p><p>AI 可以帮助 ORTC 解决很多问题，反过来 ORTC 也可以赋能 AI，让 AI 更好地落地。在实践中，AI 端侧算力有着很大的瓶颈和局限，面临很多的挑战。为了让 AI 更好地发挥作用，赋能工业生产，ORTC 就可以成为很好的解决通道。ORTC 以其低延时、高保真的特性，让端侧算法很好地在云端大展身手。</p><p>&nbsp;</p><p>李雪松介绍到<a href=\"https://www.infoq.cn/article/vkHROQzRXNkX5uooNGgl\"> OPPO </a>\"最近提出的一种云端 AI 处理架构，就是 ORTC 服务于 AI 的一个解决方案—— AIFilter。 AIFilter 可以对原始音频流、视频流进行云端 AI 处理，输出智能流，方便用户分析以及应用。OPPO 充分利用了分布式集群和 GPU 并行处理能力，为客户提供低延时、高并发的优秀AI解决方案。</p><p>&nbsp;</p><p>据李雪松介绍，与 ORTC 结合之后，AI 自然语言处理、语音分析处理等技术可以轻松落地，云端远程实时语音转录、同步翻译以及实时变声对话机器人陆续落地实践。ORTC 结合 AI 的面部识别、心率检测、面部表情分析，可以在云端远程对客户进行身份认证及活体检测。AI 引入的微表情分析、情感分析能力，结合动作捕捉、情绪面部特征捕捉，可以在云端形成 3D 数字人，构造元宇宙的诸多应用场景。</p><p>&nbsp;</p><p>李雪松表示，公司正在探索的另一个热门领域是远程医疗。以远程问诊为例，医生可以借助一个普通的单目摄像头对病人进行远程实时心率测量，或借助用户的远程听诊器进行远程诊听，同时借助 ORTC 平台及 IoT 监控设备进行医生和病人的双向实时互动。</p><p>&nbsp;</p><p>总体而言，ORTC 与 AI 技术相互促进，相互发展，能够给各行各业提供很好的解决方案。</p><p>&nbsp;</p><p></p><h2>二、声网视频算法工程师郑林儒：实时通信下视频 QoE 端到端轻量化网络建模</h2><p></p><p>&nbsp;</p><p>QoE，亦即体验质量，是实时通信中衡量视频传输质量的主要指标。在本专场中，声网视频算法工程师郑林儒为开发者介绍了通过 QoE 网络建模方法评估视频质量的方案。</p><p>&nbsp;</p><p>在实时视频通信中，影响体验的主要因素分为媒体质量和互动体验。其中影响音视频质量的主要是视频质量、音频质量以及两者交互的音画同步率。影响音视频质量的指标有画质、音质、流畅度等，而互动体验主要是有延时影响。总体来说，不同场景中不同因素的影响权重有所区别，比如课堂就比直播更注重延时的影响。</p><p>&nbsp;</p><p>一个端到端的 QoE 指标可以提供相对于 PSIMR、SSR 等参数更贴合人类主观印象的画质指标，基于这个指标可以让编码器选择最优的编码参数，在不影响用户感知画面的情况下节省码率，也可以作为ABR算法的参考指标。为此，声网开发了一套 QoE 端到端评估体系。</p><p>&nbsp;</p><p>声网首先建立一个画质主观评估数据库，通过内部视频软件收集数据进行处理。之后通过打分软件，按照 ITU 推荐的标准进行主观评估，得到每个视频的 MOS。对于每个视频序列至少有 20 位评估人员参与打分，以保证数据清洗后的有效人数。数据清洗分两种方案，一是通过计算每个样本的 95% 执行区间，选择执行区间小于一定阈值的视频作为打分一致性最高的视频，筛选掉了对这些视频打分偏差较大的参与者。二是计算每个人与整体的打分相关性，排除相关性较低的参与者。</p><p>&nbsp;</p><p>声网通过设置锚点发现不同的设备 PPI 对画质评估影响较大，像素密度较高的屏幕给出的分数也相对较高。为避免长时间单调标注过程中产生疲劳而导致数据失真，每个批次尽量差异化视频内容，并在画质层面最大化覆盖评分区间，每个评估人员每次打分的时长不会超过 30 分钟。</p><p>&nbsp;</p><p>为了在视频失真类型以及视频特征上最大化多样性，声网考虑了画面失真和时域失真两个维度。画面失真可能因为视频采集时聚焦不准导致模糊，也可能因为背光或光照不均匀出现过暗或过曝。时域相关的失真一般表现为画面剧烈抖动及视频帧率变化。（从下图）可以看到，用于打分的每个批次的视频都有着多样化的视频特征。</p><p>&nbsp;</p><p><img src=\"https://static001.infoq.cn/resource/image/11/fe/11c7af96e8c58f1cf539c68144b9d7fe.png\" /></p><p>图：QoE-画质数据库建立</p><p>&nbsp;</p><p>根据前人研究和声网的实验发现，同一个视频序列在手机上播放时，半屏播放相对于全屏播放有 MOS 偏移，大多数情况下半屏播放评估的 MOS 会高于全屏 MOS，这说明了视频缩放的影响。随着屏幕尺寸的提升，不同分辨率视频 MOS 均有下降，分辨率越小 MOS 下降越快。视频帧率提升时观众主观体验会提升，但大部分视频在帧率上升到一定程度后，对 MOS 的提升就非常有限，而部分视频则提升较大。这与视频的画面有很大关系，比如运动比较剧烈时，就需要更高的帧率支持。</p><p>&nbsp;</p><p><img src=\"https://static001.infoq.cn/resource/image/c5/86/c54da08f0b3bd429acb3a1a71a9a5386.png\" /></p><p>图：QoE-视频画质客观评估框架</p><p>&nbsp;</p><p>获得数据后就可以开始建模。目前深度学习的主流方法有端到端与非端到端两种。由于视频分辨率与帧数不同，所以要采样到统一大小进行端到端训练；对非端到端方法，要首先通过一个易训练的网络提取图像特征，对于视频特征进行回归训练拟合 MOS。</p><p>&nbsp;</p><p>影响视频画质的不仅是空域特征，时域失真也有影响。一段视频出现画质下降，主观体验也会立即下降。当这段视频画质提升时，观看者由于对画质下降留有印象，所以实际体验不会随着画质提高而立即提高，而是缓慢提升，这就是滞后效应。对其进行建模时，对画质下降现象可以取 TI 时刻的前 n 秒的客观画质的指标最小值作为这个时刻的 MOS，缓慢提升需要对 TI 时刻后 n 秒中客观指标比较高的一个值赋低的权重，对后 n 秒的指标进行升序排列，用高斯分布加权，最终每个时刻的平均作为最后的 MOS 预测结果。</p><p>&nbsp;</p><p>此外，行内人都知道，深度学习算法落地的一大问题是运算量与性能的均衡。为了在减少模型参数和运算量的同时保持甚至提高性能，业内的一些小模型设计给声网提供了思路。于是，经过学习和改进优化，声网总结出了模型的四个设计原则：</p><p>相同的输入输出，通道数可以最小化内存访问代价 MAC；过多的分组卷积会增加 MAC；每个分支上的碎片化操作会降低并行度；Channel Shuffle 的元素级操作运算量虽然比较低，但是也会带来 MAC。</p><p>&nbsp;</p><p>基于上述原则，声网的模型版本做了相应的优化，最终在准确率、运算量和最重要的推理速度上达到了较好的平衡。通过上述模型加速方法，声网设计了 AGORA-VQA 画质评估工具。评测显示，该模型与业内大模型表现基本一致，但参数量和运算量远远低于大模型。</p><p>&nbsp;</p><p>目前这一 QoE 指标体系还在内部打磨中，后续会开放给开发者和用户。声网未来还要进一步完善端到端指标，包括增加适配场景，增加流畅度、延迟和音频 MOS 等，并更好地平衡模型在不同分辨率下的运算量。</p><p>&nbsp;</p><p></p><h2>三、OPPO 高级后端工程师董华：关于云渲染的探索与实践</h2><p></p><p>&nbsp;</p><p>在音视频应用场景中，传统上基于端侧的视频渲染技术在遇到AR虚拟人、多镜头合成等场景时容易出现算力瓶颈，降低用户体验。为此，云渲染技术应运而生。OPPO 在探索AR应用的过程中，发现云渲染技术可以很好地解决此类场景中遇到的问题，可以为未来的元宇宙等领域打下基础。在“端云一体化，视听新体验”专场的最后，<a href=\"https://www.infoq.cn/article/h2r7qLMM8QbykrUUmGaB\">OPPO </a>\"高级后端工程师董华的分享主要聚焦 OPPO 在云渲染技术方面的探索与实践。他讲到：</p><p>&nbsp;</p><p>OPPO 的第一代云渲染技术基于英伟达推出的 Cloud XR 云渲染架构。它的基本架构是基于 GPU 的虚拟化，在云端渲染内容并串流到各个终端。相对于终端渲染模式，它可以提供更高的画质，对终端要求较低。但这一架构的网络抗抖动和低延时策略相对有限，所以弱网情况下流畅度不佳。ORTC 赋能云渲染，实现低延时的音视频流和信令交互，进一步提升 QOE（网络体验质量）。</p><p>&nbsp;</p><p><img src=\"https://static001.infoq.cn/resource/image/b0/98/b0445375ca6e5884b16aa0e0206c1198.png\" /></p><p>图：云渲染+ORTC（第二代）</p><p>&nbsp;</p><p>OPPO 的第二代方案是将第一代 GPU 虚拟化技术和 ORTC 进行整合衍生而成的，其服务端和云端渲染基于OPPO的全球混合云服务，其网络则基于 ORTC 实现低延时、抗抖动传输。终端侧基于 RTK 进行流控制。第二代方案的应用场景主要有 VR、云游戏、3D 软件设计等。</p><p>&nbsp;</p><p>第三代方案打造了云异步渲染能力，从而降低 VR 设备的云渲染延迟。视频编码部分也从 GPU 转移到了编码板卡以节约 GPU 资源，提升质量和效率。OPPO 还在第三代方案中尝试在云端结合AI创作个性化内容并提供增强效果，例如场景物体识别等。</p><p>&nbsp;</p><p>在云渲染平台研发过程中，主要使用的关键技术包括：基于混合云的云部署、边缘计算、精准调度、ORTC 延时优化、5G、AI 超分等。以下为具体解析：</p><p>&nbsp;</p><p>云部署能力基于 GPU 虚拟化技术，辅以容器弹性伸缩能力，从而充分利用服务端资源，结合虚拟引擎生产高质量内容。</p><p>&nbsp;</p><p><img src=\"https://static001.infoq.cn/resource/image/07/57/078fc12d90beb4bbe18113426d628d57.png\" /></p><p>图：边缘计算-网络链路的优化</p><p>&nbsp;</p><p>边缘计算方面需要进行链路分析。链路分析分为几个方面：首先是云端，涉及逻辑计算、内容的渲染、编码和数据发送，产生小于 30 毫秒的延迟。第二是网络，涉及网络链路、边缘计算节点分布、调度。下面的解码端会产生缓冲或抖动导致的延迟。为降低网络延迟，OPPO 基于自有混合云覆盖全国大部分区域的网络节点，经过精准调度实现用户到云渲染节点的最优链路。OPPO 还使用 5G 网络切片，针对不同场景搭载不同业务，避免多场景的相互影响，显著优化网络延迟。</p><p>&nbsp;</p><p>OPPO 还对 ORTC 的抗弱网和低延迟技术做了优化，避免产生卡顿、马赛克等问题。编码层面，OPPO 引入视觉感知编码、分层编码等技术提升编码效率，降低网络压力。</p><p>&nbsp;</p><p><img src=\"https://static001.infoq.cn/resource/image/64/88/6470bd59cc1e89ec23643b07d1c07288.png\" /></p><p>图：端云异步渲染</p><p>&nbsp;</p><p>OPPO 实现了端云异步渲染技术，在云端进行基础渲染，本地基于 VR 设备的动作和云端下发的当前帧进行帧预测插帧，从而显著降低延迟，增强 VR 设备的体验。</p><p>&nbsp;</p><p>目前 OPPO 的云渲染平台已经在数字虚拟主播、云游戏等场景中得到了应用，未来还将开拓直播、互动云游戏、数字孪生、云电脑等场景。OPPO 也希望能与业界共同探索云渲染技术，加快云渲染的落地部署进程。</p><p>&nbsp;</p><p></p><h2>四、写在最后</h2><p></p><p>&nbsp;</p><p>在 Web 2.0 时代迎来爆发的音视频技术，如今正在借云计算与 AI 的东风焕发新的光彩。本专场的嘉宾共同传达了一个讯息，那就是音视频技术将在未来为用户带来更加缤纷的体验，创造更多精彩无限的应用场景。行业正在向着这一方向持续努力，通过一系列技术创新为音视频领域注入更多活力。</p><p></p><p></p><h2>本场直播评论区互动精华</h2><p></p><p></p><h5>Q：ORTC 与 AI 技术的结合在降噪这块，有什么技术突破？下一步的演进方向是怎样的？</h5><p></p><p>OPPO 实时音频架构师李雪松：关于技术突破，基于 DCCRN 模型，通过反卷积、反傅里叶变换及帧缓冲机制，构建语音降噪流式处理方案，并对模型在前端处理、频域子带划分、后处理等多个方面进行优化，改进后的算法在有效降噪的同时对音质的保留更好。关于下一步演进方向，优化模型提升其环境自适应的能力；融合视频图像AI处理辅助语音降噪，提升噪音识别的准确率。</p><p></p><h5>Q：搭建云服务器需要哪些配置？CPU、内存、硬盘还有企业机房带宽都有怎样的要求？</h5><p></p><p>OPPO 高级后端工程师董华：云渲染的云服务器都是基于云端容器化进行服务的搭建和部署，基于动态扩容实现根据业务量需求进行弹性伸缩，CPU、内存、硬盘是根据不同的业务需求进行容器化分配，GPU进行切片实现GPU虚拟化，企业带宽分配则是根据业务本身流量分配的规律进行成本估算，来决策按流量计费/按带宽计费/共享带宽包。</p><p></p><h5>Q：云手机是如何搭建的？</h5><p></p><p>OPPO 高级后端工程师董华：云手机目前是基于 ARM 虚拟化技术（或者其他架构虚拟化）实现云端容器化管理，提供云端安卓移动应用运行平台，实现云端渲染，控制指令和音视频流通过 RTC 低延迟传输实现数据交互和音视频串流，端测可以通过电脑、平板、手机等无束缚终端进行音视频串流数据的解码和渲染以及控制指令的实现。</p>",
    "publish_time": "2022-11-02 12:24:23",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]