[
  {
    "title": "远程办公，技术领导如何帮助开发者克服倦怠",
    "url": "https://www.infoq.cn/article/2SxkCMkwhdjjcRximWFe",
    "summary": "<p>出于显而易见的原因，在过去的两年多时间里，技术公司的员工团队在地理位置上愈发分散，因此也带来了新的压力。大环境在不断发展，但工作仍然需要完成。在这种背景下，技术领导者怎样才能为软件开发的未来做好准备，为团队提供所需的工具和资源，让开发人员保持良好心态，高效且尽可能无压力地继续工作呢？</p><p>&nbsp;</p><p>随着新冠疫情导致的新日常工作模式，许多开发人员已经适应了需要在混合或居家办公环境中<a href=\"https://www.infoq.cn/article/VW0JtzTW3TrOTX7yDUq7\">远程工作</a>\"的现状，他们已经习惯了尽量避免干扰以实现更好的工作与生活平衡，同时保持甚至提高生产力。</p><p>&nbsp;</p><p>另一方面，仍有少数人认为，只有在传统的办公环境中工作、团队成员共享办公空间，才能让开发人员及其团队发挥出最佳水平。这种环境设置当然会有优势，但是，当劳动力的趋势明显向分布式模式发展时，也会持续增加企业房屋租金和日常消耗费用。</p><p>&nbsp;</p><p>开发人员的职业倦怠一直是个值得关注的问题，即使我们的工作方式与先前已不再相同，但问题依旧存在。疲劳和倦怠可能会出现在任何工作领域，对领导者而言，关键是找到合适的方法帮助团队减少甚至避免工作相关的压力，以面对不断变化的工作方式。</p><p></p><h2>拥抱线上社交工具</h2><p></p><p>在这个新的工作时代，上至 CEO 在内的所有团队成员都必须具备“读懂虚拟房间”的能力，根据在线互动和对话的语气内容，了解开发者所想所感。并意识到通过 Slack、Zoom、Teams 等协作工具的沟通，与真正面对面坐在同一张桌子上交流的不同。</p><p>&nbsp;</p><p>尽管人们可以培训领导者在这种环境下有效管理的必要技能，但同时新兴的<a href=\"https://www.infoq.cn/topic/TGO\">领导方式</a>\"也在崛起。虽然团队成员之间的交流大多是虚拟进行的，但他们会把同理心和情感联系放在首位。通过留意社交网络中的蛛丝马迹也可以帮助领导者确定成员是否过于疲劳。</p><p>&nbsp;</p><p>现代通信手段的确有助于提高工作成效和效率，但好的领导者要能够通过分析团队成员在这些通信工具中的行为，从而在团队成员最需要的时候提供支持。管理者可以采用的方法有以下这些。</p><p>&nbsp;</p><p>定期开展一对一会议。这些会议对了解团队动力和士气非常重要。如果领导者面临挫败感、失败感或者无助感，这些状态通常会传染到团队成员之中。而如果领导们合作愉快、士气高涨，积极性很高，那么团队的成员也很可能如此。打破负面情绪的循环。很多开发人员会发现自己不时沉浸在消极的想法中，在未来这可能会是常态现象，但并不代表这种情况很健康。“如果这件事搞砸了……”，常常会有人在内心疯狂纠结要如何面对那个不存在的现实。反馈优先。每一个人都应该得到不断的反馈，了解自己年度绩效评估的理由，无论是积极评价还是消极评价。事实上，在保持团队参与度和确保所有人都在向一致方向奋斗的目标中，持续的反馈比年度反馈报告要有效得多。领导会更希望看到的是，工程经理和总监借助工具每周都进行辅导和反馈，而不是忍受积压的工作并为每年的审查而持续焦虑。确立正确的管理风格。每一位团队成员对自己直系领导的期盼会有所不同。领导需要明白自己每一位成员的需要才能有针对性地应对：有的人需要一个合作者，有的人需要一个导师，有的人需要一个任务管理者，而有的人天生对权威不屑一顾。注意，有的人所需要的领导者可能无法让其在工作中发挥出最佳水平。这一点很重要，领导者甚至可以问问团队成员，看看他们想要什么。透明引领信赖。作为一名经理，我优先考虑的事项是把自己的工作内容分享出来。这不仅能帮助工程师们了解我的工作背景以及我所操心的问题，而且还有助于让我们的关系更融洽。对于一部分人来说，这是建立信任的重要因素。</p><p>&nbsp;</p><p>随着时间的推移，领导者与团队成员之间的关系会愈发紧密，领导会更善于识别需要更多支持或休息的团队成员。请记住，虽然技术领导是一项技术类工作，但究其根本，这也是一份以人为本的工作。</p><p></p><h2>完善异步交流</h2><p></p><p>随着越来越多的团队分散在全球各地，我们需要利用对团队所有成员来说都“正常”的工作时间来举办会议；对西海岸的人来说基本是上午，欧洲则是下午。这样，既让开发人员能拥有大量不受干扰的工作时间，又保障了组织首选协作工具的沟通流。</p><p>&nbsp;</p><p>对开发人员来说，没有会议干扰的工作时间越长越好。他们可以利用这些时间专注编写代码、构建应用程序，或者将注意力转移到任何可能出现的问题并进行解决。这不仅组织的生产力会得到提升，还助力增长了团队的士气。当人们花费精力解决了复杂的问题后，总会收获价值感，他们会认为自己的工作更有价值、更有吸引力，我们不应忽视这一点。事实上，这在很大程度上也是人们不换工作甚至不会转职的原因。</p><p>&nbsp;</p><p>减少会议次数很好，但必要的沟通和协作仍需要进行，这样开发人员才能更有效地完成他们的工作。异步沟通的需求由此诞生，而随着团队成员在物理位置上变得更加分散，这点也愈发重要。以下是同步与异步沟通之间的简单对比。</p><p>&nbsp;</p><p>同步沟通。团队成员的地理位置相近，如同一城市、州或时区，即使需要通过 Zoom 或 Teams，团队也可以快速组织一次会议来解决问题。这些团队通常负责同一组代码，并经常实时合作。他们所面临的主要挑战之一是如何准确定位及共享他们的设计或逻辑背后的理由。异步沟通。随着越来越多的团队由跨州、跨时区及跨大陆的成员组成，这种类型的沟通需求正在急剧增长。由于这类团队几乎不可能在必要时约一个快速会议，他们更需要异步的方法和工具，清楚地传达和记录任务目标，以可搜索的形式保持重要信息流动。他们所要面临的挑战在于如何打破因成员分布在世界各地而自然形成的信息孤岛。有效的异步通信既能使开发人员独立工作，又可拥有充分可见性。操作得当的情况下，这种方法可以防止瓶颈出现，保持代码流畅，并减少可能导致倦怠的不必要压力。</p><p>&nbsp;</p><p>这两种沟通方式都是有效且成效显著的，大多数人可能都没有怎么尝试过异步沟通的方式。实施最佳实践，并随着时间的推移不断发展，让团队始终保持共识，减少无效沟通带来的挫折感。</p><p>&nbsp;</p><p>在 InfluxData，公司的团队分散在世界各地且完全远程办公，为了有效营造团结氛围，全公司每天都会举行的“站立会议”。每一位员工都会参加这个十分钟的 Zoom 会议，分享来自各个部门的公告和最新进展，为员工加油鼓劲或表彰工作纪念日。“站立会议”帮助公司在新冠疫情的大环境下保持强大的企业文化，让分布在各地的团队都参与进来，为共同的目标奋斗。</p><p></p><h2>认真对待工作与生活的平衡</h2><p></p><p>随着工作与家庭生活的不断融合，“工作与生活的平衡”可以说是有些重弹老调了。但我们需要重新理解这个概念，以帮助开发团队避免倦怠。家庭工作泾渭分明的日子基本已经成为了过去式，但对于开发人员来说，非工作期间完全脱离工作依然很重要。</p><p>&nbsp;</p><p>在疫情爆发最初阶段，团队几乎是被迫居家办公时，很多人仍试图在“上班”时仍保持明显的家庭与工作的分隔，即使他们的“办公室”只是通过 Zoom 等会议软件的虚拟背景展示。然而，随着我们逐渐适应这种方式，团队成员更愿意分享自己的家庭生活。我们认识了同事们的孩子或宠物，甚至可能更多家庭情况，这也有助于增长团队在个人层面上的联系。</p><p>&nbsp;</p><p>更进一步讲，目前许多开发人员即使是在工作日也会负责起家庭日常。在工作之余分神做饭、遛狗，或者是接孩子放学都是常有的事。自我保养也包含在内，例如在附近短途散步或慢跑、参加线上瑜伽课程，等等，以在一天的工作之中略做放松。全新的远程办公文化使开发人员更加健康快乐，这也是很多人不愿意或者抗拒回到疫情前的办公室办公的主要原因之一。</p><p>&nbsp;</p><p>企业文化在协助团队成员保持健康快乐的心态方面有着不可或缺的作用。企业领导人和管理人员需要尊重团队成员健康工作和生活平衡，这样才能达到双赢的局面；员工可以收获快乐并提升效率，企业则能够在近年来竞争愈发激烈的就业市场上留住人才。</p><p></p><h2>总结</h2><p></p><p>综上，随着开发人员的工作方式不断演变，组织的战略和管理方式也应不断发展，以最大限度地减少开发团队的压力，避免团队成员陷入完全倦怠期。成功的组织是能够制定计划，并随着时间的推移不断将计划完善以适应开发人员需求的组织。这不仅是一个好的商业战略方案，也是一个以人为本的理念。</p><p>&nbsp;</p><p></p><p>原文链接：</p><p><a href=\"https://www.infoq.com/articles/guide-avoid-burnout/\">The IT Leader’s Guide to Helping Developers Avoid Burnout</a>\"</p><p></p><p>相关阅读：</p><p><a href=\"https://mp.weixin.qq.com/s?__biz=MzA4NTU2MTg3MQ==&amp;mid=2655159792&amp;idx=1&amp;sn=6905f0ddae406e45b9d81e9da4e408a9&amp;chksm=84602290b317ab86c608164264b0984a08d1c145ef14f142b920e2adf96c2379300031a08ea4&amp;scene=27#wechat_redirect\">创业团队的项目管理，如何面向开发人员优化</a>\"</p><p><a href=\"http://mp.weixin.qq.com/s?__biz=MzAxNDU2MTU5MA==&amp;mid=208297748&amp;idx=1&amp;sn=f82dcecc8126cfc801530683df5c8a00&amp;chksm=120f874d25780e5b260a22247798ee6812e9d7c86d12805b664104fd3acbe0562305862c7e67&amp;scene=27#wechat_redirect\">开发人员转型到管理者必须学会的 7 件事</a>\"</p><p><a href=\"https://xie.infoq.cn/article/28b9b8248b2cefba1594ab88e\">如何优化组织结构? 如何助力疫情中的企业?</a>\"</p>",
    "publish_time": "2022-08-30 09:37:08",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]