[
  {
    "title": "华晨宝马是怎么做数字化的？把正确的技术应用到正确的场景中",
    "url": "https://www.infoq.cn/article/iKiSHHDJWSZgA4Ujz9ci",
    "summary": "<p>在数万种汽车配件中，维修人员可以通过拍照识别直接搞定，而不必再用ID编号对照长长的配件清单以及文字描述才能最终确认；通过AI与超清摄像头的结合，检测人员可以立即找到发动机缸盖的缺陷位置，重新检查并采取相应措施......以上便是发生在华晨宝马数字工厂中的实际场景，而这也再次让我们真真切切地感受到了AI技术是如何改变着传统制造业。</p><p>&nbsp;</p><p>但上述所描绘的场景只是华晨宝马数字工厂中的冰山一角，为了深入探究华晨宝马在 AI 技术上的实践，一览华晨宝马在数字化转型方面的发展全貌。InfoQ 有幸采访到了华晨宝马数字化生产与物流总监戚海飞，以下内容根据 InfoQ 与戚海飞老师的对话编辑整理，以飨读者：</p><p>&nbsp;</p><p>InfoQ：先请您介绍下您在华晨宝马主要负责的工作内容</p><p>&nbsp;</p><p>戚海飞：目前我主要负责华晨宝马在中国 3 个工厂的生产制造领域和物流供应链领域的数字化工作，简单来说，既要确保每个工厂每时每刻所有数字化系统稳定运行，以保障生产运营的稳定性，又要负责新工厂、新车型项目里的数字化建设工作，同时还负责数字化转型在生产制造和物流领域的推广推动。</p><p>&nbsp;</p><p>InfoQ：AI产业虽然在如火如荼的发展，但是传统企业对于AI技术的应用还不算理想，所以大家会认为AI技术在传统行业的应用速度和范围是低于消费互联网等行业的，从戚总的观察来看，这种说法是否符合整个行业的发展情况？</p><p>&nbsp;</p><p>戚海飞：传统行业和消费互联网有很大区别在于行业应用场景非常多样性，每家企业都有不一样的场景和价值诉求，这些的多样性为 AI 技术落地带来了极大的复杂性，所以在 AI 技术规模化部署的成熟度，行业 AI 专业人才，业务场景及价值的探索和落地等这些维度，传统行业与消费互联网等行业都不在一个层面上，这几方面正在快速发展中，但也是 AI 技术更能发挥价值的领域。</p><p>&nbsp;</p><p>InfoQ：为了解决上述挑战，华晨宝马采取了什么方式进行应对？</p><p>&nbsp;</p><p>戚海飞：华晨宝马在这一方面起步相对较早，我们在 2018 年就在内部建立了数字化技术部门，开始在<a href=\"https://www.infoq.cn/topic/cloud-computing\">云计算</a>\"、大数据，<a href=\"https://www.infoq.cn/topic/AI\">AI</a>\"、物联网等领域进行组织和人才团队的建立，业务场景的落地。若想将 AI 技术应用在工业场景中，需要了解内部的流程体系、业务知识等等，所以也就要求技术人员不仅需要懂算法，还必须懂业务。</p><p>&nbsp;</p><p>我们在 2018 年的时候就有一个案例，这个训练模型的准确度在实验室非常高，但拿到现场就只有 60% 左右的准确率。这是因为在实验室中，周围环境都是稳定的，但在生产线现场会受到到很多挑战，比如光线角度，受到反光、昼夜，天气等因素影响，导致准确率降低。为了应对这个挑战，我们就要求技术人员都要去生产线去了解业务、观察现场，让他真正了解业务的痛点是什么，业务场景是什么。我们还会把业务部和 IT 部门的人放在一起工作，让他们发挥各自的优势，业务人员也会被鼓励参与到技术创新当中来。</p><p>&nbsp;</p><p>除此以外，由于 AI 技术还没有达到一个相对成熟的阶段，很多能力还不能够规模化的部署和应用。对于我们而言，重要的是要考虑怎么进行规模化的部署，降低 AI 技术的壁垒，我们目前已经把底层技术进行平台化、服务化,&nbsp;比如把每个应用场景都会用到的图片/视频采集,模型训练,管理,发布等进行平台化处理,这样大大降低AI应用案例实现的技术门槛,实现成本和时间。</p><p>&nbsp;</p><p>InfoQ：如何理解“把正确的技术用到正确的地方”这句话？又该如何判断技术的引入是否合适？</p><p>&nbsp;</p><p>戚海飞：对于应用场景，我们核心的思想就是把正确的技术用到正确的地方，这本身就是一个企业的能力体现，需要很多的判断能力、考量能力，否则可能会产生适得其反的效果。在华晨宝马，我们会在技术可行性、投资回报比以及方案是否具备可复制性等方面，来判断如何将技术运用到正确的业务场景里。这里解释一下投资回报比，你可以简单理解成我们会对一个场景或者项目做详细的财务评估，比如到底要投入多少人力、物力以及时间成本，最终可以解决什么问题,取得的回报是什么以及这个工艺被自动化以后能提升多少效率。</p><p>&nbsp;</p><p>InfoQ：华晨宝马的数字工厂主要在哪些场景中应用了AI技术？</p><p>&nbsp;</p><p>戚海飞：具体到华晨宝马的数字工厂中，我们主要在质量自动检测、工作效率提升以及生产规划部署等方面，运用到了AI技术。通过集成应用AI技术，华晨宝马不仅大幅度降低了生产复杂性，更有效提升了操作精准度，确保为客户生产交付最高品质的宝马汽车。</p><p>&nbsp;</p><p>拿工作效率举个很小的例子，工厂的设备需要维护和维修，那就需要用到备件，但这些备件的种类多达七八万种。有些配件的体积比较大，可以在上面贴标签很好识别，但对于一些小不点的备件来说，辨识难度就变得很大。之前，就需要有经验的维修人员跟库管人员进行对接、沟通，但现在在AI技术的支撑下，就可以自动识别配件，把它跟我们内部的系统进行连接集成之后，拿手机拍个照，自动识别出来之后，就会显示出来这个备件的信息，比如库存量、储存位置等等。</p><p>&nbsp;</p><p>InfoQ：华晨宝马在数字化转型方面的进展如此之快的原因是什么？</p><p>&nbsp;</p><p>戚海飞：第一，敢于尝试、敢于创新，我们就是敢于第一个吃螃蟹的那个人；第二，是敢于投入，就是敢于承担某些特定的风险；第三，数字化转型从底层来讲是文化的变革，如果在企业内部营造好氛围以后就能更好地开展工作。总体来说数字化转型，是数字化文化，数字化人才和数字化技术的共同作用。</p><p>&nbsp;</p><p>与此同时，企业做数字化转型需要有一个思考的过程，可以先用小步快跑的模式运转起来，一定不能盲目跟风，别人弄得好，但不一定意味着引入到你的业务中也好。因为我发现很多企业可能处在信息化建设阶段，然后直接就想做数字化，基础没有打好就想往上盖高楼，建起来也是不稳定的。所以企业还是得先了解自身的业务情况，再考虑用什么样的技术能让商业价值最大化。另外，企业做数字化转型的出发点，说到底还是看数字化能力能不能作为企业的竞争力之一，加持企业运营效率和可持续发展，这就意味着虽然数字化转型是大趋势，但并没有所谓的标准答案。</p>",
    "publish_time": "2022-11-29 09:03:14",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]