[
  {
    "title": "破天荒！Netflix 为软件工程师引入细分职级，已有不少老员工因对新职级不满离职",
    "url": "https://www.infoq.cn/article/MXfmbyJkSmDkIHNRJb5Q",
    "summary": "<p>今年四月，我们（mobile&nbsp;）曾报道了Netflix打算为软件工程师岗位引入更多细分职级的消息。</p><p></p><p>据悉，目前，Netflix的最新职级设计思路如下：</p><p></p><p>工程师I工程师II高级工程师组长工程师（Staff）主任工程师（Principle）具体细节还在商讨当中，工程团队内部已经看到了相关提案。新制度的出台当然会引发不少争议，特别是现有工程师能否直接升任组长或主任职务。根据最初提议，所有工程师可能会最多担任高级工程师，再通过后续晋升成为组长或主任。</p><p></p><h3>“所有工程岗位都只有一个职级”，问题逐渐显现</h3><p></p><p>但问题是，过去25年以来，Netflix公司不依靠这套体系也已经发展迅速，而且拥有一支近2000人的高级软件工程师队伍。</p><p></p><p>既然如此，为什么非得对岗位再做细分？当然是那套机制存在实质性问题：</p><p></p><p>大约一年前，当Netflix启动2021年应届毕业生招聘时，“所有工程岗位只有一个职级”的问题开始显现。 新人们由于不可能直接担任高级工程师，所以无论水平高低、表现优劣，全部以软件工程师的身份加入公司。</p><p></p><p>于是Netflix就必须得帮助这些毕业生设计明确的职业发展道路。最直接的方法，当然是把其中一部分提拔成高级工程师。但因为职级过于扁平，新人可能需要很长时间才能完成高级工程师的蜕变，所以大部分人可能早在晋升之前就已经离职。</p><p></p><p>对Netflix来说，要想留住更多应届毕业生，最明智的做法应该是再建立一个“中级”职务，大多数企业称之为软件工程师II。大多数工程师在工作两年左右就会达到这个级别，再过两到三年才有资格担任高级工程师。</p><p></p><p>Netflix面临的另一大挑战，是如何不断吸引高级人才。 由于在几年之后，每个人都成了高级软件工程师，所以Netflix很难吸引到其他科技巨头及顶尖工程师们的关注。这倒不是说Netflix就没法雇佣到这个群体，而是只能以市场最高的薪酬，“暴力”从其他厂商那硬挖工程师人选。</p><p></p><p>而且由于缺乏“组长”之类的职级，不少其他科技企业的组长及以上工程师都以为，Netflix根本不需要或者说不关注比这个级别更高的技术人员。这跟Facebook就形成了鲜明对比。在Facebook，每个人对外都顶着软件工程师的头衔，但在内部，Facebook为其划分了从E3到E10的细分级别。</p><p></p><h3>管理层：为什么要对职级做出调整？</h3><p></p><p>因此，Netflix向工程师们解释了为什么要对职级做出调整。</p><p></p><p>在一份内部文件中，Netflix管理层表示：Netflix在员工、规模及整体复杂性方面不断发展壮大。但随着业务和组织结构的不断变化，我们所建立的工程团队架构并没有一同演进。我们认为，现在需要额外的结构来支撑团队构成，最大限度提高我们的人力成本预算效能，促进薪酬实践更加一致、更加透明，借此建立明确的发展路径与员工认可度。我们将努力为业务创新和Netflix的长期成功提供必要的创新技术解决方案，并确保其成本不会随业务增长而过度膨胀。</p><p></p><p>为了帮助实现这些目标，我们计划引入IC职业路径。在工程方面，引入的新职级将适用于包括软件工程师、安全工程师、测试工程师、技术项目经理等在内的具体岗位。</p><p></p><p>在后续发布的简要更新中，Netflix管理层概述了职级结构调整的原因：</p><p></p><p>引入IC职业路径，能够帮助我们解决以下关键挑战：</p><p></p><p>1、发展团队组成，最大限度提高我们的人力成本预算效能</p><p></p><p>2、 提高薪酬实践的一致性、严谨性和透明度</p><p></p><p>3、建立明确的发展路径与员工认可度</p><p></p><h3>新政核心动机：或与成本有关</h3><p></p><p>但从种种迹象来看，Netflix出台新职级的核心“驱动力”恐怕与成本有关。具体来讲，全部按高级工程师的职称为员工规划薪酬似乎效能较差，其工资甚至达到了其他科技同行组长工程师甚至是主任工程师的水平。</p><p></p><p>我曾与几位年薪15万美元的南美洲高级软件工程师交流过，还分别接触过在美国市场能拿到42.5万美元、52.5万美元和80万美元年薪的工程师。但在实际入职之前，他们的薪酬预期都是一样的。之所以存在这么大的差异，是因为有些获得了高级工程师职务，有些甚至达到了组长或主任工程师级别。</p><p></p><p>薪酬拿得越高，肩上的担子自然越重，而且已经占据岗位的员工肯定不想挪窝。</p><p></p><p>现在我们把Netflix的新职级与Facebook对应起来看：</p><p></p><p>E3：软件工程师I</p><p></p><p>E4：软件工程师II</p><p></p><p>E5：高级软件工程师</p><p></p><p>E6：组长软件工程师</p><p></p><p>E7：主任软件工程师</p><p></p><h3>内部调查：68%的受访者对新职级不满</h3><p></p><p>8月10号星期三，激动人心的“大日子”终于来临。Netflix更新了员工名录，大家终于可以相互查看职级了。</p><p></p><p>其实之前员工就已经知晓了自己的职级，也跟关系亲近的同事私下交流过。但这一次，所有调整都将全面公开。</p><p></p><p>过去几个月来，职级调整的过程其实颇为紧张。我与一位工程经理交流过，他希望把自己手下的所有工程师都评上E6级别。毕竟大家都已经工作了很多年，而且也都拥有不俗的业绩表现。但主管完全不支持这样不加区分的方式，所以最终只有20%的工程师晋升为E6职级，其余仍是E5级别。</p><p></p><p>以Netflix内部，某拥有约150名工程师的部门为例，各职级间的典型分布如下图所示：</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/e3/e37255587fe4dc7d338c21570a9501c7.png\" /></p><p></p><p>大部分软件工程师被评为E5级别（高级工程师），部分成为E6（组长工程师）。在所有职级中，E4（工程师II）和E7（主任工程师）占比最低。</p><p></p><p>过去几个月来，随着项目的持续推进，不少老员工离开了Netflix。大多数人之所以选择辞职，理由正是仍在E5，没能更进一步升任E6。</p><p></p><p>不少离职工程师之前都是从其他科技巨头跳槽来Netflix的，他们之前就在那边担任组长或主任工程师。当初没有问题，是因为他们知道Netflix这边最高也就到高级工程师，人人如此。很多人觉得这样不错，头衔不再细分、自然也就没有高低。</p><p></p><p>但随着新职级的出台，这些曾任担任过组长或主任工程师的员工现在被评为E5（高级工程师），自然引发了他们的强烈不满。</p><p></p><p>在Netflix匿名Blind频道进行的一项内部调查中，只有24%的受访者回答了“各位E5工程师：评级已经结束，有多少人打算离职？”的问题，并表示愿意留下来。在“你对自己新的评定职级满意吗？”中，68%的受访者回答了“否”，32%回答称“是”。</p><p></p><p>但这种匿名调查往往会过度放大负面情绪，所以对结果还是谨慎些为好。但无论如何，大家对E5职级的不满可以说是有目共睹。</p><p></p><p>软件工程师们对E5职级的最大不满，跟薪酬补偿有着密切关系。E5职级的年薪一般在40万到80万美元之间。很明显，这个区间内的高位已经接近甚至达到了E6和E7的级别。那这些收入高、职级评定却较低的工程师，后续会受到怎样的影响？</p><p></p><p>答案很快就会揭晓，因为年度薪酬审查已经开始。Netflix的年度薪酬审查从8月22日持续到10月21日，这可是决定员工工资水平和能否加薪的重要时刻。而从10月24日到11月11日，经理们将逐一向员工传达新的薪酬待遇。</p><p></p><p>绝大多数Netflix员工预计，那些收入高但职级低的工程师应该暂时不再涨薪，直到完成职级晋升、进入更高的薪酬区间。这也是我们能够想到的，最明智的处理方式。毕竟粗暴降薪肯定会导致员工流失，所以Netflix应该不会做这样的蠢事。</p><p></p><h3>“单职级”政策宣告终结</h3><p></p><p>职级的引入，也可能标志着Netflix不再鼓励人们比较外部薪酬、参加其他公司的面试。在此番职级调整之前，Netflix会鼓励员工多参加外部面试，搞清楚自己的市场定位；但前提是他们得把打听到的薪酬数字分享给Netflix，帮助公司做好待遇设计。</p><p></p><p>但随着职级制度的落地，与之匹配的内部预算结构也将固定下来，所以Netflix那新颖的制度恐怕也将宣告结束。</p><p></p><p>Netflix推出职级制度，标志着其“单职级”政策的终结。事实上，Netflix能够在这么多年里靠单一职级汇聚起近2000位软件工程师，这本身就是个奇迹。一般来说，这种简单的管理方式最多只能支撑100名左右的软件工程师，Netflix已经用实际行动创造了历史。</p><p></p><p>所以我们有理由回顾Netflix这套单一职级制度的优越性：</p><p></p><p>独特的文化。 虽然Facebook之类的企业对外也没有明确的职级划分，但内部细分其实一直明确。而Netflix则创造了一种既不做内部细分、以能维持工程师队伍长期稳定的制度，非常了不起。</p><p></p><p>有益于招聘。 很多工程师其实更喜欢这种扁平化的职级设计，所以帮助Netflix吸引到不少这类人才。</p><p></p><p>坚持提供市场最高薪酬。 通过鼓励员工参与外部面试并反馈市场报价，Netflix提供的永远是市场最高的薪酬水平。想要多赚钱就去Netflix，早已成为技术行业内公开的秘密。</p><p></p><p>但没有制度是完美的，出于以下几个问题，Netflix的这套老方案迟早会崩溃：</p><p></p><p>成本问题。 Netflix其实是在用超额预算雇用软件工程师，却没有为他们设定明确的高期望。当然，只要员工们有自我驱力，那设不设期望其实影响不大。因此这种方式在小团队中往往效果不错，但随着初创公司发展为大型企业，这种内驱力也将消散在庞大的组织结构当中。</p><p></p><p>阻断了新人工程师的加入通道。 由于只设一个职级，所以Netflix从来就不会向初级软件工程师敞开大门，这也在很大程度上影响了企业文化。大多数科技企业会通过实习生和应届毕业生招聘渠道来内部培养人才，Netflix则用市场上最高的薪酬直接挖走这些人才。看似摘取了培养果实，但Netflix也为此付出了极高的人力成本。</p><p></p><p>期望不明确。 当组织对不同经验、不同技能水平的员工给予同样的期望时，就会引发某种混乱。这种混乱会广泛存在于绩效评估和日常工作当中。换言之，在Netflix这边，拥有四年工作经验的工程师跟已经干了二十年的技术老鸟需要承担同样的责任、满足同样的期望，这显然有点不切实际。</p><p></p><p>作者介绍：</p><p></p><p>在 mobile.dev 撰写实用工程师通讯和顾问。曾在 Uber、微软、Skype、Skyscanner 任职。</p>",
    "publish_time": "2022-09-05 13:35:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]