[
  {
    "title": "红帽发布全球企业级开源现状调查报告：八成受访企业倾向选择企业开源软件",
    "url": "https://www.infoq.cn/article/UF9axyOmpWZIXwJGFsKQ",
    "summary": "<p>近日，红帽发布2022年企业级开源现状调查报告，这是红帽第四年进行该调查。结果发现，92% 的受访IT 决策者认为，企业级开源解决方案非常有助于解决他们面临的与疫情相关的挑战。早在疫情开始之前，许多企业就已经开始向开放混合云过渡。 无论是有意的架构选择，还是在日新月异的市场环境中被迫为之，使用开源开发模式，以及开源代码构建的云计算和不间断服务对几乎所有行业的企业来说都越来越重要。此外，供应商支持、安全性都会影响企业对开源软件的选择。</p><p></p><h2>企业级开源增长趋势明显</h2><p></p><p>在今年的调查中，82%的IT决策者表示更倾向于选择为开源社区做出贡献的供应商，原因集中在供应商更加熟悉开源流程、会帮助维持健康的开源社区、对企业所需功能的开发有影响力、解决技术挑战的效率更高。</p><p><img src=\"https://static001.infoq.cn/resource/image/19/e3/19624c96d832807db179b6a7d40530e3.jpg\" /></p><p></p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/52/c3/52f9cba0e0dbcbf848be6f250b7e64c3.jpg\" /></p><p></p><p>安全性也是企业级开源的一大优势。89%的受访者认为企业级开源软件比专有软件更安全或者同样安全。大体上，这些数值与去年的调查结果类似，但是“更安全”这个选项的比例增加了百分之四，这与十多年前将开源软件安全视为弱点的主流认知相比发生了很大的观念变化。</p><p>&nbsp;</p><p>从安全角度来看，是什么让企业级开源如此有优势？</p><p>&nbsp;</p><p>开源安全如今最大的优势在于“团队可以为内部应用使用经过测试的开源代码”，这反映出开源代码在企业内部得到了广泛应用。52%的受访者认为安全补丁有据可查，51%的受访者认为供应商及时为企业级开源漏洞提供补丁，44%的受访者认为相比于专有软件有更多人审查和测试代码。</p><p><img src=\"https://static001.infoq.cn/resource/image/bf/7a/bfa82c6f9c1e437eac73667a19yy557a.jpg\" /></p><p>最近几年，企业级开源在持续获得专有软件的市场份额。根据红帽的调查，这种趋势在接下来两年会持续下去，受访者公司中使用的专有软件占软件总数的比例将下降百分之八。与此同时，预计企业级开源软件的比例将上涨5%，基于社区的开源软件比例将上涨3%。</p><p>&nbsp;</p><p>企业级开源的应用也已经延伸到新涌现出的重要技术工作负载，其中80%的受访者计划增加企业级开源在人工智能、机器学习、边缘计算和物联网等领域的应用。这种趋势出现的很大一部分原因在于参与调查的IT决策者认为企业级开源越来越受欢迎，其中77%表示相比一年以前，现在他们对企业级开源的看法更加积极。</p><p><img src=\"https://static001.infoq.cn/resource/image/c5/7f/c55fee121fdcdda7c1c71f806687cc7f.jpg\" /></p><p>在具体应用层面，62%的企业会选择将企业级开源软件用在IT基础架构现代化的过程中，54%的企业会在数字化转型中应用。容器、Kubernetes以及大量补充性的云原生开源项目都是典型的新兴软件类别，这些构成的软件生态系统正在不断发展中。70%参与调查的IT决策者所在的公司正在使用Kubernetes，几乎三分之一的决策者计划在接下来12个月内大幅增加对容器的使用。</p><p><img src=\"https://static001.infoq.cn/resource/image/0e/14/0ee5b4d4d5b5286b3545fdbd87359214.jpg\" /></p><p>即便企业级开源已经成为很多企业的主流选择，但也有部分企业出于对技术支持水平的担忧、对兼容性的担忧、对代码本身安全性的顾虑以及内部员工缺乏管理和支持企业级开源技术技能而放缓使用脚步，但从长远来看，企业级开源技术的应用度将逐渐升高。</p><p></p><p>作为一种战略资源，企业级开源具有多种重要特性，超过75%的受访者同意企业级开源技术能带来灵活性，确保其公司可以及时利用最新创新，有助于公司利用混合云基础架构，并且是其安全战略的重要组成部分。</p><p>&nbsp;</p><p>作为企业级开源最重要的供应商之一，红帽在近期的全球峰会上针对企业当前在应用开源软件中存在的问题发布了一系列解决方案。</p><p></p><h2>红帽企业Linux 9来了</h2><p></p><p>红帽Linux可以看作是一个未来创新的平台，不论是物理机、虚拟机、私有云、公有云还是边缘，甚至是汽车操作系统，Linux 9都支持，红帽会把一致性、稳定性、安全性作为Linux 9未来发展的中心，同时简化混合云基础架构，让用户在公有云、私有云中都有一致的体验，提高开发效率。</p><p>&nbsp;</p><p>在之前，红帽已经有了汽车级 Linux 项目，但如今和通用汽车进行了合作，开发了汽车专用 Linux 发行版。通用汽车在 Ultifi 平台上实施连续功能安全认证，简化了车载软件系统更新开发过程，过去的安全认证通常需要花费六个月到一年的时间做认证。而车载操作系统只是红帽在汽车这个边缘市场工作的一小部分，开发连接车辆的云基础设施更为复杂。车联网的大部分关键计算虽然都发生在边缘，但大量数据需要发送到云端处理。</p><p>&nbsp;</p><p>这些工作不是靠红帽和汽车制造商就能完成的，需要包括 GPU 等芯片制造商在内的众多合作伙伴的努力。为此，红帽在峰会上推出了红帽边缘 (RedHat Edge) 计划来加快企业采用边缘计算架构。这套新的跨产品组合边缘功能将专注于通过降低复杂度、加快部署、增强安全能力，增强从数据中心到边缘系统的一致性，帮助客户和合作伙伴更好地适应边缘计算。</p><p></p><p>事实上，近几年红帽的很多应用创新都发生在边缘端。比如，过去一年里红帽已开始将 RHEL 和红帽 OpenShift 等主打产品推向边缘，红帽希望将其在数据中心的这些能力带到边缘。</p><p>&nbsp;</p><p>此外，既然是做边缘计算，就要更加自动化，人力在边缘端的管控力有限，所以要透过自动化的方式控制边缘计算。</p><p></p><h2>安全是最重要的话题</h2><p></p><p>&nbsp;</p><p>毫无疑问，不管有多少功能，最重要的还是安全，安全永远是所有IT使用者，包括所有人都最关心的事情。如今，黑客对开源的攻击发生在整个供应链层面，红帽也在不断扩展安全能力。</p><p>&nbsp;</p><p>红帽认为安全是供应链的安全，所谓供应链是一个循环的概念，从基础设施到开发、运维和交付，每个环节都需要安全，缺一不可，不只是说应用安全就可以了，软件本身的开发模式，甚至开发中的签名功能，都需要保证安全性，并且尽量自动化整个过程。</p><p>&nbsp;</p><p>面向未来，红帽会持续在品牌，社区与生态、产品与行业、协同扩展方面努力。</p>",
    "publish_time": "2022-06-27 11:03:48"
  },
  {
    "title": "首都在线龚宏绩：用生态赋能企业出海 实现多方共赢 | TGO 专访",
    "url": "https://www.infoq.cn/article/PmPSOLYH7rLm0OJ0SyMF",
    "summary": "<p>嘉宾介绍：龚宏绩，首都在线海外事业部 CTO&amp;副总经理，TGO 鲲鹏会（广州）学员。</p><p>曾先后供职于 SurfControl、腾讯、魅族、三七互娱等公司，担任开发、运维等高级管理职位。自 2021 年加入首都在线以来，龚宏绩先生一直致力于通过高效、稳定的云基础设施助力中国企业出海。</p><p></p><p>“折腾”是龚宏绩对自己职业生涯的评价之一。一直能够踩中时代风口的他，不仅敢折腾，而且更善于折腾。自 2021 年加入首都在线以来，龚宏绩一直在“折腾”一件大事——通过云服务助力中国企业出海。</p><p></p><p>同事们对他的评价是，工作专注、效率高。龚宏绩表示，高效的工作得益于详细的工作计划以及四象限计划表，特别是四象限计划表更贴近工作中的执行阶段，让他把精力集中在重要紧急的事情上，进而提高工作效率。</p><p></p><p>而专注对待每一件重要的事，从他工作与生活的细节中可以窥见一斑。龚宏绩工作时全身心的投入其中，不被外界所打扰；工作结束陪家人时，也会沉浸其中，比如他会直接参与到小孩的活动中，而不是在旁边看着孩子玩耍。</p><p></p><p>对龚宏绩而言，折腾是对自己敏锐洞察力的信心，而专注和高效的风格是他对公司、客户以及家人的尊重，而他的这一风格，也在首都在线的团队中留下了深深的烙印。</p><p></p><h3>提升企业全球竞争力，云服务商成重要推手</h3><p></p><p></p><p>从早期的互联网社交、视频和短视频、互联网工具等数字化产业出海，到现在传统企业积极借助数字化技术进行出海，中国企业通过全方位数字化转型和创新，在海外实现产品升级和品牌升级，提升全球竞争力。</p><p>越来越多的企业在进行全球业务布局时，将自己原有的数据中心迁移上云，或者通过混合云的方式，方便其全球化的运营和管理，同时更便捷地服务客户，提升客户体验。龚宏绩表示，“鼓励企业出海参与全球化竞争是一项国家战略，云服务商应该尽全力为他们提供稳定、可靠、落地的一站式的云上云下服务，帮助中国各产业提高全球竞争力。”</p><p></p><p>在谋划出海的过程中，企业对云服务提供商在全球基础设施覆盖、云计算技术的稳定性、安全合规以及合作伙伴解决方案的丰富性等均有着较高的要求。</p><p></p><p>有着多年甲方工作经历的龚宏绩，对出海企业的心态特别理解。在他看来，出海企业对云服务商提出的要求都十分合理，因为这些企业直接面对、服务的可能是几百万、上千万的用户，云服务一旦出现问题，大量的用户体验将受到影响。</p><p></p><p>据龚宏绩介绍，云计算服务商在最基础的服务部分应着重考虑稳定性，在创新层上应尽力为企业客户提供更大的便捷性，比如数据的实时监控、更快的服务速度等；云服务商在自身安全合规的前提下，应组织企业客户定期对不同国家的数据、网络、安全合规要求进行学习；另外，云服务商还应做好服务方的生态，提供一揽子解决方案，为出海企业助力。</p><p></p><p>拥有“全球化思维，本地化行动”是企业出海取得成功的关键。而能够为数字经济提供技术支撑，同时在全球范围内高效配置资源，加强不同国家和地区的安全合规，推动企业围绕当地用户需求创新产品、服务和体验的云计算服务商，已经成为企业实现“全球化思维，本地化行动”的重要推动力。</p><p></p><h3>用产品与服务构筑出海能力，破局国内企业出海核心痛点</h3><p></p><p></p><p>天下大势，合久必分，分久必合，企业需求也会如此变化。近五年，中小企业、传统产业，都在寻求把原有业务转云，让云服务商提供企业基础架构组件。当前，别是一些中大型公司，又有从云上转到云下的需求。企业的需求基于市场变化，优秀的云服务商也要具备灵活调整服务边界的能力。</p><p></p><p>据龚宏绩介绍，首都在线就是一家具有全球服务能力的国际化云计算服务商，通过建设稳定、优质的全球网络，向客户提供一站式云上云下服务，助力中国企业出海。</p><p></p><p>谈到与同行之间的优势，他表示，经过十余年的投入和优化，在网络层面，首都在线已形成全球一张网，全球所有站点都用内网的方式打通；在交付能力上，首都在线能够适应客户的定制化需求。产品人员、研发人员、解决方案人员以快速响应客户需求，并迅速落地；而服务一直是首都在线生存的核心，目前也在不断优化和提升相关能力。</p><p></p><p>在服务能力方面，首都在线背后存在一支强大的运营团队，可以实现从资源的采购、转运到最后部署上线的全过程管理；另外结合客户业务特点、行业特点，制定精细化运营、服务方案，并且不断提高资源周转率、使用率，最大限度降低客户使用成本。同时，通过一些完整的解决方案，满足客户行业需求、提高终端用户使用体验。</p><p></p><p>比如，在全球同服加速方案中，首都在线为客户提供专属优化的本地多线 BGP 带宽、本地 DDOS 防护，将游戏客户端请求就近接入，并利用全球云互联专线加速分发到游戏服（中心节点）。让游戏玩家享受到流畅且高性能的游戏体验，同时也大大提高了服务可用性；在混合云组网的方案中，通过云 + 裸金属 + 自建 + 混合云方式应对业务独享、安全、冗余的架构，同时满足业务爆发式增长的需求。</p><p>龚宏绩把首都在线云服务的基础部分称为底座，公司的战略是把底座打稳，然后再通过团队的行业解决方案能力，在一个个不同行业落地生根。当服务同一个行业里的大量不同客户后，团队就很清楚客户的需求点在哪了，甚至已经比客户还懂客户的需求。</p><p></p><h3>构建服务方生态体系，提供一揽子解决方案</h3><p></p><p></p><p>几年前，出海对很多中国企业来说，还是一道选择题。现在，它已经变成一道必答题。“独木不成林，一人不为众”，单凭云服务商自身的资源和力量难以更好地满足客户的诉求。因此，云生态服务方的生态建设也进入了新阶段，通过集合生态伙伴能力，满足更多出海企业客户“用好云”的诉求。</p><p></p><p>据龚宏绩介绍，首都在线围绕企业出海建立的生态同盟已初具规模，可以为客户提供一揽子解决方案。比如，通过与 AWS 的战略合作，首都在线全球网络布局、特别是跨大洋、跨大洲的光缆和通信能力方面，实现重要补充；另外在整个互联网生态，特别是 PaaS 和 SaaS 产品部分，能够满足客户的诸多特殊需求。</p><p>不仅如此，首都在线还与其他众多专业厂商牵手建立战略联盟，丰富公司产品线，为用户提供更全面的高质量 IaaS 公有 / 私有云服务，以及 PaaS 层和 SaaS 产品服务。同时，首都在线也成为客户与生态伙伴之间沟通的桥梁，帮助其改善产品体验与服务。</p><p></p><p>“公司专注自己的优势领域，在一些特殊的场景、特殊的产品上，选择与全球优选的服务商合作。以首都在线全球化数据中心为基础，共建基础、开放、高效的云平台，实现多方共赢。”龚宏绩说道。</p><p>除了提供优质的产品及服务外，合规与安全也是企业出海的“生命线”。龚宏绩称，不触碰、不接触用户数据，是首都在线服务客户的安全底线。公司除了在资源规划和平台部署时会对安全合规做整体考量之外，还会邀请生态企业中的专业法律顾问团队，为客户提供不同国家、地区对数据、网络、安全的法律法规要求的学习培训。</p><p></p><p>龚宏绩认为，客户独特的行业特性，以及在出海时面对全球各地用户的独特需求，使得云服务商需要具备整合生态，锚定伙伴能力提升，提供更完整解决方案的能力。同时，还要具备足够开放的心态去真正赋能生态伙伴、发展生态系统，加强更多应用落地，助力出海企业业务不断地推进、下沉，这才是国际化云服务商未来的生存之道。</p><p></p><p></p><h3>Q&amp;A</h3><p></p><p>&nbsp;云边协同可以将边缘计算节点的算力、存储等资源和云计算资源进行统一进行协调，在我们服务的客户中，云计算解决哪方面的需求？边缘节点解决哪方面的需求？</p><p>A：云计算解决的是集中统一，资源统一管理、服务集中调配的问题；边缘计算将网络边缘上的计算、网络与存储资源组成统一的平台为用户提供服务，使数据在源头附近就能得到及时有效的处理。比如，短视频或直播行业，因行业覆盖范围广，各地方网络质量不一样，要保证主播、用户有比较好的延时体验，计算部分放在云上，视频调度、流媒体的部分就用边缘覆盖，以保证主播和粉丝的用户体验。</p><p></p><p>&nbsp;企业出海会经历业务从落地、逐渐发展到爆发的阶段，首都在线是如何做到在企业业务不同阶段，云资源能够顺滑的实现调整？有什么方式可以为客户节省成本？</p><p>A：首都在线背后有一个强大的资源运营的团队。运营团队成员，一方面会去做年度的计划、客户的规划；另外一方面做精细化运营，比如教育行业，客户业务高峰期是在白天；游戏客户的业务高峰期在晚上八点到十点。结合行业特点、客户访谈信息，以及客户自身业务发展情况等，通过精细化运营的手段，不断提高资源周转率、使用率，最大限度降低使用成本。</p><p>首都在线向客户提供全球资源服务，包括不同的节点之间也有专业运营的团队在在背后支撑，我们可以用最短的时间实现需求从提出到落地。公司从资源的采购、资源转运到最后部署上线，背后都有一套完整的运营系统在支撑。</p><p></p><p>&nbsp;在用户的数据隐私方面，首都在线的解决方案是什么？</p><p>A：首都在线非常清楚的知道自己是中立的云服务提供商，公司不触碰、不接触用户数据，这是安全底线；当用户需要数据安全的时候，我们会向用户提供关键的建议，甚至在必要且能够保证客户数据安全的情况下，给用户提供数据安全方面的服务，但我们的底线是永远不碰用户数据。</p><p></p><p></p><p></p><h3>关于 TGO 鲲鹏会</h3><p></p><p>TGO 鲲鹏会是极客邦旗下科技领导者聚集和交流的组织，学员由 CTO、架构师、技术 VP、具有技术背景的 CEO 等组成，目前已经在北京、上海、深圳、广州、杭州、成都、硅谷、南京、台北、厦门、武汉、苏州等 12 个城市定期举办学习活动。</p><p>TGO 鲲鹏会采用了“学员共建”的组织形式，希望通过“共建、自治”的方式维护各城市的健康发展，为学员提供必要的服务，帮助学员个人更好地学习和成长，助力学员企业之间更好地合作与交流。加入 TGO 鲲鹏会，全方位提升自身价值，成为卓越科技领导者！</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/4c/4c5129d041d7023b2c328ccaa1b96277.png\" /></p><p></p><p></p><p>点击阅读原文或扫码加入TGO鲲鹏会！</p>",
    "publish_time": "2022-06-27 10:25:39"
  },
  {
    "title": "中台产品经理的进阶思考｜InfoQ大会早班车第4期",
    "url": "https://www.infoq.cn/article/94zRDf3fged5KsySLbvx",
    "summary": "<p>刘光月老师拥有十余年产品经验，她见证了一个又一个亿级用户产品的成长。本期我们连线京东产品总监刘光月，和你一起聊聊她在中台产品设计、产品运营方面的思考，期待对你有所启发。</p>\n<p>首届PCon全球产品创新大会即将落地北京，<a href=\"http://pcon.infoq.cn/2022/beijing/schedule?utm_source=infoq&amp;utm_medium=zaobanche\">点击查看最新日程</a>。</p>",
    "publish_time": "2022-06-27 10:15:49"
  },
  {
    "title": "平安消费金融高并发业务架构演进实践与思考",
    "url": "https://www.infoq.cn/article/yL2dLq6M3O02WRW2A80C",
    "summary": "<p>在最近短短几年中，平安消费金融业务迎来爆发式增长，业务系统也从单体应用一步步演进到微服务架构的一百多个应用，这个过程经历了一系列的微服务架构的建设规划、升级、落地及架构不断演进，目前系统日交易金额10亿+，良好的支持了业务系统高并发、高可用及弹性扩展能力。</p>\n<p>本次演讲主要介绍互联网消费金融的业务架构特性，如何在业务订单量、成交金额高并发增长业务同时，应对监管、安全、风控要求下设计合理架构；如何对内对接海量银行内部系统，对外采集风控审批业务数据源；以及在架构演进过程遇到的问题及思考。</p>\n<p>另外，美的、微众银行、福特汽车等企业都来大会演讲啦，快来<a href=\"http://gk.link/a/11siC\">ArchSummit深圳站一睹为快～</a></p>",
    "publish_time": "2022-06-27 10:12:26"
  }
]