[
  {
    "title": "开发者如何看待分布式系统中的不确定性 | InfoQ访谈",
    "url": "https://www.infoq.cn/article/XhwPhp9HxaZ3pE0kexVs",
    "summary": "<p>分布式系统中有故障是很正常的，分布式系统只能确保一致性、可用性和分区容忍性三项中的两项。但Kevlin Henney认为，这种印象将限制了开发者对分布式系统行为方式的了解。Henney曾于<a href=\"https://qconlondon.com/\">2022年伦敦QCon</a>\"及<a href=\"https://plus.qconferences.com/\">2022年五月10-20日QCon Plus</a>\"中发布了关于“6个不能”的主题演讲。</p><p>&nbsp;</p><p>Henney认为，在一段代码中，我们可以透过结构和源代码缩进看到简单的控制流，如序列和分支。但我们看不见的则是网络或后端中损失的时间或序列重排。路由、电缆、主机或者是中间件发生故障并不稀奇，我们不能指望所有东西都能随时保持可用性。Henney列出了一个可能发生的场景：</p><p>&nbsp;</p><p></p><blockquote>如果用于响应用户信息的节点彻底崩溃下线，那么用户将永远无法收到回应。架构师也无法保证节点是否能够恢复使用。当然，我们也可以将缓存中的答案返回给用户，但这个回复可能已经过时了。无论怎么说，用户都不会收到真正的答复。</blockquote><p></p><p>&nbsp;</p><p>CAP定理是分布式系统的“海森堡不确定性原理\"：一致性（Consistency）、可用性（Availability）以及分区容忍性（Partition Tolerance）。我们无法同时拥有全部三种属性，正如Henney所解释的：</p><p>&nbsp;</p><p></p><blockquote>一致性意味着，返回结果只能是最新的、一致的或者错误的三者之一；对可用性来说，错误响应不存在，但却不能保证结果是最新或一致的；分区容忍度是指分布式系统在部分分区网络不可用的情况下仍保持运作的能力。我们只能拥有其中两项，或者说，我们做不到全知全能。&nbsp;</blockquote><p></p><p>Henney总结说，超时和缓存在分布式系统作用显著的原因不在于它们的变通性或者优化的能力，而是因为从根本上讲，它们是必需的。</p><p>&nbsp;</p><p>InfoQ就分布式系统采访了<a href=\"https://www.infoq.com/profile/Kevlin-Henney/\">Kevlin Henney</a>\"。</p><p>&nbsp;</p><p>InfoQ：为什么人们会默认分布式系统是可知的？</p><p>&nbsp;</p><p></p><blockquote>Kevlin Henney：开发者通常是从IDE中看世界的，也就是单一的机器。他们会默认以面前的代码来推理系统的运作。虽然他们能意识到网络是故障、并发、异步以及延迟的来源所在，但受视角所限他们往往不能认清现状：当前的问题实际上是更基础的、系统本质上的。&nbsp;尽管异常处理程序可能会意识到故障的存在，但它们无法反映出故障的异常性。我见过不止一个编码指南如此写道：“异常应该是例外的”。这条建议也不过是文字游戏而已，它既没帮助也不现实。在网络环境中，连接超时、中断以及其他异常情况都一样，都是“正常现象”。并且，这些“小问题”也不算很小，或者说它们就是分布式系统的组成部分。</blockquote><p></p><p>&nbsp;</p><p>InfoQ：我们要如何处理分布式系统的不确定性呢？</p><p>&nbsp;</p><p></p><blockquote>Henney：首先，承认不确定性的存在。其次，承认失败或不完整信息是正常情况而非是例外。第三，决定什么样的数据质量是适合应用的。&nbsp;对确定性和可知性的限制意味着架构师必须意识到，状态的一致性是基本决策而非实现细节。数据最终是一致的还是同步交易的，决定了代码、用户体验以及其他系统品质。如果用户做出变更，那么该变更是否需要对其他用户立即且必须可见？这个问题的答案对架构起决定性作用。对数据质量过于严格违背CAP原则，或者会严重影响性能，如分布式锁定。&nbsp;这些对分布式的限制影响有很多，比如Java的RMI之类的分布式垃圾回收机制，在确定一个对象是否不再需要，也就是需要回收的时候，答案并不是唯一的。在托管语言的单个进程中，对象是否可以作为事实声明引用是可以被确定的，但在分布式系统中却不一定。基于超时的租凭机制可以用于确定远程进程是否可以引用某个对象， 但它并不能保证该判断是否绝对正确，只是可能正确而已。</blockquote><p></p><p>&nbsp;</p><p></p><p>&nbsp;</p><p>原文链接：</p><p><a href=\"https://www.infoq.com/news/2022/09/distributed-system-knowable/\">A Distributed System is Knowable: an Impossible Thing for Developers</a>\"</p>",
    "publish_time": "2022-09-14 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "李彦宏发起创立的AI制药公司，首次发布免疫机器人，可对免疫系统实现精准编程",
    "url": "https://www.infoq.cn/article/80N3vqFJcO6YhdBKw9Sb",
    "summary": "<p></p><blockquote>基于AI能力加持的生物计算引擎，可以帮助创新药物研发实现从“大海捞针”变为“按图索骥”。</blockquote><p></p><p></p><h2>百图生科推出生物计算驱动的“ImmuBot”免疫机器人</h2><p></p><p>&nbsp;</p><p>9月9日，百图生科正式启动北京中心实验室，并首次对外披露其基于生物计算引擎de novo设计的全新蛋白质药物——“ImmuBot”（免疫机器人）。</p><p>&nbsp;</p><p>据介绍，由于人体免疫系统高度复杂，种类多达数十类，且在不同组织器官环境有不同特征的免疫细胞族群，与每个细胞上决定其功能的数以万计的蛋白质，共同形成了复杂的万亿关系级别的功能调控网络，且在不同人群中有各不相同的亚型。</p><p>&nbsp;</p><p>当前的免疫调控药物只针对这个复杂系统内的通用人群、单一或少数靶点进行调控，缺乏对病人亚群和疾病异质性的精细设计，无法实现精准的靶向和完整的调控，造成了药物的安全性、有效性特别是长期有效性的巨大挑战。</p><p>&nbsp;</p><p>面对免疫调控的行业难题，百图生科基于生物计算引擎 de novo设计的“ImmuBot”，具备四大功能特点：</p><p>&nbsp;</p><p>弹头高性能。基于<a href=\"https://www.infoq.cn/article/WwxQa0kOxY8B7Qwyztsj\">人工智能</a>\"的强大能力，ImmuBot为每一个靶点配备了恰当亲和力、精准定表位、精准功能激发的高性能弹头，并可实现相对其他同族蛋白的高特异性设计，从而极大提高有效性和安全性。组合多靶向。基于生物计算引擎的靶点组合挖掘和多弹头桥接药物设计，ImmuBot可实现对多个组织特异性靶点、免疫功能靶点的组合靶向，使其具备强大的精准靶向、免疫细胞招募、作用于多个免疫机制、防止耐药逃逸等功能优势。编程式控制。通过创新蛋白质设计，ImmuBot可以实现对人体微环境、细胞因子等的传感器感知，实现AND、OR、IF等条件触发功能，从而实现在特定疾病微环境内激活、针对患者情况选择性激活、序贯弹头激活等高级功能，实现对免疫系统的精准重编程。构件式组装。每个ImmuBot均由多个免疫功能弹头、组织导航弹头、微环境传感器、可编程控制器在适合的底座上由生物计算引擎组装而成，各类构件均可预制、多次复用、快速组装，不仅确保了单体药物的最佳性能，而且带来整体药物研发10-100倍的效率提升，为针对细分人群、疾病亚型、罕见病的精细化药物设计带来新的可能。</p><p></p><p>百图生科首席执行官刘维介绍，ImmuBot 平台上的每个“机器人”药物均由多个免疫功能弹头、组织导航弹头、微环境传感器、可编程控制器等构件组装而成，可以实现传统抗体药物无法实现的复杂作用机制，有望为大量未被满足的临床需求提供新的解决方案。</p><p>&nbsp;</p><p>刘维表示：“百图生科所开发的免疫机器人药物，是高度复杂的创新蛋白质，大多在自然界中并不存在。由于不能依赖生物筛选的基础，其潜在设计空间趋于无限大，为设计带来了极大的挑战。但<a href=\"https://xie.infoq.cn/article/84fdfc60085104ca8f1d88587\">生物计算</a>\"的高效de novo设计能力，可以在超大算力的加持下，迅速对大量候选蛋白质的各功能指标、可开发性指标等维度进行评估，再通过高通量实验体系高速验证迭代收敛，使de novo设计成为可能。”</p><p>&nbsp;</p><p>资料显示，百图生科（BioMap）是中国首家生物计算引擎驱动的创新药物研发平台，由百度创始人李彦宏于2020年创立。2021年，百图生科与北京海淀区政府达成战略合作，在海国投贝伦产业园区建设5000平米的百图生科北京中心实验室。</p><p>&nbsp;</p><p>百图生科北京中心实验室内部设有大规模高通量自动化验证实验室、CLIA标准组学实验室、微流控芯片实验室、类器官实验室、免疫细胞和基因编辑技术实验室等一系列研究实验室，通过自主研发的高通量CRISPR系统、类器官系统、微流控系统、计算光学系统，为百图生科解码免疫系统、打造高通量干湿闭环的生物引擎提供关键能力。</p><p></p><h2>免疫机器人是如何炼成的？</h2><p></p><p>&nbsp;</p><p>ImmuBot 免疫机器人意图实现对免疫系统的精准重编程，治疗上百种免疫相关疾病。这样一个突破性药物平台是如何开发的？</p><p>&nbsp;</p><p>刘维表示，资产组合、引擎技术、生态平台是其核心支撑。</p><p>&nbsp;</p><p>基于免疫机器人技术平台高效研发的特色优势，百图生科正在构建一个大型的创新药物资产组合，包括10余类自主靶点挖掘项目、30余个构件研发项目、10余个自主和合作药物研发项目。</p><p>&nbsp;</p><p>随着大批构件项目的研发推进，未来公司会自主或与合作伙伴联合，高效地推出更多的药物管线。目前，公司已在10余个项目上取得HIT、LEAD等进展，预计明年将实现首批ImmuBot项目进入全球临床。</p><p>&nbsp;</p><p>这个大规模资产组合覆盖了大批肿瘤和自免疾病，特别是中国高发的胃癌、肝癌等临床需求强烈的病种，也覆盖了近十种主要的免疫细胞，为每类免疫细胞准备了创新的弹头。</p><p>&nbsp;</p><p>而在大规模资产组合背后，是由AI大模型驱动的高通量干湿闭环生物计算引擎。</p><p>&nbsp;</p><p>这一引擎通过一系列底层技术创新的“大科学装置”，包括万亿关系的多组学免疫图谱、千亿参数的蛋白质/免疫计算大模型、亿级数据生产量的高通量免疫模拟实验系统等关键技术，形成了高效的干湿闭环，才能将解码复杂免疫系统、de novo设计全新的蛋白质药物变为可能。</p><p></p><h2>百图生科的“AI+药物研发”实践</h2><p></p><p></p><p>随着 AI 技术在越来越多的行业中落地应用，AI + 制药也成了近两年的热词。</p><p>&nbsp;</p><p>头豹研究院报告显示，<a href=\"https://xie.infoq.cn/article/d5a177e935aa7ee3b07659954\">AI 制药</a>\"是指将自然语言处理、机器学习及大数据等人工智能技术应用到制药领域各环节，以提高、优化新药研发的效率及质量，降低临床失败概率及研发成本。</p><p>&nbsp;</p><p>而百图生科的核心逻辑是，利用生物计算引擎，从海量生物数据与信息中抽取知识，绘制“BioMap”，将创新药物研发实现从“大海捞针”变为“按图索骥”。</p><p>&nbsp;</p><p>百图生科首席 AI 科学家宋乐博士表示，整个 AI 体系架构会是一个四层嵌套结构。“你可以把人想象成是一个多尺度的系统，外面是器官或组织，有细胞的协同工作，再细分是单个细胞，里面是非常复杂的蛋白质互相作用网络、蛋白质调控基因表达网络，再深一层是蛋白质相互作用。这个大模型最底层的是基于蛋白质序列进行预训练，对蛋白质结构进行预测。”</p><p>&nbsp;</p><p>具体而言，四层嵌套结构可以理解为，系统通过训练获得一组表征，这个底层的表征可以用在上层模型上作为输入，第二层模型输出又可以作为上面一层模型的输入，让整个体系里的数据流通，或是让模型之间组合在一起。最后，在细胞系统层面的模型可以和下面的蛋白质预训练模型链条产生更好的效果。</p><p>&nbsp;</p><p>当前 AI 制药仍存在诸多挑战，其中一个比较大的难点在于，如何为 AI 定义目标？</p><p>&nbsp;</p><p>在接受采访时，刘维表示，宽泛地做 AI 无法产生独特的数据，也没有独特的试验闭环，很难真正突破行业平均水平。因此，必须要选定一个特定领域，并围绕这个特定领域搭建技术能力。</p><p>&nbsp;</p><p>“从公司创立之初，我们想得比较清楚的几件事是：第一，我们一直在找一个特定针对的领域，就像我们今天做的领域很垂直，但我们相信这是一个巨大的市场。这个领域中，免疫机器人作为一种平台技术，能够解决上百种免疫疾病。第二，我们围绕这个特定领域搭建了高通量蛋白、高通量免疫所有的实验能力，以及大模型和为了训练大模型所需的数据和知识图谱。如果你希望用一个新技术去泛泛做服务，想什么问题都能解决，这是很难的。而我们找了一个足够难，但足够聚焦的方向，就是去做全新的蛋白质药物设计。”刘维说道。</p>",
    "publish_time": "2022-09-14 09:53:56",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "京东科技全链路故障诊断智能运维实践｜InfoQ大会早班车第20期",
    "url": "https://www.infoq.cn/article/0qXKT2eVDyXBLCd08LbC",
    "summary": "<p>本次大会早班车邀请了京东科技智能运维算法负责人张静，聊一聊监控、告警、故障诊断、智能化，异常检测算法在京东科技数据库、网络、资源调度落地经验。</p>",
    "publish_time": "2022-09-14 10:51:45",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]