[
  {
    "title": "Netflix微服务异步迁移：从同步的“请求-响应”模式转换为异步事件",
    "url": "https://www.infoq.cn/article/2oxX1A5kr7l3NUJ9gIhv",
    "summary": "<p>假设我们正在运行一个基于Web的服务。请求处理变慢最终将会导致服务不可用。实际上，并不是所有的请求都需要立即处理。有些请求只要确认已收到即可。你有没有问过自己这样的问题：“我是否能够从异步请求处理中获益？如果确实如此的话，我该如何在一个实时的、大规模的关键任务系统中做出这种转变？”</p><p></p><p>接下来，我将要讨论我们是如何将一个面向用户的系统从基于请求-响应的同步系统迁移为一个异步系统的。我将会介绍是什么原因促使我们开始了这样的旅程，我们做出了哪些系统设计变更，这一过程中的挑战是什么，以及我们做出了哪些设计选择和权衡。最后，我会介绍在上线新系统时我们所使用的验证过程。</p><p></p><h2>原始架构</h2><p></p><p><a href=\"https://netflix.com/\">Netflix</a>\"是一个流视频服务，全球有超过两亿的会员在使用该服务。会员可以在众多支持的设备上观看电视节目、纪录片和电影。在访问Netflix的时候，借助我们的个性化推荐系统，他们能够看到各种选择。用户只需要点击播放按钮，就可以坐下来享受观看电影所带来的乐趣了。</p><p></p><p>我们会在这个电影放映过程中收集很多数据，用于运维和用例分析。其中有些数据会用来支撑我们的产品特性，比如继续观看，该特性允许会员中途停止观看电影，稍后等他回来时，在任何其他设备上都能从这个暂停点继续观看。这些数据还用于个性化和推荐引擎，以及核心业务分析。</p><p></p><p>我将会介绍迁移某个产品特性的经验，也就是浏览历史，该特性允许会员看到他们过去的浏览活动历史并且可以选择隐藏它。我们先看一下迁移之前的现有系统。在较高的层次上来讲，我们有支持不同设备的Netflix客户端，比如手机、台式机、笔记本电脑以及电视，它们在放映过程中会向Netflix云发送消息。</p><p></p><p><img src=\"https://imgopt.infoq.com/fit-in/1200x2400/filters:quality(80)/filters:no_upscale()/articles/microservices-async-migration/en/resources/11%20existing%20architecture-1662732582381.jpeg\" /></p><p></p><p>首先，数据会到达Gateway服务。在这里，它会被发送至Playback API，该API会管理放映会话的生命周期。此外，它还会将放映数据发送至Request Processor层。在Request Processor中，除了其他的任务之外，它会将长期和短期的观看数据存储到持久层中，对我们来说，也就是<a href=\"https://cassandra.apache.org/\">Apache Cassandra</a>\"以及用作缓存层的<a href=\"https://github.com/Netflix/EVCache\">EVCache</a>\"，后者能够让我们实现快速查找。</p><p></p><h2>回压</h2><p></p><p>大多数时候，该系统都能运行得非常好。在极少数情况下，有可能因为网络突发事件，或者某个Cassandra节点暂时运行缓慢，导致正在处理的某个请求被延迟。当这种情况发生时，鉴于此处是同步处理，请求处理线程不得不等待。这反过来又会使上游的Playback API服务变慢，进而使得Gateway网关服务变慢。</p><p></p><p><img src=\"https://imgopt.infoq.com/fit-in/1200x2400/filters:quality(80)/filters:no_upscale()/articles/microservices-async-migration/en/resources/12%20backpressure-1662732582381.jpeg\" /></p><p></p><p>除了云中的重试策略之外，这种速度变慢还会响应到运行在用户设备上的Netflix客户端。有时候，这种现象被称为回压。回压可以表现为系统中的不可用，并且会建立一个客户端必须要进行重试的队列。在这里面，有些数据对我们的工作至关重要，所以我们希望避免数据丢失，例如，如果客户端填充其本地队列时，该队列的容量是有限的，那么就可能会造成数据丢失。</p><p></p><p>我们对该问题的解决方案是在系统中引入异步处理。在Playback API服务和Request Processor之间，我们引入了一个可持久化的队列。现在，当请求传入的时候，它会被放到一个持久化队列中，并且立即确认。这样，就没有必要等待该请求处理完毕了。</p><p></p><p>事实证明，<a href=\"https://kafka.apache.org/\">Apache Kafka</a>\"非常适合这样的场景。Kafka提供了一个日志抽象，像Playback API这样的生产者可以追加日志，然后多个消费者都可以基于偏移量按照自己的节奏从Kafka日志中读取数据。</p><p></p><p><img src=\"https://imgopt.infoq.com/fit-in/1200x2400/filters:quality(80)/filters:no_upscale()/articles/microservices-async-migration/en/resources/15%20new%20architecture-1662732582381.jpeg\" /></p><p></p><p>这听上去很简单。但是，如果只是在两个处理层之间引入Apache Kafka，我们就能宣告大功告成吗？并非如此。Netflix的运营规模达到了每秒钟100万个事件。在这种规模下，我们遇到了异步处理的一些挑战，包括数据丢失、处理延迟、乱序和重复记录，以及偶然性的处理失败。另外，还有涉及Kafka消费者平台的选择以及跨区域方面的设计决策。</p><p></p><h2>挑战：数据丢失</h2><p></p><p>关于数据丢失，有两个潜在的诱因。首先，如果Kafka集群本身不可用，毫无疑问，我们将会丢失数据。解决这个问题的简单方法就是添加一个额外的备用集群。如果主集群由于难以预见的原因而导致不可用的话，发布者（本例中，也就是Playback API）可以将请求发布至备用集群。消费者的请求处理器可以连接至两个Kafka集群，因此不会丢失任何数据。</p><p></p><p><img src=\"https://imgopt.infoq.com/fit-in/1200x2400/filters:quality(80)/filters:no_upscale()/articles/microservices-async-migration/en/resources/16%20standby%20cluster-1662738783532.jpeg\" /></p><p></p><p>显然，这里付出的代价就是额外的成本。对于特定类型的数据来讲，这种行为是可行的。但是，是否所有的数据都需要这样做呢？幸运的是，答案是否定的。我们有两种类型的放映数据。关键数据将会按照这种方式来处理，这证明备用集群的额外成本是值得的。其他不太重要的数据则会只使用一个普通的Kafka集群。由于Kafka本身采用了很多的策略来提升高可用性，所以这足以满足我们的要求。</p><p></p><p>数据丢失的另外一个诱因是发布时间。Kafka具有<a href=\"https://developer.confluent.io/learn-kafka/apache-kafka/partitions/\">多个分区</a>\"来增加可扩展性。每个分区都是由一组叫做broker的服务器来提供服务。其中，有一台服务器会被选为首领（leader）。当发布消息到某个分区时，会将数据发送至首领broker。我们可以仅等待首领确认条目已经持久化到它的存储中，也可以等待跟随者（follower）broker都确认它们也已写入到了持久化存储中。如果我们处理的是关键数据的话，等待分区所有broker的确认是合理的做法。在大规模的场景中，这不仅仅会涉及到多次写入的成本问题。</p><p></p><p>如果丢失了对首领broker的连接，会发生什么呢？在部署新架构仅仅几个月后，我们就遇到了这样的情况。如果在等待某个broker的确认信息时，该broker突然不可用，这显然会降低处理速度。这种速度减慢会导致回压和不可用，这正是我们所要避免的。</p><p></p><p>如果我们只是从首领broker中获取确认信息，将会遇到一个非常有意思的故障场景。如果我们在成功发布后又丢失了对首领broker的连接，会发生什么呢？首领选举会产生一个不同的首领。但是，如果原来首领已确认的条目并没有完全复制到其他broker上，那么这样的首领选举就会造成数据丢失，而这正是我们想要避免的。这叫做不完整的（unclean）broker首领选举。</p><p></p><p>我们是如何处理这种情况的呢？同样，这里需要进行权衡。我们有一个生产者库，它是基于Kafka生产者客户端的一个包装器。这里有两个相关的优化。首先，因为我们使用了non-keyed分区，所以库能够选择它写入的分区。如果某个分区因为首领broker不可用而无法使用它的话，我们的库会写入到不同的分区中。同时，因为分区是在一个under-replicated的broker集合上，也就是首领broker具有的条目比跟随者broker更多，复制还没有全部完成，那么我们的库会选择一个复制情况更好的分区。</p><p></p><p>通过这些策略，我们最终选择了以异步模式写入，即发布者将消息写入内存队列，并异步发送至Kafka。这有助于扩展性能，但是我们希望在同时遇到多个错误的时候，能够有一个最坏情况的数据损失上限。基于内存队列的大小和避免under-replicated分区策略，我们配置了令自己满意的上限。</p><p></p><p>我们监控了数据的持久性，从中可以持续得到4到5个9的可靠性，对于我们来讲，这是可以接受的。如果你的应用不允许丢失任何数据，那么可以选择在接受到所有broker的确认之后，再将该条目视为已处理。</p><p></p><h2>挑战：处理延迟和自动扩展</h2><p></p><p>在我们的系统中引入Kafka会有一个无法避免的副作用，那就是请求处理会有额外的延迟，这包括Playback API发布消息到Kafka以及Request Processor消费消息所需的时间。</p><p></p><p>还有就是数据在Kafka队列中等待的时间。这被称为滞后（lag），它是由消费者工作者节点和流量组成的一个函数。对于给定数量的节点，随着流量的增加，滞后也会随之增加。</p><p></p><p>如果你对峰值流量有一个明确的预估，那么就可以计算出系统中所需的处理节点的数量，以达到可接受的滞后。这样，我们就可以简单配置系统来管理峰值流量，只需“简单地设置即可，无需过多关注”。</p><p></p><p>对于我们来讲，流量在每天的不同时段和每周的不同日子都会有所变化。我们发现峰值的流量是低谷期的5倍。鉴于如此巨大的流量变化，我们希望能够更有效地利用资源，所以选择了自动伸缩。具体来讲，我们会基于流量添加或移除特定数量的消费者处理节点。</p><p></p><p>每当我们改变Kafka主题的消费者数量时，该主题的所有分区会在新的消费者集合之间重新平衡。这里的权衡是资源使用效率与重新平衡的成本。重新平衡会以不同的方式影响到我们。</p><p></p><p>如果你的处理是有状态的，那么必须要做一些复杂的事情。比如，消费者必须要暂停处理，然后获取内存状态，并根据Kafka中的偏移量进行已处理到何处的检查点判断。在分区重平衡之后，消费者会重新加载检查点之后的数据，然后基于检查点的偏移重新开始处理。</p><p></p><p>如果你的处理稍微简单一些，或者以外部方式存储状态，那么你可能会在重平衡进行的时候，继续正常进行处理。这样的话，当重平衡开始时，某些条目正在处理中，它们还没有发送确认消息到Kafka，这些条目将会出现在另外一个处理节点中，因为该节点在重平衡后对应到了这个分区。在最糟糕的场景中，我们会重复处理某些条目。如果你的处理是幂等的或者有其他方式处理重复的项目，那么这并不是什么问题。</p><p></p><p>下一个问题就是，何时以及按照多大的幅度来进行自动扩展？有人可能认为滞后是触发自动扩展的一个好指标。但问题在于，我们无法很容易地通过这个指标进行收缩。当滞后是零的时候，我们如何得知该收缩1个、10个还是50个处理节点呢？一次性移除太多的节点会导致“摇摆（flapping）”，也就是在短时间内一次又一次地移除和重复添加节点。</p><p></p><p>在实践中，很多开发人员会使用某个代理指标，比如CPU利用率。对于我们来讲，事实证明，每秒记录数（records-per-second，RPS）是一个很好的触发器，能够用来实现自动扩展。当系统处于稳定状态时，我们会测量RPS并建立一个基线。然后，当吞吐量相对于该基线发生变化时，我们就可以添加或移除节点了。</p><p></p><p>我们也有不同的模式实现扩展和收缩。我们希望避免在扩展过程中进行重平衡，因为此时已经有大量输入的数据，重平衡会暂时减缓消费者的速度，所以我们希望快速扩展。而收缩可以逐渐完成，因为此时支持的吞吐量要高于实际的值，我们可以接受再平衡带来的减速。</p><p></p><h2>挑战：乱序和重复记录</h2><p></p><p>在分布式系统中，会出现乱序和重复记录的情况。如何解决这个问题取决于应用的具体情况。在我们的场景中，我们使用了会话机制（sessionization），它会收集一个视频放映会话内的事件，该会话有一个明确的开始和结束事件。因此，我们会收集这个边界内该会话的所有事件。</p><p></p><p>对于给定会话内的多个事件，基于数据内的特定属性，我们会对其进行排序并去重。例如，每个事件会有一个递增的ID或来自客户端的时间戳。对于写入操作来说，当事件抵达服务器时，我们能够通过时间戳进行去重。</p><p></p><h2>挑战：偶然性的处理失败</h2><p></p><p>在消费者端，我们还要解决偶尔处理失败的问题。通常情况下，我们不想因为一个失败的条目而中断对整个队列的处理，有时候这种做法叫做队头（head-of-line）阻塞。相反，我们想要把失败的条目放到一边，继续处理队列中的其他内容，稍后再来单独处理它。</p><p></p><p>我们希望系统具备这样的特点，那就是再次尝试之前应该有一个有限的等待时间，没有必要立即进行尝试。我们可以为这些失败的条目使用一个单独的队列，也叫做延迟队列（delay queue）。有多种方式可以实现这一点。我们可以将其写入到另外一个Kafka队列中，然后构建一个延迟执行的处理器。</p><p></p><p><img src=\"https://imgopt.infoq.com/fit-in/1200x2400/filters:quality(80)/filters:no_upscale()/articles/microservices-async-migration/en/resources/27%20delay%20queue-1662738783532.jpeg\" /></p><p></p><p>对于我们来讲，使用<a href=\"https://aws.amazon.com/sqs/\">Amazon Simple Queue Service</a>\"（SQS）很容易实现这一点，因为我们已经在<a href=\"https://aws.amazon.com/ec2/\">Amazon Elastic Compute Cloud</a>\"（EC2）上运行了。我们会将失败的条目提交到SQS队列中，该队列有一项特殊的功能，里面的条目在消费之前，可以指定一个间隔时间。</p><p></p><h2>消费者平台</h2><p></p><p>我们可以使用多种平台来消费和处理来自Kafka的条目。在Netflix，我们使用了三种不同的平台。<a href=\"https://flink.apache.org/\">Apache Flink</a>\"是一个流行的流处理系统。<a href=\"https://netflix.github.io/mantis/\">Mantis</a>\"是Netflix几年前开源的一个流处理系统。最后，Kafka有一个嵌入式的<a href=\"https://cwiki.apache.org/confluence/display/KAFKA/Clients\">消费者客户端</a>\"，借助它我们可以编写微服务，直接处理Kafka中的条目。</p><p>我们首先面临的问题是，哪种平台最好用？最终，我们意识到这个问题本身就是错误的。相反，问题应该是，哪种处理平台在哪种使用场景下最为有利？这三种方式各有优缺点，在不同的场景下，这三种平台我们都用到了。</p><p></p><p>如果要进行复杂的流处理，那么Mantis和Apache Flink非常合适。Apache Flink还内置了对有状态流处理的支持，其中每个节点都可以存储本地状态，例如可以用于会话机制。微服务是很有吸引力的方案，至少对我们来讲是这样的，因为Netflix工程师对微服务生态有良好的支持，涵盖生成或初始化整洁的代码库，到CI/CD流水线和监控。</p><p></p><h2>跨区域的问题</h2><p></p><p>跨区域（cross-region）问题是很重要的，因为Netflix要在多个区域运营。由于我们正在运维的是一个大型的分布式系统，某个区域可能偶尔会出现不可用的情况。我们每年都会进行多次演练，关闭某个区域，确保能够实现跨区域的流量转发。</p><p></p><p>乍看上去，这没有什么问题，如果某个条目本来要发往另外一个区域，我们可以借助跨区域的隧道，将其远程发布到Kafka主题中。通常情况下，这是可行的，但是当我们遇到该区域真正无法使用时，远程发布方式就无法奏效了。</p><p></p><p><img src=\"https://imgopt.infoq.com/fit-in/1200x2400/filters:quality(80)/filters:no_upscale()/articles/microservices-async-migration/en/resources/28%20cross%20region-1662732582381.jpeg\" /></p><p></p><p>我们做了一个简单但微妙的修改，那就是始终希望在本地发布。我们发布到另外一个Kafka主题，并使用区域路由器异步将其发送至另外一个区域中。通过这种方式，某个放映会话的所有事件就可以一起处理了。</p><p></p><h2>测试、验证和上线</h2><p></p><p>现在我们已经解决了挑战，并做了权衡，那么该如何测试和上线的呢？在这个过程中，可以使用<a href=\"https://microsoft.github.io/code-with-engineering-playbook/automated-testing/shadow-testing/\">影子测试（Shadow testing）</a>\"技术。在你的环境中，可能已经使用过类似的策略了。对我们来讲，这包括让Playback API双重写入到现有的同步系统和Apache Kafka中，异步请求处理器会基于Apache Kafka进行消费。然后，我们会有一个验证程序，它能校验正在处理中的请求是一致的。</p><p></p><p>下一步就是确保存储的制品是相同的。为此，我们创建了一个影子Cassandra集群。在这里，我们使用成本来换取足够的信心。如果你能有一个环境，可以相对容易地在短时间内获得额外的资源，那么在上线之前，它可以给你带来额外的信心，对于我们这样的云环境来讲，这一点是很容易实现的。</p><p></p><p><img src=\"https://imgopt.infoq.com/fit-in/1200x2400/filters:quality(80)/filters:no_upscale()/articles/microservices-async-migration/en/resources/19%20shadow%20testing-1662732582381.jpeg\" /></p><p></p><p>最终，我们上线了这个方案，按userId分割流量，也就是说，给定userId的所有流量被持续写入新系统或旧系统。我们从1%的用户数据写入新系统开始，然后逐步增加比例，一直到100%的用户。这使我们的迁移非常顺利，没有对上游或下游系统造成影响。</p><p></p><p>下图显示了我们现在的情况和下一步的发展方向。其中，蓝色的内容，即Playback API、Viewing History Processor和Bookmark Processor以及Kafka，现在已经投入生产。我们还有处理额外数据的其他组成部分，包括Attributes processor和Session Logs服务，它们将会很有趣，因为数据量非常大，比你通常写进Kafka的数据要大得多。我们将有一些新的挑战需要解决。</p><p></p><p><img src=\"https://imgopt.infoq.com/fit-in/1200x2400/filters:quality(80)/filters:no_upscale()/articles/microservices-async-migration/en/resources/110%20future%20work-1662732582381.jpeg\" /></p><p></p><p></p><h2>结论</h2><p></p><p>我们已经看到，异步处理是如何为我们提高可用性和数据质量的，以及在我们的环境中，是如何进行设计选择和权衡的。在实施之后，影子测试和增量上线确保我们能够进行自信和顺利地部署。有了这些信息，请思考如何将这些经验应用到你的环境中，以及在类似的旅程中可能会做出哪些其他的权衡。</p><p></p><h2>作者简介</h2><p></p><p>Sharma Podila是一位软件工程领导、系统建设者、合作者和导师。他在云资源管理、分布式系统、数据基础设施方面有很深的造诣，并在交付跨功能的大规模分布式系统方面有着丰富的成功经历。</p><p></p><p>原文链接：</p><p><a href=\"https://www.infoq.com/articles/microservices-async-migration/\">Microservices to Async Processing Migration at Scale</a>\"</p><p></p><p>相关阅读：</p><p><a href=\"https://www.infoq.cn/article/JC8GL4g4OHL1WFISs4g1\">Netflix基于Redis、Kafka和Elasticsearch构建高吞吐优先队列Timesone</a>\"</p><p><a href=\"https://www.infoq.cn/article/MXfmbyJkSmDkIHNRJb5Q\">破天荒！Netflix 为软件工程师引入细分职级，已有不少老员工因对新职级不满离职</a>\"</p><p><a href=\"https://www.infoq.cn/article/wMuuGUleIPIIDhWGibu5\">Netflix工作10年，我收获的一些关键经验</a>\"</p>",
    "publish_time": "2022-11-21 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "大型企业如何建设自主可控的数智化平台？",
    "url": "https://www.infoq.cn/article/1q20RyHVsgS7xi4k1yVc",
    "summary": "<p>“坚决打赢关键核心技术攻坚战，以高水平科技自立自强推动经济社会发展”、“着力提升产业链供应链韧性和安全水平”，这是二十大报告中重点提出的两个问题。就 IT 产业而言，其供应链稳定的重要性不但超出了 IT 产业本身，而且直接关乎到下游各行各业的稳定和发展，关乎到整个经济发展和社会稳定。</p><p>&nbsp;</p><p>央企及龙头国资企业作为国民经济发展的中坚力量，在政策加技术的双轮驱动下，积极投身于数智化转型浪潮。通过安全可控、自主创新的技术体系，构建能够实现国产化价值替代的“中国方案”，成为我国企业实现数智化转型与商业创新的必然选择。</p><p>&nbsp;</p><p>从信息化到数智化，从上一代企业信息化应用系统 ERP 到新一代数智商业创新平台 BIP，企业服务的产品结构与形态都发生了巨大变化，其中平台底座变得越发重要、多元、强大。国央企数智化价值替换的核心诉求之一就是通过构建数智化平台底座，打造统一数智化支撑。数智化底座可以满足企业自身管理需要，做到一“屏”尽览无障碍、一“网”打尽无遗漏、消除信息孤岛，实现互联互通无梗阻，向着数字化管理、智能化决策的目标迈进。</p><p></p><p></p><h2>自主可控为数智底座提出更多要求</h2><p></p><p></p><p>&nbsp;</p><p>自主可控技术就是依靠自身研发设计，全面掌握产品核心技术，实现信息系统从硬件到软件的自主研发、生产、升级、维护的全程可控。数智化自主可控对数智底座提出了更多要求：</p><p>&nbsp;</p><p>一，实现自主可控管理安全。在自主可控技术实现之前，首先要先解决自主可控的管理，没有严格的管理手段即便再安全的产品也会漏洞百出。安全管理意味着责任切实落实问责机制，而信息安全管理体系的建立正是解决这些管理和治理层面问题的最佳途径；</p><p>&nbsp;</p><p>二，实现自主可控网络安全。主要包括通信安全、区域边界安全、计算环境安全；</p><p>&nbsp;</p><p>三，实现自主可控开发安全。当企业客户的需求不能通过采购现有信息安全系统或产品满足时，需要供应商在信息安全系统设计的基础上，按照软件安全开发流程开发系统或产品；</p><p>&nbsp;</p><p>四，实现自主可控数据安全。数字经济时代下，数据成为了当下企业组织重要的资产之一，企业组织需要施行行之有效的数据安全管理，计划、制定、执行相关安全策略和规程，确保数据和信息资产在使用过程中有恰当的认证，授权等措施，最终目标是保护信息资产符合隐私及保密法规要求，并与业务要求相一致；</p><p>&nbsp;</p><p>五，实现自主可控授权认证安全。身份验证可以说是安全界的核心，授权认证安全包括用户身份认证和授权、身份管理、欺诈检测治理。</p><p></p><p></p><h2>自主创新，实现真正的国产化价值替代</h2><p></p><p></p><p>&nbsp;</p><p>掌握核心技术的知识产权实现产品自主可控需要坚持自主发展和创新发展，没有自主创新就没有核心竞争力，就难以与跨国公司竞争，这就需要在关键核心技术上加强技术的创新和积累，重点技术攻关。</p><p>&nbsp;</p><p>用友作为“国产化价值替代”的主张者与引领者，一直坚持产品的自主研发和设计，为以央国企为代表的大型企业提供了自主创新的企业数智化新底座——用友iuap，真正实现国产化价值替代，帮助更多中国企业迈向世界一流。</p><p>&nbsp;</p><p>早在 2014 年，用友 iuap 推出国内第一款纯云原生 PaaS 平台，完全采用微服务架构开发运维一体化，公有云优先、然后再快速专属化私有化的方法。用友是第一家也是唯一一家把互联网化云计算技术完整实践到企业服务领域并成功实现从公有云到私有云敏捷工程化的厂商。</p><p>&nbsp;</p><p>目前，用友 iuap 已实现多项技术突破，并基于最新的互联网技术体系、产业级社会化视角，打造企业数智化新底座，帮助企业实现技术、业务、决策的深度融合，最终实现企业效率和收益的提高。其中，5 项首创和领先的技术包括：首创 YMS 云中间件技术，实现跨云技术突破和多云适配能力；首创云上云下一体的持续交付体系，让企业私有云平台体验到公有云的更新效率，让云下应用升级像 AppStore 一样简单；领先的多租户、多数据中心技术，实现了多云异构的“云上管理、云下运行”。同时，针对超大型企业客户，按需提供灵活定制代码服务；自研多维数据引擎（存算一体），实现 100%自主安全可控，支持千亿级数据规模下的“多准则、多币种、主附表”快速合并，一键出表；安全可信的国产化信创适配，为企业客户提供稳固可信、自主可控的数智化平台服务。</p><p></p><p></p><h2>安全可控，为数智化提供安全保障</h2><p></p><p></p><p>&nbsp;</p><p>信创作为我国 IT 产业发展升级采取的长期计划，旨在实现“自主可控、安全可靠”的发展目标，同时也是国家经济数字化转型、提升产业链发展的关键。目前，我国信创产业已经从“可用”进入“好用”阶段，国产 IT 基础设施和软硬件也进行了大量的适配工作。有研究机构预测，未来三年，行业信创以及央国企信创建设将迎来全面加速。</p><p>&nbsp;</p><p>用友把网络安全、数据安全、隐私保护作为公司业务和运营的底线要求，视用户数据安全和用户隐私保护为用友最重要的安全原则和战略方向，通过不断优化技术和提升开发能力，竭诚为客户提供安全、稳定、可靠、合规的 SaaS 化应用服务产品。用友建立了自己强大的开发团队与安全团队，夯实了数智化底座，确保产品自主研发，自主创新、安全可控。通过完善的服务体系与产品体系，帮助大型企业实现安全可控的全面数智化。</p><p>&nbsp;</p><p>一、统一镜像源。基于用友沉淀的信创技术资产，基于技术平台所部署的应用，统一使用技术平台维护的基础镜像，针对项目中各种漏洞和风险，随时适配并提供解决方案；</p><p>&nbsp;</p><p>二、交叉编译。基于用友信创的最佳实践，采用 x86 交叉编译 ARM 架构源码，简化开发过程中对底层组件的开发适配工作；</p><p>&nbsp;</p><p>三、多系统兼容运行。基于用友的最佳实践，在基于 Yum、RPM 管理机制的国产系统中进行离线包制作，满足各类离线系统细微差异中的环境部署；</p><p>&nbsp;</p><p>四、数据库适配技术。基于用友最佳实践，采用统一数据库适配转换层，进行语法、关键字、函数的转换，应用层无感知，并支持横向扩展，降低适配难度，提高适配效率；</p><p>&nbsp;</p><p>五、交付部署。在部署方案上，支持多套环境部署架构。生产环境承载着正式的业务访问，该区域所有业务与中间件均采用集群架构部署，避免单点故障，提升业务可用性。在预发和生产独立部署 K8S 集群，同时 Ingress 链路分离保证业务稳定性。中间件、数据存储、业务资源池都是集群部署，支持高可用。</p><p></p><p>用友 iuap 遵循国家网络安全、信息安全、数据安全等安全理念，强化安全建设能力，提升安全保障水平。用友 iuap 通过国家等保 2.0 等认证，可以确保系统符合云服务客户数据、用户个人信息等存储于中国境内，如需出境遵循国家相关规定等要求。同时，通过中国信息安全测评中心最高等级（级别：EAL3+）信息技术产品安全评测证书，这是国内首个，也是目前唯一达到该安全等级认证的应用软件产品。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/70/70a7a96c9c8f189e95649aa9ff0a62a9.png\" /></p><p></p><p>同时，用友推动国产化软硬件全面适配，用友 iuap 平台秉承创新、开放的理念，携手合作伙伴共建产业链生态。用友联合龙芯中科、统信软件、达梦数据库、东方通、人大金仓、中国长城、飞腾信息、麒麟软件、奇安信、瀚高等国产化厂商，发布用友信创全栈适配成果 3.0，标志着用友在信创领域取得了显著成果，也进一步展示了用友持续推进国产化替代的决心。用友 iuap 已全面适配国内主流国产化厂商的 210 项信创产品。</p><p></p><h2>数智化+信创化，推动央国企实现真正的价值替代</h2><p></p><p></p><p>2020 年起，我国信创进入大规模落地推广阶段。国家提出“2+8+N”信创体系，包括党政+金融、电信、电力、石油、交通、教育、医疗、航空航天八大关键行业+信创产品全面应用。2022 年信创产业开启规模化应用，2023 年开始，金融、运营商、电力等八大关键行业的国产化有望加速。</p><p>&nbsp;</p><p>央国企作为我国经济发展的重要推动力，成为信创发展的首要阵地。在今年下发的 79 号文中，要求全面完成综合办公系统和重要基础设施替代。要求所有央企、国企、地方国企，全面落实信创替代。其中 OA、门户、邮箱、纪检、党建、档案管理要求全面替换；战略决策、ERP、风控管理、CRM 经营管理系统等要求应替就替；生产制造、研发系统要求能替就替。</p><p>&nbsp;</p><p>用友认为真正的国产替代不仅仅是把 ERP、CRM 等软件换成国内的，而是要以新的思路、新的应用将数智化与信创化相结合，形成中国企业真正的价值替代，扎实推动国有企业实现质量更好、效益更优、竞争力更强、影响力更大的发展。</p><p>&nbsp;</p><p>目前各行业应用从应用软件的信创化逐渐过渡到基于平台的全面信创化。用友 iuap 作为企业数智化新底座从平台自主创新到信创产业生态融合，基于信创的技术使能，重构云化底层平台及上层应用，加速信创产业的发展，全面提升企事业单位的信创水平。</p><p>&nbsp;</p><p>用友 iuap 为企业与公共组织提供多态融合的综合性企业云服务与定制化解决方案，涵盖智能财务、数字人力、敏捷供应链、智慧采购、智能制造、数字营销、数智研发、数字项目、数智资产、协同办公等核心领域云应用场景，纵深金融、政务、建筑、医疗、能源、汽车等多行业深度应用全生命周期管理，实现行业云的全面布局。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/3b/3bdfaf6b04030ccb8d77b8d838188356.png\" /></p><p></p><p>用友基于丰富的行业经验，聚焦安全可控、自主创新、数智化平台建设等信创发展重点方向，配备央企专家团队，全面开展央企信创服务工作，已经为近 65%的中央企业提供数字化产品、服务及解决方案。</p><p>&nbsp;</p><p>比如，某工业集团基于用友 iuap，构建了信创体系下的合并报表。在隔离网络的情况，统一核算平台，统一核算主数据，统一财务报表，包括管理报表，同时满足国产化要求；某烟草公司，基于用友 iuap 构建信创体系下的人力数字化。基于国产化的数智化底座，围绕人力数据建立了稳态经营管理服务及敏态创新服务基础，实现内部组织、人事、薪酬等业务流程和数据协同；某水电集团，搭建了国产芯片、操作系统、数据库信创底座，基于信创底座以及用友 iuap 数智化新底座，打造企业中台，实现资源共享、标准管理，以支撑企业业务模式变革和快速创新，提升企业效率和快速响应能力。</p><p>&nbsp;</p><p>作为中国和全球领先的企业和公共组织云服务与软件提供商，用友一直采用自主创新的信息技术，来打造服务企业业务与管理升级的产品与方案。数智商业时代，用友通过企业数智化新底座用友 iuap 帮助大型企业完成自主可控的数智化平台建设，真正实现国产化价值替代，迈向高质量发展！</p>",
    "publish_time": "2022-11-21 09:53:40",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "《如果我夺冠了》",
    "url": "https://www.infoq.cn/article/aZqMEOpiTkJlBu3fL0d2",
    "summary": "<p>咳咳，大家好，我是<a href=\"https://www.infoq.cn/article/7ejrDIB7r5KRIuLwaRPd\">2022 深圳国际金融科技大赛——西丽湖金融科技大学生挑战赛</a>\"组委会最受同学们喜爱、最最帅气的（没错，我自封的）小助手，上周大赛初赛完美收官，我们共接到了来自 360+ 所高校的 1300+ 名同学报名，他们共组成了 500+ 支队伍。开赛以来，不少参赛同学常常来找我聊天互动，我深深地感受到了大家对本次大赛的热情和必胜的决心！</p><p></p><p>于是，小助手我随机采访了一些看起来准备十分充分的夺冠种子型选手，聊了一下他们对于夺冠后生活的憧憬...</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/60/602edf7e4864f2b0ece7971ef37c67d5.jpeg\" /></p><p></p><p></p><h2>#01</h2><p></p><p>夺冠拿到奖杯，</p><p>下了领奖台的第一件事你要做什么？</p><p></p><p>以下访谈信息取材于北京理工大学李同学、桂林电子科技大学卜同学、耿同学。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/9a/9a71ddd001f11b5b69abed7d77140da5.jpeg\" /></p><p></p><h4>所以原因是？</h4><p></p><p></p><p><a href=\"https://www.infoq.cn/article/amRrNh9XruvaPjY90RWO\">2022 深圳国际金融科技大赛（ FinTechathon ）—— 西丽湖金融科技大学生挑战赛</a>\"为进入决赛的同学提供 100 余张可双向选择的实习面试直通卡，助力高校人才实现更充分、更高质量的就业目标，构建产学研一体化人才培养模式，以构建金融科技人才培育生态圈。</p><p></p><p>以下为大赛官网刚刚更新的一版，同学们可以使用“实习面试直通卡”的岗位：</p><p><img src=\"https://static001.geekbang.org/infoq/52/528b67fb1e5cf58eb1268e94705d6233.jpeg\" /></p><p></p><p></p><h2>#02</h2><p></p><p>夺冠之后</p><p>你将发一条怎样的朋友圈？</p><p></p><p>以下访谈信息取材于东南大学颜同学、南特高等商学院李同学、广东技术师范大学张同学。</p><p><img src=\"https://static001.geekbang.org/infoq/54/548b8c86b8d6ff555b4b33f759c5aae9.jpeg\" /></p><p></p><h5>所以究竟哪里不一样？</h5><p></p><p></p><p><a href=\"https://www.infoq.cn/article/xlshY7xzPkVyq5rK4BtT\">2022 深圳国际金融科技大赛（ FinTechathon ）—— 西丽湖金融科技大学生挑战赛</a>\"所颁发的区块链数字证书，为所有获奖者提供具有唯一标识的数字化获奖凭证。获奖选手可随时查看和下载，校方、招聘企业等也可以扫码快速验证证书真伪，达到可信验证、高效互通的效果。未来，区块链数字证书可进一步拓展到奖学金认证、技能培训认证等场景，为金融科技人才专业资格与资质提供便捷的查验与认证通道，助力构建金融科技人才培养可信体系。</p><p></p><p>该数字证书基于微众区块链技术，采用国产安全可控开源平台FISCO BCOS为底层链，上链获奖信息防篡改、可追溯、数据来源可信任。微众区块链、深圳大学微众金融科技实验室、深圳市金融区块链发展促进会（金链盟）为该数字证书提供技术支持。&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/b4/b4b7f3161be6f2694f24ba008abd8e47.png\" /></p><p></p><p></p><p></p><h2>#03</h2><p></p><p>拿到奖金后，你有什么安排？</p><p></p><p>以下访谈信息取材于深圳大学刘同学、北京外国语大学邓同学、清华大学赵同学。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/79/794578eccc603e5f22833df15d8f7d7c.jpeg\" /></p><p></p><h4>所以到底有多少奖金？</h4><p></p><p></p><p>2022 深圳国际金融科技大赛（ FinTechathon ）—— 西丽湖金融科技大学生挑战赛设置总额超过 69 万元人民币的赛事奖金，激励高校人才持续积极投入到金融科技创新事业中。人工智能赛道、区块链赛道、产品经理赛道将分别有10支队伍进入决赛，决赛现场将产生一等奖、二等奖、三等奖各一队。获得一等奖的团队可以获得奖金100,000元；获得二等奖的团队可以获得奖金80,000元；获得三等奖的团队将获得奖金50,000元。</p><p></p><p>所以，你以为</p><p>2022 深圳国际金融科技大赛</p><p>（ FinTechathon ）——</p><p>西丽湖金融科技大学生挑战赛的现场</p><p>只有炫酷的奖杯和区块链证书、</p><p>丰厚的奖金、挑花眼的实习岗位？</p><p></p><p>NO NO NO...</p><p>11.29-11.30，决赛历时 2 天</p><p>任同学们尽情释放自己的才华风采</p><p>36h 编程马拉松、现场答辩...</p><p>全程高能，无限热血！</p><p></p><p>可以浅浅感受一下上届大赛的现场 ↓</p><p></p><p></p><p>本届大赛作为首届金融科技节的重要一环</p><p>这场全球高校都共同参与进来了的世界级竞赛</p><p>来自中科院、深圳大学、武汉大学、西南财经大学、</p><p>华南理工大学、微众银行等学企单位的</p><p>数十位科研专家会来到决赛现场担任评委嘉宾</p><p>在第一时间为参赛团队指点迷津！</p><p></p><p>通过 2 天决赛，决出获胜队伍后</p><p>大赛官方将在&nbsp;12.1 下午举行</p><p>第二届湾区金融科技高校分论坛暨</p><p>2022 深圳国际金融科技大赛</p><p>——西丽湖金融科技大学生挑战赛颁奖典礼</p><p></p><p>届时大赛奖杯、区块链证书、</p><p>69w+ 奖金池、100+ 实习岗位都将集中亮相！</p><p>让同学们在领奖台上尽享高光时刻！</p><p></p><p>话不多说，让我们共同期待</p><p>11 月 29 日，决赛场见！</p>",
    "publish_time": "2022-11-21 10:34:28",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "AI 辅助编程创业7年后，Kite 宣布停止：未能使用AI 达成10倍突破、50 万开发人员不会付费使用",
    "url": "https://www.infoq.cn/article/jp6bYxMWR53wFuMSRpp3",
    "summary": "<p>当地时间11 月 16 日， AI 辅助编程初创公司<a href=\"https://www.kite.com/blog/product/kite-is-saying-farewell/\">Kite 宣布将</a>\"停止开发 Kite，且不再支持 Kite 软件。从2014&nbsp;年至2021年，Kite 创始人Adam Smith 对公司这七年的失败原因进行了总结。</p><p>&nbsp;</p><p>第一，企业未能实现 AI 辅助编程的愿景。 Smith 认为进入市场早了 10 年，意味着相关技术尚未准备好。</p><p>&nbsp;</p><p>“我们构建了当时最先进的 AI 来帮助开发人员，但由于 ML on code 的技术水平不够好，因此它的改进没有达到突破所需的 10 倍。”Smith 表示，最大的问题是最先进的模型也不理解代码的结构，例如非本地上下文。</p><p>&nbsp;</p><p>“我们在更优的代码模型方面取得了一些进展，但问题是工程密集型的。构建一个能够可靠合成代码的生产级工具可能花费超过 1 亿美元，目前还没人尝试过。”Smith 认为，即使是由 Github 与 OpenAI 合作构建的<a href=\"https://www.infoq.cn/article/x8rOEIh9fzXiskf1LMAj\">Github Copilot</a>\"虽然表现出很好的前景，但仍有很长的路要走。</p><p>&nbsp;</p><p>Smith 指出，如果不使用 AI 将开发人员生产力提高 10 倍的话，Kite 可以建立成功的业务，但Kite 并没有这样做。</p><p>&nbsp;</p><p>第二，Kite 没有建立商业化业务。</p><p>&nbsp;</p><p>根据介绍，Kite创业的顺序是先建立团队，然后研发产品，之后进行分销，最后是货币化。“因为我们的产品构建很难，所以我们先建立了一个世界级的工程团队。这点我们做得非常成功。然后我们专注于产品研发。直到 2019 年，即公司成立五年后，经过多次重大工程迭代才让产品与市场契合。然后我们扩大了用户群。这点我们执行得非常好，每月活跃开发者增加到了 500,000 名，营销支出几乎为零。然而，我们的产品未能产生收入，50 万开发人员不会付费使用它。”</p><p>&nbsp;</p><p>Kite 团队得出的结论是，个人开发者不为工具付费。经理人可能会这样做，但他们只想为离散的新功能买单，即让他们开发人员的编写代码速度提高 18% 这点，并不能引起他们足够强烈的共鸣。</p><p>&nbsp;</p><p>随后，Kite 探索了业务转型，并找到了一个新方向——代码搜索。“但经过七年的紧张工作和早期创业的压力，我们的团队太累了，无法追求这个支点，我们决定找到一个软着陆点。”Kite 说道。</p><p>&nbsp;</p><p>对于投资者，Smith 表示，“感谢您对我们的信任，很抱歉没有成功。我知道我们的投资者将继续为新业务提供资金，即使很大一部分没有成功。我很庆幸生活在一个投资者承担此类风险的世界中，因为这种冒险是进步的必要组成部分。”</p><p>&nbsp;</p><p>对于团队，Smith 也对没有成功一事表示抱歉。“我们拿着低于市场水平的薪水来延长跑道，并且长时间工作，尤其是在公司成立初期。我们团队成员的背景都非常优秀，招聘人员一直给我们打电话，在其他地方提供更高的职位和机会。”</p><p>&nbsp;</p><p>&nbsp;</p><p>“我们迫不及待地希望 AI 彻底改变编程。”Smith表示，“虽然 Kite 是该领域的先驱，但我们并不是将其落地的公司。这不是我们开始时希望的结果，但我们所有进行实验的人的勇气和贡献依然值得歌颂。”</p><p>&nbsp;</p><p>目前， Kite 的大部分代码都已在 <a href=\"https://github.com/kiteco\">GitHub 上开源</a>\"，包括其数据驱动的 Python 类型推理引擎、Python 公共包分析器、桌面软件、编辑器集成、Github 爬虫和分析器等等。</p><p></p><p></p><p>参考资料：</p><p>https://www.kite.com/blog/product/kite-is-saying-farewell/</p>",
    "publish_time": "2022-11-21 10:39:25",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "汽车“元宇宙”的初尝试",
    "url": "https://www.infoq.cn/article/id8Bz202Zpw3jeiTY28T",
    "summary": "<p>元宇宙的概念自 2021 年下半年以来就一直热度不减。根据 IDC 预测数据，从 2020 至 2024 的 5 年间，全球虚拟现实产业规模年均增长率将达到 54%。元宇宙犹如时代的列车呼啸而至，众多互联网巨头争相“搭乘“，而一直在寻找数字化转型解决方案的汽车行业也不甘落后，车企们纷纷在元宇宙领域施展拳脚。于是，InfoQ 特别采访了汽车之家主机厂事业部技术总监陈超，深度了解一下元宇宙技术在汽车行业的应用与实践。</p><p>&nbsp;</p><p>陈超认为，“汽车元宇宙是以数字孪生的汽车为中心，通过布置虚实结合的环境再结合智能数字人组成而成的可与现实世界交互的虚拟世界。”</p><p>&nbsp;</p><p>作为国内领先的汽车消费者在线服务平台，<a href=\"https://www.infoq.cn/article/oBSd1zNsBz8alRiH73k4\">汽车之家</a>\"积极尝试为用户带来全新的感官体验，通过虚拟数字人的方式充分发挥其情感链接价值，提供多元的品牌营销场景，拉紧了用户与品牌之间的共同纽带；又借助元宇宙技术，使用户能够在汽车之家能源空间站完成浏览、对比、试驾多个品牌新能源汽车的一站式操作；此外还采用 3D 虚拟展馆技术赋能“中国春季云车展”和“818 全球超级车展”，以颠覆性的创新能力和强大的科技实力展示了自己在元宇宙领域内的底蕴。</p><p>&nbsp;</p><p></p><h2>一、通过“虚拟数字人”讲好汽车品牌故事</h2><p></p><p>&nbsp;</p><p>借助虚拟数字人这一元宇宙载体，汽车品牌可以通过在虚拟空间进行互动，把过去无法实现的创意和效果得以实践，全方位展示品牌故事，并且可以和其他生态在虚拟空间进行联名创新。今年818 汽车节中，汽车之家 AI 体验官宫玖羽、汽车之家品牌代言人谷爱凌“数字人”陆续亮相。</p><p>&nbsp;</p><p><img src=\"https://static001.infoq.cn/resource/image/33/bd/33de401eaeb910452b0eb604b73b14bd.png\" /></p><p></p><p>二者在 3D 人物模型方面区别比较大，宫玖羽是之家内部完全虚构的一个人物角色，在设计的时候更偏重往人物虚拟化 IP 方向打造，以突出人物独特性；谷爱凌则是由专业模型制作团队 1:1 真人复刻还原的孪生数字人形象，由于谷爱凌是一个家喻户晓的体育明星，所以对模型细节的要求很高。为了更真实的还原谷爱凌的形象，其终版人物模型三角面数量高达 1 亿多个，同时还要对谷爱凌的表情、动作和声纹进行了数据采集，应用了动作绑定和 TTS 等 AI 技术。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/29/72/290cbd5266c83d1fda5fb3a7bba12172.png\" /></p><p></p><p>“超写实虚拟人需要尽量逼真写实还原真人效果，让用户感觉到是在和一个真人互动。”陈超表示，这其中涉及到高精模型制作、丰富的真人表情、流畅的动作、真人语音效果对话、智能实时对话等技术实现：</p><p>&nbsp;</p><p>在人物形象方面，谷爱凌对真人形象的细节还原度较高，只采集本人的声纹数据；宫玖羽则更多侧重打磨人物个性 IP，对多套真人声纹数据进行采集，可以随意切换不同版本的声音；在全流程实时渲染方面，两款虚拟人都应用了汽车之家自研的高性能 3D 实时渲染技术，依托云端高性能 GPU 显卡主机做实时渲染，以高清视频流的方式推送到各个边缘设备节点，提升渲染性能的同时可以覆盖支持更多低端边缘设备；在音频识别方面，汽车之家打造的这两款虚拟人可以理解普通话、四川话等多种方言，并能流畅地使用方言和用户进行对话。</p><p>&nbsp;</p><p>当然，虚拟数字人不是独立存在的，它需要依托于场景、车等其他虚拟化，大量级的实时渲染对服务器造成了很大压力，并且拓展性也非常差。为此，汽车之家实现了一套信号融合架构，把之前一台设备、一套技术框架内的运算任务都通过高清视频信号的方式接入到 3D 元宇宙车展中，并针对其中涉及到的漫反射和透视问题编写定制化脚本，优化视觉感受。</p><p>&nbsp;</p><p>未来，<a href=\"https://xie.infoq.cn/article/14e0bde8d7ed3c04f25601a46\">汽车之家</a>\"除了通过持续升级数据样本和算法模型来提升虚拟人的智能化水平，让数字人更智能、更懂用户外，还会把数字人推广到全息舱、MR、真人、虚拟人混流直播等更多的场景中，让虚拟人技术赋能整个汽车行业。</p><p></p><p></p><h2>二、“全息体验仓”颠覆汽车行业传统营销方式</h2><p></p><p>&nbsp;</p><p>“虚拟数字人+虚拟场景”等虚拟元素链接到实际营销活动中已十分普遍，不仅为品牌和企业提供了年轻化营销的创新思路，也为各行业如何用虚拟营销与 Z 世代产生链接带来更多启发，除了虚拟数字人之外，汽车之家还将虚拟场景链接到了实际营销当中，不断提升消费者的体验，在汽车之家能源空间站上海体验店中一站式浏览、对比和试驾多个品牌的新能源汽车。</p><p>&nbsp;</p><p>空间站中最大的亮点就是“全息体验舱”，“全息技术”是“全息体验舱“的关键所在，汽车之家调研了国内外的一些 3D 虚拟化呈现技术，通过对比发现全息膜与环境非常契合，但考虑到全息膜上的舞台剧十分逼真，而汽车对效果的要求更高，汽车是否适合全息膜的场景尚未可知。为此，汽车之家专门做了一辆车通过视频的方式投射到全息膜上进行测试，发现效果差强人意，着手选用高级别的硬件在总部搭建了测试版全息舱，精心挑选供应商、硬件设备、3D 程序、中控指令台等，之后再对物理空间、图像文字清晰度、灯光、音响和背景亮度等进行打磨，最终在面前呈现了一台栩栩如生的汽车。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/97/3d/97460cfac317c5223af4fee66211483d.png\" /></p><p></p><p>正如陈超所说，真正的狭义全息技术并不常见，它起于全息照相技术，应用于全息光栅光波导技术中，全息照相的过程十分复杂，很难为普通消费者所用，目前国内外消费级的狭义定义全息产品还没有。大部分的消费级产品分两类，一类是借助近眼显示设备和 3D 实时渲染技术呈现的“感知全息”，比如 Oculus 和 Hololens，这种目前国内外都有不错的消费级产品落地。还有一类就是我们说的类全息平面投影，通过借助半透半反的膜层把平面显示器的内容反射到观察者眼中，营造出立体感。好处是对用户设备没有要求，比较适合展厅类效果呈现。</p><p>&nbsp;</p><p>纵观整个全息技术领域，目前要实现真正的狭义上的全息技术还存在较多的技术难点，如全息照相技术中所使用的全息光栅镜片的曝光制备技术，对光学实验环境有着很高的要求，无法在消费级产品中大规模量产。一个比较可行的方案是拓展AR 类全息技术，例如 Magic Leap 公司的光场全息技术，但是这项技术对 AR 眼镜硬件设备的要求也很高。</p><p>&nbsp;</p><p>目前，<a href=\"https://www.infoq.cn/article/8Xg8HDBIAducvy6AueKE\">汽车之家</a>\"在 3D 车的呈现方面专门针对类全息平面做了深度的效果优化，汽车之家在国内类全息平面投影技术的使用和整合程度上来说已是领先水平。未来，汽车之家上线接入更多的全息车辆，持续打磨更好的全息效果，并通过结合虚拟数字人和全息投影来打造更多的全息场景。</p><p></p><p></p><h2>三、“3D 虚拟展馆”打造用车、看车新体验</h2><p></p><p>&nbsp;</p><p>虚拟展馆是指在互联网平台上发布的利用VR 技术构建的数字化展览馆，是互联网新技术与传统会展领域的新融合。它是一种三维互动体验方式，不仅突破了时空限制，节约了建造成本，还可以发挥无限的想象创意，使观众能够随时随地在网络平台上感受展馆及展品，用仿真互动的方式体验“身临其境，畅游无限”的精彩。</p><p>&nbsp;</p><p>汽车之家从三个方面应用3D 虚拟展馆技术赋能车展，首先，打造了一个通用的 3D 展馆和 3D 模型技术中台，依托中台的低代码能力完成展馆的分钟级搭建，同时提供 2D/2.5D 层自定义能力，支持自助搭建各种不同效果的展厅，极大提升车展上线效率；其次，进行车展 3D 功能组件化封装，抽象地提炼出了 50 余个 3D 功能组件供多个展馆间进行快捷方便的复用；第三，将外部合作业务以插件化的方式接入，汽车之家设计了一套通用的插件化接入机制，实现外部合作业务，通过编写插件的方式快速接入展馆。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/89/60/896aa92ff8b2da26172bcb514f4e8560.png\" /></p><p></p><p>然而，罗马非一日建成，在 3D 虚拟展馆技术方面，汽车之家也进行了大量探索。比如手机是我们目前最常使用的设备，但手机的内容表现力往往受屏幕尺寸、电池、处理器（CPU、GPU）以及带宽等因素的限制，为了能让用户尽情在手机上逛展看车，汽车之家做了如下探索：</p><p>在视觉方面，大量使用 2.5D 技术，同时，使用懒加载技术从各种方面替用户节省带宽；在 3D 技术应用方面，通过贴图压缩、模型压缩、GC、增加大量场景可承载内容等大量改进来补足引擎基础能力，加载速度也因此提升了 80%；采用并优化了智能逛展、智能讲车和用户智能推荐等智能化技术，让用户能够轻松逛展。</p><p>&nbsp;</p><p>当下，汽车之家仍在致力于攻克虚拟数字人和 3D 云渲染等技术。陈超表示，“未来汽车之家将把所有的 2D 产品体验升级成 3D 体验，期望给用户带来完全不一样的看车、买车、用车和换车体验。”</p><p></p><p></p><h2>四、写在最后</h2><p></p><p>&nbsp;</p><p>过去几年，汽车之家在元宇宙领域不断“秀肌肉”的同时，也为汽车产业发展注入了新动力，让人们的看车、试车变得有趣、便捷。我们甚至可以大胆畅想，在元宇宙发展成熟的未来，在一台五菱宏光上甚至也能模拟出开 F1 的快感，这种快感绝非如今的模拟声浪技术，而是真正集视觉、触觉和听觉于一体的体验。</p><p>&nbsp;</p><p>回溯根本，元宇宙是物理世界、虚拟世界和人类社会三者高度融合的世界，主要有3 项核心技术：一是扩展现实技术，包括 VR 和 AR，用以提供沉浸式的体验；二是数字孪生，把现实世界镜像到虚拟世界里面去；三是区块链技术，以搭建经济体系。然而目前元宇宙无论是底层技术还是应用场景上都还远未达成熟形态，整体发展尚处初级阶段，汽车元宇宙亦然。</p><p>&nbsp;</p><p>当下，随着新能源汽车等智能化汽车的异军突起，汽车上承载的功能会越来越多，比如自动驾驶、模拟各个虚拟场景等，这必然对硬件的输入输出能力、芯片的算力、云计算能力等各方面都有非常高的要求，整个也是未来一段时间内智能汽车行业亟须解决的课题。而车企如果能与元宇宙结合得当，将会给行业带来更多的机会与未来。</p>",
    "publish_time": "2022-11-21 10:47:22",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "服装快反供应链不是“瞎快”，背后要有数据做基础",
    "url": "https://www.infoq.cn/article/czA8H1c8QRtM1hOEW2Gw",
    "summary": "<p></p><blockquote>编者按柔性供应链的概念最早始于 1990 年代末，但直到 2010 年左右，才在中国市场被关注和普及。回溯起来，2010 年前后的确是一个比较特殊的时间点——电商迅速崛起，消费者开始在买卖交易中占据主导，同时，海外品牌大举进入中国市场，国内竞争压力骤升。对于服装品牌商来说，把商品企划、设计、生产、销售等环节拉长到以年为周期的传统模式，在这一背景下逐渐失去竞争力。尤其是在“双 11”这样的电商大促活动中，传统集中式的订货模式完全失效。于是，“柔性快反供应链”成为品牌商应对前端运营不确定性的产物，它强调服装商品全生命周期、全链条各环节的一体化紧密协同，通常是以月或者周为单位做 PDCA 循环 (即计划 -Plan, 执行 -Do, 检查 -Check, 处理 -Act)。但是，所谓“快反”，并不是盲目地“快”，背后要有数据作为依据和基础，适应业务有计划有策略的快。柔性快反供应链的打造，与数字化息息相关。裂帛是国内的原创设计女装品牌，也是最早的互联网品牌之一。在 2012 年的“双 11”中，裂帛更是拿下了当天天猫销量的第一。作为“原生”的线上品牌，裂帛更早地遇到了订单处理、仓库发货以及供应链管理上的瓶颈，因此，从 2010 年开始，裂帛就投入大量资源做 B2C 网站、电商 ERP、电商供应链等系统等自主技术研发。据裂帛股份副总裁、现任新物云 CEO 的大麦（王浩宇）在最新一期的 InfoQ《超级连麦. 数智大脑》中介绍，2016 年起，这些技术积淀逐渐从裂帛孵化出来，通过新的科技公司新物云，目前已经向市场上 300 多个品牌实现了技术输出。</blockquote><p></p><p></p><p>本期 InfoQ《超级连麦. 数智大脑》，我们邀请到了裂帛股份副总裁、<a href=\"https://www.xinwukeji.com/\">新物云</a>\" CEO 大麦（王浩宇），和极客邦科技创始人兼 CEO 霍太稳（Kevin），InfoQ 极客传媒数字化主编高玉娴，一起聊聊“双 11”背后的电商快反供应链是如何构建的。内容有删减，感兴趣的同学可进入“霍太稳视频号”或“InfoQ 视频号”观看直播回放。</p><p></p><h2>前端运营的不确定因素，需要后端供应链去抵冲</h2><p></p><p></p><h4>在“双 11”这样的大促活动中，通常服装行业的供应链会面临哪些方面的挑战？</h4><p></p><p></p><p>大麦：现在的<a href=\"https://www.infoq.cn/article/Ji9QhA4qbX8Tf63BRkpc\">双 11</a>\" 实际上从 11 月 1 号已经开始了，节奏拉的比较长。最早的双 11 是集中在一天，赌一天的销售额，对品牌商来讲押宝风险太大了。</p><p></p><p>举个例子，以前很多互联网品牌都会给自己设双 11 的销售目标，比如去年做了 1.5 个亿，今年日常销量增长了 2 到 3 倍，也就是大促要做到 4.5 个亿，但为了完成当天 4.5 个亿的销售额，企业备的货可能是 6 个亿甚至更多。因为一个款式备了 1000 件，各个颜色尺码不可能刚好全都卖完，电商企业可能有 200 个款，每个款都要备一定的库存。</p><p></p><p>万一双 11 当天的情况跟预测的不一样，比如气温比较高，企业准备的货都是羽绒服、棉衣，就可能卖得不理想；或者流量没有预期的那么高，留下来的货都会变成库存，可能整个冬天甚至第二年都卖不完。所以备多少货是第一头疼的问题。</p><p></p><h4>怎么才能避免这种情况，实现高效协同、避免浪费？</h4><p></p><p></p><p>大麦：这就要求品牌商实现更<a href=\"https://www.infoq.cn/article/z9DfpZCh0femWpQ6awVp\">精细化</a>\"的管理。面对双 11 这种大促活动，企业不能再只做一次性大批量的采购，订单采购被切割得越来越碎，要求企业能够更懂市场。比如，需要尽可能去做精准预测、做试销，通过数据分析等手段，了解市场趋势。让数据来指导商品的下单、生产的派单，而不是凭感觉和人脉关系。</p><p></p><p>比如说，基于以往销售的情况以及对未来市场的预测，我们做了 100 个款，其中，一些款式的销量预测更高，就要多备一点货，其它的普通款式就可以少备一点。当然，这么多的成衣也不是一次性都做出来的。例如某款高销量产品预计能卖 2000 件，可能只是先做 1000 件成衣，另外 1000 件先做原材料备料，如果短时间内的销量确实如我们预计，那就可以基于供应链快反能力快速生产，如果预测有偏差，那也可以减少库存风险。</p><p></p><p>换句话说，前端销售运营的不确定因素，企业需要用后端供应链去实现抵冲，防止这些不确定性因素给企业造成致命的伤害，在这个过程中，关键要把供应链变成快反的、柔性的。</p><p></p><h2>供应链数字化的价值，是透过数据发现和解决问题</h2><p></p><p></p><h4>裂帛是如何打造这种柔性快反的供应链的？</h4><p></p><p></p><p>大麦：供应链的管理，信息化是第一步。比如说从款式设计、工艺技术到 BOM（物料清单），从原材料的选择到工厂的选择，必须把整个基础的业务流程都在信息系统中落地，规范流程提高效率，让数据沉淀，这是第一步。</p><p></p><p>得到这些数据以后，还要做好内部外部的协同，比如品牌方、原材料供应商、生产工厂的三方协同。比如，我要做一万件成衣，但是供应商的材料只够做 5000 件，这时候就要留出备料的时间；另一方面，我还要知道合作的工厂有没有这个产能，如果这个工厂任务排满满的，我的订单只能一周后开工，那也不行，这时候就要快速去找到供应链中其它具有产能的工厂合作。</p><p></p><p>这方面比较典型的案例是丰田的 JIT（即时生产方式），也叫做无库存生产方式。比如，车厂什么时候、需要多少数量的轮子，供应商只需要根据这个需求，即时在流水线上组装，生产出对应数量的轮子，按照约定时间送到指定地方就可以。在服装行业也类似，品牌方在什么时间、需要多少原材料，可以通过系统给供应商发送指令，双方进行协同。</p><p></p><p>但是服装行业的一个难点在于柔性制造。通常来说，工业品生产所需的零件数量是相对标准的，经过装配，冗余不会太多。而服装的生产需要裁剪，这个动作受人工的影响比较大，同样一块 1000 米的布，有的人能裁出 1100 件，有的人只能裁出 900 件，这跟他的排料裁剪技术能力有关。所以，品牌方经常需要实时去追踪和掌握原材料的发料、收料、用料和库存情况，与最终的生产数量目标做比对，及时决定是否要增加原材料采购等等，这个数据是不断变化的。</p><p></p><p>过去，在没有系统支持的情况下，很多决策是盲目的，要不停打电话催；现在，销售端和供应链的<a href=\"https://www.infoq.cn/article/1q20RyHVsgS7xi4k1yVc\">数据</a>\"充分联动起来，运营人员就可以快速决策。之前我们用户碰到过这样的情况，在大促前计划对一个货品补单 2000 件，但是原材料现货只有 1000 米，这时候工厂会等到原材料全部到位后才开始生产，因为他们不想在产线开工后期间出现中断，造成产能浪费。但是，对于品牌方来说，这中间等于浪费了原材料等待的时间。如果我们能及时掌握原材料数量，运营人员就可以决定直接只做 1000 件，卖完后就推别的款式。这就是从销售端、运营端到供应链端<a href=\"https://mp.weixin.qq.com/s?__biz=MzA4NTU2MTg3MQ==&amp;mid=2655167156&amp;idx=1&amp;sn=fa2cd03e03e4f77bc114a3eb82d0633e&amp;chksm=846005d4b3178cc2fc0f34b114a441449248ce9405d286628cfacd06c18cbcf7326ebd5f56ce&amp;scene=27#wechat_redirect\">信息互通</a>\"，给企业带来价值的。</p><p></p><h4>企业采用这种“无库存生产方式”，在面对疫情这样的特殊情况时，会不会对经营造成影响？</h4><p></p><p></p><p>大麦：其实不是完全不备库存，而是要合理地储备现货的库存以及原材料的库存。</p><p></p><p>打个形象的比方，上游的面料库存就像个蓄水池，在不同的季节，蓄水池里的水位高低可能不一样，但是任何时候想要取原材料，这里面都是有的。当然，另一方面，蓄水池里的水也不是超出需求的，它应该根据市场的变化动态地去设置。</p><p></p><p>在服装行业，要从销售端倒推到供应链端和的生产端，现货库存备多少、原材料库存备多少、原材料的原材料备多少，每个行业、每个企业、每个不同季节都是不一样的。</p><p></p><h4>数字化技术如何在这个过程中发挥作用？</h4><p></p><p></p><p>大麦：除了通过基础的供应链管理系统，在技术层面，我们还会去建商品的<a href=\"https://www.infoq.cn/article/SEJ62iIqiEpPfW0pRm7f\">数据中台</a>\"，把供应链的数据、销售端到数据全都拉进来，这样一来，就可以从商品运营的角度去更好地做计划，把企划做得越来越精准，并且指导后端供应链的动作。</p><p></p><p>比如，目前已经销售的货品，消费者评价如何，退换货率怎么样？如果有客户评价说尺码不对，那是不是工艺技术的问题；如果衣服掉色，是不是原料商的问题；如果衣服掉线，是加工厂的问题，还是包装的问题等等。只有当各个环节所有的数据都打通之后，才能迅速定位找到问题的根源在哪里。</p><p></p><p>并且在这个过程中，我们还可以嵌入供应商评价模型，把各种关键指标放到一起，给每个供应商打分，评估后就会发现，哪些是优质的供应商、哪些供应商是有问题的、或者它以往表现还可以但是这次表现很差，所有信息一目了然。</p><p></p><p>也就是说，供应链数字化的价值体现在数据的利用上，通过对采购价格、货期、质量、供应商评分、财务应付的分析，发现问题并做出改进。决策依据数据，而不是凭感觉。</p><p></p><h2>裂帛数字化走过的弯路，是被业务带着跑</h2><p></p><p></p><h4>作为电商品牌，裂帛当初为什么会投入巨大资源上系统、做自主技术研发？是遇到了什么业务瓶颈吗？</h4><p></p><p></p><p>大麦：品牌方想把生意做好，那么设计的款式就要比较精准，对这盘货流程把控度也要更高，才能更快更准地响应市场需要，这背后归根结底是服装品牌的三大核心竞争力：产品研发能力、供应链能力、及商品运营能力。</p><p></p><p>当初裂帛遇到的第一个瓶颈是订单处理和仓库发货。比如，十年前的双 11，当天的订单量是 90 多万，在 3、4 天内完成发货，平均每天要发出去大概 20 几万单，这需要我们在仓库里配备 500 个人员 24 小时不停地运转。</p><p></p><p>第二个瓶颈就是商品供应。比如在双 11 大促的时候，到底要准备什么样的一盘货，多大规模，是什么样的货品，如何确保这些货品保质保量地生产出来，按时放到货仓里？同时，还要考虑采购成本，好卖的产品不会断货、不好卖的不会变成滞销的库存。这对供应链来说是巨大的挑战。</p><p></p><p>在电商之前，传统品牌一般是提前一年做货，提前半年开始订货，然后用半年时间慢慢生产，其中一次性生产的货品也比较多。但是，电商销售依靠快反，款式比较多，多个批次的货款汇同时下单、采购、生产以及预售补单。随着电商双 11 的兴起，更多不确定因素就出现了，比如，每年双 11 的气温不一样，流量无法确定，消费者的偏好也变得越来越多样化，所以企业就不能一次性押宝一盘货，更多的是先采购一部分试销一下，如果有一些货品卖得好，就快速再调货，这样就可以降低库存积压的风险。而这背后，就需要整个供应链条上各个环节有统一的共识，有灵活的能力，才能实现原材料快速补给，工厂快速反单，物流快速发货——这是未来商业的理想状态。</p><p></p><p>对于裂帛来说，当时也调研了一下国内外的一些技术产品，但市场上几乎还没有比较成熟的支持服装快反的系统。所以裂帛从经营企划、商品企划、采购预算、备料计划、产能规划、下单计划、铺货计划、补货翻单等部署了整个商品流管理的全链条，后续还建设了电商运营管理系统，把电商运营相关的流程、业务操作都集中到系统中，实现了总控全局。</p><p></p><h4>裂帛的供应链系统背后的设计思路是什么样的？在建设过程中我们有没有走过弯路？</h4><p></p><p></p><p>大麦：裂帛的供应链系统最初是根据业务痛点布局的，思路是从销售发货开始倒推生产、产前、下单、开发、设计、企划。</p><p></p><p>在这个过程中我们其实踩过一些人为的“坑”。举个例子，在裂帛业务的发展过程中，业务往往会给技术提出大量的开发需求，它们有可能是真需求，也有可能是伪需求。最后我们发现，当这个业务人员离职之后，很多功能就废掉了。也就是说，我们早期其实是被业务人员带着跑的。</p><p></p><p>这造成的结果是技术很难基于完整的需求设计合理的技术架构，把商品流管理、商品企划和供应商协同流程串联起来，导致后来我们不得不对系统进行重构，重新梳理业务流程和逻辑，再推导底层技术架构和性能。</p><p></p><p>对于企业来说，要解决这个问题没有别的办法，只有技术人员不断地跟业务打交道，亲身研究业务，掌握了足够的知识之后，对方才可能听你的。现在，我们已经从中受益，可以带着业务人员一起走，一起坐下来对等地交流。如果你只是一味地站在技术的视角看问题，可能根本解决不了对方的核心问题，更没法帮他们优化业务。</p><p></p><h4>展望一下，未来十年服装供应链数字化，大概能做到什么样的程度？</h4><p></p><p></p><p>大麦：过去十年是消费互联网快速发展的十年，而未来的十年，是产业互联网的时代。在这个背景下，供应链会做到什么样的程度？比如，现在我们买衣服，无论是现货还是预售，作为消费者你并不清楚卖家的仓库里有多少货品；比如我们去超市买东西，并不知道每个商品的供应链源头是哪里、经过了什么处理。未来，服装从设计研发到生产的全过程，一定会全程在线。</p><p></p><p>当然，这个目的不一定是实现可视化，而是说所有环节一定会高度互联互通，就像我们现在要打车，只要打开 APP，就能找到最近的空车一样。产业互联网会改变很多东西，可能会加速行业洗牌，会让资源会流向更有需求的地方，上下游的协同效率会更高，浪费会更少。</p><p></p><h2>复合型人才培养，需要企业内部积累和知识传承</h2><p></p><p></p><h4>对企业来说，要找一个既懂业务又懂技术的人还是比较难的，我们是怎么解决这个问题的？</h4><p></p><p></p><p>大麦：确实，要找到复合型的人才是非常难的，对企业来说，不要指望能从市场上招到现成的。这是一个在企业内部的积累和知识传承的过程。</p><p></p><p>通常来说，业务人员只关心自己的“一亩三分地”，只能看到公司业务的局部。虽然 IT 技术人员能看到公司的全局，比如从最初的技术建档、订单构建到订单结束，中间经过了多少部门、有多少状态、出现了多少种异常情况等等，他们是能看见的，但是，过去这些技术人员又是不懂业务的。</p><p></p><p>所以，关键在于如何把双方欠缺的能力培养起来。对于我们来说，主要是通过培训，包括给员工提要求、定计划，比如我们的产品顾问，他会去培养一个小组，通过不断地做项目，给小组成员进行实践讲解、录视频、演练，培养一个小团队出来，让大家对业务和系统越来越熟悉。</p><p></p><p>我们发现，当技术人员能够把自己变成非常精通业务的角色之后，就会开始乐在其中，这个过程我们是深有感触的。</p><p></p><p>在早期，我们被业务部门“折磨”了四五年，整天加班改需求，业务的人可能换了一轮又一轮，不同的人又会提不同的需求。后来，我们在对外输出技术的时候，又会发现，行业里的模式千差万别，拿原材料来说，可能是自己采购，也可能指定原材料由生产商去采购，还有一种是工厂包工包料，品牌方不指定原材料，只要大货经过检验就能过关。</p><p></p><p>所有的这些经验都要靠慢慢积累，只有我们自己把业务逻辑搞清楚，自信心才会提升，在面对客户的时候，才能更有把握地提供建议，培养双方信任感。</p><p></p><h4>极客邦致力于数字人才培养，对于企业加快数字化、加快业务和技术融合这件事您有什么建议？</h4><p></p><p></p><p>霍太稳：极客邦科技双数研究院对数字化人才进行了简单的划分，发布了“<a href=\"https://www.infoq.cn/minibook/WvG2KwN4tFfpjtTaxNve\">数字人才粮仓模型</a>\"”。从上到下，“数字人才粮仓模型”把数字人才分成了五层：</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/4f/c6/4fab60a222ayy7yy5716ab718084e9c6.jpg\" /></p><p></p><p>最上面一层是数字思维管理者，他们是决定整个企业数字化转型成败与否的关键；第二层是数字思维业务人才，包括很多销售、运营、营销、财务、市场、品牌、产品设计等等；第三层是业务架构人才，他们是业务的架构师，扮演的是业务和技术连接者的角色；第四层是技术架构人才，通常横跨多个技术领域，具有技术侧的全局思维；最下面一层是专项技术人才，这部分人才需要具备两类能力，一类是软件工程能力，知道开发体系怎么运转，另一类是专项技术能力，包括人工智能、区块链、大数据等。</p><p></p><p>但在做数字化布局时，首先，企业一定要认识到，数字化转型是一把手工程，一定要有一把手的支持；然后，再去考虑具体用什么样的工具，什么样的方法论，需要用到什么样的咨询公司；再往下，才需要考虑什么情况下会用到什么类型的人才，然后有针对性地去培养。</p><p></p><p>所以，我们现在无论讨论企业数字化转型还是<a href=\"https://www.infoq.cn/article/wliPhHXvgVJrKIs52RYk\">数字化人才培养</a>\"，都会强调不同体量的公司做法不一样，大家一定要具体问题具体分析，千万别照办硬套。假设，市场上已经有比较成熟的工具和解决方案，那企业可能就没有必要自己花成本、花时间去建一个自己的数字化团队，去自研数字化系统；如果市场上的产品满足不了自己的需求，带头人又知道如何多快好省的构建一个系统，有了这样的条件，再去考虑自建。这个事情大家一定要充分想清楚。</p><p></p><h4>嘉宾介绍</h4><p></p><p>大麦（王浩宇），新物云 CEO。计算机硕士，专注品牌数字化、供应链管理方向。国际信息系统审计师 CISA 资质，中国时尚行业 CIO 联盟理事，江苏省产业教授，宁波 3315 引进科技创业人才；2010-2020 年在裂帛股份负责企业信息化，熟悉服装电商及供应链业务，带队开发的软件产品已服务 300 多个品牌；2020 年与团队一起创立新物云，专攻供应链 SaaS 方向，2021 年获得上市公司天使轮投资，2022 年获得蓝江资本 Pre-A 轮投资。</p><p></p><p>霍太稳，极客邦科技创始人兼 CEO，InfoQ 中国创始人，极客时间创始人，TGO 鲲鹏会发起人。2007 年创立 InfoQ 中国，2014 年创立极客邦科技，2015 年发起 TGO 鲲鹏会，2017 年创立在线职业教育学习品牌极客时间，2019 年开创极客时间企业版，拓展企业服务市场。</p>",
    "publish_time": "2022-11-21 11:24:18",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "“3D 元宇宙技术”在汽车新零售领域的应用与实践",
    "url": "https://www.infoq.cn/article/jNKRhKRjuHVk8WkfjgXa",
    "summary": "<p>随着不久前汽车之家新零售项目震撼发布，我们直击用户看车选车痛点首次提出 ABC 新体验模式，以元宇宙科技打造沉浸式交互服务，开放元宇宙能源空间站体验店，为用户打造更“有用”的体验。</p><p>A：是指一站式选车试车服务（All in one），用户通过全息对比看车以及实车对比试驾，让产品对比体验更直观省时；B：是指专享时空客观评价（Belong to customers），意在给用户提供专属服务空间免打扰，同时可以看到汽车之家编辑专业、客观、公正的车辆评价，实现更省心的体验；C：是指汽车之家能源空间站沉浸式元宇宙体验（Creative technology），通过全息技术，实现1:1看车、拆车、同框对比看车等功能，为用户带来深度产品解析及更真实的科技体验。</p><p></p><p>同时，依托<a href=\"https://www.infoq.cn/article/id8Bz202Zpw3jeiTY28T\">汽车之家</a>\"实际测试数据打造“最真实的虚拟用车体验”让用户更省力地体验车辆加速、转弯、刹车、碰撞等用车场景。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/33/d9/331d2f88841f662e075612ee2ace4ed9.png\" /></p><p>图：上海能源空间站</p><p>&nbsp;</p><p></p><h2>一、从业务诉求出发看问题</h2><p></p><p></p><p><a href=\"https://www.infoq.cn/article/ipOwF5MIRR4qJXxMWE2M\">汽车之家</a>\"作为集“内容生态+工具服务+交易平台”于一体的一站式汽车生活服务提供商，为帮助用户更好的看车、买车、用车和换车决策，也一直在思考如何打破线上和线下的次元壁，思考如何把线下的用户和主机厂经销商连接起来，帮助用户更好的做看车、选车和买车决策。这就要求汽车之家需要有一个强大的线下看车、买车和购车的全流程平台能力。</p><p></p><p>我们首先思考的是如何能让用户在一个场地空间中可以深度体验和连接多款车，降低用户在物理空间中来回奔波 4S 店的痛苦，同时又不能是简单的页面信息检索，要给到用户接近真车的看车体验，还要能给到用户连真车都给不到的体验，如车体爆炸拆解改装，甚至是脑洞大开的破次元壁娱乐体验，如新能源汽车知识科普，所以业务的要求相当苛刻，要求：多款车、单个空间、真实、客观、超越想象等等。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/8d/b8/8dff255994100a5e1261a4b70b2a23b8.png\" /></p><p></p><p></p><h2>二、从问题出发找技术方案</h2><p></p><p></p><h4>2.1方案选择</h4><p></p><p></p><p>结合上述这些业务的核心述求，我们调研了目前国内外一些汽车 3D 虚拟化呈现技术，最终综合硬件实现方案成熟度和效果要求，选择了使用全息膜+Unity3D 引擎技术来给用户呈现一种沉浸式的裸眼3D看车体验。</p><p></p><h4>2.2全息技术选择</h4><p></p><p></p><p>第一类是狭义全息技术，比如典型的全息照相技术，是利用光的干涉原理把每个点的光线的方向和强度数据转换为可以通过显影记录的干涉条纹，在镜片载体表面对光敏介质进行曝光处理，获得记录了光线全部信息的全息光栅，狭义全息技术并不常见，它起于全息照相技术，应用于全息光栅光波导技术中，全息照相实验的过程十分复杂，很难为普通消费者所用，目前国内外消费级的侠义全息产品还没有。</p><p></p><p>一类是借助近眼显示设备和 3D 实时渲染技术呈现的“感知全息”，比如 Oculus 和 Hololens，这种目前国内外都有不错的消费级产品落地。</p><p></p><p>还有一类就是我们说的类全息平面投影，通过借助半透半反的膜层把平面显示器的内容反射到观察者眼中，营造出立体感。好处是对用户设备没有要求，比较适合展厅类效果呈现。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/07/55/07ee1deab665790968ca033c7be80155.png\" /></p><p>图：全息膜原理展示-1</p><p>&nbsp;</p><p><img src=\"https://static001.infoq.cn/resource/image/bd/32/bdbcaac367ecd854573d37b19736e432.png\" /></p><p>图：全息膜原理展示-2</p><p>&nbsp;</p><p>我们最终选择了类全息平面投影的技术方案，是目前国内做大型展览馆演出类活动比较常用的技术方案，在相对固定的空间中能给到用户接近真实的裸眼 3D 观看体验。</p><p></p><h4>2.3 3D引擎选择</h4><p></p><p></p><p>我们最终选择了目前国内主流的 Unity3D 引擎来实现，Unity 引擎针对 PC 端的 HDRP 高清渲染管线支持正向和延迟渲染，并且使用基于物理的光照和材质。它将图形推送到高端硬件（像 PC、XBox和Playstation）以打造震撼的高清视觉效果的理想选择。其面向高逼真度的游戏、图形 demo 和建筑渲染、超写实效果，以及所需的最佳图形效果。同时针对高端图形处理时，它要比内置渲染器要快得多。</p><p></p><p>我们在设计初期就考虑到了一套代码既支持 HDRP 管线也可以复用到 URP 管线，方便把我们的能力快速升级迁移到移动端设备中，包括手机、AR 眼镜和 VR 眼镜中，同时我们借助动捕设备的辅助，可以轻松驱动移动端 3D 数字人，目前国内 Unity 技术社区成熟，有很多实用且经过验证的前人的成果可以直接借鉴使用。</p><p></p><h4>2.4 技术难点</h4><p></p><p></p><p>我们的最终呈现要依赖物理空间中全套软硬件设备都能完全协调一致才能实现，对硬件设备、3D 程序、中控指令台、灯光控制等整体架构方案都存在很高的要求，要能保障用户在沉浸式的体验全息车辆的过程中不能有太多的技术干扰因素让用户觉得假。 同时整个能源空间站全息舱必须要考虑能支持大规模商用和快速可复制的要求，这就对软硬件的标准和技术实现的要求都非常高。</p><p></p><p>同时全息舱还需要作为一个沉浸式虚拟体验技术平台把能力对外输出到其他业务线，比如公司直播平台和网上车展联动等场景，促进公司内部技术的横向赋能。</p><p></p><h4>2.5 全息舱架构</h4><p></p><p></p><p>针对上诉这些技术难点，我们在技术落地的前期就必须思考周全，我们的总体思路总结起来就是九个字：标准化、高效率、真体验。所以架构设计上我们会收拢技术标准，包括外部渠道接入全息舱的标准，全息体验评估标准，3D 虚拟人和 3D 车辆模型标准等。</p><p></p><p>我们的架构设计也会极度重视研发上线交付效率，期望接入新车的时间成本降到最低。同时所有的标准和高效都建立在体验真实的基础上，这就要求我们从多个方面去不断升级我们的全息体验，以保证用户时刻都能感受到\"真\"。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/c5/0c/c5d4acef6187dcbdb5cf9c6cc302c70c.png\" /></p><p>图：整体架构</p><p></p><h4>2.6 统一标准化</h4><p></p><p></p><p>我们整体设计了一套软硬件一体的架构部署方案，并打磨出一套最好的 3D 视觉呈现规范，包括用户距离全息膜的物理空间距离、屏幕清晰度、灯光亮度、音响环绕音和背景视频选择等等一系列的指标，所有这些都形成一整套的 SOP 规范，才能最终给用户营造呈现出现在的全息沉浸式观看效果。当一切都按照我们的标准来规范化建设的时候，大规模的商用才有可能实现。</p><p></p><p>关于硬件设备统一标准。所有全息舱内的硬件设备都必须统一标准，包括 GPU 游戏机主机配置、显示设备清晰度和尺寸、投影设备型号、全息膜厂商规格、灯光设备以及所有这些设备的中控指令API规范等等，经过 8 个月的持续打磨和摸索，来回和硬件供应商的沟通和撕扯，最终为来能达到全息舱的真实震撼的用户体验，我们输出了业内最严格的全套硬件设备接入规范标准，为后续能源空间站的大规模商用推广做好了硬件准备。</p><p></p><p>关于 3D 模型素材高标准。经过 20+ 次的迭代打磨，我们才最终把全息舱内 3D 汽车模型标准规范统一起来，以最高规格的模型标准来管控从模型制作、美术验收到程序验收的所有环节， 平均每个 3D 汽车模型都拥有超过 4000 万个三角面，模型包体超过 1.5G 的大小，为最终全息舱内能给用户带来极致震撼的体验效果打好了基础。模型标准规范支持在 4K、8K 屏幕上显示媲美实车的高精度外观内饰模型，同时还满足移动端通用模型十倍的面数以达到更高的精度。对内饰皮革、木纹、塑料、屏幕等展示精度要求媲美实车。对车辆外观材质要求 1:1 真车实图对比，灯光效果要求更真实的氛围灯、体积光、光晕、流水灯、灯舞、等灯光效果。从模型规范层面就能支撑起 80% 的车辆全息体验效果保障。</p><p></p><p>关于全息体验标准化。为了保障整体全息舱体验的统一，为大规模开舱可复制做好准备，我们对全息舱内软硬件环节都做了标准化取舍，如灯光在不同体验场景下的亮度、音响在不同场景下的音量大小、3D车模型在不同场景间的过场衔接效果等，全部的体验细节我们都做了统一处理。</p><p></p><p>关于外部信号接入标准化。全息舱作为一个平台，会有很多的外部合作业务想要接入进来，和全息舱内的车辆和素材进行实时互动，考虑到技术实现的统一性和体验稳定性，我们在接入规范层面就要求外部业务想要接入全息舱需全部使用高清 4K 视频流信号的形式接入进来，为此我们研发了一套通用的多路视频信号采集和编解码系统，专门用于在全息主机中前置处理外部接入的视频信号，保障全息舱内体验到的外部素材的信号稳定性和清晰度。</p><p></p><h4>2.7 高效率架构</h4><p></p><p></p><p>整体的架构设计上，是我们通过接近 8 个月的时间逐步摸索出的一套符合业务需求同时也能极大提升研发效率的技术架构方案，核心包含三个方面： 指令分层设计、完全数据驱动设计和视频流 I/O 设计。</p><p>针对模块指令层设计，我们模仿网络通信协议设计，把指令编码层、通信层和 UI 展示层分离。从代码实现层面分层隔离，可以单独对各层进行优化，同时中控和指令间建立长连接，保障传输效率的高效，同时借助 WebSocket 协议的全双工通信机制可以有效的控制指令的执行状态和进度，用户可以随时中断执行中的指令，让用户真正的可以通过中控指令控制全息舱内的画面呈现内容。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/a5/d5/a5d708d0ba2710c051f3c6c3600fe9d5.png\" /></p><p>图：指令通信层设计</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/80/13/8037919464e7a3e3b24ca892c0a08d13.png\" /></p><p>图：基础架构分层</p><p>&nbsp;</p><p>为了达到极致的研发交付效率，我们期望完全通过后台数据驱动的方式来低代码配置化交付，为此我们重新设计了 U3D 的代码架构，把全息舱拆解成 9 大模块 30+ 个指令功能。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/42/03/4289966d3490ebf312a35d1dee2df103.png\" /></p><p></p><p>我们把讲车模块拆分成多个指令，在模块层面具备进入和退出的独立逻辑，在指令层面有单独的生命周期控制，抽象出：Module-&gt;Command-&gt;Action 三层数据架构，通过分层隔离，我们可以直接通过数据组装的方式拼接出一个完整的指令，所有指令都按照一个通用的时间线逻辑执行，用户可借助长连接通信和指令生命周期状态实时控制全息内容的展示效果和阶段。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/f3/a6/f3a6e78a08d4cd2e03fa5415511f46a6.png\" /></p><p>图：讲车模块架构</p><p>&nbsp;</p><p>针对单个指令，为了方便数据配置，我们单独上线了指令可视化编辑器，核心思路是模拟视频剪辑软件的设计思路，期望能在编辑器中通过简单的托拉拽的方式\"剪辑\"出一个功能完备的全息舱指令，可视化编辑器搭配后台数据配置功能，我们就具备了极高效的功能生成效率，从而可以保障单车交付效率。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/c6/93/c6b433d4bcd5f8e1a8362eeae83c1f93.png\" /></p><p>图：Command指令架构</p><p>&nbsp;</p><p>通过指令模块拆分隔离、合理的数据结构设计，可视化指令编辑器、功能完全数据配置驱动等这一系列的优化设计，最终达成的效果是：全息单车交付效率从 12 天一辆车缩短为现在的 3 天一辆车。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/05/26/055fed7c1c6924d296283180bced7326.png\" /></p><p>图：指令可视化编辑器</p><p>&nbsp;</p><p>我们设想把全息舱当成一个平台，从业务规划判断，这个平台需要同时具备两个特征：方便外部业务接入进来、方便接入到外部业务中。主要是应对这两个业务场景：</p><p>入舱接入：支持外部业务和功能接入到全息舱中，比如虚拟数字人、实时采访信号、直播画面信号、外部画中画等场景，针对此类需求，我们根据上面标准化设计的视频采集接入流程，通过 HDMI 物理线路和实时视频流 URL 的方式采集接入，经过我们专门研发的视频转码合成程序合成后作为一路视频信号输出到全息大屏上。出舱输出：可以输出到直播平台，经过直播平台推流到 CDN 节点，用户实时拉取直播信号数据，我们可以做到 5 秒左右的直播延迟。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/bd/0e/bd6331728ffd4f59ac2db6558294fd0e.png\" /></p><p>图：视频流I/O架构</p><p>&nbsp;</p><p><img src=\"https://static001.infoq.cn/resource/image/7f/63/7ff0200742b2084b06661cf25831d563.png\" /></p><p>图：全息指令系统架构&nbsp;</p><p></p><h4>2.8虚拟数字人</h4><p></p><p></p><p>为了在全息舱内把人车互动做到极致，我们联合给周杰伦演唱会中打造邓丽君真人形象的团队一起花费 5 个月的时间打造出汽车之家形象大使谷爱凌的 3D 数字人形象，并经过算法声纹采集和大量的汽车知识库大数据样本的机器学习训练，最终打磨出来一个有趣、逼真又有料的谷爱凌\"数字真人\", &nbsp;我们在全息舱中可以零距离和谷爱凌进行各种有趣的互动。</p><p></p><p>数字人这块，我们还在规划更多黑科技功能落地，比如智能表情和肢体驱动和控制、实时语音交付等，我们的终极目标是让数字人从外观形体到智能化程度都更像真人，给用户逼真且情感丰富的回馈。</p><p></p><p></p><h2>三、业务亮点</h2><p></p><p></p><h4>3.1 3D全息真体验+真数据</h4><p></p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/c2/y0/c2edcbbbab93ab8e92d6e102cc78eyy0.png\" /></p><p>图：3D汽车模型极致逼真还原</p><p>&nbsp;</p><p>在酷炫全息 3D 车辆展示效果基础上，我们还依托<a href=\"https://xie.infoq.cn/article/f5a196d018cf22600f8ebe163\">汽车之家</a>\"对所拥有的海量垂直汽车行业用户数据的深度挖掘和学习，使得我们比用户自己更懂用户诉求，叠加汽车之家专业编辑和大 V 持续输出的专业评测数据，我们可以对每辆车都输出完整的中立客观的评测数据，给用户最真实的购车决策建议，做到使用户看到真车更看到真观点。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/9a/a6/9abf76f8180ab9e9419756d28866dda6.png\" /></p><p></p><p></p><h4>3.2 网红大咖全息互动直播</h4><p></p><p></p><p>为了让更多的用户能不用亲临能源空间站现场就可以体验我们的酷炫全息讲车，同时也为扩大新零售能源空间站的网络声量，吸引更多到店试驾用户流量，我们打磨了一套全新的直播技术体系--全息互动直播，我们把全息舱车辆叠加 3D 立体背景和多路真人主播视频信号混流成一个完整的全息沉浸式直播信号流，营造出一种人、车、场完全融合的极致逼真效果，使得我们可以在一场直播中任意切换多个环境和多款车进行详细车辆讲解，给用户带来前所未有的直播体验。</p><p></p><p>我们第一次全息互动直播就获得了接近 4 万用户的观看量，用户评论互动都非常积极，后续我们还会持续对全息直播体验进行深度优化和升级，期望给用户给行业都带来完全不一样的全新直播体验。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/22/228db790e2be3d48d45163eee16c4fa9.png\" /></p><p>图：全息多路混流直播</p><p></p><h4>3.3全息互动梦想剧场</h4><p></p><p></p><p>借助能源空间站全息技术除了可以以裸眼 3D 的方式淋漓尽致的展现车辆细节，还可以以剧场的形式展现更多有趣有料的素材内容，比如能源科普视频节目、文化艺术普及推广节目以及数字人互动娱乐等等丰富有趣的节目形式，让用户体验到比电影院更加立体逼真的视觉效果。</p><p>&nbsp;</p><p>同时我们还通过融合 MR 互动技术和全息舱 3D 空间研发了更多的能让用户直接参与互动的有趣功能，包括真人与车合影互动、真人与谷爱凌数字人互动合影，以及真人语音和数字人对话等场景。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/f5/ef/f553760bcf064111687fe0eccc49f0ef.png\" /></p><p>图：虚拟数字人和真人合影(商业权益所限数字人形象脸部已做虚化处理)</p><p></p><p></p><h1>四、写在最后</h1><p></p><p></p><p>大家可以去到上海能源空间站实地体验我们用 3D 元宇宙技术打造的全息舱，现在看到的效果还只是刚开始，我们的研发团队一直都在加班加点对产品功能和体验持续优化和升级，以两周一个迭代的版本速度推进，同时我们还规划了更多的有趣好玩的功能等待大家的发觉。</p><p></p><p>全息舱是我们主机厂产研团队历经 10 个月的时间从无到有一步步打磨出的一个全新的产品，我们期望能借助我们的技术真正的给业务方和客户方赋能，助力汽车之家迈向新的征程。</p><p></p><p>本文参考资料：</p><p>[1] &nbsp;&nbsp;<a href=\"https://www.infoq.cn/article/A%20Large%20Scale%20Interactive%20Holographic%20Display\">A Large Scale Interactive Holographic Display</a>\"</p><p>[2] &nbsp;<a href=\"https://kns.cnki.net/kcms/detail/detail.aspx?dbcode=CJFD&amp;dbname=CJFDLAST2022&amp;filename=DSSS202209034&amp;uniplatform=NZKPT&amp;v=M44uptHFI4zVgenGoxmPOfI5DdtzS3cz8W7uxuimpIDse0xgjA5xNwFyO88z5nSt\">全息投影技术在展示设计中的应用研究</a>\"</p><p>[3] &nbsp;<a href=\"https://zhuanlan.zhihu.com/p/31898679\">https://zhuanlan.zhihu.com/p/31898679</a>\"</p>",
    "publish_time": "2022-11-21 15:44:48",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "大数据+ VR 全景技术重塑“二手车买车场景”",
    "url": "https://www.infoq.cn/article/XiOExk9joBOKM7Fb4f8e",
    "summary": "<p>行内人都知道，二手车交易的核心问题在于车况信息不透明。中国二手车交易市场制度尚不完善，长期以来缺少行业公认的车辆估值标准和车况检测标准，二手车商提供的估值和车况信息不够透明。这导致用户和车商交易双方都陷入了循环困境：用户对车商信任不足，购买意愿低；二手车商缺少潜在客户线索，为招揽客户不惜采用虚假信息，使得市场环境进一步恶化。为推动车况信息的透明化，汽车之家二手车不断完善优化“车史档案”，使二手车出险记录查得率达到 98%、维保记录查得率达到 85%，同时还有天天拍车平台开展线下检测业务，获取真实的车况数据完善档案数据。</p><p></p><p>现阶段，多方面的车辆信息已实现了物理层面上的集成，但在语义内容的解析和信息的视觉呈现上还有待深入研究。用户需要亲自阅读碰撞、维保、电池报告来理解其中的内容，报告内容的丰富性、专业性与可读性将对用户的交易决策产生重要影响。例如用户浏览 APP 时被汽车外观、内饰的照片所吸引，却可能因不了解汽车车体结构和车况排查标准而无法准确理解相应的碰撞、维保、电池报告中所包含的众多内容，最终导致交易转化失败。</p><p>&nbsp;</p><p></p><h2>一、提出解决方案的第一步：明确目标</h2><p></p><p></p><p><a href=\"https://www.infoq.cn/article/id8Bz202Zpw3jeiTY28T\">汽车之家</a>\"二手车将利用数字能力和数据资源不断推动车况信息的透明化、标准化，使用户更易了解车况信息，提高用户决策效率和线索转化效率。具体来说，<a href=\"https://www.infoq.cn/article/jNKRhKRjuHVk8WkfjgXa\">汽车之家</a>\"二手车结合机器学习、自然语言处理和 VR 全景等技术重塑了二手车购买的业务场景，将二手车车源在估值、车史、VR 全景展示三个维度的信息进行了集成与融合，以交互式可视化的形式呈现给用户，使用户更快捷、直观、详尽了解二手车车源的车况和估值，降低用户的信息搜寻成本和信息理解成本，促进用户做出交易决策。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/c6/ac/c650bf99c73731987d0cf4c7e67dedac.png\" /></p><p>图1.传统二手车买车场景和数字化二手车买车场景对比</p><p></p><p>如图所示，传统的二手车交易需要用户在不充分了解车辆信息的情况下去与二手车商预约线下看车，再根据看车人的经验知识做出主观的评断。而数字化的二手车买车业务则是用户直接通过 PC、APP 从云端获取标准化的车辆信息，充分了解车辆信息、初步评估后再决定是否线下看车，有效提高线下看车的效率。汽车之家二手车在为用户创造数字化体验的过程中，除了促进购车交易，也提高了买车新模式的商业增长。</p><p></p><p></p><h2>二、制定解决方案：构建“买车新模式”</h2><p></p><p></p><h4>1、业务场景</h4><p></p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/41/57/4110e8b0b4104f1df76381917da14457.png\" /></p><p>图2.二手车买车业务架构</p><p></p><p>二手车买车业务流程架构如图所示。结构化的数据来自从汽车之家二手车交易平台中的二手车的车辆数据、交易记录等数据。其中，二手车的车辆数据中包括省份、城市、车型、上牌时间、行驶里程、发布时间、过户次数等各种数据，二手车交易记录中包括成交价格、交易类型、检测车况等数据。这些结构化的数据按用于估值模型的训练，预测车辆在当前及未来的价格趋势。</p><p></p><p>半结构化的数据是指从第三方获取的车辆出险记录，4S 店维修保养记录、天天拍线下检测记录以及电池数据记录，这些记录具有多种数据类型，需要转化为统一的数据格式，解析其中的语义内容，抽取结构化的信息。对于新能源车的电池数据经过加工解析生成电池在线检测报告，综合得出维保、碰撞、电池等多维度的车史报告。</p><p></p><p>全景数据是指通过 VR 外观相机和 VR 内饰相机所拍摄的原始图像数据，原始图像数据经过 VR 拍摄组件生成 VR 图片，再通过 APP、H5 端的 VR 播放组件进行展示。从非结构化数据中抽取出的结构化信息除了形成车史报告，也可以与 VR 中图像进行跨模态的语义对齐，例如车史报告中如提到“左前门碰撞”，则可以在 VR 展示中提示出左前门的状态异常。估值、车史和VR展示将共同呈现于用户界面。</p><p></p><p>当用户浏览通过 PC、APP 浏览二手车车源详情时，可在用户界面查看车辆估值信息，查询车史报告，VR全景看车，从价值、车况、外观内饰三个角度来评估车辆是否符合需求，决定是否购买或留下购车线索。</p><p></p><h4>2、技术难点</h4><p></p><p></p><p>估值：车辆的数据十分复杂，通常包括了区域、车龄、里程数、车型、车系、外观、内饰、车况等多达上百维的特征信息，并且这些特征存在着数据的部分缺失或特征间多重共线性的复杂关系，给二手车价格的预测模型带来三大挑战：模型预测的准确率，模型推理的计算效率，模型的可解释性。虽然现有的机器学习技术如神经网络或梯度提升树模型可以端到端地处理复杂特征，但车辆特征数据的复杂性使得此类方法不适合用于二手车价格的预测，已有的二手车估值模型准确率较低。为解决上述三个问题，本估值模型采用了分而治之的思路，将车源按照省份、城市和车型分组，再将分组后的车源数据中与时间相关的数据进行量化处理，根据相关性筛选特征，训练多元线性回归模型。</p><p></p><p>VR全景：现有的 VR 外观技术方案是采用单反相机+长焦镜头拍摄，在自带转盘的影棚内进行车辆外观的 360° 拍摄；或采用单反相机+鱼眼镜头拍摄，车内使用单反进行 4 面拍摄，然后采用人工后期处理的方式完成全景 360° 图像的生成。缺点在于单反+影棚+转盘造价高，条件苛刻，拍摄车辆需要专人负责运输，效率低，后期图像处理繁琐，产出一辆车的外观+内饰图片过程长，对于人员专业度要求苛刻。而通过手机 APP 引导拍摄+后期人工处理的方法所得图像不够精准，后期人工处理耗时长。二手车VR看车全新设计研发了基于模型、车辆轮廓识别、陀螺仪、磁场传感器综合性的对被摄车辆和场地进行计算，给拍摄者提供便捷的定位拍摄方案。</p><p></p><p>车史档案：维修保养记录、碰撞记录和电池充放电记录的数据也同样面临着数据维度巨大、数据质量不一、缺乏规范化的问题。比如维保记录和碰撞记录，有着多种形式的数据来源，既有半结构化的记录表单，也有记录文档，甚至还有拍摄或扫描的文档图像，需要对这些数据源进行加工处理，规范为统一格式的数据形式。在车况信息的抽取过程中，需要根据领域专家知识明确需要抽取的信息类型，建立车况评估和电池状况评估的知识模型以及相应的标准化术语词表，建立车况和电池的评分、评级模型。</p><p></p><h4>3、实现方法</h4><p></p><p></p><h5>3.1估值</h5><p></p><p>&nbsp;</p><p><img src=\"https://static001.infoq.cn/resource/image/67/29/671956a0666faecac24fe044e7dd0329.png\" /></p><p>图3.估值模型</p><p></p><p>对车辆进行估价，是二手车交易的重要环节，在交易过程中，需要根据车辆信息对二手车进行评估定价，获得较为准确估价区间。目前，我们基于汽车之家丰富的二手车车源数据研发了一种车辆估价模型,来满足商家、用户对二手车车源价格的评估。</p><p></p><p>我们的车辆估价模型主要使用的车源数据包括：地理区域、车型、行驶里程、上牌时间、发布车辆时间等，首选我们需要车源数据中提取地理区域和车型，并按照地理区域、车型对车源数据中的其他维度数据进行分组，得到分组数据，再将分组后的车源数据中与时间相关的数据进行量化处理，处理后的各组车源数据作为训练数据，训练多元线性回归模型，模型定义如下：</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/96/64/960f083112598c12c92de3836349e164.png\" /></p><p></p><p><img src=\"https://static001.geekbang.org/infoq/e8/e8324f076a00e835a724de76c98d7bac.png\" /></p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/da/cf/da6c9055eef2f7ee47a7035b1a2ba9cf.png\" /></p><p>表1.不同理区域、不同车型对应估计模型的截距与回归系数</p><p>&nbsp;</p><p>构建多个针对各个地理区域下的、不同车型的车辆估价模型，即每个省份对应多个车辆估价模型，每个省份、城市、车型下对应一个车辆估值模型。由于不同省份、车型的车辆价格存在一定的差异，因此针对不同地理区域、车型训练不同的估值模型，可以有效减少预测误差，使模型估计的准确性更高。得到针对各个地理区域下的、不同车型的截距与回归系数。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/8e/8ed08d7c6dbe00f32a1f593b3cc75c67.png\" /></p><p>图4(左）-根据信息预测估值；图5（右）-历史成交和建议</p><p></p><p>因此，本估值模型本质上是一个集成模型，顶层是按省份、城市和车型进行的分类模型，底层是对应类别的多个预测模型。当利用训练得到的车辆估价模型进行估价时，首先根据从客户端获取的地理区域、车型，选择与地理区域、车型相对应的车辆估价模型，再将从客户端获取的上牌时间、用户发布车辆信息时间、行驶里程输入以选取的模型，模型输出对应的高准确性的车辆估价。</p><p></p><h5>3.2 VR 全景</h5><p></p><p></p><p>在 VR 技术逐渐普及，可为用户提供新颖的内容展现形式的背景下。因二手车一车一况，通过VR技术采集商家各辆车的内外图像数据，随车辆信息发布以后，可为用户提供更加直观、真实的车辆状况展示，线上车源 360° 展现，外观、内饰无死角细节浏览，提升浏览体验。提高用户决策及线索转化，提升到店转化率 。同时也为商家提供了高质线索和用户到店率。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/e2/b2/e2ab5807eea4f548bf7f20fda9f1c9b2.png\" /></p><p>图6.VR全景拍摄技术流程</p><p>&nbsp;</p><p>拍摄方案：载入用户选择的对应年代款的车辆模型图 30 张，一套 360° 外观图需要拍摄 30 张不同角度的照片，以车辆为圆心，12° 为一个点，进行站位点划分，站位点与模型图角度进行强关联，每张图对应到一个站位点。使用手机内置陀螺仪+电子罗盘，经过计算可为拍摄者提供精准的角度位置信息，供拍摄者参考自身占位是否与模型图匹配；通过图像轮廓实时识别能力，为拍摄者提供精准的距离指引，免除人工丈量设置拍摄点位的繁琐步骤；当拍摄者按下拍摄按钮后，程序对拍摄的图片进行分析识别，保留车辆轮廓内的车辆清晰图片，对轮廓外的背景区域进行 20% 的高斯模糊图层生成，并对边缘进行羽化处理，拼合所有图层，得到最终的一个角度的外观图。本外观拍摄方案，简化了人工图像处理步骤，通过智能识别算法，全自动生成预期的车辆清晰背景虚化的外观图片，极大的简化了车辆外观 360° 的拍摄流程，10 分钟内即可完成外观和内饰拍摄，并直接上传平台展示。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/3f/d2/3fe79588d8dee585a7b8f60174a6bfd2.png\" /></p><p>图7.VR全景多平台一体化集成方案</p><p></p><p>适配多端拍看一体化技术方案(手机 App 拍摄 + App 双端 VR 播放组件 + H5VR 播放组件)：</p><p>1. 自研手机 360°VR 外观拍摄 App 组件；</p><p>2. 自研集成化内饰 VR 拍摄组件, 支持多品牌VR相机连接拍摄.；</p><p>3. 自研 App 原生外观播放器控件； </p><p>4. 基于 ThreeSixty 二次研发的外观 H5 播放器; </p><p>5. 基于 Kpano 的内饰 360°H5 内饰播放器。</p><p></p><h3>3.3车史档案</h3><p></p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/41/70/41b600074803f8a34e99b4f5639cde70.png\" /></p><p></p><p>车辆出险记录，4S 店维修保养记录和天天拍线下检测记录数据形式多样，部分图片数据需要先通过 OCR 转换为统一的文档格式，再从文档中抽取结构化的信息。首先建立车况评估和电池状况评估的知识模型以及相应的标准化术语词表，解决了哪些信息需要被抽取，信息彼此之间的关系是什么，信息该如何利用的问题。</p><p></p><p>具体来说，NLP 模型抽取出时间信息，里程数、维修/理赔金额等数量信息，实体信息（汽车关键部位，如 A 柱、B 柱等）及相应的方位词（如正前方、前方左侧等）和动词（如切割、钣金、焊接等），并根据句法标注建立实体、方位词和动词之间的关系，构成形如“左-A 柱-焊接”的语义短语，这样的语义短语是描述车辆碰撞维修历史的最小语义单元。</p><p></p><p>由于原始记录的不规范或 OCR 识别过程中的误差，记录文档对汽车关键部位的描述可能不够准确或不够完整，还需要依据预先建立的标准关键部位名词词表、动词词表、方位词词表进行规范化处理，得到标准化的关键部位名词、动词，以及相应的语义短语。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/a8/c3/a8a17ac9c5742ce12453f8c1326c22c3.png\" /></p><p></p><p>根据检测部位和事件类型，将车况排查分为骨架排查、加强件排查、水泡排查、火烧排查、里程排查、外观部件、变速箱/发动机排查、安全气囊排查八大维度。其中外观部件的排查信息可以与 VR 图像建立语义上的对齐，进而在VR层面进行视觉上的呈现。根据标准化的关键部位名词与动词关系，制定了不同维度的车况评级规则，将抽取出的标准化语义短语映射为“ABCD”四个等级评级，最后综合八个维度的评级和车辆的出险记录、理赔金额、新车指导价格等信息对车况做出综合的评估，分为“优、良、中、差”四个等级。从抽取的语义短语、事件和数量信息生成车辆的碰撞历史明细、维修保养历史明细和历史里程明细。</p><p></p><p>随着新能源汽车市场的迅猛发展，汽车之家二手车也积累了数万的新能源车源车主和对新能源车源有买车欲望的用户。除了获取车辆的维保、碰撞、里程车史，新能源车用户还对电池性能和电池续航能力的评估有着强烈需求。为此，二手车联合北理新源，利用新能源车电池大数据打造了新能源二手车智能车况云平台，将电池数据进行加工处理和评级，在汽车之家、二手车之家等相关产品上一键生成新能源电池一站式在线检测报告，实现电池性能实时评估和续航里程在线检测。</p><p></p><p>电池检测报告记录了电池出厂数据，并对电池评估数据、充放电数据、行驶数据和异常情况数据进行综合排查评估电池性能，计算出参考续航里程。综合解析以上维度的数据，构建了电池状况评分和评级模型，预测电池性能的评分并按照评分划分为优、良、中、差四个等级。</p><p></p><h2>三、写在最后</h2><p></p><p></p><p><a href=\"https://www.infoq.cn/article/ipOwF5MIRR4qJXxMWE2M\">汽车之家</a>\"二手车针对二手车车辆数据和视觉展示进行了深度探究，建立了标准化的数据处理加工流程、方法模型以及可视化展示形式。面对海量的复杂的车辆数据，以分治思想建立估值的集成模型，极大提高了估值的准确性，使用户能够准确了解当前车辆的价值；建立标准化的车史知识模型，通过算法模型和规则方法将碰撞、维保、电池的信息结构化，特别是新能源车电池在线检测报告，在业内处于创新领导地位。</p><p></p><p>在视觉展示层面，创新地利用软件技术解决了传统 VR 技术过于依赖硬件和人力导致的成本偏高，时间偏长的问题，使商家能够轻松地拍摄 360° 全景影像，提升购车用户的浏览体验。三个维度的信息经过数字技术解析并集成融合，重塑了二手车买车的业务数字化场景。</p><p></p><p>二手车买车业务是汽车之家二手车非常关键的业务线，在用户做出交易决策的过程中，可信且完善的车辆信息以及信息与用户的交互起到至关重要的作用。汽车之家二手车的愿景是持续推动业务的数字化转型，打造二手车流通的全数字化系统，实现非标商品标准化，过程透明化，建立起一套赋能二手车行业数字化转型的新模式。</p>",
    "publish_time": "2022-11-21 15:49:31",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]