[
  {
    "title": "基于 TiDB 构建 UbiSQL，平安科技分布式数据库架构设计与实践",
    "url": "https://www.infoq.cn/article/qMqxDtxqzJyfKrBf6wjN",
    "summary": "<p>嘉宾｜汪洋</p><p>采访｜钰莹</p><p>撰稿｜传英</p><p>&nbsp;</p><p></p><blockquote>导语：在各种因素的推动下，分布式数据库已经成为一种技术潮流，甚至是新基建很重要的一部分，该类型数据库也在众多行业进行了广泛落地，供需两旺。分布式数据库的架构设计思想也很值得广大开发者学习。本文，InfoQ 希望呈现有关分布式数据库的架构设计优化及实践相关内容。</blockquote><p></p><p>&nbsp;</p><p>过去十年，飞速发展的信息技术给企业的数据量带来了成百上千倍的增长，也让更多人受益于数据服务，与此同时，数据应用的场景变得越来越复杂，对实时性的要求也在提高。</p><p>&nbsp;</p><p>在实时性、高可用等需求的推动下，越来越多公司开始使用<a href=\"https://www.infoq.cn/article/lqSvRZ7AB3NtjYpH79Rk\">分布式数据库</a>\"。面对保险业务飞速发展，以及庞大业务量的挑战，平安集团在 2018 年引入了分布式数据库 TiDB，用来支撑金融、医疗健康、投资等业务。</p><p>&nbsp;</p><p>在这期间，TiDB 数据库实例保障了 2019 年“1.08 财神节”单日交易额破千亿，并通过弹性的水平拓展，使数据库集群的性能有了量级的提升，使互联网保险业务可以抗住每秒几千单的压力……同时，平安集团基于TiDB基础的数据库引擎，自研了金融级分布式数据库UbiSQL。2022年，平安集团完成了首套传统商业集中式数据库迁移到 UbiSQL 的关键项目存储过程约 2 万行，之后，依次进行应用层功能的全回归测试、应用的性能压测以及数据库的压测，并对迁移后的数据库做相应的监控和报告，通过这套方法，平安集团对内部比较核心的统一支付、客户信息核心管理系统以及工作流系统进行了完整的迁移。</p><p>&nbsp;</p><p>从架构设计角度出发，不同路线的分布式数据库应该怎么选择？分布式数据库带来的运维复杂性怎么解决？重建 OLAP 或者新建 HTAP 哪个更有效？为什么现在选择乐观协议的分布式数据库越来越少？本文，InfoQ 采访了平安科技总工程师及数据库团队负责人汪洋，试图探寻上述问题的答案。</p><p></p><h2>平安科技数据库架构设计实践</h2><p></p><p>&nbsp;</p><p>2018 年，是平安集团开始使用 TiDB 的关键时间点。彼时，伴随着数字化转型，平安集团连续几年开展类似双十一的促销活动，在稳定性方面具有较大优势的传统商业集中式数据库，伴随着平安集团平稳走过了几个“开门红”活动。</p><p>&nbsp;</p><p>由于当时还没有分布式数据库的模式，平安集团需要在大型活动前进行容量评估——是否需要将数据库从一台小规格的机器迁移到大规格的机器上？如果按需扩容，在活动结束后，采购的机器应该如何处理？……在这样的情况下，平安产险 2018 年的“开门红”活动中，首次尝试应用了原生的分布式数据库TiDB，通过一个月的搭建和测试，TiDB 满足了平安集团对分布式数据库的预期，也很好地支撑了“开门红”活动。</p><p></p><h4>为什么选择 TiDB 这类原生分布式数据库？</h4><p></p><p>&nbsp;</p><p>当时，市面上供选择的分布式数据库已经有很多了，据汪洋回忆，平安集团选择引入 TiDB 主要有两方面的考虑。</p><p>&nbsp;</p><p>一是技术层面，如前文所述，TiDB 的能力已经在平安集团的业务中得到了验证，而且对于开发人员和 DBA 而言，学习成本也可以接受，同时，作为国产数据库，TiDB 也能最大限度地保障信息自主可控。</p><p>&nbsp;</p><p>二是生态层面，平安集团将数据库是否开源视为一个重要的考量因素。在 TiDB 之前，平安集团也引入过 Redis，MongoDB 等开源数据库，已经了解使用商业数据库可能带来的成本等各方面的问题，因此开源成为了选型的必选项。在开源的基础上，也关注开源社区的活跃程度：社区的生态好不好、有没有可持续性、软件迭代的速度快不快等。汪洋表示，TiDB 遍布世界各地的贡献者、针对数据库开设的培训课程、积极通过生态工具或者集成的方式增强产品性能等方面，都体现了社区的活力。</p><p></p><h4>UbiSQL 的演进历程</h4><p></p><p>&nbsp;</p><p>出于金融机构对数据库稳定性、高可用的要求，以及国内对信息自主可控的要求也在提升，平安集团也想推出自己的原生分布式数据库，这样不仅能降低数据库迁移的成本和风险，也能保证平安集团技术的自主可控，保障信息安全。</p><p>&nbsp;</p><p>基于这些考虑，平安集团基于 PingCAP 公司的 TiDB 打造了金融级分布式数据库发行版 UbiSQL，在提升运维效率，满足金融监管要求以及信息技术自主可控 3 条线同时发力，持续适配不同金融场景。为了更好地处理 UbiSQL 的运维问题，平安集团将问题依据复杂程度划分为了三级，简单的问题内部解决，复杂的问题引入&nbsp;PingCAP 的技术团队共同处理，同时，平安集团也在培训工程师，提高团队消化问题的能力。目前，UbiSQL 实现了研发能力、解决方案能力与交付运维能力的进化，也进一步适配了金融场景的需要。</p><p></p><h4>分布式带来的运维复杂性怎么解？</h4><p></p><p>&nbsp;</p><p>凡事都有两面性，分布式也不例外。分布式的确在扩缩容和资源配置等方面带来了便捷，但从运维角度来看，分布式带来了很多不确定性，这给数据库的运维带来了很多挑战。</p><p>&nbsp;</p><p>面对平安集团这样庞大的数据体量，数据库运维的压力更大。对此，汪洋表示，<a href=\"https://www.infoq.cn/article/vvyUzWQYu7H7zbF6Orgc\">大规模运维</a>\"有一个很好的理念——脚本工具化、工具平台化、平台产品化，平安集团也是按照这个思路，以云的理念和模式进行运维，主要有两个方面。</p><p>&nbsp;</p><p>第一，依靠云的服务。在开源数据库和微服务架构兴起的趋势下，数据库实例会越来越多，每个环境都不一样，因此，大规模运维的终极解决方案就是通过云的模式，通过暴露服务的方式进行运维。像平安云 UbiSQL、TiDB Cloud，不仅可以对资源池成本进行更好的管理，也更适合大规模运维，给用户带来更好的体验。比如，将 UbiSQL 引擎的进一步封装，在云上通过 Database asa Service (DBaaS)</p><p>的方式进行运维；云上的 Serverless 模式&nbsp;可以更灵活的使用资源，同时满足运维的需求；或者将 SRE、DBRE 等概念，融合到容器化的 Operator 中，当故障发生或者存储不足时，帮助系统自愈或者进行扩展。汪洋认为，通过云原生的&nbsp;Operator，未来数据库会走向容器化，进一步提高开发和运维的效率。</p><p>&nbsp;</p><p>第二，数据库标准化、规范化建设。云的优势之一，就是能够将资源统一管控，将资源的价值最大化。因此同一种数据库架构、配置相同的情况下，用户的定制化改动都能被配置中心记录下来，这样就给大规模复杂运维创造了条件。同时，因为所有的环境都是标准化的，所以在发生问题后可以将解决方案下发到数据库的所有实例中去解决，避免问题再次发生。</p><p></p><h2>分布式数据库架构设计焦点问题</h2><p></p><p>&nbsp;</p><p>围绕分布式数据库架构设计在时效性、技术路线、微服务化等热门话题，InfoQ 也与汪洋进行了进一步的探讨，以下为主要的观点及未来设想。</p><p>&nbsp;</p><p>InfoQ：重建 OLAP 或者新建 HTAP，未来在解决 AP 时效性上的方案会更偏向哪一种？</p><p>&nbsp;</p><p>汪洋：技术无分对错，只有最合适的场景的技术。OLAP 与 HTAP，或者说 MPP 与 HTAP&nbsp;解决的是不同场景中的问题。</p><p>&nbsp;</p><p>MPP 数据库，或者说我们现在说的一些数据仓库，更侧重在战略的层面，对大规模数据进行加工、分析和处理，生成报表，提供 BI，它对时效性的要求没有 HTAP 那样高。而且，MPP 数据库在大规模数据加工、处理方面、应对负载的能力更好。</p><p>&nbsp;</p><p>OLAP 与 OLTP 是两种完全不同的形态，数据库引擎有三大核心：如何解决数据存储的问题？如何解决数据访问的问题？如何解决数据更新的问题。OLTP 倾向于行式存储；而 OLAP、MPP 基本上以列式存储为主。在 SQL 优化器引擎方面的设计也不一样，OLAP 中，我们会思考怎样解决雪花模型、怎样应对即时查询还能快速返回、怎样解决数据聚合方面的问题……这些优化思路与OLTP是完全不同的。</p><p>&nbsp;</p><p>MPP 本身就很专一和聚焦，比如说，面对我们现在常提到的数据湖，它可以解决类似数据湖这些超大规模的数据量带来的分析、加工的问题。HTAP 更侧重于战术和操作类型的决策。有些东西在进入到数据湖之前，可能需要基于当天的销售额进行快速的决策：那些需要改变的货物上架了、需要做哪些调整等。</p><p>&nbsp;</p><p>对于商业决策来说，快速把握瞬息万变的意味着掌握商机。在 HTAP 被应用之前，需要从 OLTP 的数据库中，把数据转到大数据平台上加工，再把结果或者数据模型反馈回来，加载到 OLTP 数据库中，这个流程耗费了很多时间。而 HTAP 不需要数据搬迁，也不消耗数据搬迁的成本，它只需要当天的或者短期的数据，在自己的数据库中，就可以帮助我们做短期的、操作类型的决策。</p><p>&nbsp;</p><p>最后，举例来说，如果分店经理想要基于当天的业务数据进行操作和决策，那么 HTAP 比较合适；如果面向的是超大规模的数据，且进行战略层面的方向制定，那么 MPP 更有优势。</p><p>&nbsp;</p><p>InfoQ：在并发控制层面，为什么现在选择乐观协议的分布式数据库越来越少？TiDB 也是改回了悲观协议？</p><p>&nbsp;</p><p>汪洋：以前采用 TiDB 的都是互联网企业，例如，对于电商企业而言，它们不会对同一行的账目进行更新，基本上是根据一些维度，比如卖家、卖家进行分片，基本上是比较孤立的，这样的情况下，发生冲突是一个小概率事件，而“乐观锁”的代价相对较小，也避免发生额外的成本，还能保证较好的整体性能。</p><p>&nbsp;</p><p>现在越来越多的企业采用 PG，是由于企业的业务逻辑和以往互联网企业的简单逻辑相比更为复杂，MySQL 在复杂逻辑方面与 PG 相比有不足之处。但这两种数据库都是悲观锁模型。在越来越多的企业选择 TiDB 的情况下，也出现了一些问题：第一，在原有企业应用迁移过程中，类似于从悲观锁转变乐观锁这样的迁移，带来“水土不服”的问题。会经常发生并发任务更新同一行数据库的情况，乐观锁的代价远比悲观锁的代价要高；第二，开发人员思维转变的问题，很多开发人员已经用了很多年的包括 MySQL、PG 等都是悲观锁，那么可能下意识的设计出适用于悲观锁的模型。如果 TiDB 只有乐观锁模型，就一定会发生冲突。另外如果企业要用乐观锁，开发人员也同样需要改变一些习惯和设计的方法。</p><p>&nbsp;</p><p>另外，像企业金融账目想要更新具体某一行数据，多并发的连接和事务需要对同一行或者同一个数据进行操作，在这样的情况下，采用乐观锁势必会在提交过程中遇到大量的冲突，造成性能下降，这种情况下，不如换悲观锁，这样就避免在提交时处理冲突。在我看来，以上的几方面原因决定了现在的 TiDB 要支持悲观锁。</p><p>&nbsp;</p><p>InfoQ：如前文所言，分布式数据库的技术路线会逐渐向<a href=\"https://www.infoq.cn/article/fAjL7MEGbjKJtS75MN4E\">原生分布式</a>\"靠拢？</p><p>&nbsp;</p><p>汪洋：云数据库未来的发展趋势，第一，会朝着 Serverless 数据库发展。但 Serverless 和现在非 Serverless 数据库也不是谁取代谁的问题，还是要看应用场景。这是因为 Serverless 还存在需要解决的问题，比如说，节点扩展得够不够快，可能会存在短暂的暂停，我们怎样提升启动效率等，这些都会影响到性能的一致性。</p><p>&nbsp;</p><p>第二，在云上实现存算分离。云上本身就有资源池的概念，也提供了分布式的存储，通过 NVMe/RDMA 的组网提供了很好的性能。然而在本地化部署中，我们很难做到这么大的规模，云上实现存算分离是未来的趋势，对于分布式数据库来说，存算分离也是趋势。</p><p>&nbsp;</p><p>第三，云上大规模智能运维。云上数据规模比较大，更容易收集到诊断数据进行分析，我们甚至可以将 AI 算法引入进来，弥补人工运维的不足，提前发现隐患。此外，可以在问题发生后通过关联分析得出结果，将模型套用回去，当下次发现它相同模式的时候，就可以在问题发生前，进行一些处理，也就是自愈。</p><p>&nbsp;</p><p>第四，提供智能化建议。云上的智能诊断自愈和建议，都是建立在可见性的基础上，因此当我们做大规模部署的同时，就要增加产品的可见性，有了足够的信息，就能够进行智能自愈和建议，这里面所说的智能建议是指，比如说，应不应该创建索引，或者发现一些对系统性能有影响的 SQL 语句并给出针对性优化建议等。</p><p>&nbsp;</p><p>第五，解决多租户管理的问题。既然一个数据库中不只支撑一个微服务，就会有租户管理的问题，数据库里面可以入住多个租户，就会带来故障隔离、资源隔离的问题，我们需要思考如何让每个租户看似在一个集群中，又有属于自己的资源使用池。以上这些都是未来可以做的方向。</p><p>&nbsp;</p><p>InfoQ：您对数据库微服务化怎么看？</p><p>&nbsp;</p><p>汪洋：从两个方面考虑，一方面是数据库怎样支撑微服务化，现在对微服务化的定义中有一点是说，微服务中每个服务都是一个闭环，它有自己的存储引擎、数据库引擎、中间件等，不同的技术栈都能找到一个针对于这个服务最合适的数据库，但实际运行下来，会增加很多数据库的运维成本。</p><p>&nbsp;</p><p>微服务兴起带来了规模急速增长，虽然我们在云上有了大规模运维的能力，但是大部分情况下，我们采取了一种平衡的架构，一方面能减少故障的影响范围，另一方面，不会严格地按照每一种服务都是自己的数据库引擎，来避免在运维和资源使用上造成 overhead 增加，这就涉及到数据库怎么支撑应用微服务的问题。</p><p>&nbsp;</p><p>对于数据库自身的微服务，在内核引擎上这种原生的分布式已经实现了一部分，这是因为它的每个组件都是解耦的，像 UbiStore、UbiServer 或者 UbiMeta 层（对应 TiDB 产品的 TiKV、TiDB 和 PD 层），都通过 gRPC 进行互相调用，这也是有微服务化的理念在支撑——专业的组件做专业的事情。在DBaaS产品中，我们也需要对数据库内核引擎进行包装，通过服务接口调用一些主机、操作系统和存储方面的接口，完成整体服务编排。这些都是数据库自身实现微服务化的体现。</p><p>&nbsp;</p><p>此外，在云数据库产品中，还有一些编排系统，比如在创建 UbiSQL 时要写一些配置或者调用一些配置、账单的管理，这也是各自的微服务。由于云数据库产品本身涉及到编排系统，还需要跟账单系统、计费系统等配置系统打通、备份恢复等，都需要调用其他的组件，因此这种微服务在云上体现的更加明显。UbiSQL 的存算分离、几个组件之间的调用、应用系统的支撑以及多租户的管理等，都体现了微服务的概念。</p><p></p><h2>对国产开源数据库社区建设的期待</h2><p></p><p>&nbsp;</p><p>数据库未来的发展中，开源将是一条重要的路线。近几年，在国家政策导向、自主可控要求，以及云模式和云计算的兴起等多方面因素影响下，国内开源生态的发展与之前相比开放了很多，OB、TDSQL、openGauss 等国产数据库都在开源。去年，国家也在鼓励开源社区在国际上贡献力量，提升自身的影响力。</p><p>&nbsp;</p><p>汪洋表示，在未来，符合开源精神的彻底开源十分重要。目前，有些数据库并没有开源出所有的功能，而我们需要的是彻底开源、具有扩展性和良性开源生态的开源数据库。正如平安集团当初引入&nbsp;TiDB，不仅仅是因为它是开源的数据库，更是因为它的开源精神比较彻底。</p><p>&nbsp;</p><p>除此之外，如何在云模式的冲击下做好开源，也是数据库开源社区需要面对的课题。受云模式冲击的影响，很多开源数据库纷纷更改了开源协议，开发者只能看到源代码，或者基于源代码做一些开发，而无法直接商用，未来，我们能否能走出其他的路？</p>",
    "publish_time": "2022-10-31 10:34:25",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "数见未来，智创无界 | 华为云“数智高峰论坛”开启",
    "url": "https://www.infoq.cn/article/sA4fOd7jGKcHQRJCZM66",
    "summary": "<p>当下，正值国家数字经济战略、<a href=\"https://www.infoq.cn/theme/144\">企业数字化转型</a>\"的关键时期，传统和新兴产业都面临着内部转型和升级所带来的巨大挑战。通过数据智能驱动业务决策、促进生产力提升以及加速产业发展是未来企业发展所需解决的核心问题之一。</p><p></p><p>11 月 4 日，以“数见未来，智创无界”为主题的华为云“数智高峰论坛”将在杭州安朴酒店举行。华为云数据智能创新 Lab 邀请了来自北京大学、清华大学、哈尔滨工业大学、西北工业大学等国内顶尖高校的多位资深专家、教授、学者，一同探讨<a href=\"https://www.infoq.cn/video/wj9FuVYxt63XpmOkfVmt\">数智融合</a>\"的业界难题、前沿技术、创新实践及未来发展趋势。</p><p><img src=\"https://static001.geekbang.org/infoq/fe/fe3a125e17078e04551f96c320827127.jpeg\" /></p><p></p><p>华为云数据智能创新 Lab 专注于让数据驱动智能决策，帮助<a href=\"https://activity.huaweicloud.com/intl/zh-cn/free_packages/index.html?utm_source=Google_SEM&amp;utm_medium=SEM_CPC&amp;utm_campaign=%E9%A6%99%E6%B8%AF_%E5%93%81%E7%89%8C%E8%AF%8D&amp;utm_content=CN_%E5%93%81%E7%89%8C%E6%A0%B8%E5%BF%83&amp;utm_term=%E5%8D%8E%E4%B8%BA%2B%E4%BA%91&amp;utm_adplace=AdPlace009159\">华为云</a>\"及广大客户、开发者群体解决大数据时代数据管理困难、价值变现困难等挑战，推动释放数据价值，实现数据创新。</p><p><img src=\"https://static001.geekbang.org/infoq/67/67b75bed41e159367f622e1c9b476ccb.png\" /></p><p></p><p>基于最先进的大数据技术与 AI 技术，华为云数据智能创新 Lab 研发出一站式的智能数据平台，引领智能数据治理、智能可视分析以及智能数据仿真与决策三大创新研究方向，致力在业界打造数据智能解决方案新范式。</p><p></p><h4>智能数据治理</h4><p></p><p>数据驱动业务已成为不可逆的趋势，业务所需的数据体量以及对数据实时性的要求日益提升，单纯利用算力、人力套利的时代也逐渐褪去，低成本与高效率成为了大数据时代的主旋律。复杂的数据建模、被动的质量监控、冗杂的数据处理过程、延迟的数据分类等步骤，都亟需智能的数据治理解决方案突破效率和成本的瓶颈。</p><p></p><h4>智能可视分析</h4><p></p><p>单一报表分析以难以支撑互联网时代复杂的业务场景，如何高效地展示各类数据中复杂的业务见解是商业数据分析的关键。下一代商务智能软件将帮助任何决策者通过自然语言的“所问即所得”，快速进行数据洞察、可视化推荐、描述文本生成等，最后基于 AI 形成完整分析报告。</p><p></p><h4>智能数据仿真与决策</h4><p></p><p>智能数据仿真技术旨在构筑智能流水线，将物理数据与业务流程模型灵活集成，通过对数据的学习实现业务流程在真实世界的数字孪生。通过仿真、反事实推断技术对未来趋势和未知场景进行预测，最终将预测结果同步给真实世界，实现智能决策。</p><p></p><p>更多前沿技术解读，尽在 11 月 4 日第一届华为云“数智高峰论坛”。华为云诚邀您与数据智能领域的专业人士同行，共同探讨数智难题，开拓技术视野，助力业务成功！快通过下面链接预约我们的直播吧！</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/a7/a738605dace9b7b1d52bea70358d518e.jpeg\" /></p><p></p>",
    "publish_time": "2022-10-31 11:51:23",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "“云无界、端无边” 2022 OGeek 技术峰会",
    "url": "https://www.infoq.cn/article/JoHS1jkJfkQPM6f9xoDR",
    "summary": "<p>近年来，云计算、大数据、人工智能等技术的高速发展对社会生产生活带来愈加深刻的影响。数量和规模快速增长的数据中心，拥有庞大算力和海量存储的集群，每天都在为各行各业运行类型繁多的服务和应用并创造惊人的价值。</p>\n<p>另一方面，移动互联网的全面普及极大推动了智能终端的进步。今天接入移动网络的智能终端数以十亿计，未来甚至可能达到千亿量级。虽然这些终端承载的应用日趋复杂，但受限于设备尺寸、能耗与成本等因素，其本地算力、存储空间并不能无限提升，以至于成为应用体验持续提升的瓶颈。</p>\n<p>面对这样的矛盾，行业意识到充分利用云端能力的优势赋能终端，打造端云协同的一体化服务才是最终实现万物智能化未来的解决之道。现如今，端云协同已经成为开发社区竞相研究的前沿技术方向，OPPO 也在积极探索端云一体，并帮助开发者在该领域快速成长。10 月 29 日举办的主题为“云无界、端无边”的 2022 OGeek 技术峰会便是 OPPO 为关注端云协同技术的开发者打造的一个交流平台。</p>\n<p>2022 OGeek 技术峰会的主论坛特别邀请到了来自 OPPO、英特尔、阿里云、亚马逊云科技的多位专家，为大家描绘了一幅美好的“端云协同”技术蓝图。以下为他们分享的内容主题：</p>\n<ul>\n<li>OPPO 云计算中心总经理鲍永成：《端云智能协同，守望万物互融未来》</li>\n<li>英特尔中国区云与行业解决方案集团互联网行业总经理胡凯：《云化万物，共建未来》</li>\n<li>阿里云智能边缘云产品负责人佘俊泉：《云端进化，协同未来》</li>\n<li>亚马逊云科技首席架构师费良宏：《从芯片创新展望云的下半场》</li>\n<li>OPPO 实时音视频技术总监郑晓川：《OPPO实时音视频平台建设之路》</li>\n<li>OPPO 智能物联云技术总监夏舰波：《开放和赋能：IOT云平台技术架构演进》</li>\n</ul>",
    "publish_time": "2022-10-31 12:55:26",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "端云一体化，视听新体验 | 2022 OGeek 技术峰会主题分会场",
    "url": "https://www.infoq.cn/article/FqFfJTL9FqrMoKR5dsge",
    "summary": "<p>数字经济席卷各个行业，编解码、RTC 等音视频技术和云渲染技术在短视频、游戏、数字孪生、VR／AR 等新型领域得到广泛应用。以泛娱乐社交类短视频应用为例，几乎所有功能都离不开音视频、云渲染技术。</p>\n<p>围绕这一主题，以“云无界、端无边”为主题的 2022 OGeek 技术峰会特别设置“端云一体化，视听新体验”主题专场，并于 2022 年 10 月 29 日在 InfoQ 视频号进行直播。</p>\n<p>值得一提的是，“OGeek Day”是由 OPPO 数智工程事业部主办的行业技术沙龙品牌，旨在为技术爱好者搭建一个技术交流和分享的开放平台。沙龙主要围绕“科技为人、以善天下”的品牌使命，聚焦于为智能终端提供安全高效的数据、算力、算法、云服务方面的前沿技术，打造技术互动的行业生态，探索技术在行业应用的实践、突破及未来发展方向。</p>\n<p>而在本次的“端云一体化，视听新体验”主题专场中，OPPO 实时音视频架构师李雪松、声网视频算法工程师郑林儒、OPPO 实时音视频架构师董华三位技术大牛带来了许多干货分享，围绕 RTC、云渲染及音视频+技术在应用场景下的实践与开发者展开了讨论。</p>\n<p>以下为嘉宾分享的内容：</p>\n<ul>\n<li>OPPO 实时音视频架构师李雪松：《ORTC与AI之间的那些事》</li>\n<li>声网视频算法部门算法工程师郑林儒：《实时视频 QoE 端到端轻量化网络建模》</li>\n<li>OPPO 实时音视频架构师董华：《OPPO 云渲染探索与实践》</li>\n</ul>",
    "publish_time": "2022-10-31 13:20:10",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "寒冬之下，年销售增速不降反增，这家国企做对了什么？",
    "url": "https://www.infoq.cn/article/pm2PARQsscdHribDhSJ3",
    "summary": "<p></p><blockquote>采访嘉宾 | 用友网络副总裁罗小江、明日控股集团 CIO 沈琪敏主持人 | InfoQ 极客传媒总编辑 王一鹏编辑 | 郑思宇</blockquote><p></p><p></p><p>从 2020 年年初至今，所有企业面临着严重的经济挑战，一时间，几乎所有企业的目标都变得纯粹，那就是“活下去”，而在此基础上，如果还能继续发展那就再好不过了。</p><p></p><p>在“寒冬”之下，我们注意到了一家稍显“特殊”的传统企业：明日控股在 2021 年实现了 35% 的销售增速，且人员增速低于营销增速；明明是一家传统塑化产业链服务商，但其却将“数字化”纳入了公司“三化战略”的首位...... 我们很难想象，在传统企业发展维艰的当下，明日控股究竟做对了哪些事？又是怎样的数智化转型战略支撑着明日控股的业务创新？</p><p></p><p>为了深入探究明日控股的数智化转型历程以及实践经验，在本期《InfoQ 新知实验室》，InfoQ 极客传媒总编辑王一鹏与用友网络副总裁罗小江、明日控股集团 CIO 沈琪敏进行了一场对谈，以期为正处于数智化转型的从业者带来启发与思考。</p><p></p><p></p><p></p><h2>先从明日控股对数智化转型的构想谈起</h2><p></p><p></p><p>从上世纪九十年代至今，信息化、数字化是发生在所有企业与组织中的重要变革，随着各行各业线上化进程的不断加速与普及，数智化成为了数字化发展到一定阶段的必然结果，其更多开始聚焦于数据赋能，并结合<a href=\"https://www.infoq.cn/article/o0D5vN6o1LUxvayKGWHH\">人工智能</a>\"、大数据等新兴技术实现业务模式创新。</p><p></p><p>难能可贵的是，身处传统产业的明日控股完整地经历了信息化、数字化以及数智化的发展周期：从 2004 年起，明日控股就已经开始对信息化进行探索，并逐步将线下业务转为线上，并用 5 年时间完成了信息化的起步阶段；在 2009 年 -2015 年期间，明日控股完成了 ERP 的建设；三年后，随着数字化爆发期全面来临，明日控股又一步步通过数字化来驱动业务，并于 2018 年 12 月，提出了数字化的发展战略；从 2019 年至今，明日控股不断基于现有能力进行提升，重点聚焦于平台底座的建设，为企业数智化转型打好了基础。</p><p></p><p>沈琪敏坦言，明日控股的数智化转型其实刚刚走过了起步的阶段，在推进数智化之前，大家都是按部就班的工作，但到了智能化阶段，很多岗位在角色方面发生了改变，逐渐开始用机器代替重复性的工作。“这样的场景已经慢慢地在很多单点上得到了突破，未来如果可以形成面，整个供应链的效率将会变得非常智能。”</p><p>那么，理想的数智化转型应该是什么样子呢？沈琪敏以明日控股的数智化转型实践为例，从以下四个方面进行了描述：</p><p></p><p>平台侧：企业需要具备支撑数智场景的智能化创新平台，平台需要始终保持技术架构的先进性，可以不断地融入新技术，从而迭代其自身的能力。连通侧：传统企业大多会聚集于自身数据，但在数智化场景中，企业需要将运营数据实现互联，并拉通与企业运营相关的所有社会资源，形成产业链及跨产业链的核心数据资产；业务侧：通过“以机代人”的业务模式，实现信息传递的高速与无损，希望至少 80% 的业务场景交由机器来自动决策完成；价值侧：站在明日控股的视角来看，数智化的最终结果还是要为客户服务，通过提供智能服务场景实现企业愿景目标，促进产业链高效繁荣。</p><p></p><p>谈及数智化转型的理想场景，罗小江也补充了自己的看法，他认为：“从数字化到数智化推动了整个企业本体的变革”。在信息化时代，信息系统的触点相对较少，往往需要做某个决策才开始调取数据，但在企业运转的实际过程中，数据应该贯穿在整个日常的工作中。因此，在未来数智化的变革中，所有管理层的触点界面会越来越多，比如通过个人助手 RPA、自然语言与机器交互，使所有管理层都可以更好地感知到整个企业。</p><p></p><h2>数智化转型的实践经验分享</h2><p></p><p></p><h3>避免为了数智化而数智化</h3><p></p><p></p><p>眼下，无论是从国家政策层面出发，还是从企业实际场景出发，数智化转型都是企业必须要走一步。虽然大多数企业已经认识到数智化转型带来的业务价值以及诱人的商业前景，但在实际的落地层面，企业往往会由于组织文化、战略设定等多重因素，偏离原本数智化转型的预设目标。</p><p></p><p>拿数智化战略来说，大部分企业都会选择“自上而下”的策略进行推动，但由于企业内部的惯性以及历史包袱等问题，则会导致项目未能达到预期；从数智化转型的切入点上来看，部分企业会优先选择建应用这条路，达成短期成效，但随着企业规模不断发展，信息不对称、数据孤岛等问题便逐渐显露......诸如此类的问题还有很多，这也更加让我们意识到，如果思想认知、顶层设计以及战略规划等各个层面，没有在企业内部落实到位，都会导致数智化转型在推动的过程中走样。</p><p></p><p>基于用友多年服务大型企业的经历，罗小江提到：“现在数智化团队的职责变得更加广泛了，更多要考虑如何让技术与业务做融合。”就如同上述提到的“以机代人”的业务模式，无论是用机器人取代一个部门，还是用程序取代一些部门的业务，技术上虽然是成熟且可实现的，但究其根本，还是要在实现的过程中找到业务上的痛点。目前，很多大型企业会设立 ITBP 这样的角色，他既向 IT 团队汇报，也像业务部门汇报，并且不仅要提出现有的问题，还要结合企业的未来发展，帮助技术与业务实现更好地融合。</p><p></p><p>此外，在过去一段时间内，我们观察到有部分企业会无限地追求技术的先进性，误以为只要上几套系统，引入新技术就能够完成数智化转型了。谈及这个现象，罗小江也提出了自己的看法，他认为，小微企业、中小企业根本没必要去买平台，因为企业自身没有那么大的体量去支撑。“包括微服务、云原生等技术概念，其实也带偏了一批企业，用了微服务架构以后服务变多，企业该怎么治理？又怎么保障数据一致性？这些问题就全部显露出来了。”</p><p></p><p>因此，对于企业而言，数智化转型其实是一个循序渐进的过程，面对层出不穷的新技术，企业需要有把标尺，避免堆砌大量数智化技术而不顾业务需求。</p><p></p><h3>“架构优先”更符合数智化转型的发展规律&nbsp;&nbsp;</h3><p></p><p></p><p>明日控股的数智化转型经验是什么？沈琪敏提出了三个“优先”：首先是“架构优先”，“很多企业还是先建应用，然后再用架构去整合，但从明日控股的角度来说，架构优先比应用优先更有优势”，也就是先打牢数智化地基，再在地基上建房子（应用）。</p><p></p><p>罗小江也深表赞同，他认为，这是短期看还是长期看的问题，短期看建个应用马上就能见效，但长期看会导致架构不通，后续接入系统过多，还需要投入更多的成本。“对于一些走在前列的企业来说，时间是最大的成本，企业需要加速奔跑拉开竞争格局，而有一个好的架构，才能保证企业走得更快、更远。”</p><p></p><p>其次，沈琪敏提到了“数据优先”，企业需要打破传统数仓理念，用战略性思维宜早规划数据管理体系的建设，包括平台建设、数据治理、数据应用等多个方面；最后是“组织优先”，数智化转型关键还是在人，用先进的数智理念武装大脑，在业务和管理侧不断挖掘数智场景，形成数智化的思维文化也很关键。</p><p></p><p>沈琪敏回忆道，明日控股曾在架构方面遇到过瓶颈，因此考虑在 2019 年将原有架构升级到 iuap 数智化底座，但这一决策在一线业务单元引发了不少质疑，因为这对于许多业务人员是无感的，他们认为原本的系统用得很好，为什么要换？在这种情况下，就要求数智化领导小组要基于决策层面进行改革，最终，明日控股将原本 CRM + ERP + BI 的架构，转变到了以<a href=\"https://www.infoq.cn/article/9ejcKHgV8iJ8wSXvCI56\"> iuap</a>\" 为底座的双中台架构。</p><p></p><p>当认知层面的经验建立好了以后，技术层面也会随之迎来挑战。在沈琪敏看来，一方面，伴随着产品设计理念的转变，技术人员需要从流程思维向用户思维转变；另一方面，随着大数据、算法、人工智能等新兴技术的涌现，技术人员需要将其融合到企业运营之中。因此，对于技术人员来说，技术架构的顶层设计能力与平台选型能力十分重要，平台选好以后如何去装应用，进而发挥出平台的价值也尤为关键。</p><p></p><h2>数智化技术底座为何如此重要？</h2><p></p><p></p><p>沈琪敏表示：“我们的愿景目标是要打造塑化产业链服务平台，但平台的打造不可能是空中楼阁，肯定需要一个底座来支撑，否则是建不起来的。”</p><p></p><p>更重要的是，未来的数智化场景是互联互通的，需要集成很多外围系统，从企业经营社会化的角度来看，如果不用平台去建立一种标准，也同样无法达成目标。此外，从开发层面来看，面对快速迭代的业务需求，整个 IT 组织建设的成本是非常高的，比如重复建系统、重复键模块等等，通过一个技术底座可以避免重复造轮子，运维起来也更加有保障。</p><p></p><p>目前，明日控股已经通过用友 iuap 数智化技术底座，构建了由统一身份认证，审批中心，模板中心，消息中心等组成，打造了具备中台化服务能力的明日控股数字化平台。“我们真正围绕着整个用友 iuap 去开展下一个阶段的数智化转型工作，开创了一个新的阶段”，沈琪敏说道。</p><p></p><p>如果站在用友的角度来谈数智化底座的重要性，罗小江提到了三点：第一，iuap 数智化底座通过提供云中立、敏捷工程化等能力，帮助企业屏蔽技术的复杂性；第二，未来的企业需要敏态的架构作支撑，包括数据的敏态、业务的敏态等等，从而更好地迎接乌卡时代；第三，像明日控股这样的大型企业，未来要走向整个产业链，就需要把自己的能力开放出去，同时也要把外部的能力接入进来，这时候就要构建一个开放的体系，而平台就具备这样的集成能力，帮助企业有效的聚合生态。</p><p></p><p>据罗小江介绍，用友 iuap 数智化底座作为用友 BIP3 的 PaaS 平台，其采用 YMS 云中间件技术，实现跨云技术突破和多云适配能力；首创云上云下一体化的持续交付体系，即公有云的产品和部署到明日控股的版本是完全一套代码，提升企业私有云平台的更新效率；除此以外，还拥有企业级多租户、多数据中心技术，实现多云异构的“云上管理，云下运行”。</p><p></p><h2>写在最后</h2><p></p><p></p><p>通过了解用友 iuap 数智化底座的新特性以后，沈琪敏也表达自己对于用友 iuap 的期待：“云上云下的混合模式讲到了我的心坎里，也消除了之前我们一直关心私有云的顾虑，能够让部署在本地的应用享受到公有云的技术红利，我们也静待花开。”</p><p></p><p>最后，沈琪敏还表示，对于像明日控股这样的大型企业来说，用友 iuap 数智化底座最大的价值便是在数智化转型的过程中，变成了企业未来阶段的核心，基于中心化的平台开展了数智化转型的工作，又以此发散出了很多场景，这是带给我们最大的价值。</p>",
    "publish_time": "2022-10-31 13:57:44",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "将“架构”列为第一优先级，明日控股是怎么做数智化转型的｜InfoQ 新知实验室",
    "url": "https://www.infoq.cn/article/iaPcTY4yADaJZKKbcSD5",
    "summary": "<p>为了深入探究明日控股的数智化转型历程以及实践经验，在本期《InfoQ 新知实验室》，InfoQ 极客传媒总编辑王一鹏与用友网络副总裁罗小江、明日控股集团 CIO 沈琪敏进行了一场对谈，以期为正处于数智化转型的从业者带来启发与思考。</p>",
    "publish_time": "2022-10-31 14:10:59",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "AIoT，智联生活新未来 | 2022 OGeek 技术峰会主题分会场",
    "url": "https://www.infoq.cn/article/70L35VAv2D57ck1CQ8yP",
    "summary": "<p>随着5G、人工智能、传感器等技术的演进，世界正在实现万物互融。AI与IoT两种强大技术的结合增加了应用的敏捷性和灵活性。AIoT 的最大优势，就是让“人工智能”走向“应用智能”。</p>\n<p>近日举办的 2022 OGeek 技术峰会设置了“ AIoT，智联生活新未来”主题专场，OPPO 智能视觉云服务研发负责人宋佳洋、亚马逊云科技物联网产品专家蔡裕正、OPPO 智能物联架构师陈松三位技术大牛，基于端云协同的实践案例展开了 AIoT 在各场景下技术发展的讨论。</p>\n<p>值得一提的是，“OGeek Day” 是由 OPPO 数智工程事业部主办的行业技术沙龙品牌，旨在为技术爱好者搭建一个技术交流和分享的开放平台。沙龙主要围绕“科技为人、以善天下”的品牌使命，聚焦于为智能终端提供安全高效的数据、算力、算法、云服务方面的前沿技术，打造技术互动的行业生态，探索技术在行业应用的实践、突破及未来发展方向。2022 年 10 月 29 日、30 日，OGeek 技术峰会在 InfoQ 视频号进行直播，本届峰会以“云无界、端无边”为主题，与各位开发者一起探讨音视频、云渲染、AIoT、一站式应用开发等热门技术的演进方向，共建端云协同生态。</p>\n<p>以下为嘉宾们在“ AIoT，智联生活新未来”主题专场的演讲内容：</p>\n<ul>\n<li>OPPO 智能视觉云服务研发负责人宋佳洋：《OPPO 智能视觉在智能家居中的应用》</li>\n<li>亚马逊云科技物联网产品专家蔡裕正：《智能家居商业和技术生态》</li>\n<li>OPPO 智能物联架构师陈松：《极致体验：OPPO 智能家居生态实践》</li>\n</ul>",
    "publish_time": "2022-10-31 14:14:28",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "重新定义“一站式应用开发” | 2022 OGeek 技术峰会主题分会场",
    "url": "https://www.infoq.cn/article/kgry88KKKTYvKfcPVsXJ",
    "summary": "<p>企业使用应用开发平台，主要诉求是提升移动研发效能，提高协作效率。但在具体实践中，不同的企业、业务线和产品之间的需求都存在着巨大差异，很多开发者称，“很难有一个平台或工具能适配所有场景、解决所有问题。”</p>\n<p>该如何解决打破这一僵局，真正打造一站式的企业应用开发平台？</p>\n<p>针对这一主题，近日举办的 2022 OGeek 技术峰会设置了“重新定义’一站式应用开发’”专场。本专场邀请到了 OPPO 移动研发平台负责人麦峰强、蚂蚁集团无线开发工程师王磊、OPPO 云测设备开放服务平台负责人杨建波三位技术专家，他们与各位开发者们共同探讨了“一站式”应用开发平台的定义、现状、价值和未来技术演进。</p>\n<p>值得一提的是，“OGeek Day” 是由 OPPO 数智工程系统主办的行业技术沙龙品牌，旨在为技术爱好者搭建一个技术交流和分享的开放平台。沙龙主要围绕“科技为人、以善天下”的品牌使命，聚焦于为智能终端提供安全高效的数据、算力、算法、云服务方面的前沿技术，打造技术互动的行业生态，探索技术在行业应用的实践、突破及未来发展方向。2022 年 10 月 29 日、30 日，2022 OGeek 技术峰会在 InfoQ 视频号进行了直播，本届峰会以“云无界、端无边”为主题，与各位开发者一起探讨音视频、云渲染、AIoT、一站式应用开发等热门技术的演进方向，共建端云协同生态。</p>\n<p>以下为“重新定义’一站式应用开发’”专场的嘉宾分享内容：</p>\n<ul>\n<li>OPPO 移动研发平台负责人麦峰强：《OPPO 移动研发平台建设实践》</li>\n<li>蚂蚁集团无线开发工程师王磊：《基于场景沉淀的移动端技术架构演进》</li>\n<li>OPPO 云测设备开放服务平台负责人：《云测设备开放服务平台建设实践》</li>\n</ul>",
    "publish_time": "2022-10-31 14:28:37",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "团队交付的速度变慢了，我该怎么办？",
    "url": "https://www.infoq.cn/article/JCB92DRfLZF7SaNhlBsL",
    "summary": "<p>随着团队的发展，他们会放慢脚步。一个更大、更成熟的、负责更大代码库的团队，比一个小型初创公司中的团队需要关注更多的东西，以便更加快速地行动并找到市场匹配度。这需要构建和维护具有更长寿命的复杂系统的专注力。避免过多的技术债务和确保系统的安全性和性能变得越来越重要。所有这些都需要时间和精力，对于技术团队以外的人来说，这可能表现为交付速度的放缓。</p><p>&nbsp;</p><p>虽然速度放缓似乎是不可避免的，但这并不意味着团队停止交付就可以推动未来业务增长的价值。作为一名技术管理者，在你的职业生涯中，你的CEO或业务领导可能会问：“为什么一切都这么慢？”你该如何回答这个问题？你怎样提前做好准备？怎样才能让你的团队以最快、最可持续的速度前进？</p><p></p><h2>是什么导致团队在发展过程中放慢脚步</h2><p></p><p>&nbsp;</p><p>通常情况下，当团队迅速扩大规模时，例如随着对公司投资和技术团队的增长，交付速度通常会开始变慢。我相信有很多原因导致团队在快速发展的环境中慢下来。</p><p>&nbsp;</p><p>随着团队规模的扩大，随着越来越多的人加入到团队中，沟通变得越来越困难。例如，一个3人的团队将有3个主要的沟通路径，而一个17人的团队则有136个可能的沟通路径！因此，要了解正在发生的事情变得越来越难，在不引起认知负担的情况下传播信息也越来越难。</p><p>&nbsp;</p><p>随着团队规模的扩大，不一致性也会成为一个大问题。如果团队和团队成员没有就优先级和下一个任务达成一致，就会导致工作浪费，并产生团队进度变慢的感觉，因为他们没有向产品交付任何价值。例如，在微服务架构中，团队A可能正在修改一个服务，而这刚好是团队B需要构建的特性的一部分。除非两个团队都意识到协调工作的必要性，否则在测试特性时，如果团队A的解决方案中出现了bug，就很有可能出现不一致，要么工作被浪费掉，要么需要返工。如果团队A比团队B更早地交付了他们的工作，那么他们很可能需要花费相当多的时间和精力来返工，特别是如果他们已经转移到新的工作上了。我还发现这在更传统的、功能性的团队中也是一个问题，开发后端平台的团队和开发Web应用程序的前端团队之间的不协调常常会导致一种感觉，即前端团队交付速度很慢，但其实他们只是在等待后端团队的进度。</p><p>&nbsp;</p><p>在考虑团队需要关心哪些问题时，认知负担也是其中一个。是考虑整个系统（通常会在规模扩大时快速变大）还是将范围限制在系统的一部分？快速扩张的公司经常用技术债务来换取速度，随着系统变得越来越难以维护，开发者体验也变得越来越差，专注于系统更小部分的需求变得更加重要。没有明确内部领域所有权的大型单体代码库意味着工程师需要了解系统的大部分东西。随着代码库的扩大，要在理解系统的大部分东西与对特定部分有更深入的理解之间做出平衡变得不太可能，这也是为什么将单体拆分为服务或微服务变得如此有吸引力。</p><p>&nbsp;</p><p>此外，在初创企业中，其他重要的技术方面的责任，如维护运行应用程序的平台，通常落在一个团队身上。随着团队的快速扩展，在为越来越复杂的平台提供支持的同时构建新功能通常会导致交付速度变慢。引入专门的角色，如平台运维人员，可以减轻工程师的负担，让他们能够专注于软件工程。这确实有助于整个组织加快交付速度。</p><p>&nbsp;</p><p>最后，有时候这只是一个感知或优先级问题。快速扩张的公司的管理者通常习惯于事无巨细地了解正在发生的事情，因为在这些公司规模还很小的时候，这很容易做到。但随着公司规模的扩大，不可避免地会让人感觉交付速度变得不那么快了。因此要学会总结技术团队在发展过程中变慢的原因，并确保直接商业驱动的工作和战略技术工作都得到优先考虑，这样交付的速度就仍然是可预测的。</p><p></p><h2>交付速度慢到底意味着什么以及如何衡量它</h2><p></p><p>&nbsp;</p><p>为了了解交付速度是否在变慢或本来就慢，我们需要知道如何衡量它。</p><p>&nbsp;</p><p>交付速度对不同组织中不同的人来说有不同的含义。关键在于要了解自己的期望是什么、应该追求什么，并弄清组织的规范是什么。</p><p>&nbsp;</p><p>我曾在诺基亚这样的大公司工作过，速度不是他们的首要任务（但肯定曾经是），我也曾在像Bloom &amp; Wild这样的快速扩张的初创公司工作过（这样的公司要找到适合的市场，然后快速增长，这意味着执行速度是关键）。那么他们的期望是什么？合适的交付速度应该是怎样的？问问你的领导他们希望看到什么样的结果，然后你就可以做一些更简单的事情来衡量你朝着结果前进时所取得的进展。</p><p>&nbsp;</p><p>至于如何衡量你的速度，我发现有两个很好的着手点。首先是专注于Nicole Forsgren、Jez Humble和Gene Kim在《加速》一书中提出的指标。在这本伟大的著作中，<a href=\"https://www.devops-research.com/research.html\">DevOps研究和评估</a>\"（DORA）团队（一个在2018年被谷歌收购的研究项目）描述了如何使用四个指标来持续改进实践，更快地交付软件，并保持可靠性。这四个指标是：</p><p>&nbsp;</p><p>变更交付时间（Change Lead Time）——从变更请求启动到将变更部署到生产环境中的时间；部署频率（Deployment Frequency）——团队将代码部署到生产环境的频率；变更故障率（Change Failure Rate）——这些代码推送中有多少比例会导致生产问题，如事件、回滚或一般性故障；平均恢复时间（Mean Time to Recovery）——从触发发生到事故被解决的时间。</p><p>&nbsp;</p><p>我建议将这个作为想要衡量团队交付速度的人的着手点。你可以在InfoQ的<a href=\"https://www.infoq.com/articles/book-review-accelerate/\">《加速》书评</a>\"中找到更多信息。</p><p>&nbsp;</p><p>最近，《加速》一书中的想法得到了扩展，包含了有助于提升团队绩效和幸福感的其他指标，特别是更多地关注开发者体验。新的<a href=\"https://queue.acm.org/detail.cfm?id=3454124\">SPACE</a>\"框架建立在DORA工作的基础上，并建议使用更为广泛的度量指标。</p><p>&nbsp;</p><p>满意度和福利（健康检查、开发者效能等）；绩效（结果，即可靠性、客户满意度）；活动（例如部署频率）；沟通和协作（显示谁与谁以及如何连接的网络指标，上手时间等）；效率和流程（例如流程中的转交次数）。</p><p>&nbsp;</p><p>我建议从小处开始，在花时间设置能够进行实际度量的指标之前，先专注于如何让团队了解为什么你要收集这些指标，以及它们将如何帮助团队做出改进。</p><p></p><h2>防止交付速度变慢太多</h2><p></p><p>&nbsp;</p><p>随着团队的发展，他们会放慢脚步。一个更大、更成熟的、负责一个更大的代码库的团队，比一个小型初创公司中的团队需要关注更多的东西，以便更加快速地行动并找到市场匹配度。他们需要把更多的精力放在构建和维护具有更长寿命的复杂系统上。他们还需要避免过度的技术债务，并确保系统的安全性和性能。这些都需要时间和精力。通常情况下，系统架构会成为进一步改进交付速度的障碍。例如，在一个快速扩展的公司中，一个过于复杂的单体架构会迅速降低团队的交付速度，因为团队的变更不能孤立地进行，或者系统部分之间的过度依赖需要高水平的跨团队协调。</p><p>&nbsp;</p><p>组织的设计在防止交付速度变慢方面起着重要作用，限制人们需要关心的事情的范围是关键。如果每个团队成员都需要维持太多的沟通路径或关系，就会出问题。</p><p>&nbsp;</p><p>例如，在Bloom &amp; Wild，我们的团队是跨职能的，当团队成员达到8个人左右时，我们会将其他人分到新的团队中。我们相信8个人的团队既具备取得成功所需的技能，同时又不会让人感觉团队变得迟钝。当一个团队让人感觉到迟钝时，你就会发现，每天的站会变得无聊，参与度下降，保持沟通也变得困难。</p><p>&nbsp;</p><p>我们还限制了团队需要关注的事情的范围。团队拥有一项产品或客户体验的一部分，包括产品和技术领域的东西。我们希望它们的寿命更长，并且尽可能独立地运作，毕竟，那些开发网站或移动应用程序产品页的人怎么会真正去关心运营中心是如何打印东西的呢？</p><p>&nbsp;</p><p>我们把顾客的体验分成五个部分——从发现品牌到收到包裹。这包括从为花束采购花茎到客户账户管理的所有步骤，以及两者之间的所有东西。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/37/373249cb17a3dc44dfd6bac20e03d53e.png\" /></p><p></p><p>&nbsp;</p><p>我们的工程团队被分成两个不同的部分，每个部分都映射到不同的小组，并且越来越多地映射到不同的应用程序和技术平台。电子商务部门负责我们的核心电子商务领域和平台，从营销技术到跨Web和移动应用程序的采购和客户管理。我们的运营技术小组负责内部客户和第三方合作伙伴使用的采购、产品管理和履行平台。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/95/95f6f189dde19381fb690c87e4a456fa.png\" /></p><p></p><p>&nbsp;</p><p>工程团队由平台运营团队（拥有我们的底层基础设施）、IT团队（拥有我们的IT资产）、数据科学团队（与工程团队在基于机器学习的解决方案上紧密合作，为整个公司使用的商业智能系统提供动力）提供支持。</p><p>&nbsp;</p><p>我们对这种团队设置的主要灵感来自伟大的《团队拓扑》一书。上面的模型与业务导向（Stream-Aligned）团队和平台团队的概念存在紧密的映射关系。《团队拓扑》书中提到的业务导向团队是一个与业务变更的主要流程保持一致的团队，具有跨职能技能，并且能够在不等待另一个团队的情况下进行增量交付。平台团队负责底层平台，为业务导向团队提供支持。之所以出现重叠，主要是因为平台简化了原本复杂的技术，并为使用它的团队减少了认知负担。要了解更多信息，我建议从InfoQ的<a href=\"https://www.infoq.com/articles/book-review-team-topologies/\">《团队拓扑》书评</a>\"开始。</p><p>&nbsp;</p><p>我们还关注产品和技术团队之间的协调。我们发现目标、关键结果和关键绩效指标对我们很有效，不管是让团队在重要的事情上保持一致，还是通过KPI来跟踪和纠正整个周期。我们的KPI主旨是“技术和团队实现快速和安全的大规模变更”，我们发现给它们打上口号确实有助于在技术团队内外落地。</p><p>&nbsp;</p><p>我们已经在整个公司范围内采用了季度计划周期，这非常有效地确保了所有团队在重要的事情上保持一致，并确保在整个组织中有一个明确的交付节奏。在这个框架中，我们有一个明确的机制来确定工作的优先级，这与利益相关者的理解保持一致，所以如果我们无法为利益相关者确定工作的优先级，我们很清楚是为什么，也很清楚下一个优先级窗口将何时打开。</p><p></p><h2>团队和利益相关者之间的一致性</h2><p></p><p>&nbsp;</p><p>基于定期的、季度性的计划周期设定明确的预期是最重要的一致性保持点。我们的产品团队在协调利益相关者方面做得很好，采用自上而下的OKR方法，确保利益相关者的期望与公司战略和我们的交付能力保持一致。</p><p>&nbsp;</p><p>我所看到的是，当需要考虑技术债务或战略性技术工作优先级但却不清楚这些工作的价值时，会出现更多一致性方面的问题。我们与我们的团队合作，确保他们能够以一种利益相关者和产品团队成员都能理解的方式来有效地解释技术工作的价值。我想说的是，人们在游说需要完成的工作时应该能够“像决策层那样说话”，量化工作的价值是很重要的，无论它是直接由商业驱动的还是对技术策略有利。这意味着需要理解什么对公司来说是重要的，以及团队如何做出贡献。这也意味着需要理解人们真正关心的是什么，这通常不是代码库的状态或是否使用了最新的前端框架，而是将消息转化为业务结果和投资回报的支持，这是利益相关者真正关心的。</p><p>&nbsp;</p><p>就像其他很多事情一样，这是关于如何讲好故事。我们发现使用KPI作为当前状态的框架有一定的帮助。周期时间就是其中的一个KPI，表示从开始工作到在生产环境中实现价值的时间。当改进能够对团队所交付的东西起到明显的作用时，构建关于工作将如何改进正在进行的周期时间或提高团队效率的对话可以真正地吸引利益相关者。让利益相关者成为故事的英雄，是实现最大价值的人，这样真的很管用！</p><p></p><h2>加强团队内部沟通</h2><p></p><p>&nbsp;</p><p>对于我来说，第一个关键点是确保期望是明确的。我发现，如果你是团队的一员，共同创建团队章程确实有助于团队在设定团队的常态和建立“游戏规则”时让成员有参与感。</p><p>&nbsp;</p><p>团队章程应该由团队来制定，由团队所拥有，并且不仅要对团队可见，也要对所有与他们一起工作的人可见。章程定义了他们是谁以及他们喜欢的工作方式。这也是当人们加入或离开团队以及团队动态发生变化时应该重新审视的东西。我介绍了更多关于<a href=\"https://medium.com/@stephenjanaway/creating-a-team-charter-4a94971ab7e1)\">定义和使用团队章程</a>\"的方法，如果你想了解更多，可以了解一下它们。</p><p>&nbsp;</p><p>作为我们季度计划周期的一部分，我们还在每个团队中进行团队健康检查，因为虽然交付速度很重要，但这个速度需要是可持续的，我们不要忘记了团队是由人组成的。我们使用了由Henrik Kniberg在Spotify所创造的<a href=\"https://engineering.atspotify.com/2014/09/squad-health-check-model/\">团队健康检查模型</a>\"的一个版本，即我们向团队提出一些关于团队、组织和代码库健康等方面的问题。我们的问题与Henrik的文章中提到的问题类似，只是针对Bloom &amp; Wild环境进行了一些小的调整，所以如果你也想做一些调整，我建议使用Spotify的问题作为起点。关键在于要在每个团队中使用相同的问题，这样可以让管理团队的工程经理与团队在特定的行动点上合作，也让技术领导团队在团队之间找到趋势，即行动可能产生最大影响的地方。我们发现，健康检查是提高团队自我意识和集中指导精力的一个很好的工具。事实上，我们在每个季度的计划和交付周期结束时在我们的团队、社区和高级技术领导团队中使用它们。</p><p>&nbsp;</p><p>加强团队之间的沟通也很重要，因为整个组织的速度取决于最慢的团队。建立论坛至关重要，方便团队之间沟通交流。我认为它就像胶水，你需要用胶水把东西粘在一起！我们用一套既适用于团队也适用于实践社区的原则和实践将团队“粘”在一起。</p><p>&nbsp;</p><p>实践社区就是志同道合的人（例如我们所有的Ruby工程师）的论坛，他们定期会面，为他们的代码库制定短期和长期的技术策略。它们也是获得支持、指导和建议的地方。它们由我们的技术领导负责运营，将社区紧紧地联系在一起。我们发现这种设定有助于保持团队的独立性，让他们能够以可持续的速度进行交付，同时确保团队中的工程师得到他们需要的支持。</p><p></p><h2>关注可持续交付速度有哪些好处</h2><p></p><p>&nbsp;</p><p>我们发现Bloom &amp; Wild已经能够变得更加专注，通过技术内部的协调活动，我们的团队也能够变得更加专注。我们的季度周期是一个关键的推动因素，我们的KPI有助于我们在整个周期中保持在正确的轨道上。</p><p>&nbsp;</p><p>通过限制团队成员需要关心的事情的范围，以及通过设计组织来约束团队的产品和技术环境，我们已经能够减轻团队成员的认知负担。这意味着他们可以专注于重要的事情，为公司内外的客户设计和提供更好的体验。</p><p></p><h2>团队的速度变慢了，我该怎么办</h2><p></p><p>&nbsp;</p><p>希望你的OKR和KPI能够告诉你该怎么办，但通常情况下，它首先会从利益相关者那里显露出来。如果一个利益相关者问“为什么技术比以前慢了？”，首先你需要问问自己他们问的问题是不是对的。可能确实需要更长的时间来交付工作，你需要讲述一个故事来解释为什么会这样。在一个快速扩张的公司中，你的利益相关者很可能在他们的团队中也经历过这种情况，所以要找到与他们的经历相似的方法。注重对工作投资回报的理解和协调，利益相关者通常不太理解设计和开发软件所需要做的事情，在这些方面分享更多的信息确实会有所帮助。有时候，向他们解释交付一个特性所要耗费的成本和原因可能意味着这个特性随后根本就没有优先级！</p><p>&nbsp;</p><p>不要认为这是利益相关者的问题。看看你的团队中是否有可以优化的地方。KPI和历史数据真的可以起到一些作用，它能够让你主动识别问题所在并改变前进方向，可以帮助你形成一种叙事技巧，向你的团队讲述一个关于变更需求的故事，并向利益相关者说明为什么变更是有价值的。</p><p>&nbsp;</p><p>总的来说，这是关于确保你能够理解团队可持续交付的节奏，并利用这一点来优先安排更有影响力的工作。如果你能做到这一点，那么你很可能就会发现利益相关者不会再问“为什么一切都这么慢”这样的问题。</p><p>&nbsp;</p><p>作者简介</p><p>&nbsp;</p><p>Steve Janaway是欧洲最大的消费者花卉品牌Bloom &amp; Wild的工程副总裁，他通过技术将人民更贴心地联系在一起。他对在建立可持续的、快乐的、高效的团队的同时如何利用技术来推动可能性边界充满了热情。他经常撰写和发表关于领导力和软件的文章，并在Twitter（@stephenjanaway）上谈论有关技术的一切。</p><p>&nbsp;</p><p>原文链接：</p><p><a href=\"https://www.infoq.com/articles/measure-optimise-delivery/\">https://www.infoq.com/articles/measure-optimise-delivery/</a>\"</p><p></p><p>相关阅读：</p><p><a href=\"https://www.infoq.cn/article/5bacNI7E9uWR6mpWbu0m\">研究了代码质量后，开发速度提高了 2 倍，bug 减少了 15 倍</a>\"</p><p><a href=\"https://xie.infoq.cn/article/99eadb43f1b13fbafc441507a\">做到这 4 点，才是真正的持续交付|研发效能提升 36 计</a>\"</p><p><a href=\"https://www.infoq.cn/article/5LMB6Mtp7NIW7OawVLZT\">有度量才有真管理 研发效能的度量体系建设实践</a>\"</p>",
    "publish_time": "2022-10-31 18:11:24",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "加码医疗设备AIoT赛道，绪水互联获数千万A轮融资，助力医疗数字化",
    "url": "https://www.infoq.cn/article/bFNB2yLPxci1iSPllwu7",
    "summary": "<p>InfoQ获悉，最近，北京绪水互联科技有限公司（下文简称：绪水互联）完成数千万元A轮融资，由惠每资本领投，pre-A轮领投方远毅资本跟投。</p><p>&nbsp;</p><p>据绪水互联介绍，本轮融资将应用在医疗设备 <a href=\"https://www.infoq.cn/article/Dx3Jov25cFcUKvPL0sjv\">AIoT</a>\" 和数字化相关领域的研发以及市场推广中，加速助力技术成果的商业化落地。</p><p>&nbsp;</p><p>绪水互联是成立于2016年的一家专注于医疗设备AloT领域的数据服务公司，依靠自主研发的数据异构、边缘计算和<a href=\"https://www.infoq.cn/article/mxgAsWjUZv97ZmYrkdCo\">数字孪生</a>\"三大核心技术，致力于帮助医疗机构实现医疗设备智能化管理。过去几年中，绪水互联通过持续打磨技术、产品，在行业标准等维度实现了一定突破。</p><p>&nbsp;</p><p>通常而言，医院在进行<a href=\"https://www.infoq.cn/topic/1160\">数字化转型</a>\"的过程中，由于内外部医疗管理运营体系混乱、数据人才缺失、原本信息化数据存储平台安全性低、数据量大，很多医院存在医疗信息孤岛、资源配置效率低、数据外流风险大等亟需解决的问题。</p><p>&nbsp;</p><p>比如，在医疗数据的应用方面，大多数医院在信息化基础设施建设方面已经初具规模，医院每天都会产生大量的数据，但是由于缺乏统一的数据标准、数字化医疗设备新旧不一、各系统之间有隔阂，医院依旧存在严重的信息孤岛问题，导致各部门难以共享数据。长此以往，不完善的信息化系统将会阻碍医院的数字化进程。</p><p>&nbsp;</p><p>再比如，在数字人才方面，对于目前很多医疗机构而言，医务人员的数量远远大于技术人员。由于每个医疗领域都有独特的业务特点和数据需求，因此，医院在进行数字化转型的过程中，需要既懂医疗知识的，也懂数据分析技术的复合型数字人才。</p><p>&nbsp;</p><p>虽然数字化转型是一个漫长的过程，但是对医疗机构来说，越快实现数字化，就能够越早的进行<a href=\"https://www.infoq.cn/article/mfcsP6wws312tLTcrPCl\">数字赋能</a>\"，因此，如果医院想要慢慢自行培养<a href=\"https://www.infoq.cn/article/a7ls8rH7EoAweEdLcNfO\">复合型数字人才</a>\"，难免无法确保数字化转型的周期与效果，这对医疗机构的数字化能力提出了更高的要求。</p><p>&nbsp;</p><p>而绪水互联专注于医疗行业数字化转型，一方面，推出面向医疗机构的医疗设备数字化运营管理平台，其 AIoT 技术所支持的设备品类已从放射超声类扩展到生命支持类、腔镜类和小型设备类&nbsp;，可以基于医疗设备底层真实数据的挖掘、清洗和分析，提供运维质控、效益分析、采购决策、科研转化的一体化平台，推动医疗行业进行智慧化管理落地，满足医疗机构全院级全品类医疗设备数字化运营的需求，实现医疗设备的智能化变革。</p><p>&nbsp;</p><p>另一方面，面对售后服务商，绪水互联提供医疗设备数字化运维服务平台，通过云平台和SaaS服务，可以为售后服务企业提供设备故障预警与远程诊断等数据服务，让数据助力产业数字化升级。</p><p>&nbsp;</p><p>据悉，目前，绪水互联已与北京协和医院、四川大学华西医院、青岛大学附属医院等国内数十家家知名医院进行合作，建立了覆盖全院、可兼容拓展、自主可控的医疗设备数字化运营管理平台。</p><p>&nbsp;</p><p>除此之外，绪水互联目前已服务了140余家医疗机构，其中有近20家的三甲医院，覆盖全国26个省市，管理设备3000多台，实现1200家医院的大型、中型医疗设备的智慧物联。未来，绪水互联将以医院为中心，持续专注于数字化技术，为行业带来结构性效率提升，实现医疗设备产业链的数字化升级。</p><p>&nbsp;</p><p>“长期向好的驱动因素，如老龄化、人均可支配收入、个人对健康更高层次的要求没有显著变化，整个医疗健康产业的需求端依然强烈。”绪水互联认为，今后较长一段时间，医疗供给端效率的提升，必将为整个产业创造持续的发展动能。&nbsp;</p>",
    "publish_time": "2022-10-31 18:25:31",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "腾讯云加码云原生技术投入，宣布升级云原生战略布局",
    "url": "https://www.infoq.cn/article/N8u6idtvtt9jgTPhaaV8",
    "summary": "<p>随着云原生热度持续攀升，行业进入云上价值探索的新阶段。</p><p>&nbsp;</p><p>10月29日，在Techo Day腾讯技术开放日上，腾讯宣布升级云原生战略布局，加大PaaS自研能力建设，并发布了三款云原生新品，表示将持续加大对云原生技术研究的投入，推动云原生在企业的落地，助力企业深化数字化转型。</p><p>&nbsp;</p><p>企业数字化更需要云原生的PaaS和SaaS能力</p><p>&nbsp;</p><p>云原生时代，企业“上云”已不再满足于简单地把基础设施搬到云上，为了追求更进一步的降本增效和业务发展，越来越多企业把云原生作为数字化转型的新思路。</p><p>&nbsp;</p><p>据IDC调研结果，在使用云原生的企业中，有近五成企业已经将云原生技术应用到生产环境的核心和次核心系统，83%的企业表示将持续加大在此方面的投入。</p><p>&nbsp;</p><p>可见，云原生已经成为企业“用云”的新范式。此次Techo Day，腾讯云副总裁刘颖也分享了对行业的洞察，他认为，“云原生技术能够帮助企业提高应用的开发、发布、迭代速度，且具备极致的资源伸缩能力、服务自治和自愈能力，让企业在新场景下，灵活应对架构、资源、稳定性等各种挑战。”</p><p>&nbsp;</p><p>而腾讯作为最早布局云原生业务的云厂商之一，已具备完整的云原生技术和产品体系，涵盖软件研发流程、计算资源、架构框架、数据存储和处理、安全等五个领域的多个场景，不仅通过自研业务全面上云，开展了业界最大规模的云原生实践，还在服务外部客户的过程中，积累了丰富的经验。</p><p>&nbsp;</p><p>例如，小红书80%的业务基于腾讯云TKE容器部署，其中AI训练和推荐场景技术全栈使用容器化部署，总体成本降低了40%，实现了更稳定、灵活、低成本的底层基础设施建设。</p><p>&nbsp;</p><p>在腾讯云副总裁黄俊洪看来，随着企业数字化转型的深入，实体经济的转型更需要贴近业务的PaaS和SaaS能力，“腾讯云尤其加大在PaaS自研能力上的建设，比如说像音视频的TRTC、容器领域的TKE、数据库的TDSQL等等，来帮助企业适应未来业务发展的云原生服务平台。”</p><p>&nbsp;</p><p>活动上，腾讯云发布了TSE云原生网关Kong、TSE Polarismesh（北极星）、TKE HouseKeeper原生节点三款云原生新品。</p><p>&nbsp;</p><p>其中，TSE云原生网关Kong作为高性能、高可用的开源托管网关，可以集流量网关、安全网关、微服务网关为一体，有效减少用户自建网关的开发和运维成本。TSE Polarismesh（北极星）是腾讯开源的服务发现、配置中心和治理中心，能解决分布式或者微服务架构中的服务可见、故障容错、流量控制和安全问题。</p><p>&nbsp;</p><p>TKE Housekeeper原生节点是专为云原生设计的增强节点，通过云原生声明式的方式管理和运维节点，帮助运维人员更高效地解决运维难题，提升资源利用率。</p><p>&nbsp;</p><p>未来云原生将以应用为核心</p><p>&nbsp;</p><p>云原生的概念最早出现于2013年，人们普遍将其理解为容器+微服务+持续交付+DevOps，围绕资源管理来进行实践，而当下，云原生技术已经有了大规模的落地和相对成熟的应用，业界对云原生的未来发展方向有了新的预估。</p><p>&nbsp;</p><p>黄俊洪认为，未来的云原生，“逐步会过渡到以应用为中心，除了具备初代的云原生容器、微服务的这些特征外，更多强调的是对资源的配置和对应用效率的一个最优解。”</p><p>&nbsp;</p><p>这意味着未来资源管理和调度将变得更高效。例如腾讯云的Web IDE产品Cloud Studio，让开发者可以摆脱物理环境束缚，在云端完成远程协作和应用部署，并且，其将在线开发环境和底层云资源融合，让开发者可以快速调用生产环境资源，一键管理开发资源。</p><p>&nbsp;</p><p>同时，应用的交付和管理会变得更敏捷。以腾讯云的自动化交付和运维工具Orbit 为例，其覆盖了云原生应用开发、交付、运维的全生命周期——在开发环节，研发人员通过模块化的应用和插件，只需填写少量和业务相关的参数，就能完成云原生应用的改造；在交付环节，通过GitOps的方法自动捡配，结合灵活的发布流程，可以保障发布的一致性和可靠性；在运维环节，Orbit具备混合云统一观测平面能力，覆盖了监控告警、链路追踪等多个日常排障场景，运维人员可以更轻松方便地进行管理。</p><p>&nbsp;</p><p>此外，由于许多云原生产品具备标准化能力，也会有更完善的安全可信和合规。</p><p>&nbsp;</p><p>云原生将成为开发者的“必修技”</p><p>&nbsp;</p><p>随着云原生技术的普及，越来越多开发者选择用云原生产品来构建应用。据了解，腾讯云拥有国内最大的云开发小程序生态和开发者工具平台，截至目前，腾讯云原生产品所服务的开发者数量已经超过300万。</p><p>&nbsp;</p><p>云原生改变了传统的本地化编程，将开发环境搬往云上，减少了环境局限，同时，还降低开发门槛和资源管理成本，解放了开发者的生产力，让开发者可以将更多精力投入到富有创造性的业务逻辑，以及对业务场景的理解上。反之，云原生技术的演进也对开发者提出了新要求。</p><p>&nbsp;</p><p>黄俊洪认为，云原生将成为开发者必备的能力之一，“甚至说如果不懂云原生，在找工作方面可能相对来讲就比较困难。从具体的能力上来说，比如像微服务的拆分能力，容器化的改造能力，服务治理的能力，以及像DevOps这些能力。我觉得云原生知识积累跟储备，对于开发者来讲还是尤为重要的。”</p><p>&nbsp;</p><p>此次Techo Day活动上，来自腾讯云Prometheus云原生监控、Crane、CODING等多个云原生产品的工程师分享了各自的产品理念和技术实践，帮助开发者从理论到实践，全面感知云原生的技术价值，更好地享受云原生时代带来的红利，为未来的职业发展做好准备。</p>",
    "publish_time": "2022-10-31 19:53:20",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "马斯克：推特最糟糕的事情是“一个人编码十个人管理”",
    "url": "https://www.infoq.cn/article/zbwkGAA9dQKl1xMP4cqp",
    "summary": "<p>马斯克最终还是以440亿美元的代价收购了推特。 10 月 27 日，马斯克抱着“水槽”进入 推特总部。10月29日开始，成为推特老板的马斯克开始对推特进行改革。</p><p>&nbsp;</p><p>据报道，入驻后的第一天，推特要求公司的程序员<a href=\"https://www.reddit.com/r/programming/comments/yg9cpw/twitter_engineers_asked_to_print_out_their_last/\">书面打印</a>\"他们30-60天内的代码，以此作为他们在公司正常工作了的证据，并且为了防止开发人员突击添加代码，特地将代码进行了冻结。而据彭博社消息，马斯克还要求<a href=\"https://www.infoq.cn/article/1jdi4LDTycjblozS8QwV\">特斯拉的工程师</a>\"来审核推特代码。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/ad/ade92d01d5be499286e17cc36a38ad9b.png\" /></p><p></p><p>&nbsp;</p><p>10月30日，这位亿万富翁暗示了推特管理中的一个主要问题。马斯克发出了<a href=\"https://twitter.com/elonmusk/status/1586686935518498816\">一条推文</a>\"，声称推特最糟糕的事情是“一个人编码十个人管理”。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/fe/fea9b5e6a414de314605be2c3f0845a2.png\" /></p><p></p><p>&nbsp;</p><p>&nbsp;</p><p>尚不知马斯克是如何审核代码并得出如此结论的，但有网友评论：“初级开发人员 = 添加代码，高级开发人员 = 删除代码。”代码量是工作的一个衡量指标，但准确度能达到多少却很难说清楚。</p>",
    "publish_time": "2022-10-31 20:37:47",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]