[
  {
    "title": "如何将人工智能技术更好地应用到实际商业场景？｜专访网易智企算法专家李雨珂",
    "url": "https://www.infoq.cn/article/EN6D7qupmStSK1MLZsaG",
    "summary": "<p>随着AI技术的应用深度与广度不断延伸，AI技术为实际业务场景所带来的价值已经成为共识，然而，如何才能以更低的成本引入AI技术，如何能够以更加轻量化的方式使用AI技术，成为值得思考的问题。</p><p>&nbsp;</p><p>为此，InfoQ记者有幸在<a href=\"https://qcon.infoq.cn/2022/shanghai/track/1470\">2022 QCon全球软件开发大会上海站</a>\"的现场，采访了网易智企算法专家李雨珂。目前，他负责数字内容风控领域的人工智能算法研究，并在QCon发表了《AI服务效率升级，在智能数字内容风控中实践AI生产增效》的主题演讲，关于如何助力人工智能生产增效，他有着特别的思考。</p><p>&nbsp;</p><p>以下是视频采访的全部内容，为方便读者查看，视频下方也附上了文字内容。</p><p>&nbsp;</p><p></p><p></p><p>InfoQ：感谢李老师参加QCon全球软件开发大会，先请您做下自我介绍</p><p>&nbsp;</p><p>李雨珂：我目前在网易智企旗下的网易易盾，最近一段时间主要在做基于 AI 的数字内容风控相关的技术，我也是网易智企技术委员会下面 AI 分委会的负责人。</p><p>&nbsp;</p><p>InfoQ：网易智企技术委员会在整个网易智企是扮演着什么样的角色？以及网易智企技术委员会的主要职能是什么？</p><p>&nbsp;</p><p>李雨珂：技术岗位会被分成很多类型，如果按照水平的方式去做管理有一个好处，就是不同的技术岗位能够得到比较好的发展，在整体的发展方向上可以有一致性。实际上，这对于商业的部门来讲，不一定是最好的方式。就好像我们去找客服，如果有一个专属的客服，需求响应速度是非常快的，而且你的体验也会非常好。但是如果你的客服需要通过排队去等待，这个体验就会比较差。所以我们真实的组织架构，是把不同的技术岗位拆解到不同的业务当中去，也就能够有更强的战斗力，或者让这些团队的技术人员对于相关的业务能够更加的熟悉，或者说更懂得商业。因此基于现在的组织形式，我们会去让各个业务团队的研发代表站出来组成一个技术委员会，相当于是从一个水平的角度去做支撑。</p><p>&nbsp;</p><p>从我个人的角度理解，技术委员会主要起到以下几个作用：</p><p>&nbsp;</p><p>第一个方面，能够做一些技术上的复用，至少不要重复去造轮子。这种复用包括两个方面，其一，有一些能力我们可以直接通过 API 的形式去使用；其二，也可以去参考别人技术上的解决方案，看看他们是怎么去做的，在我们自己的真实问题中可以做借鉴；第二个方面，我们整个事业部层面会有一些水平的任务需要做支撑，技术委员会比较适合去做整体的推动和关注。举个例子，账号是比较适合从整个大部门的角度去做关注的，还有一些基础数据的问题，也更加适合从大的部门去做整理；第三个方面，由技术的负责人一起去想一些技术分享的主题会更加合适，让不同团队之间相互知道大家在做什么事情。在这个过程中也可以相互学习、相互借鉴，将其用在自己的业务领域里；最后，因为有了技术委员会，它会对不同业务的发展情况以及技术的使用情况有全局的概览，也更方便我们去做整体技术发展方向的讨论和制定。</p><p>&nbsp;</p><p>InfoQ：在《人工智能技术应用实践白皮书》中了解到，网易智企已经将AI技术在内容风控、音视频、自然语言对话三个领域进行了实践，请您分别介绍下网易智企在以上三个领域针对性的解决方案。</p><p>&nbsp;</p><p>李雨珂：首先，我会讲一些共性的方向，第一部分的共同点，它真正地解决了业务场景中的实际问题，并不是为了应用这个 AI 技术而去用它。举个例子，像在内容风控场景中，它是有复杂场景下的一些困难目标识别问题；在自然对话场景下，它会有复杂的客户需求需要解决；第二部分的共同点，在应用 AI 的过程中，我们都非常关注 AI 的效率，即引入了新的技术，但是不能让这个技术带来更多的开销，希望能够轻量级地去应用 AI 技术，所以在这些解决方案中都有相关的体现。</p><p>&nbsp;</p><p>展开来讲，在内容风控场景下，我们会在算法层面做一些调优，去帮助复杂场景的识别效果进行提升；在音视频场景，我们会有降噪、场景分析以及超分辨率等等，以 AI 为主导的技术去帮助我们提升音视频方向的体验；在自然对话场景，我们也会通过特征检索方式的优化，用一些对话的框架以及沉淀的行业知识，帮助我们去解决复杂的客户需求。</p><p>&nbsp;&nbsp;&nbsp;</p><p>InfoQ：由于行业场景不同，导致不同行业面临的内容风控的需求也有所差异，比如游戏行业，未成年人监管以及玩家信息合规是一个关注的重点；在金融行业，身份认证、营销欺诈等等也是需要关注的风险问题......请问网易易盾是如何满足不同行业的内容风控需求的？</p><p>&nbsp;</p><p>李雨珂：第一方面是数据上的支撑，我们前期聚集到了某一个行业比较多的客户。在这样的前提下，我们做了相关的数据分析，针对于不同的客户，他们有怎样的属性、关键问题等等。得到的结果是，有一些可能跟我们的理解比较一致，有一些可能超出我们的理解，无论是怎样的发现都对我们理解这个行业是有帮助的。</p><p>&nbsp;</p><p>第二个方面是水平地建立技术上的能力，比如针对未成年人的技术、特征检索技术等等，基于这些能力，针对不同行业的解决方案就会更加灵活一些。这里可以打个比方，当足球教练排兵布阵时，如果有更多类型的队员进行选择，排兵布阵就会更加容易。</p><p>&nbsp;</p><p>第三个方面是在对接客户时，我们会形成一个小团队，其中包括技术同学、客户运营同学、策略同学等等。这些同学组织在一起会贴近客户，服务于客户的一些真实问题。在这个过程中，我们各个岗位的同学会更了解客户，进而更了解这个行业。</p><p>&nbsp;</p><p>最后一点，我们观察到部门的管理者其实是有在关注一些新兴的行业，给我们增加了一些新兴行业的理解和洞察，帮助我们去找一些新的应用。</p><p>&nbsp;</p><p>InfoQ：目前市场上针对内容风控的这个场景解决方案有很多，请您列举一下网易易盾核心的优势</p><p>&nbsp;</p><p>李雨珂：这个问题不同岗位的同学可能有不同的答案，我可以讲一下我自己的理解。首先站在我们自身，我们就是一直长期坚持去做这么一件事情，所以我们的技术同学对于行业有非常深入的理解。因此在解决问题的时候，也会更加得心应手一些。</p><p>&nbsp;</p><p>其次可以站在客户的视角去看，客户接入一般会经历 POC 的过程，这个过程固然很重要，但是客户正式接入了以后，实际上才是一个真正的起点。我们需要做很多和客户共同成长的事情，帮助客户去解决真正的问题。在解决问题的过程中，我们也不会刻意回避一些困难的问题，而是尽自己所能去做到尽善尽美。我们的技术人员也会主动识别现存的问题，帮助客户去想解决方案，这样的心态才是核心能力的体现。</p><p>&nbsp;</p><p>InfoQ：在内容风控场景中，由于系统中涉及的数据维度多，不同系统对于数据的标准也有所不同，使得数据成为非常核心的内容，请问您是如何看待数据标准这个问题？</p><p>&nbsp;</p><p>李雨珂：数据标准在内容风控场景里确实是一个很重要的问题。因为从人的视角来看，很多东西都是很主观的，但是对于机器来讲，没有办法得到一个认知上的结果。所以我们在做前期模型的时候，会更加照顾机器的感受，还会制定一些偏客观的标准，帮助机器先积累一些比较基础的能力。当有了这些基础能力以后，我们会在技术上做进一步的工作，帮助机器去靠近人的认识，这是我们在初始阶段做的一些事情。最近的话我们开始在思考让模型能够连续输出一些结果，更加方便在做判断的时候进行调控。</p><p>&nbsp;</p><p>此外，从我们这么长时间做这件事情来看，我们不能太低估模型的能力。因为一开始我们会觉得数据标准模型可能没有办法 Hold 住，但经过很长时间的实践，我发现模型对于一些复杂困难的数据标准，它也是有一定的能力。因此这里有一个比较关键的点，不要让数据标准成为技术生长的限制，希望未来能够让我们的技术能力去适应更复杂的数据标准。</p><p>&nbsp;</p><p>InfoQ：在《人工智能技术应用实践白皮书》的最后一章中，我们提到了三方面的AI前沿技术，如多模态、无监督与超大规模AI系统以及工程自动化，请您再概括下这三方面技术在未来的潜力</p><p>&nbsp;</p><p>李雨珂：我可能会从实用的角度来讲这几个比较新的方向。这些话题其实都是比较吸引人的，但是怎样把它应用到实际的商业场景中，是一个值得讨论的问题。</p><p>&nbsp;</p><p>多模态确实能够帮助我们去提升效果，但是实际应用起来，它的成本开销也会逐步的上升。这就相当于我们要多付出 50% 的工作量去多解决 0.1% 的问题。所以在接下来的工作中，我们从实用性的角度出发，更多考虑在怎样的时机去引入多模态的技术；无监督和超大规模也在近一段时间非常的火爆，从我们的角度来看，它要在线上直接应用可能还有一段距离，我们使用可能会围绕以下几个方面：第一个，帮助我们去生成更多的数据，或者帮助我们去找寻更多合适的数据用于下游的训练；第二个，基于预训练模型，怎么应用才能帮助我们得到更好的下游效果；第三个，思考怎样利用它去做特征检索工作。</p><p>&nbsp;</p><p>关于工程自动化，这固然是一个很好的工具，但我始终相信一个好的工具需要有好的人来使用才能发挥最大的作用。工程自动化帮助我们在做成熟业务的时候去提升效率，但是它同时也限制了做这些业务的灵活性。所以在这个过程中，可能需要考虑效率和灵活性之间的平衡，以及怎样培养更适合的人去使用这个平台，发挥出它最大的作用。</p><p>&nbsp;</p><p>InfoQ：明年，您个人的工作重心和规划有哪些？有哪些重点关注的新方向？</p><p>&nbsp;</p><p>李雨珂：一年多以前，我个人更多会关注怎样用前沿的技术，来帮助我们的业务场景做效果提升，但近期以及未来的工作重点，会转向怎样去提升 AI 在使用过程中的效率。具体来讲，在数据层面，我可能会更加关注数据科学这个方向，看看如何能够在数据层面做更高效的事情，希望未来能够更少使用人工的数据标注；在算法层面，过去很长一段时间大家都在讲大力出奇迹，我个人希望在未来，我们可以多看看怎样精简一个训练，去获得更高效的结果；在服务层面的工作其实会更加细致、全面，这可能也是我自己更看重的一个方向，怎样在服务层面去做效率上的提升，能够支持更多类型的AI服务。</p>",
    "publish_time": "2022-12-02 08:53:06",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]