[
  {
    "title": "恒生电子旗下数字藏品平台予藏开始“清退”；蚂蚁、腾讯等近 30 家机构联合发起《数字藏品行业自律发展倡议》; Meta今年工程师缩招超3000人 | 区块链周报",
    "url": "https://www.infoq.cn/article/4CZbyzSoo5lQol5AWMVx",
    "summary": "<p></p><blockquote>区块链周报栏目从产业动态、数字货币、权威观点、监管和技术等方面，为您总结了本周区块链领域发生的头条事件，让您更快速了解行业最新动态。更多信息关注公众号：区块链前哨（ID：blockchain-666）</blockquote><p></p><p></p><h2>企业动态</h2><p></p><p></p><h4>蚂蚁、腾讯等近 30 家机构联合在京发起《数字藏品行业自律发展倡议》</h4><p></p><p>近日，在中国文化产业协会牵头下，近 30 家机构联合在京发起《数字藏品行业自律发展倡议》，反对二次交易和炒作、提高准入标准成行业高质量发展的核心共识。参与各方涵盖文旅产业专业机构和协会、文化央企、IP 机构以及蚂蚁、腾讯、百度、京东等互联网科技公司，是目前行业覆盖方最广的自律公约。</p><p></p><h4>腾讯高级副总裁：腾讯已成立XR业务线</h4><p></p><p>在“SPARK 2022”腾讯游戏发布会上，腾讯高级副总裁马晓轶在接受媒体采访时表示，腾讯最近已经成立软硬一体的扩展现实（XR）业务线，希望抓住未来4-5年内的机会，在软件、内容、系统、工具SDK、硬件等各环节积极尝试，打造行业标杆的VR产品与体验。</p><p></p><p>此前，腾讯曾被曝正式成立XR部门，意在发展虚拟世界的元宇宙概念，有消息人士表示，腾讯XR部门预计拥有超过300名员工。</p><p></p><h4>扎克伯格：Meta今年工程师缩招超3000人</h4><p></p><p>当地时间周四，Meta首席执行官马克·扎克伯格表示，Meta已经下调2022年工程师招聘目标，至6000-7000人。 此前，该公司计划招聘约1万名新工程师，该指标缩减幅度超30%，超3000人。报道称，扎克伯格是在Meta公司每周例会上透露了这一点。</p><p></p><p>另外，Meta（前Facebook）发言人表示，已开始在其旗舰社交网络Facebook上为部分美国创作者测试以太坊和Polygon NFT，很快会增加对Solana和Flow NFT的支持。 Meta产品经理Navdeep Singh表示，用户将在他们的Facebook个人资料上拥有一个“数字收藏品”标签，他们可以在其中展示拥有的NFT，代表其所有权。用户将能够将加密货币钱包连接到Facebook个人资料，还可以将NFT生成Facebook帖子，用户可以对其点赞、评论和分享。Meta尚未透露NFT功能是否或何时向所有用户开放。</p><p></p><h4>米哈游、莉莉丝诉五矿信托案即将开庭，暴雷产品所涉资金追回难度较大</h4><p></p><p>6月27日消息，青海省西宁市城中区人民法院公告称，将于7月25日上午9时在本院第十五法庭依法公开审理米哈游科技（上海）有限公司、上海莉莉丝网络科技有限公司诉五矿国际信托有限公司营业信托纠纷案。</p><p></p><p>据悉，五矿信托是央企五矿集团旗下机构。公司于2010年10月8日设立，注册地为青海省西宁市，注册资本130.51亿元。此前多家媒体报道，招行代销的五矿信托产品疑似暴雷，该产品涉及的资金或已投入地产项目中，相关投资者想要追回的难度较大。</p><p></p><h4>恒生电子旗下数字藏品平台予藏开始“清退”，暂停发售新藏品并原价回购已售藏品</h4><p></p><p>6月27日，数字藏品发售平台予藏发布公告宣布关停业务并将进行清退。在其官方公众号中，予藏平台发布了《予藏平台暂停发售藏品及藏品回购公告》。 公告内容提及“目前国内尚未出台数字藏品相关的明确法律法规和政策文件，数字藏品作为新兴领域仍具有一定的不确定性与风险性。” 因此该平台称经过审慎评估，平台决定于即日起暂停发售数字藏品，转赠功能也将暂停开放，同时平台也将关闭新用户注册通道。 据悉，予藏是恒生电子区块链业务孵化的数字艺术收藏平台，而“予藏”公众号的账号主体认证也是恒生电子股份有限公司。</p><p></p><h4>新加坡金管局：三箭资本提供了虚假信息</h4><p></p><p>新加坡金管局称，三箭资本提供了虚假信息。同时，英属维尔京群岛的一家法院已下令清算总部位于新加坡的三箭资本。位于英属维尔京群岛的Teneo Restructuring的合伙人已排队处理三箭资本的破产事宜。目前还不清楚这对三箭的债权人会有什么直接的财务影响。</p><p></p><p>三箭资本创始人Zhu Su去年12月花费4880万新币（约2.4亿rmb）买入的位于Yarwood Ave的优质洋房（GCB）正在寻求甩卖（Urgent Sell）。据悉，此前关于三箭资本资不抵债、流动性危机等传言持续发酵。</p><p></p><h2>产业动向</h2><p></p><p></p><h4>BSN-DDC基础网络单日交易数超越以太坊</h4><p></p><p>6月29日消息，BSN-DDC基础网络（DDC网络）自1月25日正式运行以来，第一次单日生产环境应用的日交易数超过以太坊。DDC网络（包括所有开放联盟链）全天24小时达到了交易数974,517次（时区UTC+8），而以太坊全天24小时交易数则为938,166次（时区UTC+8）。</p><p></p><p></p><h4>以太坊Sepolia测试网预计将在近几天内进行合并</h4><p></p><p>以太坊基金会发布测试网Sepolia合并公告称，Sepolia已经为合并做好了准备，会在终端总难度（TTD） 17,000,000,000,000,000时过渡到PoS网络，预计会在几天内发生。 若Sepolia合并未发现任何问题，一旦客户端测试完成，以太坊的另一个EL测试网Goerli将通过Prater CL测试网的Merge运行。在Goerli/Prater成功过渡并稳定下来后，主网信标链上的Bellatrix升级将选择一个epoch，并为主网过渡设置难度值。 昨日消息，以太坊客户端Geth发布v1.10.20版本，设置了Sepolia的终端总难度。</p><p></p><h4>安全团队：元宇宙项目Quint近日遭黑客攻击，损失13万美元</h4><p></p><p>据成都链安“链必应-区块链安全态势感知平台”安全舆情监控数据显示，元宇宙项目Quint在6月29日遭黑客攻击，损失13万美元。黑客地址如下： 0x82f42c1172ff2dab3129045de05cde0ca8c87fca 0xcBd00C9A86f3BfD4441693E0D23F5026A648117F 0xa59D3d8911DbC3Ba7c56A2Bc35c22Cbef759992d</p><p></p><h4>美英监管层发表联合声明，重申在支持稳定币负责任创新的同时加强监管</h4><p></p><p>7 月 1 日，据英国财政部官方网站消息，英国和美国金融监管人士在美英金融创新伙伴关系（FIP）会议上发表联合声明。美国和英国致力于继续合作以支持安全创新以加强跨司法管辖区稳定币的监管成果。</p><p></p><p>声明表示，最近发生的事件凸显了稳定币、加密资产交易和借贷平台在数字资产生态系统中的关键作用、其治理和运营的差异，以及强有力的跨境监管合作的必要性。随着各自政策和监管议程的进展，英国和美国的参与者还考虑了进一步讨论更广泛的加密资产监管举措和考虑的未来机会。</p><p></p><p>与会者还指出了在国际论坛上继续就加密和数字资产开展合作的重要性，包括 G7 数字支付专家组、金融稳定委员会加密资产工作组和稳定币工作组监管问题，根据 G20 路线图加强跨境支付、支付和市场基础设施委员会、中央银行集团和国际清算银行 (BIS) 共同致力于 CBDC，以及国际证券委员会组织的金融科技工作组。</p>",
    "publish_time": "2022-07-03 10:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "深圳加快培育鸿蒙欧拉生态，开源贡献奖励最高达百万元",
    "url": "https://www.infoq.cn/article/UghWftE1W8wwzX2Kxssu",
    "summary": "<p>深圳市工业和信息化局（简称“深圳工信局”）在<a href=\"http://gxj.sz.gov.cn/xxgk/xxgkml/qt/tzgg/content/post_9924851.html\">官网发布</a>\"了关于公开征求《深圳市关于加快培育鸿蒙欧拉生态的若干措施（征求意见稿）》（以下简称“《若干措施》”）的通告。</p><p></p><p>通告称，为把握<a href=\"https://www.infoq.cn/theme/113\">鸿蒙</a>\"、<a href=\"https://www.infoq.cn/article/L31DF2Y9AMzMil2IL34m\">欧拉操作系统</a>\"发展的战略性机遇，支持鸿蒙、欧拉生态建设，推动深圳市数字经济产业高质量发展，打造全球“鸿蒙欧拉之城”，根据《深圳市培育发展软件与信息服务产业集群行动计划（2022-2025年）》部署，研究起草了《若干措施》。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/04/04b46648f800cbb2c23cbca3e2fd3820.png\" /></p><p></p><p>《若干措施》围绕鸿蒙欧拉的关键发展要素：供给侧、需求侧、生态三大组成部分，以问题为导向，针对鸿蒙欧拉生态培育和产业发展的痛点难点问题，制定有针对性的解决措施。</p><p></p><p>在培育产业主体方面，《若干措施》提出，鼓励开源贡献及开源产品开发、支持发行版企业在深发展壮大、支持设备企业采购鸿蒙欧拉模组、支持软件企业开发鸿蒙欧拉应用。其中，对开源鸿蒙、开源欧拉社区代码贡献排名前列的企业和个人开发者给予最高100万元的梯度奖励。对鸿蒙、欧拉系统发行版产品或服务销售额排名前列的发行版企业，给予最高500万元的奖励。</p><p></p><p>在深化应用牵引方面，《若干措施》提出提出加强政府及国有企事业单位对鸿蒙、欧拉产品的采购力度。各行业主管部门每年将发布一批基于鸿蒙、欧拉的政务服务、智慧城市、警务、卫生健康、教育、环保等行业数字化项目需求清单，积极向鸿蒙、欧拉产品开放应用场景。</p><p></p><p>同时，推动千行百业应用鸿蒙欧拉。面向制造业、服务业，重点针对“20+8”产业集群，每年组织评选一批基于鸿蒙操作系统的优秀示范项目，对采购应用方给予项目总投资额30%，不超过1000万元的资助。另外，促进鸿蒙产品走进千家万户，将基于开源鸿蒙的汽车，手机、电脑耳机等消费电子产品，以及电视机、空调、冰箱等家用电器，纳入深圳消费促进政策给予补贴等。</p><p></p><p>在培育生态体系方面。《若干措施》提出建设鸿蒙欧拉生态中心，支持打造鸿蒙欧拉生态国际性产业组织，加速鸿蒙欧拉人才培养，推动鸿蒙欧拉生态集聚。支持相关院校开设鸿蒙、欧拉课程，建设鸿蒙、欧拉实训实验室和实训平台，分阶段给予每家院校不超过200万元的资助。支持深圳户籍或在本市正常缴交社会保险费的人员或深圳院校的学生考取鸿蒙、欧拉有关认证，给予每人最高2000元的奖励。</p><p></p><p>《若干措施》的编制说明中还特地说明了深圳市培育鸿蒙欧拉产业的重要意义。</p><p></p><p>一是推动关键核心技术高水平自立自强。操作系统是数字基础设施的底座，我国操作系统技术体系面临对外依赖性强、供应连续性风险等问题，要想实现高水平自立自强，具备根技术的操作系统及其生态突破是必须攻克的关键一环。</p><p></p><p>二是主动把握万物互联时代新技术与产业升级机遇。万物互联的时代正在到来，新的芯片、新的操作系统、新的工具/语言/编程框架、新的智能化应用将迎来新的发展机遇。通过培育鸿蒙欧拉操作系统生态发展，主动迎接新的技术与产业升级机遇，有助于我市加快构建现代产业体系。</p><p></p><p>2021年，深圳电子信息制造业增加值5259.9亿元，增长2.3%，占全市GDP的17.2%，信息传输、软件和信息技术服务业增加值3511.6亿元，增长10.7%，占全市GDP的比重为11.5%。产业规模均位于全国前列。深圳有21家企业入选2021年中国电子信息竞争力百强企业，总量位居全国大中城市第一位。</p><p></p><p>深圳工信局认为，在软硬件领域，深圳市拥有大批潜在的鸿蒙、欧拉生态合作伙伴。总体来看，该系列措施旨在培育和吸引更多企业、更多人才、产业组织集聚深圳发展，在全国率先打造“鸿蒙欧拉之城”。</p>",
    "publish_time": "2022-07-03 17:33:11",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "从“数据孤岛”到统一数据体系，明源云DataOps实践探索之路 | 卓越技术团队访谈录",
    "url": "https://www.infoq.cn/article/HFv7gDOPLt4E5uZdKYV9",
    "summary": "<p></p><p></p><blockquote>数据运行时如何保证快稳准？规范在前、开发在后、实时运维、有的治理。</blockquote><p></p><p></p><p>采访嘉宾｜梅容，明源云天际·PaaS平台数据云事业部产品负责人</p><p></p><p>“数据”是新的生产要素已成为共识，而要挖掘数据价值，就绕不过数据管理。在数据管理层面，近几年业界有一个相关概念受到广泛关注——DataOps。</p><p></p><p>DataOps的概念自首次被提出至今已有8年，并在2018年被Gartner纳入数据管理技术成熟度曲线。从实施上看，当下DataOps仍处在发展初期，鲜少企业或团队能据此真正沉淀一套方法论或技术产品的体系。不过，随着越来越多的企业开启DataOps实践，相信令人“雾里看花”的DataOps方法体系也会逐渐明朗起来。</p><p></p><p>明源云是其中一个探索者，过去25年，明源云的数字化服务主要聚焦在住宅开发领域。随着房地产行业从过去的红利时代急转进入混沌时代，不少企业开始纷纷布局存量市场，并注重精细化管理，明源云的下一步业务战略正是沿着不动产的产业数字化方向扩展。不动产企业的发展战略趋向多元化，对于经营决策、运营服务等的需求越来越迫切，同时，明源云意识到，在企业经营管理战略上，如果数据不能保证及时和准确，数字化价值则会大打折扣。为此，过去几年在业务发展路径和客户数字化诉求的驱动下，明源云持续结合DataOps实践、探索数据治理体系的落地。近期我们与明源云天际·PaaS平台数据云事业部产品负责人梅容进行了一次交流，以进一步了解明源云DataOps的实践过程、从中收获的经验和认知。</p><p></p><h2>什么是DataOps？</h2><p></p><p>关于DataOps，一个常见的基本问题是，DataOps和DevOps有什么关系和区别？</p><p></p><p>2021年，Gartner发布的“十大数据和分析技术趋势”中有一项是“XOps”，Gartner研究总监孙鑫对此解读道：</p><p></p><p></p><blockquote>现在的分析和AI解决方案没有跟上日益增长的实践的多样性，其原因在于应用当中的DevOps的最佳实践的多个Ops学科，大家可以看到的有DataOps、ModelOps以及DevOps，造成了市场的混乱，所以Gartner把它叫做XOps。无论是什么Ops，它的目标都是利用DevOps的最佳实践去实现效率和规模经济，并确保可靠性、可重用性和可重复性，同时减少技术和流程的重复，从而实现自动化。</blockquote><p></p><p></p><p>同样地，明源云的DataOps实践也是基于Devops衍生而来。“将DevOps中使用的 CI/CD 理念应用于DataOps，实现数据横纵链路上的自动化和自主管理。”梅容表示，DataOps是数据管理的工具化和自动化的方法体系，将数据的需求设计、研发实现、发布运行、交付运维等关键流程自动化，从而提高对业务场景的价值，其同样需要将标准、流程、机制、组织和技术融合落地。</p><p></p><p>今天，企业在构建数据资产的过程中离不开数据治理，但在梅容团队看来，数据治理是方法论，它能指导大家怎么去把数据治理得准确和稳定，但它没有办法负责数据运行时的及时、稳定和准确。因此其引入的DataOps会更偏向“运行态”，并在数据应用的整个流程体系进行探索和实践。</p><p></p><h2>DataOps的探索与实践</h2><p></p><p>2017年，某个头部地产客户的数据治理和BI项目让明源云意识到一个迫切待解的问题：如何保证持续稳定的数据质量？</p><p></p><p>当时，团队在快速兑现了该客户预期的数据指标体系和管理看板后，在交付过程中却经常收到来自用户的反馈——数据错误影响业务使用。</p><p></p><p>团队在排查问题后发现是数据在定期清洗过程中，经常出现数据质量问题，其中既有来自业务的影响，如：数据来源的业务系统不规范的更新表结构；数据口径不一致，同一个指标数据在不同的业务系统有不同的表述；数据填报不规范等。</p><p></p><p>也有技术问题带来的影响，如ETL过程中某字段变更导致数据加工出错，数据处理引擎突发数据变更峰值造成链路阻塞，系统服务出现异常导致调度任务执行失败等。</p><p></p><p>当时的BI产品只能检测到系统里面的数据有没有出问题，其清洗和运行服务是不是正常，但是没有办法覆盖到数据产生端的异常问题。在这样的背景下，团队提出了“全链路的数据巡检监控和预警”机制。它可以回溯到数据产生的业务源、在工具里面对数据进行加工的清洗过程，再回溯到BI里面，把每一端的巡检来串联起来，通过OLTP逻辑去判断最后呈现的数据是否准确。</p><p></p><p>但巡检事后预警机制，并不能根本性地解决事前发生的问题。于是团队又开始进一步探索，怎么能够保障它不出问题？这相当于要在“事前”的数据研发侧做探索。</p><p></p><h4>数据建模</h4><p></p><p>前面提到，数据质量问题频出与业务端的影响有关，这里涉及一个常发生的情况是：开发人员经常改“口径”。究其原因，和管理层经常需要从不同维度去看数据有关，一旦管理层提出了基于某个指标的新的看数据的维度，开发人员可能又得重新去开发一次。</p><p></p><p>“从数据模型的角度来讲，这种需求场景往往只要在数据多维模型上增加维度或者调整已有指标的计算逻辑就可以解决。数据是衡量业务过程和管理结果的，和业务模型是一一映射关系。我们在研发过程中会做DDD领域建模，但却忽略了数据建模过程。等到要使用数据时，例如输出业务报表或者跨业务间数据指标查询时，才会考虑给数据团队提需求，此时再介入设计，识别到业务开发问题的变更成本较高，往往就埋下了技术债务，在数据治理过程中进行纠偏，处理成本和效果都不太好。”梅容指出，这一点反映出团队原先在开发前置环节的数据建模有所欠缺。</p><p></p><p>所有业务模型是相对稳定的，映射到数据模型也是一样。为了考虑功能和服务的可复用性，会进行应用业务建模，相对应的数据模型也要同步设计。业务应用研发和数据资产构建不应该是上下游关系，而应该是并行关系，通过业务建模和数据建模可以相互咬合来验证设计的合理性。</p><p></p><p>因此，为了在事前避免引入数据质量隐患，梅容团队认为第一要点是要保障数据开发人员可以基于业务建模的思路去映射完成数据模型设计，定义数据逻辑规范，然后再去切入开发过程。</p><p></p><p>这个思路类似于现在常见的应用开发流程，产品经理会去基于领域建模、基于领域的实体、对象、事件去做通用模型的设计，设计完之后，由研发人员基于这个设计去完成代码实现，去满足事件、对象以及事件对象的交互过程。</p><p></p><p>参照上述思路，团队把数据研发的过程分成了两段——先数据建模后开发。“通过我们对业务过程的分析，去定义这个业务过程中它涉及到的维度、事实，建立多维模型。”等建好了之后，开发的同学才接着做。规范在前，开发在后，它能按照业务语言和需求保持一致性，也能约束开发实现的严谨性，从而预防业务源头端引入的质量问题。</p><p></p><h4>统一数据标准体系</h4><p></p><p>“先建模，再开发”是在事前解决问题的第一类举措，团队提出的第二类举措则是在明源的体系里统一数据体系，实现“实时运维、有的治理”的数据工具。</p><p></p><p>明源云的业务系统和很多企业一样是“烟囱式建设”，每个业务系统各有各的数据服务中心。各数据服务中心的数仓构建过程、规范、标准、清洗的脚本和清洗的语句都不一样，导致严重的“数据孤岛”问题。</p><p></p><p>团队认为，要解决这个问题，要以统一数据体系为基础。为此，明源云建立了5个“1”的数据工具标准：</p><p></p><p>统一数据架构标准。所引用的大数据引擎、数据开发工具必须统一，这样才能保证开发脚本SQL语句是一样的，从而约束每个业务员出来的数据的一致性。统一基础数据标准。将各业务系统的组织、项目、人员、客户、供应商等高度共享的数据进行统一采集管理与分发，实现基础数据实体ID统一，为支撑企业数据资产沉淀做好铺垫。统一数据资产标准，即上文提到的先建模再开发，要求每一个业务板块都按照这种模式去把其数据进行规范化的治理，形成多维模型、指标模型和标签模型等数据资产，并基于模型的应用场景封装，提供标准的查询服务API。统一数据分析标准。数据分析师可以直接应用数据资产模型的查询服务，不用进行繁琐的数据准备，大大减少了SQL开发，从而保证数据口径的一致性。统一数据开放标准。面向业务数据消费场景提供统一数据共享工具，打造除BI外的智能流程引擎、自动化营销引擎、预警简讯等一系列智能数据产品。通过5个“1”，把数据的产生端、数据的生产端、数据的消费端和数据的开放端都统一，明源的业务体系里的数据才能完成标准化。</p><p></p><h4>部署和运维</h4><p></p><p>在数字化转型中，企业对于数据安全和数据资产的价值要求越来越高，不论是业务系统内置的数据中心，还是明源为企业提供数据治理服务和构建数据资产中心，都要求能够私有化，部署在国资云或者自建机房环境。团队利用Kubernetes容器应用集群化管理，能够对引擎中间件、平台服务等以应用组合包方式，进行一键部署和统一运维。整套系统云端和私有化的部署交付在30分钟内完成，并具备自动化资源调度，动态扩容等能力。</p><p></p><p>数据工具的统一应用，解决了数据管理流程化的落地性。在数据生产和消费链路中，仍然会有技术侧或者人为引入的异常。还需要在数据流程中通过巡检、运维机制的在线化保证，以规则的确定性应对结果的不确定。</p><p></p><p>明源云数据运维的基本原则如下：</p><p></p><p>业务规则穿插在设计中完成，设计即标准。不增加用户的工作量，自动形成数据质量知识库沉淀。监控先建立全局视角，分主次、优先级和处理时效。对重要场景的数据终端和基线做高优先级兑现，避免无效信息爆炸。建立业务和技术双视角的责任模式，自动定位根因指向确定的排错解决方。尊重人性，谁利害相关，谁主责解决，避免靠人线下推进导致的多方拉扯情况。通过以上原则，在工具产品中落地了全链路巡检机制，拉通业务数据库和业务应用场景，形成从数据发生、数据采集、数据处理、数据服务、数据查询和数据呈现等关键环节的规则巡检，并基于分级规则预警和推送优化建议。对运行态的风险、异常实时可知，保障数据稳定、准确和及时性。</p><p></p><h2>难题与挑战</h2><p></p><p></p><h4>技术架构选型和内部推行的阻力</h4><p></p><p>明源云在DataOps上的探索与实践之路并非一帆风顺。技术层面，在大数据技术方案选型上一直在“踩坑”和“填坑”。</p><p></p><p>据了解，一开始数据团队是基于公有云商业化的数据平台架构去做业务实践，后来发现在服务器上花了大量成本之余，也依然有很多解决不了的场景。因此，团队就坚定地选择了自建大数据底层架构的道路。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/f9/f9e636bfef9b5bc022cdd1eb2507f4f3.png\" /></p><p></p><p>据梅容介绍，一开始先做离线架构的搭建，选用Lambda架构，由于明源云的SaaS服务报表的查询并发很高，查询场景多样化，因此前后有过不少技术选型尝试，例如在离线部分，尝试过StarRocks、Presto、TiDB......</p><p></p><p>做实时计算框架也是，“当时行业流行数据湖，包括SnowFlake、Databricks等国际一流厂商都用数据湖的架构，当时我们还跟AWS的工程师去聊，想搭数据湖的架构，但像Hudi和Iceberg在前两年的时候都不太成熟，过去也是尝试过一段时间。最终从生产稳定性角度考虑没有选择数据湖，而是结合B端管理实际场景，采用CDC+自研SQL计算框架的实时监听来满足业务人员查看实时明细报表的场景；采用Flink流计算模式来满足营销等业务，基于实时指标运营的场景。基于社区版Flink的自研，把各团队使用的商业版，以及Kafka、Pulsar等消息队列进行适配改造。最终统一了技术架构，同步演进。”</p><p></p><p>梅容表示，大数据的组件不像原来的关系型数据库那么成熟，行业也一直在发展，不断有厂商去做各种各样的尝试，明源云需要结合自己的业务场景去选择最适合自己的架构。</p><p></p><p>除了技术挑战，DataOps实践面临的另一大挑战是在内部推行统一数据体系。“对于业务团队而言，虽然一些已有的数据基础设施存在一些问题，但也能基本满足业务快速迭代、快速创新的需求。但在这个人人都忙于兑现客户需求的过程中，怎么样‘对运行的飞机换引擎’，如何在契合业务快速发展对数据技术升级要求的机会下，既保留现有数据成果，又能够让大家快速应用我们的数据体系产品，以实现组织效率成本的最优化？”</p><p></p><p>“整个过程并非要大拆大建，把所有数据拉取过来进行集中式治理，而是以“分区治理、分区入湖”的模式展开。”梅容说到，“对于数据质量相对较好的业务团队，采用逆向建模方式，以结果映射的方式，对客户数据消费场景进行规范化和一致性的数据管理，以保证交付客户应用的准确性和稳定性；而对于要为客户提供数据资产价值创造的业务团队，和数据团队合作，按数据标准体系共建的方式，形成数据驱动业务价值的场景化数据中台解决方案，例如行业客户数据中台（CDP）、供应链协同平台（SDP）、企业一体化经营决策平台等。”</p><p></p><h4>数据治理的效果如何显现</h4><p></p><p>探索DataOps也让明源云更坚定了一个目标：需要从用户视角，建立一套持续、稳定、可快速复制的面向交付的数据体系，也就是让数据资产对所有的利益相关者来说都是现成的、可访问的和价值最大化的。</p><p></p><p>DataOps在明源云的数据资产体系中也会应用在交付实施的方案中，用于支撑数据业务化产品的灵活交付，以及持续稳定、准确的运维保障。</p><p></p><p>但数据治理的效果很难显性化体现，难以让客户感知到成果。这也是明源云在落地DataOps的过程中，遇到的主要挑战之一。为解决该问题，面向客户三类角色，团队把DataOps实施的成果可视化和价值化呈现：</p><p></p><p>业务视角的数据资产全景图：实时看到按业务主题域构建的四类资产多维模型、指标、标签、API服务资产等，穿透查看资产模型的生产链路，便于识别业务系统数据风险。价值视角的数据资产信息架构：包含面向高层决策的指标价值树和业务人员的指标目录，能够洞察业务发展趋势、异常变化、晴雨表现，分类管理高层和业务人员使用的指标体系。技术视角的数据地图：数仓分层的各类表清单，数据生产流程和血缘关系，体现拉通了哪些系统的数据，支撑了哪些业务场景的应用。运维视角的数据全链路巡检监控告警：基于终端用户（重点高层报表）数据消费场景，对数据采、建、用数据全链路进行自动化的巡检，主动及时地推送对数据应用的异常。</p><p></p><h2>从DataOps到AIOps</h2><p></p><p>“DataOps的设计理念是以用户为中心，用确定性的工具来解决不确定性的业务变化。”那么，一般行业上怎么解决这类不确定性的问题？</p><p></p><p>梅容进一步总结道：“第一点是有规范，怎么样都在框架内，这样就不至于说各自发散收不回来。第二点是工具化，一定要有在线化的工具，可以按照其规范一步步执行。”</p><p></p><p>需要注意的是，现阶段也有DataOps解决不了的问题，比如DataOps更多是方法论和一系列有效的工具集合，并没有业务知识的沉淀，即行业Know-how的开箱即用内容；缺乏发现和排除问题、自动修复能力；另外，DataOps目前是基于项目实践经验的规则治理，应该加入更多自学习的能力，向AIOps演进。</p><p></p><p>谈及接下来明源云在DataOps的探索，梅容告诉我们，首先是数据体系落地，即明源云产研体系里的五层数据体系，先把它做实；其次是AIops数据准确性盘点，目前DataOps更多还是要靠人去维护规则标准，后续需要能根据数据趋势去预判数据的增减对于业务是否合理等等；第三是智能化的问题排查恢复，以及最佳实践的优化建议，即基于终端业务用户的数据消费场景，事前提供数据变更时的关联影响体系，事中提供告警并针对异常提供数据血缘、生产链路关系分析，事后提供数据质量巡检规则配置加强。</p><p></p><p>电子书推荐</p><p></p><p>本文选自<a href=\"https://www.infoq.cn/minibook/TwGuGOHY5HDv3RLaeFLC\">《中国卓越技术团队访谈录》（2022 年第二季）</a>\"，本期精选了微软 Edge、蚂蚁可信原生、明源云、文因互联、Babylon.js 等技术团队在技术落地、团队建设方面的实践经验及心得体会。本期电子书已经在 InfoQ 网站上线，大家可以扫描下图二维码下载，查看更多精彩内容。</p><p></p><p>《中国卓越技术团队访谈录》是 InfoQ 打造的重磅内容产品，以各个国内优秀企业的 IT 技术团队为线索策划系列采访，希望向外界传递杰出技术团队的做事方法 / 技术实践，让开发者了解他们的知识积累、技术演进、产品锤炼与团队文化等，并从中获得有价值的见解。</p><p></p><p>访谈录现开放长期报名通道，如果你身处传统企业经历了数字化转型变革，或者正在互联网公司进行创新技术的研发，并希望 InfoQ 可以关注和采访你所在的技术团队，可以添加微信：caifangfang842852，请注明来意及公司名称。</p><p></p><p><img src=\"https://static001.geekbang.org/wechat/images/56/563da3f84d923258d994fde4864cdc1f.png\" /></p><p></p>",
    "publish_time": "2022-07-03 17:52:33",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]