[
  {
    "title": "2022年中国开源创新大赛在乌镇正式启动",
    "url": "https://www.infoq.cn/article/xoG0SH2tyH1mXe7lF2C1",
    "summary": "<p>11月10日上午，在<a href=\"https://cn.wicinternet.org/\">2022年世界互联网大会乌镇峰会</a>\"数字经济分论坛上，2022中国互联网发展创新与投资大赛暨2022年中国开源创新大赛在乌镇正式启动。</p><p></p><p>本届大赛是在中央网信办信息化发展局指导下，由<a href=\"http://www.cidf.net/\">中国互联网发展基金会</a>\"、中国网络空间研究院、中国互联网投资基金联合主办的开源技术竞赛。</p><p></p><p>党的二十大报告提出，教育、科技、人才是全面建设社会主义现代化国家的基础性、战略性支撑。必须坚持科技是第一生产力、人才是第一资源、创新是第一动力，深入实施科教兴国战略、人才强国战略、创新驱动发展战略，开辟发展新领域新赛道，不断塑造发展新动能新优势。</p><p></p><p>开源理念坚持技术面前人人平等、科学知识自由传播，有助于促进我国高科技创新人才培养，有助于我国提升核心技术创新能力，早日实现自主发展，打破特定科技领域受制于人的局面。</p><p></p><p>中国工程院院士倪光南表示：“我国信息技术的快速崛起也得益于开放源代码，在软件领域通过支持开源、运用开源，大大缩小了我们与发达国家之间的差距。今后我们还应该进一步拥抱开源，积极参与，增加贡献，发扬开放、共享、协同、共赢的开源精神，汇天下英才，与世界协同创新。”</p><p></p><p>中国开源软件推进联盟名誉主席陆首群教授认为：“中国要更加重视开源的溢出效应，<a href=\"https://xie.infoq.cn/article/57af3d8a5e89dd76d7c737ac9\">开源创新</a>\"已成为数字化转型、智能化重构的基础，成为全球的一种创新和协同模式，符合创新国家建设的战略需求。”陆首群指出，“中国开源现在已经发展到第三个历史阶段，是在经济双循环基础上规范建设和改造我国的供应链并主要在促进产业链、供应链数字化的基础上，采用取代物料表格式样的开源代码，保障其安全的历史阶段。”</p><p></p><p>诚然，如诸多科技领域一样，发展离不开人才，创新更需要人才。倪光南认为，“在全面建设社会主义现代化国家新征程中，对开源人才的培养工作也提出了更高的要求。面临新形势新任务，中央网信办指导举办的2022年中国开源创新大赛意义格外重大。”</p><p></p><p>据悉，本次大赛以“开源创新&nbsp;共建生态”为主题，设立了人工智能、操作系统、<a href=\"https://www.infoq.cn/article/AMHObrpVe29vbUpQoky3\">Risc-V</a>\"、<a href=\"https://xie.infoq.cn/article/3491e72fc39cc02438f6e61b1\">开源供应链</a>\"等十余个专业技术赛道，邀请到业内五十余位一线技术专家参与评选，整个赛程接近半年时间，面向全社会开放，企事业单位、创业团队、开源社区、大学生和个人开发者均可报名参赛。</p><p></p><p>“我们希望能够将本次开源创新大赛办成一场公开、公正、公平、公益的赛事，通过这样的赛事来为社会培养和选拔开源领域的青年才俊，为国家储备专业技术人才。”中国互联网发展基金会有关负责同志表示，“本届大赛得到了国内开源企业、开源社区、高校和科研机构的大力支持，多家开源社区共建大赛官网，可以直接覆盖国内上千万的开源爱好者。接下来上海、深圳、杭州、成都等多地开源社区还将参与到大赛的宣传和推广中来。”</p><p></p><p>2022年中国开源创新大赛已于11月10日正式上线，现邀请全国的开源爱好者，开源技术人士关注赛事官网，积极报名参赛。本届大赛由北京长风信息技术产业联盟承办，报名截止日期为2023年1月9日。报名完成后，随即进入初赛阶段。2023年4月底，大赛的决赛将如约而至。</p><p></p><p>大赛将为从事开源技术研发工作者提供与同行交流切磋、展现自身才能的机会。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/99/992ede35bffb8b436cbd1e0a451ad92e.png\" /></p><p></p><p><img src=\"https://static001.geekbang.org/infoq/38/38cf214a456b6db3abb14a2c9f43e048.png\" /></p><p></p>",
    "publish_time": "2022-11-11 00:11:10",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]