[
  {
    "title": "Vitalik Buterin：以太坊只完成了 40%，开发人员将经历五个阶段",
    "url": "https://www.infoq.cn/article/WKvcMUAoqdYF4ie7hxxf",
    "summary": "<p>7 月 21 日，Vitalik Buterin 参加在巴黎召开的以太坊社区会议（ETHCC），并针对以太坊合并进度以及以太坊未来路线图发表演讲。</p><p>&nbsp;</p><p>Vitalik Buterin表示，比特币的拥护者认为比特币已经完成了 80%，但以太坊的支持者认为以太坊只完成了 40%。以太坊的开发人员将会经历五个长期阶段：The Merge、The Surge、The Verge、The Purge和The Splurge，以太坊在完成 5 个关键阶段后可实现 10 万 TPS。</p><p>&nbsp;</p><p>Merge 是指从 PoW 转移到 PoS，即将以太坊主网与信标链合并。Vitalik表示，Merge只是以太坊发展之路上的一小步，后面四个阶段是以太坊扩展、清理和演变的关键部分。&nbsp;</p><p>&nbsp;</p><p>据悉，The Merge目前已完成90%，只需要在Ropsten上进行测试。一旦“合并”成功发生，验证者就能提取他们锁定在ETH 2.0存款合约中的ETH。预计今年 9 月完成合并之后，以太坊仍将仅完成大约 55%。</p><p>&nbsp;</p><p>Surge是关于以太坊引入分片的，完成后，以太坊网络将更快地处理交易。Verge是关于引入Verkle 树的，旨在优化以太坊上的存储并帮助减小节点大小，最终提升网络的可扩展性。Purge旨在减少减少验证器所需的硬盘空间，消除历史数据和坏账，从而简化存储，减少网络拥塞。Splurge是一系列杂项，包含「较小」的升级，确保网络在前 4 个阶段之后平稳运行。</p><p>&nbsp;</p><p><img src=\"https://static001.infoq.cn/resource/image/c0/4b/c055209255c63b9c6af7ec9318b1964b.png\" /></p><p></p><p>此外，Vitalik 表示，我们正处于一个通过协议快速变化从而提升以太坊能力的阶段。但最终我们将停止对协议进行快速更改，并利用 L2 等系统为以太坊生态系统添加更多功能。其中，L1 用于安全性和可靠性，L2 用于快速迭代操作。</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "publish_time": "2022-07-25 10:06:22",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "研发体系支撑价值驱动的业务创新 | GTLC 南京",
    "url": "https://www.infoq.cn/article/DtABEMxU7zypMHg2zG9r",
    "summary": "<p>2022 年 7 月 16 日，由 TGO 鲲鹏会主办的 GTLC 全球技术领导力峰会·南京站成功召开，吸引全球 200 余位 CTO、技术 VP、CEO 等科技领导者参与。</p><p></p><p>会上，有赞技术 VP、顾问，TGO 鲲鹏会 (杭州) 负责人沈淦（怀民），发表《研发体系支撑价值驱动的业务创新实践》的主题演讲，分享从宏观经济到细节落地，包括业务如何转型，技术团队怎么配合业务等内容。我们将演讲内容整理如下，以飨读者。</p><p><img src=\"https://static001.geekbang.org/infoq/06/068593acecdc0a1f33f5cfdaa73111ea.jpeg\" /></p><p></p><p>我们技术同学内心特别认同价值感，相信很多事情是用愿景和梦想支撑的。但技术同学要追求梦想，就一定要了解你服务的那些人是怎么生活、工作、思考问题的，所以我去做混沌的领教，为了接触更多创业者，了解大多数没有技术背景的人如何看待问题。我认为技术同学要相信代码的力量是巨大的，特别是在数字化时代。所以我分享的内容会从宏观到细节落地，包括业务如何转型，我们怎么配合业务。</p><p></p><h3>旧经济 vs 新经济</h3><p></p><p>首先看经济。我默认大多数同学现在的企业都面临像我服务企业一样，正在经历生死考验，我们是亲身经历者。但前几年，大家的思维方式和现在大不相同，都在考虑我怎样做一件伟大的事。这两张图片大家都很熟悉，这两个看上去很像的场景，一个是诺曼底登陆，表示规模化，活得好；第二个是敦刻尔克，考虑的是有序撤退，这是很有意思的对比。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/c6/c66a74051dd13e0b0b1ab3a50da6a2fe.jpeg\" /></p><p></p><p>怎样活得好？疫情对我们影响太大了，其中有两个关键时间点：一个是刚开始 2020 年武汉，第二个是 2022 年上海，这两个时间和地点对中国经济产生了非常深远的影响，不光影响到整个 GDP，还影响了很多企业家的心态。国家统计局 Q2 的数据已经发布，从数据上观察，消费没有太大变化。另外一个数据是失业率，现阶段失业率基本和 2020 年持平。这些数据客观上变化不大，但对信心的影响是巨大的。还有一个很关键的数据是国家财政投入。经济增长包括投资和财政两方面。财政投入一般会在半年后起效，所以 2021 年 8-11 月国家财政都是超前投入，可以预判到 2022 年底国家经济形式一定是向好的。所以少上网，多看国家统计局财报，这才是国家经济的走向。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/ac/ac3a4fe4308ea7ffd0cec9133dde13d5.jpeg\" /></p><p></p><p></p><p><img src=\"https://static001.geekbang.org/infoq/8b/8be38b629e888bf4b2fc9c6f56a95faa.jpeg\" /></p><p></p><p>中国经济的底层范式发生了很大变化，以前是绝对经济优先的模式，当整体投入达到一定量级，就会发现第三产业或某些细分领域过于集中，所以开始强调可持续公平化、数据安全。这带来一个变化，就是我们以前活得特别好的行业被明显压制，另外一些新兴企业被扶持，但目前正处在过渡期，所以我认为这几年是中国出现一线企业的又一个黄金时期。</p><p></p><p>那么新经济和旧经济模式的主要差别是什么？旧经济指通过模式创新占领新市场或扩大市场规模，产生规模效应，占据行业领导地位，进而获利的业务模式。有很强的先发优势。新经济的特点是围绕业务场景，以核心能力 + 场景的模式构建产品服务矩阵。</p><p></p><p>旧经济发展到一定的阶段就会内卷。当产品无休止地迭代，我们就会学习对手，但总会发现有速度更快的对手，而且客户往往不买单。这个情况下对技术团队的要求就是速度要快，打造技术团队超 (无限) 高的交付效率，跟着业务一起卷。卷的时代只是历史时代的产物，并且带来了巨大的势能，给中国奠定了广泛的数字化环境和数字生活习惯。但现在发现卷不动了，我们还没有练就数字化真正的内功，但是环境有了，习惯有了，内功自然会有，只是过程我们还在探索。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/03/03e3a4c2dc7fbdbbb51f615b994e63bd.jpeg\" /></p><p></p><p>再看中国新经济下企业的特点，就是内核 + 强势产业链的模式。中国的制造环节在全球是绝对领先地位，产业链完整，效率非常高。短视频我理解也是产业链，因为中国的内容制造很强大，包括生活家电代工做出海势头强劲，不仅价格便宜，而且功能强大、迭代速度快，所以在海外市场巨大。因为产业链能力特别强，我们称它为科技外溢。例如将在电动车行业应用广泛的无极电刷和健身融合起来，避免运动中对身体的伤害；以及在医疗产业链上应用很广的冻干技术，现在可以用来制作咖啡；这样的例子还有很多。旧经济强调规模，新经济强调价值创造；旧经济强调狼性，新经济强调柔性；旧经济强调单极最大化，新经济强调端到端闭环。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/8a/8ac2100c88188b0fbd372f2d1b1107cb.jpeg\" /></p><p></p><p></p><h3>价值驱动的业务模式对研发体系的要求</h3><p></p><p>我们技术和业务的结合分为几个阶段，第一阶段是神秘主义，技术和商业中似乎有一道护城河，中国现在已经跨过了这个阶段；第二阶段是协作，其实就是卷王时代的特点，技术按需求工作，协同执行业务目标；第三阶段是技术引领的差异化，技术和业务边界模糊，强调的是技术怎样使业务快速试错。因为技术内核已经确定，在哪个场景能把内核的价值放大，是需要快速试错的；第四阶段是技术同学的梦想，就是代码主宰一切，可能是将来元宇宙带来的时代。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/fa/fa340540ff961a2f67ad69ffa8281fc1.jpeg\" /></p><p></p><p>价值驱动的业务模式是很简单的模型，它核心点是要把一个业务价值形成端到端的流动。无论是战略、策略、价值评估体系、交付体系、成本，最后关键是要围绕试错，让它流动起来。流动就是端到端的价值创造，从客户需求出发到客户价值交付，形成闭环。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/9b/9ba7a9cc8ff821d593bddcd13fe88255.jpeg\" /></p><p></p><p></p><h4>找价值</h4><p></p><p>端到端实践分为四个步骤：找价值、设指标、拆流程、建团队。这四个步骤的关键是顺序，因为一旦把团队放在前面，肯定会围绕团队定流程、设指标，就会很麻烦。首先是定义价值，通过用户故事，实现端到端的快速交付。会设定两个关键指标，有时候我们也会纠结定义外部指标还是内部指标为主，后面我们发现，“小孩子才做选择，成年人都要。”——外部指标和内部指标各定一个。外部指标定义的是交付效率和准确度，围绕价值部分，即能够为客户带来什么；内部指标关注闲置时间和成本，主要围绕流动的部分，因为一件事只有流动起来，才能从本质上提高效率。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/8b/8b9d80deeb02616a2ccf2fde34a55695.jpeg\" /></p><p></p><p></p><h4>定指标</h4><p></p><p>指标体系的定义方式它包含 OE 和 KOL。我们把指标拆成两步，一部分是结果性指标，就是刚才讲的内部指标和外部指标。第二部分是过程指标，一定要围绕结果指标拆解过程指标。过程指标是一个复杂体系，我自己带团队的一个最有效的拆过程指标的方式，也是一个四步法。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/a4/a49bb372164b2c8767f3ccda237efea9.jpeg\" /></p><p></p><p></p><h4>拆流程</h4><p></p><p>到底是定义流程还是拆解流程，我们也纠结过很久。拆解过程第一步是真实还原现阶段的工作，从流程管控到需求管理，要做的是拆，而不是定义。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/16/163d211293076e8e950c7baf1a20cd2c.jpeg\" /></p><p></p><p></p><h4>建团队</h4><p></p><p>到最后建团队就很容易了，因为前面一系列流程完成后，就看现在的团队中人员是否匹配，建团队实际上是调整团队的过程，包括调整团队的结构和成员分工等。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/c2/c2a915071f3b498f9521c7ff5bd32069.jpeg\" /></p><p></p><p></p><p><img src=\"https://static001.geekbang.org/infoq/b6/b6575c3eafe1796d1880c56eef688b1a.jpeg\" /></p><p></p><p></p><h4>实践过程</h4><p></p><p>首先，使用用户故事工具，来提高需求匹配的程度，把讲故事作为整个团队工作的核心。只有跟客户一起讲故事，才能围绕价值创造推进项目。用户故事最有价值的地方是建立一公里宽，还能做到一公里深。我们以前的需求是全，能做到一公里宽，但只有一厘米深。用户故事很简单，难的是端到端都相信用故事来驱动工作。我们说服研发团队围绕用户故事做构建，按照用户故事的颗粒度来定义 Future，我们把它定义一个新的概念叫用户故事集，这是对团队心智的挑战。最难的挑战是围绕用户故事做交付。我们一个项目两个月做交付，会两周做一次客户业务部门参与的 Demo 日，真正落实的程度非常高。全流程端到端做用户故事是最重要的实践价值。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/25/258e508dc8b6c501980d0957e718da70.jpeg\" /></p><p></p><p>第二，价值理论很重要，但手感更重要，一定要循序渐进。刚开始我们的流程非常细致、特别复杂，结果没人配合，不起作用。于是我们精简流程，围绕用户故事和主线，遵循少就是多的定义，允许任何一个团队对数据看板上的节点各自调整、灵活定义，自动化流程。以前看板给大家的感觉是管理工具，现在是能够有真实帮助的工具，效果会好很多。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/35/357b0bef3473190385a72418d135c85c.jpeg\" /></p><p></p><p>第三，在工具上服务 Demo 日。让大家真正有体感的东西才有价值，我们后面又做了一次迭代，真正关注价值流动，在看板上很明显地展示出价值流动的特征，让大家一目了然。做迭代不能拍脑袋，一定要建立自己的度量体系，以数据为本。数据采集是一个非常艰苦的工作，所以我们的看板全部采取自动化流程，真正把工作详细拆解后，很多同学才发现究竟在哪些地方有卡点。</p><p></p><h3>端到端 XasCode，把美好愿景变成日常</h3><p></p><p>托马斯库恩在《科学革命的结构》里讲得最重要的观点，大部分的科学研究并非从零开始发现世界的过程，而是对原有的范式承诺内的问题进行回答。回到刚才说的工作中，会发现在在价值流动过程中，在价值创造上投入的精力，远远低于适应环境和配合的环节。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/f3/f3e502a7cd6da6de6fb0b01a7e0af136.jpeg\" /></p><p></p><p>研发实践中，存在大量的人与人的沟通，最耗费精力的是知识传播。如何把知识传播从人与人变成另外一种模式？就要用到 XasCode。所有的交互分两部分，流程可以把更多人与人的交互变成人与机器的交互。XasCode 的价值就是大幅度提升人与机器的交互能力。</p><p></p><p>人与机器的交互有两个主要动作，一个是业务需求的知识传播，就是客户的价值导向；另一个是数字资产的知识传播，在以前的系统上构建新的价值。我在业务需求的知识传播中，主要的动作是测试工程化到需求工程化；在数字资产的知识传播中，主要是能力实现、能力使用、能力学习三部分。测试工程化主要是功能测试，很多同学会在测试平台上面一点点记录，我觉得这个不是工程化。工程化需要有工程结构，所有的知识管理都在上面，跟交付项目一起走，包括接口测试。测试的内容是代码，所有的测试动作和结果都是代码的一部分，也就是 XasCode，测试工程化。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/25/257647c8429b6dc2286e133114c22de2.jpeg\" /></p><p></p><p>第二部分是能力中心，也就是数字资产工程化。我们通过产品化的方式——能力中心，使整体结构化。第一部分是偏架构师的部分，叫做能力领域化，能力一定要被产品化、工程化，而不是仅仅停留在大图上，否则就会非常难推进。第二部分是能力实现，从价值推动的角度看，会发现实现是最容易，却最没有价值的事情，价值的使用才有价值。能力的使用和学习才是能力中心中最重要的。例如我们的商品查询有 20 几个，到底用哪个好？从文档是看不出来的，如果找到个人可以得到结果，但知识的传播成本很高。所以需要制定能力的使用规范，也叫作 API 标准化。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/a5/a516ec70fc7adf100849834d4dc76081.jpeg\" /></p><p></p><p>真正用的过程要能够传播速度快，称为业务可视化。例如需要在某个板块添加一个功能，我们会直接通过流量回放看到业务视角，看到线上真实的流动状况。这其中有一个坑，在微服务下的动作，一定要把所有设计思路代码化，坚决不要搞大平台式。我们曾经做过微服务统一发放的配置中心，结果上线后发现它的配置发放要逐个排队，这是血的教训。</p><p></p><h3>总结</h3><p></p><p>数字化时代研发体系要打造价值驱动，其中最主要的是端到端流程的闭环。拆解开主要是两大目标，一是围绕价值的工作，二是要让工作流动起来。最后一定要相信代码的力量，特别是代码驱动数字化世界。XasCode 是我自己追求的大方向，但目前还是碎片化的，期待有更多同学一起打造一个端到端闭环的 XasCode，谢谢大家！</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/3d/3d39108fde363930f97a88046bf047d8.jpeg\" /></p><p></p><p></p><h4>关于 TGO 鲲鹏会</h4><p></p><p>TGO 鲲鹏会是极客邦旗下科技领导者聚集和交流的组织，学员由 CTO、架构师、技术 VP、具有技术背景的 CEO 等组成，目前已经在北京、上海、深圳、广州、杭州、成都、硅谷、南京、台北、厦门、武汉、苏州等 12 个城市定期举办学习活动。</p><p></p><p>TGO 鲲鹏会采用了“学员共建”的组织形式，希望通过“共建、自治”的方式维护各城市的健康发展，为学员提供必要的服务，帮助学员个人更好地学习和成长，助力学员企业之间更好地合作与交流。加入 TGO 鲲鹏会，全方位提升自身价值，成为卓越科技领导者！</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/70/703f15f0a59ea2978ea29a98f21be028.png\" /></p><p></p>",
    "publish_time": "2022-07-25 10:35:02",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "有度量才有真管理 研发效能的度量体系建设实践 | GTLC 南京",
    "url": "https://www.infoq.cn/article/5LMB6Mtp7NIW7OawVLZT",
    "summary": "<p>2022 年 7 月 16 日，由 TGO 鲲鹏会主办的 GTLC 全球技术领导力峰会·南京站成功召开，吸引全球 200 余位 CTO、技术 VP、CEO 等科技领导者参与。会上，数禾科技 CTO、TGO 鲲鹏会（上海）学员陈东，为与会嘉宾带来《研发效能的度量体系建设实践》的主题分享。我们将演讲内容整理如下，以飨读者。</p><p></p><p>近两年，互联网行业的增速明显下降，无论公司规模大小都有一个共同的诉求，就是如何降低研发团队的成本并增加效能。</p><p></p><p>今天我会围绕《研发效能的度量体系建设实践》这一话题，将自己带领不同规模研发团队所积累、沉淀下来的思考和实践，从度量体系对于研发效能的意义、度量体系的建立原则、度量体系的架构设计与案例、度量体系的系统运营，共四方面为大家进行分享。</p><p></p><h3>第一，度量体系对于研发效能的意义</h3><p></p><p>提高研发效能的方法非常多，比如引入先进工具、优化工作流程和调整组织结构等。不过无论用什么方法，最终都要回答一个问题：研发效能提升了吗？提升了多少？如果回答不出这个问题，前面许多的工作是无法证明它的价值。因此，研发效能的度量很重要。</p><p></p><p>管理大师彼得·德鲁克讲过，“没有度量就没有管理。”管理者的一项重要职责，就是思考如何做好度量，以及基于度量做决策。</p><p></p><p>然而度量并不好做，为什么？因为没有理解度量体系建设的本质——研发管理思维的数字化转型。很多研发团队的管理者主要凭借主观感觉来对团队成员进行度量，对研发团队的能力，缺乏量化、数字化的判断标准。大多研发团队都是在帮公司做各种业务的数字化转型，但其自身工作方式却是“拍脑袋”决策，从这个角度来讲，不做度量体系管理的研发团队，就是公司数字化转型的最后一块短板。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/b8/b858358915dc15b9402be7739966da9b.jpeg\" /></p><p></p><p></p><h3>第二，度量体系的建立原则</h3><p></p><p>度量体系建设的目的是在帮助公司进行数字化转型的同时，实现研发团队的数字化转型；研发团队不能只知道埋头苦干，还要学会“抬头看天”——团队开工前定下度量体系的原则指引，以免团队之后的工作变形。</p><p></p><p>原则一，以客户价值为导向，不追求完美，但要能体现当前痛点。从客户和产品的角度思考，明确客户是谁，他们关注的痛点是什么，以及度量体系是否反映出客户当前的痛点。在开始实践时，不要追求建立完美的度量体系，因为所花费的人力成本很高；建立一个符合公司现状、满足业务痛点的度量体系更为可行。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/fd/fde0c2acec708fd53f25b5c1a18804be.jpeg\" /></p><p></p><p>原则二，以团队主要工作流程为线索，建立研发流程的度量。度量体系指标选取选取逻辑是以团队的主流程为线索，从主流程选指标来搭建研发效能的度量体系。除主流体系的之外的其他指标都不是重点指标。</p><p><img src=\"https://static001.geekbang.org/infoq/53/53498e65a25b1a74d2759bf697c7ca06.jpeg\" /></p><p>原则三，度量体系需要有层次，不同的人关注不同的指标。整个度量体系指标需要有层次，不是简单的指标罗列，因为不同的人关注不同的指标，所以要对指标进行分层。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/35/35d73355b8f1ab55671d3d4457a5ba2d.jpeg\" /></p><p></p><p>原则四，度量体系需要不断迭代。这与原则一相关，度量体系的指标要反映客户的痛点，若痛点解决了，这个指标就没有必要考核了。接下来，还需要去思考当前的痛点是什么，指标权重和考核方式是否要做修改，整个指标体系处于不断地迭代状态。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/b2/b24c6baaf68f8f8ce5f45d2c1b84a51c.jpeg\" /></p><p></p><p></p><h3>第三，度量体系的架构设计与案例</h3><p></p><p>有了上述四点原则做支撑，如何进行下一步实施呢？具体分三点：第一，度量体系的指标选取；第二，度量体系的分层架构；第三，度量指标的几个讨论案例。</p><p></p><p>度量指标的选取维度。比如，如何判断一个团队好不好呢？答案是“多快好省”，这四个字基本上可以覆盖大部分对研发团队研发效能的要求。进一步来看，“多”对应“产能”，“快”对应“响应力”，“好”对应“质量”，“省”对应“成本”，因此产能、响应力、质量、成本就是对研发团队进行度量的四个维度。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/0d/0d782dba9a1f7d444ea38c59e875bfeb.jpeg\" /></p><p></p><p>但是四个思维没有必要全做，可以排优先级的。根据第一个原则：要以客户的价值为导向。研发团队的客户是谁？是业务团队 。业务团队关心研发团队的“响应力”、“质量”和“产能”，对这三个维度再排优先级，则是质量第一，响应力第二，产能第三。</p><p></p><p>为什么质量是第一？可以反过来思考，如果质量不好，响应力越快，产能就越高，线上的 Bug 就越多。当 Bug 增多时，线上系统就会呈现崩溃的状态。这说明，没有质量保障的产能是无效的；而从另一个角度来看，若产品质量做得好，会间接促进响应力和产能的增长，因为工程师从线上紧急问题响应环节节省的时间，可以投入至原来规划的研发工作，更好保证了响应力和产能的提升。</p><p></p><p>但是只选质量这个维度是不够的，因为它太片面了，也不是客户唯一需要的。研发团队要将质量和响应力两个维度同时做起来并做得足够好，才能最小化的满足客户痛点。</p><p></p><p>如何具体设计指标。设计指标需要分层的思考，因为不同的人关心不同的指标。比如对外进行交付，业务团队关心的指标比较简单，我们列出了两个大类、四个指标。在响应力维度，关注需求的按时完成率和需求交付时长；在质量维度，关注故障的数量和故障时长。对外交付的研发项目指标不需要太复杂，掌握四个核心指标就可以。</p><p></p><p>真正复杂的是对内面向过程管理的指标设计，如何拆解上述四个指标、指标落地路径如何实现，才是研发效能度量体系建设最重要的环节。因为上述四个指标不是可以轻松达成的，并且四个指标中至少有存在两个明显问题。</p><p></p><p>问题一，在需求交付时长上存在度量是否精准的问题。需求从提出到上线之间经历的环节众多，有非常多的角色和岗位都在参与，甚至有来回拉锯的情况，因此如何定义需求的交付时长存在问题；此外，不同需求的颗粒度也是不同的，有的需求可能要花一个月交付，有的需求花一天就可以，因此需求的力度如何度量准确也存在问题。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/fd/fd67b558950dcab459d9d6098b7a08e7.jpeg\" /></p><p></p><p>问题二，在故障数量上存在指标稀疏和指标滞后的问题。根据经验，每一个研发部门，每季度的故障数一般是 0 到 1，表现差一点会到 2；如果一个部门的故障数量按季度统计的话，可能就是 0、1、0、1，这样的数据是没有统计意义的；还有，如果一个季度中的前 2 个月一直没出事故，但这时就能保证质量真的好吗？不一定。如果只是简单看“零事故”这个指标，而不做任何的管理动作，是存在隐患的。当事故真正发生时，再做任何的事情这个指标也已经改不回来了。滞后性的指标，没有办法进行日常的优化。因此，如果做不好内部的管理拆解，就很难向业务团队保障最终的响应力和质量的交付。</p><p></p><p>对内的度量体系指标的设计方面，可以先将需求、设计、开发、测试、发布、运维主流程拉出来，在主流程中看每个环节的响应力和质量，这是选取指标的核心的逻辑，像是考勤、满意度考评这些指标都不需在考察范围内。</p><p></p><p>研发流程支撑指标众多，也不一定都有效。首先，从需求角度来看。理想的度量区间，是从业务开始提需求到最终发布。但是现实往往只能度量和管理设计和开发这两个环节。前面的需求环节，因为有大量的与业务团队来回拉锯讨论的时间，所以只能观测不能考核。后面测试的环节需要在测试环境里去进行验收，只要没有验收通过，是不会往下发布的。所以，为了让整个的研发效能的流程和度量的区间变得更加合理，我们做了以下改变。</p><p></p><p>第一，提供了一个预发环境，将业务验收环节从测试环境中剥离。测试环境完全回归到研发团队里，把可控的度量空间延长，从设计、开发、测试延长到了预发部。对于头尾两部分，业务的验收和前面需求的沟通是作为观测指标进行观察，虽不考核研发团队但会进行分析，以及与业务团队沟通，使整体效能有更大的提升；第二，对于“需求颗粒度”不一致的问题。我们把需求拆解成不同的 Story，通过考核 Story 的交付时长，相对统一了考核口径，使得交付时长的统计数据也变得有意义。</p><p></p><p>接下来是工程师开发。工程师开发中有一个经典指标叫“缺陷密度”，公式为：加权的缺陷数 / 代码行数 = 工程师的缺陷密度，意思是代码写得越多，缺陷数可能会越多。但是如果按这个指标的设定，会存在有效的代码行数定义不清楚，以及工程师没有动力优化代码，对团队带来负面导向。</p><p></p><p>业界还有一个更成熟的理论，即不考量代码行数，转而考量“功能点数”，公式为：加权的缺陷数 / 功能点数 = 工程师的缺陷密度。但是这个考量方式需要人工预估功能点数，若没有专业的人员去做功能预估，是会耗团队工作量，在实际操作中不一定对所有的公司都适合。</p><p></p><p>因此我们最终采用的是第三个方案，我们用“工作量”来代替，公式为：加权的缺陷数 / 工作量 = 工程师的缺陷密度，工作量指工程师登记的工作时长。其优点在于它相对比较简单，工程师可以自主提交工作时长。当然也可能存在填写时长过长的问题，不过这一弊端有制衡的因素，如果把工作量填得很大，那响应和交付时长就会变长，从而影响产能，这一制衡因素可以避免做假和偏移的情况出现。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/15/1503ad27cea1d17753fd660c2dce7156.jpeg\" /></p><p></p><p>下一个环节是测试。测试有一个经典指标，叫缺陷逃逸率。公式为：缺陷逃逸率 = 生产缺陷数 / （测试缺陷数 + 生产缺陷数）），但是这个公式会把刚才提到的预发环境和放 10-20% 的流量的灰度环境跳过了，只能看到生产环境的缺陷。而前两个环节，发现问题概率是最大的。</p><p></p><p>因此我们重新定义了一个发布缺陷数的概念：发布缺陷数 = 验收缺陷数 + 灰度缺陷数 + 生产缺陷数，只有把所有客户感知到的环节记录下来作为分母，才能更好的反映我们的客户价值。因此缺陷逃逸率公式变成，缺陷逃逸率 = 发布缺陷数 /（测试缺陷数 + 发布缺陷数）。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/df/df81313c2a0cd8c2daf60948851ba812.jpeg\" /></p><p></p><p>最后，故障数量的改进。对于内部团队而言，考核的是事件处理，而不是事故本身。团队每周都会接到告警、业务反馈的线上问题，这些告警和线上问题不一定是事故，但的确是反映了当前系统的问题。对于每周都会发生的事情，我们会进行相关的响应力和质量进行考核，每周也都会对上一周的事件进行复盘，把对事故的管理转变成对事件的管理。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/59/59ec0214828dd5a808722f27f17de447.jpeg\" /></p><p></p><p>总结一下，度量指标需要客观反映现状，避免主观打分；度量指标尽可能在前后环节、响应力和质量之间有制衡；度量指标需要尽可能覆盖全流程，避免只关注拒不缓解；度量指标需要可频繁观测，指导日常工作。</p><p></p><p>再次强调一下度量的重要性。提升研发效能方法非常多，比如培养团队的研发能力、流程优化等，这些事情都可以做，但是很漫长。最简单、快速、有效的方法，就是把度量指标定义和调整好。只要大家能看得到正确的度量指标，团队自然有动力和方向去优化自己的研发效能。</p><p></p><p></p><h3>第四，度量体系的系统运营</h3><p></p><p>上述所讲都是度量体系如何建立，它只是一个模型，真正运行还需要系统支持，所以要做系统化、做自动化、做可视化。</p><p></p><p>我们打造的这套系统，拥有底层的基础系统层、中间的逻辑层以及最上面的展示层，通过这套系统，可以更便捷地使用和管理数据。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/6b/6b3645435fb438a3aee247790c86a8dd.png\" /></p><p></p><p>这套系统能够实现一定程度的自动化数据采集、数据分析以及自动化运营。如果没有做好数据自动化采集，整个体系是建立不起来的。必须基于底层研发工具，自动抓取工程师在这个上面工作的时间和状态，实现自动化采集数据。对于自动化运营的思路是，当指标发生偏离的时，主动去告警和推送。</p><p></p><p>在整个体系的日常运营管理上。要明确责任主体，即谁为研发效能指标负责。我们定义的主体是研发部门，让部门承担这个指标，不考核个人。如果考核个人，个人就有可能对这些指标动手脚，因为所有的数据都是由工程师在工作中产生的，如果知道这个指标会直接考核到他的绩效，就会基于数据本身做优化，而不是基于事件优化，所以我们不考核个人。</p><p></p><p>另外，日常运营中要周期性跟进。每周把数据贴出来让大家看，然后进行考评，自然而然整个团队就会投入更多关注，会做得越来越好。</p><p></p><p>最后，指标是要迭代的，只有不停的更新迭代，才能不断的进步。如果不去迭代、更新这些指标，最后很可能是每个季度的考核都是一百分，失去了度量地意义。所以，度量指标一定要调整，并聚焦在做得不好的地方。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/ce/cee82fb7fdf169088fdaca4d4bbfff6f.jpeg\" /></p><p></p><p>最后我想用一句话来结束今天的演讲：度量是为了改进。要以客户价值为导向，体现当前痛点，才能找到正确的前进方向。感谢大家的聆听！</p><p></p><h4>关于 TGO 鲲鹏会</h4><p></p><p>TGO 鲲鹏会是极客邦旗下科技领导者聚集和交流的组织，学员由 CTO、架构师、技术 VP、具有技术背景的 CEO 等组成，目前已经在北京、上海、深圳、广州、杭州、成都、硅谷、南京、台北、厦门、武汉、苏州等 12 个城市定期举办学习活动。</p><p></p><p>TGO 鲲鹏会采用了“学员共建”的组织形式，希望通过“共建、自治”的方式维护各城市的健康发展，为学员提供必要的服务，帮助学员个人更好地学习和成长，助力学员企业之间更好地合作与交流。加入 TGO 鲲鹏会，全方位提升自身价值，成为卓越科技领导者！</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/4c/4c5129d041d7023b2c328ccaa1b96277.png\" /></p><p></p>",
    "publish_time": "2022-07-25 10:39:10",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "精进式创业：以无所不学 对抗无所不知 | GTLC 南京",
    "url": "https://www.infoq.cn/article/tDcG0Cwqta3LKgN8X742",
    "summary": "<p>2022 年 7 月 16 日，由 TGO 鲲鹏会主办的 GTLC 全球技术领导力峰会·南京站成功召开，吸引全球 200 余位 CTO、技术 VP、CEO 等科技领导者参与。会上，极客邦科技创始人兼 CEO &amp; TGO 鲲鹏会发起人、校长霍太稳，发表《以无所不学 对抗无所不知》的主题演讲，分享自己在 15 年创业路上所总结的重要经验以及踩过的坑与感悟，为想创业或正在创业的伙伴提供参考。我们将演讲内容整理如下，以飨读者。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/98/98b9d23bef47969b2ce4c70e464ca105.jpeg\" /></p><p>四年前，我在 GTLC 全球技术领导力峰会·北京站做开场致词时，与大家分享了关于 CTO 下一步发展方向的话题。当时我抛出的一个问题是，CEO 如果要从 CTO、COO、CMO 中选出替代自己的人选，那么他最应该选的是谁？</p><p></p><p>如果这个问题放在十年前，我觉得 CEO 会毫无疑问的选择 COO 或 CMO，因为这两个职位在当时是能给公司带来最大营收的；</p><p></p><p>不过，四年前我抛出上述问题时，情况已经发生了非常大的变化。很多公司都变得更具科技属性了，他们已经在关注黑客增长，用科技手段获取更多流量和发展机会等。</p><p></p><p>在这四年的时间里，我看到很多 CTO 在努力地“向上走”，在此过程中，不仅需要技术领域的技能提高，还需要管理、财务、投资、沟通等知识的大幅提升。而 TGO 鲲鹏会也把上述有助于学员实现“向上走”的核心内容，贯穿到所有的课程、线上分享、GTLC 峰会等活动中，为学员们的职业发展助力。</p><p></p><p>回到今天的话题——\"以无所不学，对抗无所不知\"，其实就是想和大家分享自己创业历程中的总结与反思，包括疫情期间自己的一些感悟。</p><p></p><p>“无所不学”中应该学什么？第一，是学习常识；第二，学习沟通；第三，学习技术与业务的结合。下面我介绍的无论是“经验”还是“坑与感悟”，都与这三点非常相关。</p><p></p><p>很多人说创业是九死一生，我觉得这个表达有点乐观，特别是疫情期间，大批公司都倒下了。希望我今天分享“创业的 5 个经验”和“创业的 5 个坑与感悟”，能够给大家带来一些小小的帮助。先从经验开始：</p><p></p><p>第一个经验，也是创业最重要的三件事：找人找钱找方向，谈梦谈情谈共赢。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/5e/5e25881a28aaa7a868469cc995de4161.jpeg\" /></p><p></p><p>总结出这一理念与 TGO 鲲鹏会的一位学员也是分不开的。这位学员是一家公司的联合创始人，在一次交流时，我问他现在的主要工作是什么，他就讲了上述内容，原话中还有一个“分赃愉快”的横批。这些大白话的背后，其实是对事物本质的深刻理解。</p><p></p><p>一个有发展前途的公司，要具备技术、产品基因。2017 年是极客邦科技发展的分水岭，公司建立了研发团队，开始有了上述基因。在 2017 年前，极客邦科技在与投资机构沟通时，其估值基本就是营业收入的一倍，比如，1 亿元营收对应的公司整体估值就是 1 亿元；但是有了研发团队后，公司的估值明显提高，比如有 2 亿元营收，而公司估值则能达到 10 亿元。</p><p></p><p>数字化会让整个公司的运转效率大幅提升，但更重要的是，随着数字化、科技含量增加，公司的市值、估值也随之提升。很多公司拥抱数字化的一个重要原因是，通过数字化进行市值管理。</p><p></p><p>当前，科技管理者、技术人员不仅在公司业务的发展过程中扮演着举足轻重的角色，而且对公司的估值也起到放大器的作用。大家要更有信心，今后再与公司 CEO 交流时，可以有更多的沟通维度去体现自身价值。</p><p></p><p>不同发展阶段的公司，需要外部资本的类型也不一样。过去四年，极客邦科技每年的融资都有非常明确的目的。第一轮融资来自于慧科教育，其创始人是一位极具融资经验的专家，我特别想和他学习相关经验，就邀请他加入到我们的团队，做天使投资人；</p><p></p><p>后来极客邦科技希望切入知识付费领域，因此 Pre-A 轮接受了得到的投资，并很快借鉴得到在内容、团队方面的成熟经验，公司业务重心也在 2017、2018 年出现了非常大的转变，从原来的媒体社区转变到知识服务；极客邦科技的 B 轮融资，拿到阳光保险 7000 万的资金，用于研发、内容方面的投入，并跑通新的业务模式；</p><p></p><p>今年 3-4 月份，极客邦科技拿到 1 亿元的 B+ 轮融资，领投方为东方富海，跟投方为赛伯乐。这两家投资机构过去围绕 To B 领域进行了大量投资，在与其他被投企业交流后发现，大家有很多可以互相合作的机会，对推动企业间的业务发展有很大助力；未来，极客邦科技融资的目标大概率是引入更加一线的资本，为上市做准备。</p><p></p><p>我上述分享的目的是，希望在座的科技领导者在与 CEO 交流融资时，能够从公司所处阶段，分析、判断适合的投资机构，这对公司未来发展非常重要，一旦选择错误可能会产生致命的后果。</p><p></p><p>很多时候，选择比努力更加重要。极客邦科技 Web 的流量阵地是 InfoQ，App 的流量阵地是极客时间，但继续在自己的 App、Web 上大幅增加流量也很困难。如果到 B 站、抖音、微信视频号去做 InfoQ、极客时间的账号，会发现增粉非常迅速，这说明用户就在这些平台上。用户在哪里，我们就应该去哪里。如果只知道在媒体上花大量时间和金钱，去增加网站和 App 的流量，其实是适得其反的。</p><p></p><p>我看到很多公司非常努力的在自己的一亩三分地上耕耘，但是如果他们能够抬头看看外面的世界，选择更好的发展方向，可以实现事半功倍的效果。因此，无论大家的位置是 CTO 还是 CEO，都该多花时间思考一下未来的方向，这可能要比在公司里解决一个 Bug，解决一个实际的问题更加重要。</p><p></p><p>第二个经验，不要怕啰嗦。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/b1/b1fd3094349dd7a1f02cee2b75066efb.jpeg\" /></p><p></p><p>\"Talk is cheap，Show me the code\"是流行在工程师、技术人员中的一句话，但这样的心态在职场里存在很大的问题。</p><p></p><p>我前几天在深圳拜访了一位朋友，他在技术领域的专业能力很强，顺利解决一家接近 4000 人公司的重大业务问题；有一天，他的老板说要再交给他一件更重要的事情，原因是他不仅有强大的解决问题的能力，还具有极强的沟通、领导能力，在公司内部营造出热烈的团队氛围，所有人都愿意在他的领导下工作。</p><p></p><p>苏世民在其所著的《苏世民：我的经验与教训》一书中表示，“任何企业家领导团队的首要任务，就是围绕自己的愿景进行造势动员，营造出一种必然成功的浓厚氛围。”我认为也可以把上述内容中的“企业家”换成 CTO、经理人或管理者等。仅靠自己做事情的效率要远低于鼓励团队成员一起做事情，因此管理者要想办法让整个团队发挥出最大价值。</p><p></p><p>第三个经验，不要在恐惧的时候做决定。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/fe/fe57efaf7e6bfb54290f16d999f8fe9a.jpeg\" /></p><p></p><p>今年年初，公司有两位重要成员离开，让我感到有些焦虑。事情发生后，我希望通过做一些事情，对冲这个负面的影响，然后就邀请几位很厉害的人加入公司。最后发现这是一个错误的决定，引入的新人现在基本也已经离开公司。</p><p></p><p>“引援”失败的重要原因是，在恐惧、焦虑时，对候选人了解、沟通不够充分；而且当初引入这些新人的目的是对冲，而不是引入一位经验丰富，能够带领团队快速向前发展的人。</p><p></p><p>由此可见，无论有什么负面情况发生，大家都一定要冷静、冷静再冷静，回到本质、回到常识中，分析问题、处理问题。</p><p></p><p>如果现在让我重新做这件事，一定会把流程梳理的更加详细，对候选人做更仔细的调查并且进行更加深入的沟通，而且还要让公司其他核心高管也与其进行充分沟通。</p><p></p><p>第四个经验，公司治理也是有章法的。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/0c/0c3718c864ea7fd01e5041e208317e33.jpeg\" /></p><p></p><p>基于数据、流程做决策，对公司治理是非常有益的。如果我们做决定的时候能去想一想，有没有数据做支撑？有没有流程做依靠？然后再去做出决策，那么正确的概率会高很多。一家公司做流程、做数据分析，最主要的原因是限制高管“拍脑袋”，当然高管也包括 CTO。特别是在 200 人以上的公司中\"拍脑袋\"做决定，错误的概率会很大。</p><p></p><p>《掌控力》这本书对我的帮助很大，书中有三大关键点：每个季度都要有优先级事情、有可量化的数据支撑、有节奏的会议。</p><p></p><p>优先级大家都理解，OKR、KPI 都算优先级；有节奏的会议，相信大家都有日例会、周例会等；但可量化的数据支撑方面，很多公司做得不是特别理想，包括极客邦科技在这方面也有欠缺。今年我的目标之一是，没有数据、流程做支撑是绝不会做决定的，宁可不做决定也不能“拍脑袋”定事情。</p><p></p><p>第五个经验，保持身心健康。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/32/3282b78fba58343a96488ef95f7e613c.jpeg\" /></p><p></p><p>全球超过 3.5 亿人患有抑郁症，近 10 年来患者增速约 18%，疫情也在加重这一趋势。而锻炼、健身就是摆脱抑郁的解药。</p><p></p><p>《锻炼》这本书中的一句话让人印象深刻，做轻度和中度的锻炼对身体非常有益，锻炼时间超过 30-40 分钟时，则属于重度锻炼，对身体的改变就不再明显。我们应该让每天运动 30-40 分钟成为一种习惯，就像每天都要洗漱后去上班一样，这会对职业生涯产生非常大的帮助。我们要有努力工作的习惯，也要有努力锻炼身体的习惯。</p><p></p><p>下面讲创业的 5 个坑与感悟。</p><p></p><p>第一个坑与感悟，越早和政府打交道越好。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/71/7167ed5ff9f84ebd9b6c12540e6e328a.jpeg\" /></p><p></p><p>近两年政府在财政、业务等方面，对专精特新企业的支持力度非常大。其实很多企业如果主动了解政策、主动与政府打交道，是完全符合专精特新标准的，但大量企业因为不了解而没有参与申报。</p><p></p><p>我们在 2020 年 8 月 23 日成立了极客邦控股党支部。在成立党支部的第一年，就拿到了北京市非公有制经济党建模范单位。企业创始人是党员，企业本身是专精特新的企业，政府也十分愿意给出更多的扶持。</p><p></p><p>第二个坑与感悟，银行的钱是最便宜的，能拿的时候就多拿。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/aa/aafd1b0b859f9184be08d119595b808b.jpeg\" /></p><p></p><p>拿银行的钱看起来不像拿投资人的钱那么光鲜，拿投资人的钱可以做很多宣传，拿银行的钱大家都会觉得是借债。不过，计算一下就会发现，从银行拿到资金的成本远低于股权融资的成本。</p><p></p><p>由于极客邦科技的信誉良好，此前银行可以用不到两周的时间，就将公司所需的 1000 万元打到账户中；但是如果是与投资人沟通，没有 3-5 个月这些资金肯定是不会到账的。</p><p></p><p>第三个坑与感悟，如果这个事情重要，就一定要亲自下场去做。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/cc/cc56d248f95e597ac35c3ebc01e9d6fe.jpeg\" /></p><p></p><p>即使做到经理人、CTO、技术总监这样的级别，如果碰到一件足够重要的事情，建议一定还是要亲自下场试试。我认为视频号将是公司未来第三个流量主战场，所以亲自参与视频号运营，霍太稳视频号有机会成为 Web、App 之外，公司未来 3-5 年的另一个发展支撑点。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/99/99f00e05d919a1b258dd70ed1274c0b1.png\" /></p><p></p><p>第四个坑与感悟，KPI 很重要，但是不要忽视了关系。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/53/53ae197a4b496db1611e85d0f73e6c49.jpeg\" /></p><p></p><p>公司管理层在给团队设定目标后，如果没有和团队一起把目标的实现路径找出来，也没有花很多精力把要实现目标的氛围营造出来，结果很可能就是大家身心俱疲，但目标仍没有完成，团队也慢慢散掉了。</p><p>第五个坑与感悟，如果让我今天只分享一个经验，那就是：重业务，轻管理。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/24/24b8df4a4096538c22fc464557671659.jpeg\" /></p><p></p><p>以无所不学，对抗无所不知，就是要学常识、沟通，学技术和业务的融合。CTO 们在做技术决策时，一定要想清楚这件事能给业务带来哪些价值。</p><p></p><p>举个例子，前几日在 InfoQ 举办的深圳架构师峰会现场，TGO 鲲鹏会（上海）的一位学员和我交流时表示，团队在对 App 搜索功能进行优化后，转化率提升了 20%，每年至少能给公司带来 1 亿元营收。比如，这位学员所在公司的 App 一年应收是 100 亿元，仅搜索一项的改进就为公司提升 1% 的全年营收，技术价值的体现还是很明显的。</p><p></p><p>如何实现重业务、轻管理？就是以客户为中心，成就用户。比如上述 App 搜索的改进，在帮助公司营收扩大的同时，还改善了用户体验，这是体现以客户为中心，成就用户的一个很好的案例。</p><p></p><p>今天分享的标题来自于萨提亚·纳德拉，他在演讲和《刷新》这本书中均提到，不以\"无所不知\"自居，而始终保持\"无所不学\"的态度，这是微软文化的一大关键要素。今天，我结合自己创业的 5 个经验以及 5 个坑与感悟，将这句话分享给大家，谢谢！</p><p></p><h4>关于 TGO 鲲鹏会</h4><p></p><p>TGO 鲲鹏会是极客邦旗下科技领导者聚集和交流的组织，学员由 CTO、架构师、技术 VP、具有技术背景的 CEO 等组成，目前已经在北京、上海、深圳、广州、杭州、成都、硅谷、南京、台北、厦门、武汉、苏州等 12 个城市定期举办学习活动。</p><p></p><p>TGO 鲲鹏会采用了“学员共建”的组织形式，希望通过“共建、自治”的方式维护各城市的健康发展，为学员提供必要的服务，帮助学员个人更好地学习和成长，助力学员企业之间更好地合作与交流。加入 TGO 鲲鹏会，全方位提升自身价值，成为卓越科技领导者！</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/4c/4c5129d041d7023b2c328ccaa1b96277.png\" /></p><p></p>",
    "publish_time": "2022-07-25 10:39:28",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]