[
  {
    "title": "高管空降数字化，怎样应对局面？ | 第三期完整版（中）",
    "url": "https://www.infoq.cn/article/UipwTesLtZvD0hmAIr3f",
    "summary": "<p>《行知数字中国》第三期，InfoQ邀请到了过去30年亲历过中美高科技行业、零售业、金融业和制造业等不同行业的 IT 老兵向江旭。</p>\n<p>他曾在引领科技创新潮流的硅谷深耕技术研发，回国后赶上中国蓬勃发展的移动互联网时代，又以技术管理者的身份亲历了数家企业的数字化转型历程，在一次次跨越边界、不断探索的过程中，他对”数字化转型“的理解始终如一。在本期视频中，他将结合其亲身经历，分享数字化转型和创新的经验和教训。</p>\n<p>本视频为第三期完整版的（上）集。</p>",
    "publish_time": "2022-09-15 00:06:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "如何通过业务集成中心简化系统集成",
    "url": "https://www.infoq.cn/article/RzI87zDlJ3Gi6ha3lSs2",
    "summary": "<p>如果你问一个小学生如何解决代数问题，他们会告诉你从化简开始。对于大多数数据集成问题，我们从一开始就让数据变得太过复杂——我们使用了基于标准的XML格式，这看起来似乎很奇怪。</p><p></p><p>来自<a href=\"https://www.merge.dev/\">Merge.dev</a>\"、<a href=\"https://www.codat.io/\">Codat.io</a>\"、<a href=\"https://www.stedi.com/\">Stedi.com</a>\"等公司的新一代集成工具与这种趋势背道而驰，我非常喜欢他们的解决方案。这些集成工具简化了大多数常见业务数据对象（供应商、客户、员工、票据等）的数据模型，并提供了从流行的软件包（或EDI、电子数据交换、Stedi的格式）中获取数据的连接器，并将其转换为简化的模型。</p><p></p><p>这将使你的集成工作变得更容易，因为你不需要了解每个系统的特性，可以专注于将数据从一种简化格式转换为另一种格式。</p><p></p><p>这种新型集成公司与之前的公司之间的关键区别在于，它们不仅仅是从一个系统到另一个系统的管道，而实际上是以一种简化的格式转换和存储你的数据。你可以不将其视为管道，而将其视为一个中心，它将数据从源系统同步到简化数据中心，再从简化数据中心同步到目标系统。</p><p></p><p>这种“枢纽”极大地改变了集成的经济模式。如果我们只是将其与中心辐式机场模型和点对点机场模型之间的效率效益差异作为类比，实际上低估了中心辐式集成方法的优势。</p><p></p><p>Merge和Codat称自己为通用或统一的API，而Stedi将自己视为构建通用API的工具，但为了强调他们的解决方案和这些解决方案所产生的效率之间的联系，我将在本文中称它们为业务集成中心。</p><p></p><p>本文研究了业务集成中心的出现、这种解决方案的好处和风险，并简要介绍了其中三个案例，并评估了这种解决方案的竞争和未来。</p><p></p><h2>集成的四个阶段</h2><p></p><p>我认为我们目前正处于集成工具发展的第四个阶段。</p><p></p><p>这四个阶段（彼此之间存在重叠）是：</p><p></p><p>直接集成；定制的管道；API/连接器；转换。在第一阶段（直接集成），直接通过编写针对数据库的SQL查询来连接内部系统，并使用XML或文本分隔标准（如cXML、X12 EDI和OASIS）与客户和供应商系统集成。集成项目只适用于具有大量事务和大量持续手动工作的系统。</p><p></p><p>下一阶段（定制管道）见证了Snaplogic、Jitterbit、Talend等公司的崛起，这些公司通过编写定制的集成管道从遗留系统中推送和提取数据。</p><p></p><p>从这里开始，出现了两条平行的路径，它们都与API有关。一方面，企业开始使用Mulesoft等软件在托管系统上公开API端点。另一方面，Zapier、Tray.io和n8n.io等公司开始将API端点放在SaaS软件上。</p><p></p><p>我们现在处于转换阶段。在这个阶段，参与前几个阶段集成的公司正在构建它们的转换能力，以加速集成。认证和连接器不再是集成系统中最耗时的部分——最耗时的部分是将数据从一个系统转换为适合放入另一个系统的格式。Tray.io和n8n.io正在构建非常好的数据转换能力，使得连接两个系统的速度比以往任何时候都要快。</p><p></p><p>业务集成中心在这方面更进一步，对于许多集成任务，你不需要进行任何数据转换，即使不得不自己进行转换，也只需要从一个简化的数据格式开始，并将其转换为另一个简化的格式。</p><p></p><p>Stedi.com可能是最好的例子。你可能已经猜到，Stedi是一个EDI数据转换系统。他们构建了一个工具，可以将EDI数据转换成JSON文档，然后再转换回来。这是一个相当令人难以置信的壮举，因为EDI数据格式看起来非常枯燥，而且处理起来非常困难。因此，与其浪费时间学习每种EDI文档中的片段是怎么回事，还不如使用它们的工具或你喜欢的编程语言开始编写转换。</p><p></p><p></p><blockquote>“在Stedi，我们为开发人员提供了定义他们自己模式的工具，这些模式符合（有时也不符合）各种EDI标准。例如，<a href=\"https://www.stedi.com/docs/guides\">Stedi Guides</a>\"帮助开发人员定义他们自己对X12 EDI 810（票据）的‘看法’，并基于该结构构建他们自己的集成。现在，用户可以构建系统，以相同的EDI标准与几乎任何贸易伙伴通信，而不管他们内部使用的是什么系统或API。” ——David Kanter，<a href=\"https://www.stedi.com/\">Stedi.com</a>\"客户运营</blockquote><p></p><p>Merge.dev和Codat正在解决问题的不同部分。他们为大多数通用财务文档定义了JSON模式，并建立了连接到不同源系统的工作流。完成这些工作后，他们现在正在构建自己的连接器，以覆盖尽可能多的系统。</p><p></p><h2>好处</h2><p></p><p>使用业务集成中心的最大好处是，一旦将事务系统连接到集成中心，与多个系统集成就变得很简单了。如果你将Netsuite作为财务套件，将Salesforce作为CRM，将BambooHR作为人力资源系统，那么你可以将所有这些连接到你的集成中心，并轻松地在它们之间交换数据。当然，所有这些都可以通过像Tray.io或n8n.io这样的点对点集成工具来实现，但将所有数据存储成通用的简化模型会使这一切变得更加容易。</p><p></p><p>为了更好地理解这些好处，我们以中心辐式机场模型的经济效益作为类比。航空公司在很大程度上是按照中心枢纽的方式组织起来的。当你从田纳西州的纳什维尔飞往新墨西哥州的阿尔伯克基，你无法乘坐直飞航班，你必须经过达拉斯枢纽（美国航空公司）或丹佛枢纽（联合航空公司）。这是因为从纳什维尔到阿尔伯克基的客流量不足，无法使航空公司在经济方面无法直接建立和运营这条航线。但是，他们可以把所有从许多城市前往阿尔伯克基的乘客带到枢纽，然后就可以很容易地在枢纽和阿尔伯克基之间每天提供几次航班。系统集成的原理与之相同。在系统之间建立良好的管道是非常耗时的，使用中心枢纽总会带来经济优效益势。</p><p></p><p>如果说集成中心和机场中心枢纽之间的类比存在突破点，那应该表现在集成中心的优势方面。当你乘坐飞机时，你总是希望选择中途停留次数最少的航线。而在系统集成的世界里，这个并不重要。是直接将数据从源格式转换为目标格式，还是在两者之间使用简化表示，这通常是个个人喜好问题。作为一个做过大量集成的人，我发现将数据从源格式转换为更简单的格式，然后再从更简单的格式转换为目标格式比直接进行转换更容易。</p><p></p><p></p><blockquote>集成两个系统最困难的部分是映射和转换数据。解决这个问题的关键是标准化，这就是为什么我们花费数年时间在一些最复杂的财务数据领域（会计和商业）改进我们的数据模型。这是我们的用户能够真正感知到我们所提供的价值和质量的地方。—— Dave Hoare，Codat公司首席技术官兼联合创始人</blockquote><p></p><p></p><h2>风险</h2><p></p><p>但这些好处也伴随着两个重大风险：</p><p></p><p>你所有的数据现在都在一个地方，它们安全吗？你的数据存储成简化的模型，这些能够满足你的需要吗？如果大中型企业开始使用业务集成中心，它们需要确保数据治理和安全性。以下是Merge.dev对这个问题的看法：</p><p></p><p></p><blockquote>“保持数据安全不是一件简单的事情。我们有义务向客户证明，我们不仅保护了他们的数据，而且遵守了世界各地的各种法规。Merge对静止和传输中的数据进行加密，然后使用存储在外部服务中的密钥再次加密。我们还将欧盟和美国的数据存储在完全隔离的环境中，以确保我们的客户能够遵守GDPR。”—— Gil Feig，<a href=\"https://www.merge.dev/\">Merge.dev</a>\"联合创始人</blockquote><p></p><p></p><h2>竞争</h2><p></p><p>集成中心解决方案很有意义，但这并不意味着早期玩家最终会成为赢家。他们将面临以下类型公司的竞争。</p><p></p><p>现有集成公司，如tray.io和n8n.io。微软Azure、谷歌云平台、亚马逊云科技等云平台。Snowflake等数据湖公司；RPA公司，如AutomationAnywhere和UIPath。</p><p></p><h2>这是一个赢家通吃的类别吗</h2><p></p><p>我们不认为集成中心（每个企业都必须成为集成中心的一部分）会是一个赢家通吃的类别。当然，在每个集成中心中都有网络效应在起作用，但它们很弱。例如，如果你的几个贸易伙伴使用特定的集成中心，并且你使用了相同的集成中心，那么与他们集成就会更容易。但集成中心的竞争对手之间也会有相通的路径，所以这可能不会有太大影响。</p><p></p><p>例如，我们可以很容易地想象未来美国的一家五金连锁店采用Stedi作为他们的EDI平台。如果供应商1使用Codat集成中心，他们可以将连接Codat到Stedi。如果供应商2使用Merge.dev集成中心，他们也可以很容易地连接到Stedi。而且，如果供应商1和供应商2想要一起做一些联合营销，他们将能够在Codat和Merge.dev之间同步他们的CRM数据。</p><p></p><p><img src=\"https://imgopt.infoq.com/fit-in/1200x2400/filters:quality(80)/filters:no_upscale()/articles/business-system-integration/en/resources/3figure-1-1660901938176.jpg\" /></p><p></p><h2>来自现有集成供应商的竞争</h2><p></p><p>现有的集成公司，如Tray.io和n8n.io将是集成中心要面对的第一批竞争对手（尽管集成中心处理的本质上只是Tray或n8n.io的一个子集）。这几乎是一个哲学问题，是在不同的系统之间进行点对点集成更好，还是将数据同步到集成中心并利用它们的现有连接更好？</p><p></p><h2>云平台竞争对手</h2><p></p><p>每一家SaaS公司都需要评估一下，如果大型云服务提供商（微软Azure、谷歌云平台和亚马逊云科技）取得成功，它们会有何反应。</p><p></p><p>除了微软可能有点例外，我们不认为这三大云平台会在这个领域扮演重要角色。对于它们来说，这些位于技术栈的上层，所以它们服务不好，这一点可以通过Azure的Dataverse和亚马逊云科技的Appflow看出来。</p><p></p><p>微软Dataverse是一个位于SQL Server数据库之上的层，它定义了常用的表，如供应商、客户、票据和账单。当它第一次出现时，我非常兴奋，但实际上，它并不比实际编写SQL查询容易多少。</p><p></p><p>亚马逊云科技的Appflow是AWS集成服务的起点。看起来它将成为SaaS系统之间非常健壮的管道，但它没有将任何模式强加到集成上，而是将其留给了最终用户。这对于某些场景来说很好，但对于集成中心应用场景来说却不是。</p><p></p><p>GCP的解决方案让我感到困惑（Trifacta、Cloud Composer、Workflow、AA等），所以我把它留给读者来解释给我听:)</p><p></p><h2>Snowflake</h2><p></p><p>Snowflake公司在打造真正的集成中心方面处于非常有利的位置。直到最近，Snowflake公司还在专注于分析数据而不是运营数据，但他们最近发布的Unistore公告表明，他们正在向事务性存储解决方案迈进。Snowflake最大的挑战是专注。在吮吸了多年大型企业的乳汁后，他们会考虑销售面向中小企业的产品吗？</p><p></p><h2>RPA</h2><p></p><p>RPA（机器人过程自动化）软件在过去的十年中发生了很大的变化。RPA不仅仅是一种使用用户界面让数据出入遗留系统的方法，它现在也是一种完全成熟的集成工具。</p><p></p><p>为了成为一个可靠的业务集成中心，他们有一些有利的因素。首先，他们有大型的开发者社区，每天与标准的业务数据对象进行交互，如客户、供应商、票据、工单等。这个开发社区对数据从一种形式转换到另一种形式的过程有着深刻的理解。其次，RPA公司的市场提供了一种方式来分发由社区开发的连接器，甚至是为社区构建连接器提供补偿。</p><p></p><p>但是，与Snowflake一样，销售和分发可能会是一个问题。对于RPA销售团队来说，与集成中心展开竞争可能需要迈出非常大的一步。</p><p></p><h2>挑战</h2><p></p><p>除了上面提到的风险之外，最大的挑战在于如何在易用性和处理大多数集成场景的复杂性之间游走。任何看过“Hello World”教程的人都知道，技术可能看起来很简单，但随着你不断深入，会很快变得非常难。我对集成中心的建议是——让简单的事情变简单，并为更专业的用户提供更多功能，让他们为你完成困难的事情。</p><p></p><p>一个很好的例子就是Merge.dev最近宣布的直通功能。如果你的会计数据位于Merge.dev中，并且需要连接到Merge.dev的财务系统，但你需要的端点尚未为Merge.dev做好配置，你仍然可以使用它们的身份验证功能，但要带上自己的连接器。</p><p></p><h2>未来</h2><p></p><p>作为一种集成模式，集成中心的未来看起来很光明。对于大多数集成任务（在某些情况下进行立即集成，在不可能进行立即集成时进行简化转换）来说，以简化的格式存储数据的好处是不可忽视的。渐渐地，集成工作将是在集成中心之间进行，而不是在软件系统之间。</p><p></p><p>时间会告诉我们当前这些集成中心最终是否会取得成功，但使用业务集成中心的经济效益肯定会显现出来。</p><p></p><p>作者简介：</p><p></p><p>Doug Hudgeon是Managed Functions的首席执行官。这是一家集成公司，专门帮助SaaS公司扩展集成能力。Managed Functions是解决方案无关的，它会根据客户的需求为每个作业选择最好的工具。他也是Manning《商业机器学习》一书的合著者。</p><p></p><p>原文链接：</p><p></p><p><a href=\"https://www.infoq.com/articles/business-system-integration/\">Business Systems Integration is About to Get a Whole Lot Easier</a>\"</p><p></p><p>相关阅读：</p><p><a href=\"https://www.infoq.cn/article/qrvLruwaMWIeoz2zbrdI\">InfoQ 2022 年趋势报告：DevOps 与云计算篇</a>\"</p><p></p>",
    "publish_time": "2022-09-15 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]