[
  {
    "title": "亚马逊将无差别裁员2万人；马斯克钦点特斯拉中国区负责人朱晓彤赴美工厂抓产能；荣耀回应借壳上市传闻：消息不实 | AI一周资讯",
    "url": "https://www.infoq.cn/article/sPeHOaUtbTSxmxFKGihm",
    "summary": "<p></p><p></p><blockquote>英特尔开始裁员，鼓励全球制造部门放无薪假；谷歌、甲骨文、亚马逊和微软共享美国国防部90亿美元云服务合同；消息称马斯克钦点特斯拉中国负责人朱晓彤帮助运营得州工厂；荣耀回应借壳上市传闻：谣言不实；美国商界力促放宽对华芯片限制；推特对订阅服务涨价至11美元，为支付30%的苹果税？</blockquote><p></p><p></p><p></p><h2>资讯</h2><p></p><p></p><h4>英特尔开始裁员，鼓励全球制造部门放无薪假</h4><p></p><p>12月6日，《华尔街日报》报道，英特尔目前在加州展开裁员，几百名员工将在下个月失去工作，其全球的工厂工人也被提供无薪休假选项。</p><p></p><p>根据英特尔发给加州就业发展部的信函，该公司将在加州福尔瑟姆裁员111人，在加州圣克拉拉裁员90人，此次裁员将是永久的，预计明年1月31日开始。该公司还在俄勒冈州和其他地方向其工厂工人提供三个月的无薪假。英特尔发言人阿迪·伯尔6日证实，该公司正在向其全球工厂提供自愿休假。</p><p></p><p>此外，英特尔副总裁兼技术开发负责人Ann Kelleher周一在旧金山举行的新闻发布会上表示，“我们完全走上了正轨。”<a href=\"http://quote.eastmoney.com/unify/r/105.INTC\">英特尔</a>\"目前正在大规模生产7纳米芯片。Kelleher透露，该公司准备开始制造4纳米，并将于2023年下半年转向3纳米。</p><p></p><p>据报道，英特尔高管在10月底告诉员工、分析师和投资者，他们计划在2023年削减30亿美元的成本，同时该公司公布第三财季收入同比下滑，并调降了全年业绩展望。削减成本的措施包括裁员，但当时尚未公开将裁减的数量。</p><p></p><h4>谷歌、甲骨文、亚马逊和微软共享美国国防部90亿美元云服务合同</h4><p></p><p>12 月 9 日，据外媒报道，美国国防部表示，Alphabet 旗下谷歌、甲骨文、亚马逊和微软将共享一份为期五年半、价值 90 亿美元的混合合同，为五角大楼提供全球范围内的安全云服务。</p><p></p><p>该合同是在亚马逊、谷歌、微软和甲骨文要求竞标后获得的，以帮助解决美国国防部的云计算需求。</p><p></p><p>根据美国国防部的日常合同公告，Alphabet、甲骨文、微软和亚马逊共同为美国国防部提供联合作战云能力（Joint Warfighting Cloud Capability，简称 JWCC），相关工作将在弗吉尼亚州雷斯顿进行，预计将于 2028 年 6 月 8 日前完成。</p><p></p><p>美国国防部表示，JWCC 是一份多重授予、不确定交付 / 不确定数量的合同，该合同将能使美国国防部直接从谷歌、甲骨文、亚马逊和微软这四家公司那获得授权的商业云服务。</p><p></p><h4>消息称马斯克钦点特斯拉中国负责人朱晓彤帮助运营得州工厂</h4><p></p><p>12月8日，据彭博社报道，特斯拉CEO埃隆·马斯克已点名特斯拉全球副总裁、大中华区负责人朱晓彤前往美国，帮助运营美国得克萨斯州超级工厂。不过，朱晓彤的职责范围仅限于汽车业务，而不包括自动驾驶和机器人项目。</p><p></p><p>消息人士告诉彭博社，本周朱晓彤已经带队中国工程团队抵达得克萨斯州超级工厂，以协助监督其产能扩张。知情人士表示，尚不清楚朱晓彤将在此待多久，也不清楚他是否会保留其在亚洲的职位。</p><p></p><p>品玩的报道文章中称，朱晓彤在2022年下半年的大部分时间都穿梭在美国加州弗里蒙特的超级工厂和德州奥斯汀总部之间，配合马斯克处理一些全球性的事务，而并非将工作重心继续放在特斯拉在上海的超级工厂甚至亚太地区。</p><p></p><p>据悉，朱晓彤在一些关键特质上和马斯克有诸多相似的特质。两人均接近24小时专注工作，几乎没有个人生活，对下属要求严格甚至苛刻。且朱晓彤也和马斯克一样，在特斯拉超级工厂打过地铺。</p><p></p><h4>推特对订阅服务涨价至11美元，为支付30%的苹果税？</h4><p></p><p>12月8日，知情人士称，推特公司已经通知部分员工，他们计划调整Twitter Blue订阅服务的定价。如果用户通过iPhone应用内购买进行订阅，那么月资费将从7.99美元提高至11美元。</p><p></p><p>知情人士称，如果用户通过网站购买Twitter Blue，他们每月的订阅费为7美元。但是如果用户走苹果App Store订阅渠道，月资费将提高到11美元。这可能会促使用户转向通过网站订阅。</p><p></p><p>这一调整很可能是为了应对苹果对应用收入抽取的30%分成。不久前，马斯克称苹果威胁将推特从苹果应用商店下架，并炮轰其30%的苹果税。随后，马斯克与苹果CEO蒂姆·库克会面，声称双方消除了误会，并表示苹果已全面恢复了在推特上的广告。双方达成“和解”。</p><p></p><h4>Generative AI数字人公司跳悦智能连完成数千万天使及天使+轮投资</h4><p></p><p>近日，Generative AI营销数字人研发服务商北京跳悦智能科技有限公司完成数千万元天使及天使+轮融资。</p><p></p><p>跳悦智能是一家具备全栈核心技术能力的AI数字人初创公司。据悉，跳悦智能打通了用AI进行视频合成、唇形肢体动作合成、情感语音合成、对话引擎和知识图谱五大技术，已经具备跳悦AI代播、跳悦数字人视频合成平、跳悦达人克隆、跳悦数字人API等多条成熟的产品线。</p><p></p><p>“我们从2019年开始就在关注并使用 Diffusion（扩散模型） 技术来合成数字人和场景，产品的真实度突出，很快被来自多个行业的KA客户所认可，通过这些客户的使用，我们也积累了来自这些行业的大数据知识图谱，从而不断提升数字人的智能程度。”跳悦智能创始人兼CEO包英泽表示：“截至目前，我们已经累计向两千多付费用户交付了互动AI数字人，交付数量在国内数字人市场是遥遥领先的。”</p><p></p><h4>苹果自研芯片将首次在美制造，库克为台积电美国工厂站台</h4><p></p><p>12月7日，在台积电宣布在美国亚利桑那州新建第二座工厂后，苹果公司CEO蒂姆·库克周二出来支持称，该公司近十年时间来将首次在美国制造芯片。</p><p></p><p>库克在最新讲话中表示，当台积电美国工厂在2024年启用时，苹果将扩大与台积电的合作，届时该公司大部分设备所使用的自研芯片将在凤凰城工厂生产。目前，台积电已经在为苹果生产芯片。“现在，多亏了这么多人的辛勤工作，这些芯片才可以自豪地被贴上‘美国制造’的标签。这是一个极其重要的时刻。”他说。</p><p></p><h4>图森未来与纳威司达终止合作开发自动驾驶重卡</h4><p></p><p>12月6日，图森未来（TuSimple）与纳威司达（Navistar）发布联合声明，宣布结束双方合作开发自动驾驶卡车的协议。图森未来表示，结束开发协议的决定并不排除两家公司在未来进行合作。2020年，总部位于伊利诺伊州的纳威司达收购图森未来少数股权，并宣布在2024年前共同开发重型自动驾驶卡车。</p><p></p><h4>Meta 万人大裁员后续：部分员工称未获足额遣散费</h4><p></p><p>12月6日，据报道，一群通过Meta培训项目加入该公司的员工表示，他们获得的遣散费低于最近被裁的其他员工。这些员工是Meta的“专员培养项目”的成员，该项目旨在帮助不同背景的员工在企业技术招聘中获得职业发展机会。这个项目是Meta“路径”项目的一部分，目的是帮助不具备传统专业背景的人获得这家社交网络的学徒机会，从而为各种职位做好准备。</p><p></p><p>知情人士表示，“专员培养项目”共有60多名员工，几乎所有人都在11月初的1.1万人大裁员中离开公司。有多名“专员培养项目”的成员称，他们在4月作为该项目的最后一批成员加入Meta。他们表示，自己并非合同工，而是可以获得保险和退休金等所有全职福利的短期员工，但不包括股票。在完成了12个月的项目后，如果达到必要的标准，这些员工就会转为全职员工。</p><p></p><p>此前，Meta CEO马克·扎克伯格发给员工的信中表示，该公司将会向他们发放16个星期的基本工资，另外，每工作1年，还将额外获得2周基本工资，上不封顶。扎克伯格补充道，Meta将支付员工及其家人6个月的医疗保险费用。</p><p></p><p>但Meta“专员培养项目”的成员称，他们只获得了8周的基本工资和3个月的COBRA医疗保险。员工称，目前还不清楚他们的遣散费为何低于同事，毕竟他们也属于全职员工，而非合同工。</p><p></p><p>11月16日，受影响员工给扎克伯格和其他Meta高管发信，他们在信中写道：“我们希望Meta只向受影响的2023年4月毕业的‘专员培养项目’成员提供8个月基本工资和3个月COBRA医疗保险只是工作疏忽所致，而不是有意的无情或冷漠。”</p><p></p><h4>马斯克的脑机接口公司Neuralink正面临美国联邦调查</h4><p></p><p>12月6日，综合熟悉调查和公司运营情况的人士透露信息和文件来看，马斯克的脑机接口公司Neuralink面临美国联邦部门的调查，该公司被控涉嫌违反动物保护法（AWA）。应一名联邦检察官的要求，隶属于美国农业部（USDA）的一名检察长最近数月启动了调查。据美国农业部网站，1966年8月24日签署为法律文件的AWA是美国联邦政府层面唯一一部监管研究、教学、测试、展览、运输等用途动物处境的法律。</p><p></p><h4>荣耀回应借壳上市传闻：谣言不实</h4><p></p><p>近日，有消息称，手机厂商荣耀拟于A股借壳上市。对此，荣耀5日晚间回应称，有关荣耀借壳上市谣言不实。荣耀一直坚持公开透明的发展原则，也会持续多元化股权结构。当前荣耀聚焦产品创新，更好的服务全球消费者。</p><p></p><h4>交互AI平台“聆心智能”获数千万元天使+轮融资</h4><p></p><p>12月5日，聆心智能宣布，已完成数千万元天使+轮融资，本轮融资由连星资本领投，图灵创投和智谱AI跟投。</p><p></p><p>本月，聆心智能推出了图灵世界的首个产品“AI乌托邦”，该系统允许用户快速定制 AI 角色，只需要输入简单的角色描述，就可以召唤出相应人设的 AI ，与之进行深度对话，还可以命令AI完成相应的任务，最终实现conversation as a platform/service。</p><p></p><p>团队方面，聆心智能团队成员来自于清华大学、北京师范大学、哥伦比亚大学、纽约大学和北京大学第六医院、中南大学湘雅二医院、克利夫兰医学中心等国内外顶尖高校及医院，核心成员均具有丰富的交叉学科产研和商业化经验，是一个世界级复合型创业团队。</p><p></p><h4>亚马逊裁员将达2万人</h4><p></p><p>据IDG旗下Computerworld消息，亚马逊计划在未来几个月内，在各个部门裁员2万名员工，包括配送中心员工、技术人员和企业高管均可能被裁，这一人数为此前报道的两倍。报道引述匿名消息来源指出，亚马逊员工的等级从1级到7级，各级员工都可能受到影响。最近几天，亚马逊要求管理人员找出员工绩效问题，若最终裁员为2万人，约占公司员工总数的6%。</p><p></p><h2>IT界热评新闻</h2><p></p><p></p><h4>传闻B站新一轮裁员？官方回应：部分业务调整，无大规模裁员</h4><p></p><p>12月6日，有消息称，B站内部开启新一轮裁员，主要涉及直播、漫画、主站等业务。B站回应称，近期有部分业务调整，因此伴随人员调整，并无大规模裁员。</p><p></p><p>近日，B站公布了截至2022年9月30日的第三季度未经审计的财务报告，B站三季度营收达57.9亿元，同比增长11%。B站董事长兼CEO陈睿曾表示：“本季度，市场及销售费用同比减少25%，净亏损同比大幅收窄36%，我们将继续严格控制费用，提升利润率，收窄亏损。”</p><p></p><h4>美国商界力促放宽对华芯片限制</h4><p></p><p>据路透社12月6日报道，在美国商会等商业团体的压力之下，美国参议员修改了一项禁止美国政府及其承包商使用中国芯片的提案，从而放宽了相关限制。路透社称，修改过的最终提案文本日期为12月1日，预计将在本月通过美国参议院和众议院审议后，被送往白宫经总统拜登签署后成为法律。</p><p></p><p>最终版本的修正案内容不再禁止承包商使用中国企业生产的芯片，提案生效的期限也从先前版本的即时或2年后推迟为5年后。另外，最新草案还缩小了限制措施的适用范围，指出它们只适用于政府“关键系统”的项目，例如用于情报活动、军事指挥及武器的电信或信息网络。</p><p></p><p>今年9月，美国参议院多数党领袖查克·舒默和共和党参议员约翰·科宁试图在2023年《国防授权法案》的最终版本中加入一项修正案，要求美国联邦机构及其承包商停止使用中芯国际、长江存储和长鑫存储等中国企业生产的芯片。</p><p></p><h4>为方便推特员工通宵，马斯克把办公室改造成卧室，旧金山当局正调查改造是否违规</h4><p></p><p>12月6日，据福布斯报道，马斯克已将推特旧金山总部的部分办公室改造成了卧室。BBC称，收到了推特办公空间被改造成卧室，以及沙发被用作床的照片。</p><p></p><p>有员工在社交媒体发布照片，其中有房间看起来是会议室改造的，墙上挂着两个大型远程视频显示器，而会议桌则被换成了床垫。</p><p></p><p>旧金山建筑监察部门表示，目前接到投诉、正对推特总部部分办公室改造为员工卧室一事进行调查。此次调查是由当地时间6日一项311投诉（纽约公共服务热线）引发的，该投诉称，“推特公司的几个办公室，显然变成了让员工住宿的汽车旅馆，这违反规定”。</p><p></p><p>对此，马斯克在其推特上作出回应，他表示比起对改造办公室的关注，当局更应该保护儿童免受滥用药品的影响。当被问及为何要坚持员工高强度上班，鼓励员工睡在公司时，马斯克表示，睡在办公室是自己的工作态度，而不是“躺在热带岛屿上悠闲地喝着鸡尾酒”。马斯克一直推行硬核工作文化，他甚至曾表示：“要不是我当初睡工厂，特斯拉早就破产了。”</p><p></p><h4>687 亿美元收购案要黄？美国 FTC 起诉阻止微软收购动视暴雪</h4><p></p><p>路透社 12 月 8 日报道，美国联邦贸易委员会（FTC）周四起诉微软，阻止其<a href=\"https://www.infoq.cn/article/5QZQXf9rACSHUW5MoX1K\">收购暴雪</a>\"。据了解，这是拜登政府任内 FTC 尝试阻止科技巨头合并的最重大行动之一。</p><p></p><p>FTC 方面表示，微软在过去有购买有价值的游戏内容，并使用它来压制竞争对手游戏机的记录。比如，在 2021 年收购知名游戏开发商 Bethesda Softworks 的母公司 ZeniMaxMedia Inc.后，微软就把 Bethesda 的几款游戏变成了自己的独家产品。</p><p></p><p>“微软此前已经证明，它能够而且将会向其游戏竞争对手隐瞒内容，”FTC 竞争局局长 Holly Vedova 报告说，“今天，我们试图阻止微软控制一家领先的独立视频游戏工作室，同时阻止微软借此在这个不断变化且快速增长的游戏市场中破坏竞争。”</p><p></p><p>FTC 认为，如果这项交易达成，微软将能够直接影响到其 Xbox 游戏机竞争对手的用户，“通过控制动视暴雪的游戏授权，微软将有可能通过操纵动视的定价，降低动视的游戏质量或玩家在竞争对手的主机和游戏服务上的体验、改变动视内容的条款和时间，或完全不向竞争对手提供内容，从而损害消费者的利益。”</p><p></p><p>2022 年 1 月，微软曾表示公司将收购著名游戏制作和发行公司动视暴雪公司。据悉，微软将以每股 95 美元的价格收购动视暴雪，这笔全现金交易价值 687 亿美元，其中包括动视暴雪的净现金。微软的出价相当于动视 2021 年息税折旧及摊销前利润(EBITDA)的 18 倍。该交易原本预计将于 2023 财年完成。在此之前，动视暴雪仍保持独立运营，Bobby Kotick 也继续担任首席执行官职位。交易完成后，动视暴雪全线业务将向 Microsoft Gaming 首席执行官 Phil Spencer 汇报。</p><p></p>",
    "publish_time": "2022-12-11 13:30:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "程序员离职后为泄私愤远程锁公司服务器硬盘；前程无忧宣传语嘲讽“996”职场人；Twitter 开源工作停摆｜ Q资讯",
    "url": "https://www.infoq.cn/article/jzKqRScUyUjSUtpcZQ5b",
    "summary": "<p></p><blockquote>B 站启动系统性降本增效行动，拟节省 20 亿成本；前程无忧回应宣传语嘲讽职场人；阿里巴巴向Lazada再次注资3.425亿美元，今年总注资达16亿美元；亚马逊、甲骨文和微软获五角大楼 90 亿美元云合同；“硬核”但工资高，Twitter预招20个岗位吸引数百人申请；嫌Neuralink员工做事慢，马斯克：我恨不得在你们脑袋上绑炸弹；不限层级、不限部门，亚马逊裁员将达2万人；ChatGPT用户量5天破百万，破圈影响力惊人；程序员离职后为泄私愤远程锁公司硬盘：致重大损失；Twitter 开源工作停摆；腾讯官方QQ for Linux新版本开始公测；CNCF 宣布 Argo 正式毕业......</blockquote><p></p><p>&nbsp;</p><p></p><h2>科技公司</h2><p></p><p>&nbsp;</p><p></p><h4>B 站启动系统性降本增效行动，拟节省20亿成本</h4><p></p><p>&nbsp;</p><p>12 月 6 日消息，据《晚点财经》称，哔哩哔哩近期已经开展了一轮系统性降本增效行动，具体措施包括人员优化、缩减业务投入成本与经营管理支出。</p><p>&nbsp;</p><p>据悉，B站开启新一轮裁员，主要涉及直播、漫画、主站等业务，多位B站员工确认了此消息。知情人士称，此次降本增效的多项措施预计能够为公司节省超20亿元成本。B站相关负责人称，近期部分业务有调整，因此伴随人员调整，无大规模裁员。</p><p>&nbsp;</p><p>B 站在 11 月 29 日发布了 2022 年第三季度财务业绩，第三季度，B 站亏损为人民币 17 亿元（2.412 亿美元），较 2021 年同期收窄 36%。哔哩哔哩 CEO 陈睿当时表示，“减亏已经成为公司最重要工作之一。”</p><p>&nbsp;</p><p></p><h4>前程无忧回应宣传语嘲讽职场人</h4><p></p><p>&nbsp;</p><p>近日，江苏苏州，一网友发文称：前程无忧一标语疑嘲讽职场打工人，标语称“你们做着早九晚十每周只休1天的活，我们前程无忧”。此标语引起网友热议，不少网友表示“阴阳怪气”，“有被冒犯到”。据前程无忧工作人员回应称，没有嘲讽的意思，就是市场部的一个宣传手段。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/bc/bc4319141f240dd8f34e4c430f2554e0.png\" /></p><p></p><p>&nbsp;</p><p></p><h4>阿里巴巴向Lazada再次注资3.425亿美元，今年总注资达16亿美元</h4><p></p><p>&nbsp;</p><p>12月8日消息，据媒体DealStreetAsia从新加坡会计与企业管制局获得的数据显示，阿里巴巴近日再向东南亚电商平台Lazada注资3.425亿美元。加上5月的3.7825亿美元和8月的9.125亿美元，今年以来，阿里巴巴向Lazada投入的资金已超16亿美元。报道称，此轮注资之后，Lazada的最新估值达到113亿美元。</p><p>&nbsp;</p><p>据悉，自2016年收购Lazada后，阿里巴巴曾在2017年、2018年分别向Lazada注资10亿美元和20亿美元。2018年增资20亿美元的同时，原蚂蚁金服CEO彭蕾接任Lazada CEO。</p><p>&nbsp;</p><p></p><h4>亚马逊、甲骨文和微软获五角大楼 90 亿美元云合同</h4><p></p><p>&nbsp;</p><p>据路透社报道，当地时间周三，五角大楼正在将90亿美元（约 628.2 亿元人民币）的云计算合同在Google、甲骨文、微软和亚马逊之间进行分割。这些合同被授予这四家科技公司，以帮助建立联合作战云能力，即JWCC。多云架构能减少潜在的网络中断或故障的风险。</p><p>&nbsp;</p><p>此前，五角大楼在2019年将100亿美元的联合企业防御基础设施云（即JEDI）合同授予微软后，面临来自亚马逊和甲骨文的法律挑战，最终取消了该合同。</p><p>&nbsp;</p><p>美国国防部在一份声明中说：\"这份合同的目的是为国防部提供跨所有安全领域和分类级别的全企业、全球可用的云服务。这些合同预计将持续到2028年6月。\"也就是说，这90 亿美元是五角大楼从现在到 2028 年 6 月期间，四家云厂商共享的云支出上限。将每年16亿美元再分为四份，那么每个获胜者都拥有超过4亿美元的年云收入。</p><p>&nbsp;</p><p></p><h4>“硬核”但工资高，Twitter预招20个岗位吸引数百人申请</h4><p></p><p>&nbsp;</p><p>12月8日，据网易科技消息，Twitter近日在领英上发布了大约20个预招聘岗位信息。这些空缺岗位涵盖了各种工程和设计职位，从网络、iOS和Android工程职位到产品设计职位等。不过，所有的招聘广告都注明，这些职位目前只代表在Twitter工作的“未来机会”，而非即时招聘。其中一个软件工程师的空缺职位已经有超过500人递交了求职申请。</p><p>&nbsp;</p><p>据悉，在领英的招聘广告中，拥有至少三年工作经验的软件工程师年薪在14.2万美元到20万美元不等，拥有9年以上工作经验的高级软件工程师年薪在24.3万美元到33.8万美元之间。求职网站Glassdoor的数据显示，旧金山软件工程师的平均年薪为10.86万美元。</p><p>&nbsp;</p><p></p><h4>嫌Neuralink员工做事慢，马斯克：我恨不得在你们脑袋上绑炸弹</h4><p></p><p>&nbsp;</p><p>近日，据路透社报道，埃隆·马斯克告诉Neuralink 的员工，要想象他们自己“头顶绑炸弹”的场景来加快工作速度。</p><p>&nbsp;</p><p>一名Neuralink离职员工回忆称，马斯克曾告诉员工，如果他们不能加快进度，他将在公司内部引爆“市场失灵”。目前曝光的内部文件和对20多名在职以及离职员工的采访显示，员工们认为，马斯克为加快Neuralink技术开发的举措导致产生了错误的实验，在测试中令被杀死的动物数量增加。</p><p>&nbsp;</p><p></p><h4>微软拟开发一站式“超级应用”，整合购物、通讯、搜索等服务</h4><p></p><p>&nbsp;</p><p>12 月 6 日，据外媒 The Information 报道，微软或正在构建一款“超级应用”（Super App），整合购物、通讯、网络搜索、新闻推送等服务。</p><p>&nbsp;</p><p>报道称，微软高管希望这个“超级应用”能促进该公司价值数十亿美元的广告业务和必应搜索，并吸引更多用户使用 Teams 智能团队协作工具和其他移动服务。知情人士称，微信将通讯与购物、在线游戏、新闻和食品配送在内的各种服务结合起来，是微软高层的灵感来源。</p><p>&nbsp;</p><p></p><h4>不限层级、不限部门，亚马逊裁员将达2万人</h4><p></p><p>&nbsp;</p><p>据IDG旗下Computerworld消息，亚马逊计划在未来几个月内，在各个部门裁员2万名员工，包括配送中心员工、技术人员和企业高管均可能被裁。这一裁员人数是此前报道的两倍。</p><p>&nbsp;</p><p>报道引述匿名消息来源指出，亚马逊员工的等级从1级到7级，各级员工都可能受到影响。最近几天，亚马逊要求管理人员找出员工绩效问题，若最终裁员为2万人，约占公司员工总数的6%。</p><p>&nbsp;</p><p></p><h2>IT业界</h2><p></p><p>&nbsp;</p><p></p><h4>ChatGPT用户量5天破百万，破圈影响力惊人</h4><p></p><p>&nbsp;</p><p>近日，很多人和马斯克一样，陷入了“该死的疯狂ChatGPT循环中”。他们不厌其烦地向ChatGPT提问，并乐在其中。</p><p>&nbsp;</p><p>据OpenAI的CEO Sam Altman称，仅短短5天时间，ChatGPT 的用户量已达到100万，此前GPT-3花了将近24个月才达到这个用户量。ChatGPT是OpenAI于11月30日发布的对话语言模型 ，随后开放了免费试用。在其给出的描述中，ChatGPT“可以回答后续问题、承认错误、挑战不正确的前提并拒绝不适当的请求”。这款智能对话系统被赋予种种意义。它不再是众人以往理解的聊天机器人，它甚至被认为是现有搜索引擎的颠覆者，是通用人工智能的“第一个里程碑”。</p><p>&nbsp;</p><p>更多阅读：</p><p><a href=\"https://mp.weixin.qq.com/s/VIQ_c4TW3DYqIGNkNCttJA\">写“毁灭人类计划书”、错误太多被Stack Overflow封禁，好玩的 ChatGPT 还不能替代程序员</a>\"</p><p>&nbsp;</p><p></p><h4>程序员离职后为泄私愤远程锁公司硬盘：致重大损失</h4><p></p><p>&nbsp;</p><p>据微博@西部决策 消息，近日在广东佛山，原南海一公司的技术人员陈某，因对公司有极大不满情绪，离职后利用未移交的账号密码，远程登录该公司的系统服务器，启动加密程序锁上服务器硬盘，并将解密的钥匙删除。此举导致该公司硬盘无法解锁，业务系统全面瘫痪，造成较大经济损失。案发后，佛山市公安局南海分局民警通过数据分析，锁定陈某犯罪证据，并将其绳之以法。目前，陈某已被检察院批准逮捕。</p><p>&nbsp;</p><p></p><h4>Twitter 开源工作停摆</h4><p></p><p>&nbsp;</p><p>据外媒ZDNet消息，在解雇了Twitter大部分技术人员之后，Twitter新所有者兼首席执行官埃隆·马斯克也放弃了对 Twitter 开源工作的支持。</p><p>&nbsp;</p><p>前 Twitter 开源负责人 Will Norris 曾告诉媒体，“几乎所有在 Twitter 从事开源工作的关键人物都离开了。所有与我一起从事开源工作的工程师都离开了。” 更重要的是，Twitter 几乎所有事情都依赖开源软件。&nbsp;</p><p>&nbsp;</p><p>在接受 ZDNet 采访时表示，他曾与当时的 Twitter 首席执行官 Parag Agrawal 明确地讨论过开源投资计划：“当我加入时，已经有许多大型的现代化工作正在进行中，其中包含大型开源组件。Pants 构建系统正在被 Bazel 取代，用 Kubernetes 取代 Apache Aurora 和 Mesos 的工作也正在进行中。而且，我们已经是 Apache Kafka、Hadoop 和 Scala 的最大用户之一。我们还有一个 JVM 的自定义分支，我们希望它最终能够开源。有很多令人惊叹的工作正在发生，我们之前成功地从这些社区聘请了非常优秀的人来从事这些项目。”但是因为马斯克的收购计划，Twitter 高管选择冻结了其开源计划和投资，这些高官随后被马斯克解雇，开源计划被迫停止了，短期内也不可能有所改变。</p><p>&nbsp;</p><p>至于 Twitter 自己的开源项目，例如 Finagle，Will Norris 并不奢望“Twitter 会继续维护这些项目。所有这些项目可能都需要分叉并搬到新家，这将是一个混乱的过程，并且可能非常具有破坏性。”从长远来看，Will Norris 认为 Twitter 在开源社区中已经变得无关紧要。“他们已经失去了作为一个严肃的工程组织的所有信誉，我不在乎你如何‘硬核’。开源社区建立在关系和信任的基础上，而现在 Twitter 与这些团体没有任何关系。他们已经失去了任何有意义地参与这些社区的能力。”&nbsp;</p><p>&nbsp;</p><p></p><h4>腾讯官方QQ for Linux新版本开始公测</h4><p></p><p>&nbsp;</p><p>据OSC开源社区消息，QQ for Linux 基于 NT 技术架构迎来全新升级。从12 月 7 日起，全新 Linux QQ 正式开启公测，版本号为 2.0.1。目前，QQ for Linux 新版本目前只支持 x64 架构，arm64 架构还在加急适配中。</p><p>&nbsp;</p><p>根据腾讯 QQ 项目组的通告，全新的 QQ for Linux 基于 Electron 开发，因此理论上支持所有 Linux 发行版。Electron 是跨平台的桌面应用开发工具，基于 Electron 构建的应用可同时支持 Linux、Windows 和 Mac。</p><p>&nbsp;</p><p></p><h4>CNCF 宣布 Argo 正式毕业</h4><p></p><p>&nbsp;</p><p>当地时间 12 月 6 日， CNCF（云原生计算基金会） 宣布 Argo 正式毕业，Argo 将与 Kubernetes、Prometheus 和 Envoy 等并列到 CNCF 毕业项目行列。Argo 项目由 Applatix 于 2017 年创建并开源，于2020 年 4 月加入 CNCF 孵化器。</p><p>&nbsp;</p><p>Argo 项目是一组 Kubernetes 原生工具集合，由 Argo Workflows、Argo Events、Argo CD 和 Argo Rollouts 四个 Kubernetes 原生子项目组成，用于运行和管理 Kubernetes 上的作业和应用程序。</p><p>&nbsp;</p><p>其中，Argo Workflows 支持创建复杂的并行工作流作为 Kubernetes 资源，并用于从 CI/CD 流水线到机器学习工作流的许多不同用例中；Argo Events 基于各种事件源，为 Kubernetes 资源（包括 Argo Workflows）提供基于事件的依赖性和触发器的声明式管理；Argo CD 和 Argo Rollouts 可以帮助工程师理解、采用和使用 Kubernetes，并使 GitOps最佳实践对想要采用它的团队来说更容易实现。这些工具可以单独使用，但结合使用对大规模创建和运行复杂的应用程序有很大好处。&nbsp;</p><p>&nbsp;</p>",
    "publish_time": "2022-12-11 13:53:42",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "重磅！阿里开源自研高性能核心搜索引擎Havenask",
    "url": "https://www.infoq.cn/article/myY674gdqPhqGVM8U2h5",
    "summary": "<p></p><p>近期，阿里开源了自研的大规模分布式搜索引擎 Havenask（内部代号 HA3）。</p><p></p><p>Havenask 是阿里巴巴内部广泛使用的大规模分布式检索系统，支持了淘宝、天猫、菜鸟、优酷、高德、饿了么等在内整个阿里的搜索业务，是过去十多年阿里在电商领域积累下来的核心竞争力产品。</p><p></p><p>大数据时代，数据检索是必备的基础能力。Havenask 支持千亿级别数据实时检索、百万 QPS 查询，百万 TPS 高时效性写入保障，毫秒级查询延迟和数据更新。并具有良好的分布式架构、极致的性能优化，能够实现比现有技术方案更低的成本，帮助企业降本提效。</p><p></p><p>开源地址：<a href=\"http://github.com/alibaba/havenask\">http://github.com/alibaba/havenask</a>\"</p><p></p><p></p><h2>应用在阿里核心场景的搜索引擎</h2><p></p><p></p><p>Havenask 主要是作为高性能 AI 智能引擎，应用在搜索、推荐和广告等最典型的 AI 场景，比如淘宝、天猫 App 的首页搜索框、首页拍照搜索、首页信息流、逛逛等。</p><p></p><p>在这个场景中，工程引擎需要支持好算法团队快速 AB 实验、快速优化迭代，做到算法优化分钟级上线；并在机器资源可控，成本可接受前提下，支持算法团队实验千亿级参数、超大模型，极致优化算法效果。算法效果的好坏直接影响客户体验，影响用户的留存、购买转化、以及广告效率。因此，Havenask 对电商业务的增长起关键作用。</p><p></p><p>以手机淘宝 App 首页的拍立淘（拍照搜商品）为例，我们对感兴趣的物品随手拍一张照片，利用这张图片，在拍立淘中搜索，淘宝就会从数十亿商品中找到一样或者类似的商品。这也是典型的向量计算场景。数十亿数据，高纬度向量计算，需要 Havenask 具备实时、高性能、低成本特性，才能实现实时无延迟的搜索体验。</p><p></p><p>Havenask 另外一个应用场景是大数据检索，比如淘宝 App 中订单检索、物流信息、优惠券发放使用等，本质上都是关键词附加多条件的检索。</p><p></p><p>传统的做法是基于数据库来实现。但在这种场景中，数据量至少是 TB、PB 规模。当数据规模特别大，高并发更新和查询操作，会给数据库性能带来较大的瓶颈，成本上也会有比较大的挑战。而基于 Havenask 搜索引擎技术，可实现千亿级数据，秒级时效性，毫秒级查询延迟，为用户提供顺滑的用户体验，成本也远低于数据库方案。</p><p></p><p>以淘宝优惠券为例，淘宝有数千万商家、数亿消费者，会有大量优惠券的发放和使用，优惠券的状态变更也具有实效性，因此优惠券的发放、使用和结算，要做到好的体验，必须准确、实时。这不是一件容易的事情，对系统性能的要求非常高，成本也不会低。但依赖 Havenask，就能以低成本实现千亿级数据查询、秒级时效性、毫秒级查询延迟。</p><p></p><p></p><h2>阿里巴巴内部十余年的沉淀</h2><p></p><p></p><p><img src=\"https://static001.geekbang.org/wechat/images/09/0957f5ee179ec41b7d4cdef63a093132.jpeg\" /></p><p></p><p>阿里电商搜索早期是以 Apache http server module 的形式实现，支持淘宝、B2B 等子公司搜索业务，一个业务一个版本分支，与业务逻辑深度耦合。因此大概从 2009 年开始，阿里支持业务的同时，组建了一支小队伍，从零开始重写整个搜索系统。</p><p></p><p>2011 年，新系统完成研发，替代雅虎老的网页搜索系统完成上线，开启自研大规模分布式高性能搜索引擎时代。当时内部代号“问天引擎”（HA3），后来随着组织架构调整成为今天的 UC 神马搜索。</p><p></p><p>上线自研引擎之后，经过一两年的时间，阿里将多个老引擎分支做了统一。问天引擎开始支持集团几乎所有搜索业务，包括淘宝、天猫等，以统一代码分支和产品化、规模化的方式支持集团大量搜索业务。搜索技术团队也统一到了一起，以极致性能优化、分布式、高可用、运维友好为目标不断打磨这个搜索产品。</p><p></p><p>2016 年，随着深度学习技术广泛应用，电商领域迎来信息流推荐的新机遇，也给工程引擎带来新的挑战。从这时开始，阿里在信息流推进的基础上，将原来的 HA3 体系发展成了阿里集团里一个比较核心的 AI 引擎。</p><p></p><p><img src=\"https://static001.geekbang.org/wechat/images/7e/7ea250258bcad8c849efd06067c97392.png\" /></p><p></p><p>此后经过不断演进，Havenask 逐渐成为了阿里搜推广场景的核心 AI 智能引擎。作为阿里搜推广中台的工程引擎体系 AI·OS &nbsp;(AI Online Serving) 的核心引擎，Havenask 支撑了阿里集团包括淘宝、天猫、菜鸟、高德、饿了么等业务在内的数千搜索业务。</p><p></p><p>现在 Havenask 支持的业务，可以分为三类：</p><p></p><p>淘宝、天猫主搜最头部业务，直接部署使用 Havenask 搜索引擎，引擎团队贴身支持算法和业务，业务规模在个位数；淘宝、天猫主搜之外的其他核心搜索业务，比如高德、优酷、饿了么、AE 等，由 Havenask 之上构建的 OpenSearch PaaS 版平台产品支持，业务方自助定制开发和运维，引擎团队提供支持，业务规模在百级别；其他中长尾业务，或者无深度定制需求的核心搜索业务，由云上云下统一的云产品 OpenSearch SaaS 版（底层基于 Havenask）支持，业务方自助使用，引擎团队提供支持，业务规模在千级别。</p><p></p><p></p><h2>搜索引擎的整体架构</h2><p></p><p></p><p><img src=\"https://static001.geekbang.org/wechat/images/21/21eed993dea684b1b8be99aeeca83c56.jpeg\" /></p><p></p><p>在 Havenask 中，一个较为完整的搜索服务由：在线系统、索引系统、管控系统、扩展插件等部分构成，其中包括了查询流、数据流、控制流。</p><p></p><p>在线系统，包含了 QRS 和 Searcher。Qrs 负责接收用户查询、查询分发、收集整合结果。Searcher 是搜索查询的执行者，负责倒排索引召回、统计、条件过滤、文档打分、排序、摘要生成等。索引系统，负责索引数据生成的过程，还包含有文档处理与索引构建服务 Build Service。索引构建分为三个步骤，对数据进行前置处理（例如分词、向量计算等）、产出索引、合并索引文件的处理。管控系统，负责提供强大的运维能力。扩展插件，提供插件机制，索引和在线流程各环节中，均可以通过开发插件，对原始文档、查询 Query、召回、算分、排序、摘要进行灵活修改。</p><p></p><p>Havenask 作为 AI 引擎，本质上是为了帮助用户更精准的找到满足自己需求的商品，随着机器学习技术的发展，大量深度学习算法应用在电商搜索引擎上，实现个性化和智能化。以电商搜索为例，用户在搜索框中敲一个关键词或者一句话，系统首先会试图理解这个关键词或者这句话（NLP 技术），并拆分成以关键词、语义相关性、向量检索等多路方式召回，召回一批商品，并对这批商品做粗排，粗排后更小的商品集合上再做精排，这其中各个环节会大量应用机器学习算法，来实现搜索的个性化和智能化，整个过程需要在毫秒级完成。</p><p></p><p>在这个流程中，搜索团队在性能和迭代效率上做了大量优化，关键有两点：</p><p></p><p>海量物品的准确召回，是提升搜索质量的第一个环节，一般会通过多个系统的调用实现多路召回，调用链路复杂，召回延迟也可能较大。Havenask 支持在一个系统内部利用全图化思想，并发的完成关键词、语义相关性、向量、个性化等多路召回，合并后直接返回最终召回结果，做到极小的召回延迟。</p><p></p><p>针对不同的召回特性，支持 O2O（offline 计算转 online，或 online 计算转 offline）优化，支持数据、模型实时更新，并保证在离线的一致性。算法工程师可以运用更复杂的召回策略，在线上快速做各种 AB 实验，实验验证效果后可以分钟级全量上线。</p><p></p><p>另外，AI 引擎还支持丰富的插件拓展机制，和自研 CAVA 语言（类似于 JAVA 的语言）开发，并能集成达摩院 Proxima 向量库，支持多模态搜索。</p><p></p><p>阿里内部大数据检索场景的业务大部分基于 Havenask。大数据检索场景最主要的特点是数据量大，数据更新或查询并发度高，一般不需要强一致性，数据库的强一致性和事务，在这个场景下反而会导致性能瓶颈和较高的成本。</p><p></p><p>在大数据检索场景下，比较接近的对标软件是 Elasticsearch。Elasticsearch 主要以日志分析和检索、监控、安全分析、企业文档搜索、关键词召回等为主要场景。Havenask 跟 Elasticsearch 也有一些差别：</p><p></p><p>Havenask 数据更新时效性更好，大数据量数据写入高并发情况下，数据更新后到可查询到仍然可以做到 1 秒内。ES 受架构限制，虽然时效性可配置，但大数据量情况下，时效性配置到 1 秒在生产上基本不太可用。更好的查询性能。在同一数据集上的测试表明，Havenask 用更少的资源（内存使用量少 20~50%），查询 QPS 高 2~3 倍，查询平均延迟低约 2/3。</p><p></p><p>因此，在大数据检索场景下，可以说 Havenask 给业界提供了一个极致性价比的新技术方案。</p><p></p><p>Havenask 底层全部由 C++ 实现，具备较完备的索引构建、存储和管理能力，具有较好的扩展性，既能使用单机的存储媒介、开源的分布式存储系统，也能基于云存储产品。</p><p></p><p></p><h2>后续开源规划</h2><p></p><p></p><p>搜索引擎是非常复杂的一个系统。在数据规模极大的时候，要想达到很好的稳定性、实时性，这是非常有挑战的。对于一般规模企业来说，自研大规模分布式搜索引擎，一般需要投入几十甚至上百人的团队，耗时数年。Havenask 的开源，无疑也为有类似需要的企业，节省了高昂的研发成本。开发者和企业也能借助 Havenask 在 AI 领域实现更容易、更快速的创新。</p><p></p><p>而阿里也期望 Havenask 的开源能吸引更多优秀的开发者参与共创，共同推进国产化开源搜索引擎技术快速发展，普惠更多的开发者和企业。</p><p></p><p>阿里目前已经基于 Apache 2.0 许可开源了 Havenask 核心代码，并表示未来几个月内将发布正式版，保持与内部主干代码一致。后续有计划逐步开源阿里 AI·OS 体系更多的系统，下一个可能开源的系统是图计算引擎（内部代号 igraph）。</p><p></p><p>今日好文推荐</p><p></p><p><a href=\"http://mp.weixin.qq.com/s?__biz=MjM5MDE0Mjc4MA==&amp;mid=2651150837&amp;idx=1&amp;sn=c90a5c8c1b69e55feddeb85649bab64f&amp;chksm=bdb8a1a68acf28b01ae97fd7b1ea3ce4420b0daa3835b487b060eca6e4ac8e8f2775465509fd&amp;scene=21#wechat_redirect\">程序员离职后为泄私愤远程锁公司服务器硬盘；前程无忧宣传语嘲讽“996”职场人；Twitter 开源工作停摆｜ Q资讯</a>\"</p><p></p><p><a href=\"http://mp.weixin.qq.com/s?__biz=MjM5MDE0Mjc4MA==&amp;mid=2651150619&amp;idx=1&amp;sn=ffbfc3cb9c2db61b61fc8602c0e74675&amp;chksm=bdb8a1488acf285efe51cabeb7f3f813d3e3922c725bafda08de24976abe225577e38c4a7fa2&amp;scene=21#wechat_redirect\">再不重视软件开发工具就晚了</a>\"</p><p></p><p><a href=\"http://mp.weixin.qq.com/s?__biz=MjM5MDE0Mjc4MA==&amp;mid=2651150511&amp;idx=1&amp;sn=882407d9b730ebf9500c929e88cf254e&amp;chksm=bdb8a0fc8acf29eaf997981aa0c3106f7ff08ee4aec0eafbcf658bae227f621e3294d1631886&amp;scene=21#wechat_redirect\">“睡车间”、削减一切，马斯克为SpaceX定制的文化，不能照搬到互联网公司</a>\"</p><p></p><p><a href=\"http://mp.weixin.qq.com/s?__biz=MjM5MDE0Mjc4MA==&amp;mid=2651150314&amp;idx=1&amp;sn=dcb0475994e11726fa30c4e65713dfdd&amp;chksm=bdb8afb98acf26af1b1a4fa6edb22bcb1be8a33bb2fe1a15bdc53960d54953cf51be5ea4aea4&amp;scene=21#wechat_redirect\">写“毁灭人类计划书”、错误太多被Stack Overflow封禁，好玩的 ChatGPT 还不能替代程序员</a>\"</p><p></p>",
    "publish_time": "2022-12-11 14:04:54",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]