[
  {
    "title": "我们可以对数字化报以多大期望值？| 第三期完整版（下）",
    "url": "https://www.infoq.cn/article/ymjYEy8q6dF3egDpuqs4",
    "summary": "<p>《行知数字中国》第三期，InfoQ邀请到了过去30年亲历过中美高科技行业、零售业、金融业和制造业等不同行业的 IT 老兵向江旭。</p>\n<p>他曾在引领科技创新潮流的硅谷深耕技术研发，回国后赶上中国蓬勃发展的移动互联网时代，又以技术管理者的身份亲历了数家企业的数字化转型历程，在一次次跨越边界、不断探索的过程中，他对”数字化转型“的理解始终如一。在本期视频中，他将结合其亲身经历，分享数字化转型和创新的经验和教训。</p>\n<p>本视频为第三期完整版的（下）集。</p>",
    "publish_time": "2022-09-16 00:06:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "赛力斯黄剑龙：宏观环境下汽⻋⾏业的发展趋势带来的⼈才挑战",
    "url": "https://www.infoq.cn/article/q6NPizU8zyQH7lcOWAA6",
    "summary": "<p>各位伙伴大家好，今天我分享的话题是在当前的宏观形势下，汽车行业的发展趋势及其面对的人才挑战。</p><p></p><p>关于汽车行业的发展趋势，很多的文章都有讲解，我今天更多的是分享在此背景下的人才发展有哪些挑战，以及我们的一些实践。</p><p></p><h1>行业变化与趋势</h1><p></p><p></p><p>首先，我认为汽车行业的变化趋势是“一半是海水，一半是火焰”。这么说是因为现在面对外部的环境变化，无论是传统汽车还是新能源汽车，又或者是汽车行业的供应商、合作方，只要身处行业之中，都会有这样的感觉，看上去充满了挑战和机会，但同时又都充满了矛盾和挣扎。</p><p></p><p>从外部环境来看，有三个要素始终是推动着整个行业发展和变化的关键力量——政策趋势、技术发展、客户需求。</p><p></p><p>政策方面，我国 2030 年要实现“碳达峰”，2060 年实现“碳中和”。无论是主观还是客观方面，减排和绿色都成为汽车企业非常重要的目标，政府在推动新能源汽车发展的过程中，也陆续地出台了很多政策成为指挥棒。</p><p></p><p>技术方面，现在的智能化、电动化趋势非常明显，科学技术的发展、人工智能的运用，汽车早已经不再是从前所说的“四个轮子加一个沙发”的物品，它已经变成了一个智能移动空间。</p><p>数字化也给所有寻求转型的车企带来了很好的方式，这也是车企转型的必经之路。</p><p></p><p>客户方面，无论是因为油价上涨还是现在信息化时代，为了方便操作以及智能化需求，越来越多的客户都选择新能源汽车，这也是外部的一个因素。</p><p></p><p>在各个车展上，如果车企不展示新技术，不展示新能源，人机交互、车载互联等，都没有办法吸引到更多的客户，虽然某些品牌的燃油车还是很多客户的选择，但是新能源汽车本身就是未来的趋势。而且现在的渗透率非常低，未来可期。</p><p></p><p>从政策到技术，到客户需求的变化，为车企带来了机会同时也带来了挑战。政策方面可以看到，我国在汽车行业发展会持续给予更多关注，投入更多资源，无论从行业本身还是人才都会有很多的支持。</p><p></p><p>因此无论是传统车企、新能源车企，还是供应商、合作方，都需要思考在这样一个必须要面对变革，进行转型的时代，所有的企业都需要回答这三个本质的问题：</p><p>●&nbsp;我们的事业是什么？</p><p>●&nbsp;我们的事业将是什么？</p><p>●&nbsp;我们的事业应该是什么？</p><p></p><p>转型和变革只是方式，不是目的，因此我们更需要思考的是到底要做什么，将做什么，应该做什么，这些问题的答案将会直接指向前进的方向，同时也会告诉我们资源配置的依据是什么。</p><p></p><p>这三个问题特别重要，很多时候大家都在说要做数字化转型，但是真的要想清楚到底应该做什么。下图是新能源车和传统车的差别，这是我的一个业内朋友总结的，这是个草稿，在这里仅仅做一个对比，目的是希望大家可以看到新能源车和传统车本质上的巨大区别。这是这种巨大区别，带来了转型的巨大挑战。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/dd/dd0b8653b635ea67d9d10bb799d9c320.png\" /></p><p></p><p>当谈到转型时，首先转的是方向，是对未来趋势的把握，同时转的也是组织打造方式，以及获取人才培养方式。转型对于企业人才结构、人才需求、人才培养方式都有非常大的影响。</p><p></p><p>人才是汽车行业转型中永远不变的话题，以新能源汽车行业的人才情况为例。</p><p></p><p>第一，政策上国策加持，新能源造成风口正盛，对人才需求量增大；</p><p>第二，“新四化”加剧人才结构性短缺；</p><p>第三，人才供应不足，缺口巨大；</p><p>第四，跨界巨头入局，人才争夺战升级。</p><p></p><p>在风口之上，所有的企业都需要人才，而人才缺口巨大，2025年净缺口为3.7万人，现在有很多的力量、注意力都进入到新能源汽车行业，未来缺口还会更大。</p><p>&nbsp;</p><p><img src=\"https://static001.geekbang.org/infoq/a4/a4c234c40035d65bc95baf6e2222c97a.png\" /></p><p></p><p>同时我们也可以看到，新能源行业的企业中，有一部分来自于传统车企转型，有一部分来自于新势力，还有一部分是合资或“跨界”加入到这个领域中。</p><p></p><p>因此在说新能源汽车的时候，已经远远超出了车本身的概念。有很多其它的势力，比如说 ICT 企业加入这个领域，这都说明了新能源汽车行业竞争非常激烈。</p><p></p><p>人才争夺方面，还是以新能源产业为例，一方面是企业用薪酬待遇、股权等吸引人才，另一方面，政府出台人才政策助力人才引进，包括大力推进的产教融合，都是在联合企业、学校一起让行业发展起来，在政府的推动下，将会有更多资源投入到制造、实体企业中。</p><p></p><p>此外，企业已经越来越注意“人才不一定为我所有，但是要为我所用”，“不一定我们在哪人才就要在哪，而是人才在哪我们就要在哪”，这就是“筑巢引凤”。</p><p></p><p>以上可以看到外部趋势和各个企业、政府对于人才的态度与政策，行业竞争激烈，无论是业务本身的竞争、客户的竞争，还是人才的竞争。</p><p></p><h1>组织与人才挑战</h1><p></p><p></p><p>接下来说一说车企面临的组织挑战与人才挑战。特别说明一下，在新能源汽车领域中有非常多的企业，我更多的是分享我亲身经历的、看到的传统车企进军新能源、转型新能源，遇到的挑战。</p><p></p><p>首先，组织方面的挑战，借用德鲁克的话，我总结为“摆脱昨天”、“推陈出新”。传统汽车行业已经经历了十几年、二十几年的发展，到今天取得了很多成果，但是要注意这些成果都是过去，尤其是面对未来的时候，一定要摆脱昨天，因为昨天的资产可能都会变成负债。</p><p></p><p>在这里也简单地给大家分享一下，公司转型的不同阶段，组织面临的挑战：</p><p></p><p>第一，组织匹配度，包括组织设计的敏捷性，组织中领导者他们面对变革时的领导力，以及管理模式、组织文化的创新等，这些都需要进行审视，甚至是优化、转化。</p><p></p><p>第二，人才结构性，行业变革对人才结构提出新要求，新技术人才的供给，人才地图越来越难画；产业工人净流出，高技能人才和新技术人才，包括校招生招引难。</p><p></p><p>第三，人才激发效果，包括干部团队的开发和管理，专家团队的引进和融合。企业会大量地引入人才，尤其是专家，这些专家往往是高精尖人才，他们的激活、融合，也是特别有挑战的；企业高级的人才越来越多，对于这些人的激励保留措施的多样性、多元化提上议程。</p><p></p><p>在这里有几个需要回答的代表性的话题：</p><p></p><h2>送外卖 VS 进工厂</h2><p></p><p></p><p>比如说前段时间非常火热的一个话题——进工厂不如送外卖，很多年轻人更愿意追求自由度高的职业，宁愿去送外卖，也不愿意进工厂，这里并不是在说谁高谁低，360行每一行都有它的重要性，每一个人都是平等的，但这其实也给我们带来一些思考，就是汽车制造业要如何吸引到更多的年轻人加入到这个新兴的充满机会的行业。</p><p></p><h2>关键岗位和关键人才是什么？</h2><p></p><p></p><p>在新行业、新领域、新赛道中，关键岗位和关键人才都发生根本性的变化，我们不能再用过去的眼光来看哪些是关键岗位，哪些是关键人才。比如，干部群体、专家群体，还有某些领域的研发群体，他们都是车企未来的关键岗位、关键人才。</p><p></p><h2>导致现在人才现状的原因是什么？</h2><p></p><p></p><p>当下我们经常会遇到这样的人才挑战：新人多，他们来自于不同的主机厂，存在融入和融合的问题；腰部力量不足，能独挡一面的骨干短缺，基础干部缺失较多，后备短缺，调查发现大概有50%后备是缺失，这特别需要关注。</p><p></p><p>人才的结构性和周期性的短缺，也为企业带来了特别大的挑战。综上所述，企业如何找到人才，如何培养他们成为真正能够敢打敢拼、创新突破，能够打下山头、开放学习、持续成长的人，是未来组织竞争的核心要素。</p><p></p><p>关于未来人才的挑战，需要从原来的“选、用、育、留”，发展到现在的“抢、融、训、稳、传”。</p><p></p><p>“抢”就是要找到关键岗位的人才和创新未来的领军人物。</p><p></p><p>“融”指的是如何让吸引到的人才融合进来，如何让企业文化更加具有包容性，能够去激励人才，就是“愿景纳人”，用愿景吸引和融合人才。</p><p></p><p>“训”指“训战”，仗怎么打，兵怎么练，要分成分级明确训练对象。不能大锅饭一锅端。</p><p></p><p>“稳”指关键人才的留存、关键梯队的建设以及稳固。</p><p></p><p>“传”指组织经验的传承，瀑布式梯队队伍的声生不息。很多企业在转型，需要大量的人才，但是不可能一直靠挖外面的人才做事情，还是需要持续地将组织经验、人才传承来实现。</p><p></p><h1>人才发展实践</h1><p></p><p></p><p>接下来为大家分享一下我经历的人才发展实践。这些实践有一些已经完成了，有一些正在做，有些还在策划中，因此仅供大家参考。相信各位伙伴有更好的方法，也欢迎大家综合起来，根据你们企业实际情况运用。</p><p></p><p>我们的企业发展经历了三个阶段。1.0时代是自主创业，主要生产汽车零件。2.0时代是开放合作，主要是跟东风集团合作，生产东风小康；3.0时代是跨界融合，联合ICT的龙头企业，生产新能源汽车，立志打造世界级精品，成为全球智能汽车品牌企业。</p><p></p><p>组织的发展历程给我们带来的思考是，企业每个阶段的跨越，不仅仅是业务产品本身的跨越，不仅仅是与谁合作的跨越，它更考验组织能力，甚至意味着组织能力的重构，尤其是从2.0时代跨越到到3.0时代，意味着组织能力、人才发展能力、梯队建设能力的跨越，包括高层领导力的变革等都特别重要。</p><p></p><p>这里我用了组织发展中经常会用的BL模型，BL模型上面就是外部环境，外部环境推动组织发生变革。使命和战略、领导力、组织文化，是真正地推动组织变革落地的关键因素。</p><p></p><p>很多时候组织做变革，一上来就做底下的层次，比如提高敬业度，或者提高员工体验，这些当然非常重要，但是首先要从变革性的因素开始做。</p><p></p><p>模型中间有一个特别重要部分，叫做“管理实践”，也就是说无论怎样推动变革，在过程中一定要形成管理实践，然后形成良性循环。</p><p></p><p>比如做流程再造就要有流程再造的管理实践；文化重新定位，就要有相应的管理实践。在这里讲的是人才发展，所以一定要在组织中形成关于人才发展在新环境之下转型性过程中所需要的人才发展管理实践。这就是在思考组织变化过程中，人才发展该如何开展的非常基础的底层逻辑。</p><p></p><p></p><p><img src=\"https://static001.geekbang.org/infoq/a0/a01a86621cac204a8412c97884b12c84.png\" /></p><p></p><p></p><p>我们的人才发展实践有四个维度：分别是愿景纳人、打造能人、后继有人、顺势培人。先简单概述一下。</p><p></p><h2>愿景纳人</h2><p></p><p></p><p>第一，企业在转型时期的使命、愿景、价值观需要强化。首先，使命、愿景、价值观在企业成立之初就已经确立下来，但是随着组织的发展、业务的发展、行业的发展，它需要进一步强化，不断地传承，这时候一定要看到组织文化的重要性，它不只是告诉大家企业要做的事，还要告诉大家应该怎么做这些事，做这些事的目的和意义是什么，企业未来将去向哪里，应该秉承什么样的价值观进行选择。</p><p></p><p>这就是赛力斯从1.0时代到2.0、3.0时代，甚至到未来4.0、5.0 时代的发展过程中非常核心的东西，它就像每个人的发展一样，无论你学习什么、怎么发展，最后都要回到你希望成为什么样的人，希望用什么样的价值观做出职业选择，做出你工作中的各种选择。我们也已经明确了未来要成为怎样的企业，秉持怎样的价值观。</p><p></p><p>第二，事业目标明确，就是刚才前面讲到的战略，方向一定要清楚。</p><p></p><p>第三，愿景驱动+能力驱动人才队伍，我们需要从上到下、从高管到基层，都能够通过能力驱动人才队伍。</p><p></p><h2>打造能人</h2><p></p><p></p><p>打造能人需要识别关键人物，我们不可能把所有人都打造出来，必须先抓住关键人员，首先要强化干部队伍，第二要发挥专家作用，第三要有效地激励“大咖”和“大神”，其中包括KOL，如何发挥他们的作用？比如很多专家级人物，或者专业高手进入企业，我们首先要解决的就是融入和价值发挥的问题。</p><p></p><p>一般有几个动作可以做：第一是建立专业的标准体系，专家们推动专业通道的建设和发展；第二是师带徒，培养后备专家；第三是专业体系建设和专业知识沉淀；第四是专业难题攻关。当企业充分地发挥专家的能力和价值时，其实也是在培养着后备的同时激励着专家本人。</p><p></p><h2>后继有人</h2><p></p><p></p><p>后继有人就是聚焦人群，确立梯队策略。我们经常讲仗怎么打、兵怎么练，组织要有自己的人才梯队，保证人才供给，要有造血功能，对于同样的梯队全景图，一定要确定重点在什么地方，不能所有的梯队都打造，所有的训练营都开展，一定要聚焦关键人群。</p><p></p><h2>顺势培人</h2><p></p><p></p><p>“势”既是前面讲到的外部环境的大势，又是每一个人的优势，也是数字化的趋势。</p><p></p><p>组织在未来人才发展过程中不能生拉硬扯，不能强行灌输，一定要顺势而为，我们开展了优势的探寻和运用，这是很好的组织效率提升的方式，也是很好的激励员工发挥潜能的重要动作。</p><p></p><p>赛力斯也在打造自己的HR教练团，培养内部教练；并通过社群式的学习，建立所有人向所有人学习的文化，所谓的学习型组织不在于课程有多少，而在于真的能够打造出互相学习、互相影响的文化。</p><p></p><p></p><p><img src=\"https://static001.geekbang.org/infoq/b4/b4fce796d0a73a5e0d6296c9c5944419.png\" /></p><p></p><p>接下来给大家分享几个具体的动作。</p><p></p><h4>后继有人——这是我刚才提到的聚焦人群，确定梯队策略</h4><p></p><p></p><p>下图是人才梯队的逻辑图（示例），在这里组织需要根据当前业务需求，组织者现状能力的诊断，确定出梯队发展的重点，不能眉毛胡子一把抓。</p><p></p><p>当下梯队发展重点在高层领导力、新任、后备还有大学生。高层主要针对的是意识变革的能力；新任就是腰部力量的融入和转身，包括内部提拔整改，以及外部引入；腿部的后备人员非常重要；企业不可能总在社会上抢人，需要自己培养人才，大学生对于企业来说是造血，要帮助他们完成从学校到职场的跨越，融入公司的文化与工作当中。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/95/95ea2ab2cc3e8f61fbeea1285b37461f.png\" /></p><p></p><h4>后继有人——高层领导力发展设计</h4><p></p><p></p><p>高层领导力训练框架（示例），也是每个企业都会做的，实际上在现代环境中，很难简单地梳理出高层领导力的维度，再围绕它开展培训，而是需要知、思、行的过程，这里结合了领导力五个层次理论，把“知、思、行”结合在一起，同时首先要诊断企业领导力来源在什么地方，然后每个管理者基于他的角色、使命、所分管的内容，有针对性地提升领导力，不要千篇一律地提高领导力，尤其是高层领导力。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/fc/fcbf979593a8fd45ddc2ec6806e3687e.png\" /></p><p></p><h4>后继有人——中层后备</h4><p></p><p></p><p>中层后备的培养有以下特点：</p><p>一、搭建舞台，针对后备不一定要给他们灌输很多的东西，不需要给他们大量的课程体系，更重要的是给他们搭建舞台。</p><p></p><p>比如针对后备有专门的微信群，公司的高管都在里面，我们会定期设计一些任务，让大家在微信群里面展示出来，而且是真刀真枪的，不是喊口号的，这个就是给大家搭建舞台。大家可以将自己的工作、提案都发布在这里面，互相激励、互相学习。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/8d/8d5e6287ba4a16bd696a76eb48cc2311.png\" /></p><p>&nbsp;</p><p>二、战训结合。原来都说训战结合，我们是战训结合，一定要以战为主线，训是在过程中给大家赋能。</p><p></p><p>三、长和统。“长”就是通过 IDP，把个人和组织目标结合在一起；“统”是统一所有资源，人的成长不是靠简单几门课或者在工作中做任务就可以完成的，它需要多方统一支持，如业务负责人、HR、教练等等的共同支持。</p><p></p><h4>顺势培人——优势探询、社群学习、“乐”在其中</h4><p></p><p></p><p>下图左半部分是某一期高潜人员班所做的优势探询，从中可以看到他们优势的分布，我们也进行了优势的应用。</p><p></p><p>同时我们也开展了社区学习，举办了多期卓有成效的管理者读书会，每一次读书会都是团队教练的过程，到目前已经做了很多期，很多同学都自愿参与其中，而且反馈效果也非常好。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/5a/5acfe56ece3010bccf78ffc750dd52de.png\" /></p><p></p><p>另外，在培训学习过程中，也用了很多其他方式，比如我是乐高认真玩的教练，所以我也会用乐高的方式带领大家探索，在玩的过程中反思、学习，这就是我们会用的很多方式，它不仅是翻转课堂、行动学习，而是多方面整合在一起。</p><p></p><h4>顺势培人——HR教练团队</h4><p></p><p></p><p>HR的教练团队是要顺应每一个干部、每一个学员成长所需要的支持，比如，上级做的就是给员工工作安排、指导，导师为其传授经验，HR教练给予一些反馈，其实这就是721，721就是既有工作的挑战，又有知识的输入，同时还能得到反馈。</p><p></p><p>HR教练团队还在打造过程中，是我们面对未来，打造未来学习氛围非常重要的部分。&nbsp;同时也是在训练HR团队，让他们真的具备教练的能力、教练的视野，能够有更好的方式辅导所有的业务部门的负责人。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/55/55c4f99b8617e5d21363b07aa01b8528.png\" /></p><p></p><h4>顺势培人——数字化学习</h4><p></p><p></p><p>数字化学习每个公司都在用，这张示意图，就是对应前面的721，也对应前面关于HR教练的部分。“挑战”就是来源于上级布置的任务，“课程”来源于导师或者外部、内部课程，“反馈”来源于内部教练。</p><p></p><p>这三个要素组成了所有人学习、成长必备的要素。同时也可以看到数字化就像外面那个圈，它不仅仅是技术，更是思维方式、文化氛围。</p><p></p><p>未来的组织应该叫数字化学习型组织，这里面要理解了什么叫学习型组织，怎么样达到学习型组织，还有什么叫数字化，什么叫数字化学习？这些都是需要去思考的话题。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/19/19e0f91c2cc7e23743e225c0c8f08618.png\" /></p><p></p><p>我对外部趋势的理解、我们面临的挑战、实践经验就分享到这里，最后我想引用一句话——让平凡人做出不平凡的事，无论在什么行业，什么企业，要做的都是把所有人打造成不平凡的人，让他们共同协作，为组织做出不平凡的事。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/9e/9e7926882dc833bdaf80644024cb033c.jpeg\" /></p><p></p><h3>关于极客时间企业版</h3><p></p><p></p><p>极客时间企业版由极客邦科技倾力打造，是企业级一站式数字技能学习平台，是具备好内容、好产品、好服务的“三好平台”，助力企业打造行业领先的数字人才团队，驱动企业的数字化转型与高质量发展。</p><p></p><p>自 2019 年以来，极客时间企业版已服务近 3000&nbsp;家技术驱动型企业，覆盖银行、金融科技、保险、互联网、移动通信、软件、工业制造、教育等行业客户。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/e3/e3c148931b18c1c7305e2fa67698f7ba.jpeg\" /></p><p></p>",
    "publish_time": "2022-09-16 09:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "BSN面向海外正式发布Spartan网络：支持用户获得链上所有数据",
    "url": "https://www.infoq.cn/article/ZmCKKVkbJqIcAhR6Eb89",
    "summary": "<p>&nbsp;</p><p>2022年9月6日，BSN（区块链服务网络）国际宣布BSN Spartan网络正式上线。Spartan网络是一个由“无币公链”组成的公共基础设施网络，面向海外推出，旨在为全球企业，特别是传统领域企业提供无币化的区块链服务。</p><p>&nbsp;</p><p>“世界上几乎99%的IT系统不会使用基于虚拟货币的公有链，因为他们不想使用不受监管和不稳定的虚拟货币，而Spartan网络提供了一个集成了无币公链的基础设施，任何传统IT系统都可以通过Spartan网络以更加便捷、更具成本效益的方式使用区块链技术。”&nbsp;红枣科技CEO何亦凡表示。</p><p>&nbsp;</p><p>据悉，本次上线的测试版集成了三条无币公链，包括无币以太坊、无币Cosmos和无币Polygon EDGE，未来还将陆续有更多的无币公链加入进来。用户在GitHub免费下载安装后，即可匿名在Spartan网络上建立虚拟数据中心，并使用法定货币或稳定币在无币公链上支付GAS费用。需要注意的是，Spartan网络仅面向海外用户，国内用户无法建立数据中心。</p><p>&nbsp;</p><p>根据介绍，在Spartan的任何完整节点上，用户可以获得由不同终端用户生成的所有公共数据。</p><p>&nbsp;</p><p>传统的IT系统是建立在独立的非公共数据库上的，每个公司都有自己独特的数据存储机制和结构，系统之间数据交换的成本非常高。即使是公共数据，用户也必须到各种网站下载和收集数据。随着数字化需求的不断增加，这一过程正变得不可接受。</p><p>&nbsp;</p><p>Spartan 试图利用区块链来改变这一问题。数据只是逻辑上隔离的，只要相互提供许可就可以进行交换。Spartan 网络上的所有数据中心将能够轻松地共享数据，用户只需连接到Spartan网络，数据将通过任何设备从任何地方同步和访问。</p><p>&nbsp;</p><p>那么，Spartan 与传统公链有什么区别呢？根据介绍，这主要体现在以下三方面：</p><p>&nbsp;</p><p>成本控制。成本控制是传统产业的关键任务，因此成本必须是可预测的。然而，传统公共链为正常交易而需要消耗的加密货币是有价值波动的，并且这种波动是不可预测的（虚拟货币的价值浮动）。由于这种波动性，几乎没有传统产业使用区块链技术建立业务（成本不可控）。Spartan网络推出的非加密货币公共链，用户通过法定货币/稳定币购买NTT，NTT不能在账户钱包间互相转移，接下来使用NTT在Spartan链上购买各链的gas，如此打掉价值炒作的可能，使得成本可控。（注：NTT，不可交易代币，是在 BSN Spartan 网络默认链上发行的网络不可转让实用代币。）</p><p>&nbsp;</p><p>安全性。当用户与集中式系统交互时，向系统发起的所有请求和输入的所有信息都由系统的后端拥有和控制。这种集中式架构允许操作员轻松地修改任何数据，并且用户难以验证数据的真实性和准确性。Spartan 网络利用区块链共识机制，防止数据在上传到链后被秘密篡改，并允许用户轻松验证任何数据。Spartan 还严格实施分权治理，所有新的或变更的治理规则都由各方协商一致表决。</p><p>&nbsp;</p><p>多样性。单个公链通常会遇到各种性能瓶颈，从而导致链上事务的处理周期较长。Spartan 网络则是一个多链生态系统，每个链之间的数据交换是通过链间服务实现的。同时，不同的链框架各有特点，往往各有所长。根据BSN的规划，未来不同的行业领域可能会适用不同产业链，用户可以根据需要选择。</p><p></p><p>&nbsp;</p><p>目前，汇丰银行、英皇集团、美心集团和兰桂坊集团等传统企业已经开始在业务中使用Spartan网络。</p><p>&nbsp;</p><p>富士旗下咨询公司FUJIFILM Business Innovation Hong Kong&nbsp;通过Spartan网络把电子文档通证化，帮助客户实现数字化转型，而传统公链会存在数据环境的高风险和Gas fee过高的问题。兰桂坊集团则将餐厅的POS交易系统与兰桂坊会员系统进行了连接，以此实现数据交互的自动化。</p><p>&nbsp;</p><p>BSN 认为，无论从业务需求、应用场景还是商业模式等角度，未来都会有大量企业使用公共信息化系统，最终会形成互联网的公共层。但实现该阶段还有不小的挑战。</p><p>&nbsp;</p><p>首先，公共的基础设施要极其便宜，也需要不断降低应用门槛，无论是经济门槛还是开发门槛。其次，开发者需要通过大规模高并发来优化产品，但大部分的链没有经历大规模并发的考验。再者，大家需要建立链的真正的分布式治理，但目前大部分联盟链都是私链。最后，企业已经习惯互联网的中心化网络环境，对公共IT系统可信、公开透明、不可篡改等特征会给业务逻辑、商业模式、经济模型等带来的革命性影响缺乏认识。</p><p>&nbsp;</p>",
    "publish_time": "2022-09-16 09:31:28",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]