[
  {
    "title": "Meta宣布推出新一代AI硬件平台Grand Teton，将英伟达 Hopper 架构引入数据中心",
    "url": "https://www.infoq.cn/article/E3GhWKgg0YHy1OzmXg3U",
    "summary": "<p>最近，<a href=\"https://engineering.fb.com/\">Meta</a>\"宣布推出下一代用于人工智能训练的硬件平台<a href=\"https://engineering.fb.com/2022/10/18/open-source/ocp-summit-2022-grand-teton/\">Grand Teton</a>\"，与前代相比有多项优化，包括两倍的网络带宽及四倍的主机到CPU带宽升级。</p><p></p><p>Meta公司工程副总裁<a href=\"https://www.linkedin.com/in/alexisblack\">Alex Bjorlin</a>\"于近期的<a href=\"https://www.opencompute.org/summit/global-summit\">开放计算项目（OCP）全球峰会</a>\"的主题演讲中宣布了这一消息。Grand Teton的开放硬件设计是Meta对数据中心人工智能工作负载的最新迭代贡献，与前一代由三个“盒子”组成的Zion-EX不同，Grand Teton的集成机箱让它可以更快、更容易地部署。Meta还为Grand Teton设计了一个新的数据中心机架和冷却系统，用于支撑大型人工智能模型训练所需要的服务集群电力需求。Bjorlin称：</p><p></p><p></p><blockquote>Meta是全心全意支持人工智能的，但人工智能的未来不可能完全由我们创造，而是通过合作，通过如OCP一样的组织分享想法和技术来创造。我们渴望继续合作，建立新的工具和技术以推进人工智能的未来。希望人们能加入我们的各种努力，无论是现在开发新的人工智能方法，还是从根本上重新思考未来的软硬件设计，我们对这个行业的未来发展非常乐观。</blockquote><p></p><p></p><p>Meta训练并部署了许多大型人工智能模型，其中不乏包含数万亿参数，需要等量规模数据集训练的模型，这也意味着他们会需要大量与GPU互联的服务器。Meta自2016年起便开源了他们的人工智能硬件设计，且推出了<a href=\"https://engineering.fb.com/2015/12/10/ml-applications/facebook-to-open-source-ai-hardware-design/\">Big Sur平台</a>\"。去年，InfoQ同步报道了Meta的最新迭代<a href=\"https://www.infoq.com/news/2021/05/facebook-zionex-training/\">Zion-EX</a>\"平台，该迭代是由数千计算节点组成集群，其中每个节点都含有四个CPU插座和八个GPU。</p><p></p><p><img src=\"https://imgopt.infoq.com/fit-in/1200x2400/filters:quality(80)/filters:no_upscale()/news/2022/11/meta-ai-hardware/en/resources/1meta-hardware-timeline-1666536464626.jpg\" /></p><p>图源：<a href=\"http://engineering.fb.com/2022/10/18/open-source/ocp-summit-2022-grand-teton/\">https://engineering.fb.com/2022/10/18/open-source/ocp-summit-2022-grand-teton/</a>\"</p><p></p><p>然而，Zion平台的每个节点都需要外部布线才能整合三个不同的组件：CPU“头部”、GPU系统，以及一个交换系统。全新的Grand Teton则将这些组件全部整合到一个机箱之中，且该机箱也包括了电源、计算和网络接口，“以实现更好的整体性能、信号完整性和散热性能”。英伟达称，Grand Teton还拥有英伟达基于<a href=\"https://www.infoq.com/news/2022/05/nvidia-grace-hopper/\">Hopper架构</a>\"的<a href=\"https://blogs.nvidia.com/blog/2022/10/18/meta-grand-teton/\">H100 Tensor核心GPU</a>\"。Meta还更新了他们的底层存储平台：新版本的<a href=\"https://www.opencompute.org/documents/grand-canyon-storage-system-specification-v1-0-pdf\">Grand Canyon</a>\"在前代Bryce Canyon架构的基础上进行了改进，让Meta公司“达到驱动器的极限水平”。</p><p></p><p>在Grand Teton的设计之外，Meta公司还发布了一款数据中心机架设计：<a href=\"https://www.opencompute.org/projects/rack-and-power\">开放式机架v3</a>\"（ORV3）。与其他将电源架直连母线的机甲不同，ORV3的电源架可以安装在任何位置，设计更加灵活。改进后的备用电源与前代仅支持90秒的供电相比，可提供长达四分钟的供电。ORV3还支持多个电源架和48 VDC的输出，可部署处理高达30 kW的机架。Meta还为这代更高的功率容量设计了新的冷却策略：ORV3支持空气辅助液冷，设施水冷，以及“可选盲配液体冷却接口设计”。</p><p></p><p>Meta公司设计的可互动3D模型可在这个<a href=\"https://metainfrahardware.com/\">官网</a>\"找到。</p><p>&nbsp;</p><p>原文链接：</p><p><a href=\"https://www.infoq.com/news/2022/11/meta-ai-hardware/\">Meta Announces Next Generation AI Hardware Platform Grand Teton</a>\"</p>",
    "publish_time": "2022-11-17 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "如何通过低成本、轻量化的性能监控助力业务成功｜InfoQ大会早班车第27期",
    "url": "https://www.infoq.cn/article/sgiSe9L54MuXBppstyhi",
    "summary": "<p>在“降本增效”的形势下，业务性能监控痛点太多？怎么做到低成本、轻量化？本次大会早班车邀请到腾讯APM项目技术负责人直播分享腾讯APM项目技术亮点和实战经验。</p>",
    "publish_time": "2022-11-17 10:29:55",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "跃居Gartner全球供应链榜单第二，施耐德电气是如何实现供应链数字化的",
    "url": "https://www.infoq.cn/article/z9DfpZCh0femWpQ6awVp",
    "summary": "<p></p><p></p><blockquote>编者按在过去 7 年里，施耐德电气连续进入 Gartner 全球供应链 Top 25 榜单，并且排名连年上升，今年已经跃居第 2 位。作为一家跨国企业，施耐德电气供应链的链条更长、复杂度也更高，而这，恰恰促使其更早、更快地通过数字化连接全球供应链体系，进而满足全球客户需求。早在 2012 年，施耐德电气就提出了“定制化供应链”的概念，基于客户差异化的购买行为，将供应链运营模式分为五种不同类型。而为了化解这种定制化模式带来的供应链管理难度和复杂度，施耐德电气开始通过技术手段精细化企业内部的管理和服务。“数字化背后是整个供应链的智慧大脑，它发挥着调度和警示的作用，目的是辅助人更好地管控供应链。”施耐德电气中国区供应链绩效及数字化副总裁——顾俊在最新一期的 InfoQ《超级连麦. 数智大脑》中表示，在数字化技术与业务不断融合的过程中，施耐德电气的供应链韧性持续提升，并且成为其在近两年的全球供应链混乱中转危为机的重要能力。  </blockquote><p></p><p></p><p>本期 InfoQ《超级连麦. 数智大脑》，<a href=\"https://www.schneider-electric.cn/zh/\">施耐德电气</a>\"中国区供应链绩效及数字化副总裁顾俊，和极客邦科技创始人兼 CEO 霍太稳（Kevin），InfoQ 极客传媒数字化主编高玉娴，一起探讨了施耐德电气的供应链数字化思路，以及在实践过程中的挑战和应对策略。内容有删减，感兴趣的同学可进入“霍太稳视频号”或“InfoQ视频号”观看直播回放。</p><p></p><h2>通过短链协同应对全球“供应链大混乱”</h2><p></p><p></p><h4>您怎么看待近两年全球的“供应链大混乱”现象？</h4><p></p><p></p><p>顾俊：施耐德电气整个供应链网络体系非常庞大，全球有近 200 家工厂，接近 100 家物流中心。对于中国区而言，既有很多原材料的进出口，也包含了成品商品的出口，还有一些运输业务，因此受到疫情、自然灾害的影响也会更大。</p><p></p><p>这就非常考验企业供应链的韧性。这种韧性体现为在当外界冲击来临时，企业如何能够迅速地进行复原和反弹的一种能力，相当于企业的“内功”。</p><p></p><p>所以，我觉得供应链的大混乱时期，对我们来说是一个危机，也是一个机遇。</p><p></p><p>2019 年之前，我们很少会谈及“韧性”，更多会谈到<a href=\"https://www.infoq.cn/article/8eOkku2uTuU3qVFvwqhA\">精益管理</a>\"、库存优化、效率提升等等。但是在近几年各种危机的冲击下，我们把韧性提到了非常重要的高度。如今，施耐德电气从管理上来讲比以前更加均衡，不仅有很好的精益基础，同时在管理过程中也具备更多韧性和稳健性能力。所以我觉得近几年的所谓混乱状态，虽然对我们有影响，但收获可能更多一些。</p><p></p><h4>具体来说，施耐德电气是如何应对这个供应链困境的？</h4><p></p><p></p><p>顾俊：除了提升企业供应链的韧性，我们也更加注重供应链上下游之间的短链协同及合作共生，具体包括了以下四个方面的措施：</p><p></p><p>第一，采购本地化。之前，我们更多关注的是在全球范围内的供应链资源配置最优化。但当危机发生时，这种高度全球化的供应链网络会受到很大冲击，它的脆弱性也会展现出来。为了有效解决这个问题，我们提出了短链协同的目标，加大了供应链本地化改造和优化的力度。其实早在 2019 年之前，我们上游物料的本地化采购比例就已经很高了，但是过去三年，外部的危机促使我们进一步加速物料的本地化，以确保在扰动因素发生时，企业依然能够就近拿得到料、供得上货，最大程度上保证了供应链的连续性。此外，对于一些会对业务产生重大影响的关键物料，我们也采取了备份方案，确保每一种物料至少有两家供应商，这也是一种韧性的表现。</p><p></p><p>值得注意的是，当企业选择多家供应商进行备份时，会有对于成本增加的顾虑。这时，企业就需要在精益供应链和韧性供应链之间做有机平衡，换句话说，就是要在成本和安全之间找到合适的度。因此，首先企业要甄别出极其关键的物料，然后再针对性地做成本和安全方面的平衡方案。目前，施耐德电气中国区供应链的本地化采购达到 90% 以上，在全球是最高的。</p><p></p><p>第二，决策本地化。我们这里所讲的决策不仅仅指与供应链管理相关的一系列决策内容，包括工业战略布局、物流设计、精益体系、安全管理等方面，同时也包括了与供应链密切相关的其它职能部门的决策本地化，例如在产品规划和研发等方面，施耐德都实行了大刀阔斧的本地化改造，逐年加大我们在产品研发、技术认证、实验测试等方面的本地化管理力度，以更好地适应和满足本地市场的发展需求。</p><p></p><p>第三，生产本地化。施耐德电气在中国有将近 30 家生产工厂和物流中心，不断推动 China for China 的产品交付战略，确保了敏捷的客户交付和紧急响应能力。对于一些关键产品，我们也在不同工厂中部署了备份的产线，从最大程度上保障供应链交付安全。</p><p></p><p>第四，设备本地化。短链协同还会涉及一些关键设备，以前，这些关键设备大多都是通过国外进口的，如今中国本地也有了设计和制造关键设备的能力，可以为本地化生产做好关键设备和产线方面的保驾护航。</p><p></p><p>此外，为了提高企业供应链的韧性，我们还利用<a href=\"https://www.infoq.cn/article/2m8ATKMdZ6H7TWBKVPwg\">数字化</a>\"技术打通了信息流，使上下游供应链信息更加集成和透明化，实现高效的协同效率。这种透明化的管理既提升了企业运营的效率，也提升了供应链安全性。与此同时，当中小型供应商面临财务方面的压力时，我们也会提供一些供应链金融的服务，帮助他们克服当下的困境。</p><p></p><h2>从供应链定制化到供应链数字化，背后的逻辑与挑战</h2><p></p><p></p><h4>事实上，早在多年前施耐德电气就提出了“定制化供应链”的概念，是否可以具体介绍一下？</h4><p></p><p></p><p>顾俊：2012 年，我们第一次提出“定制化供应链”，初衷是为了更好地服务我们的客户。当时，按照客户不同的习惯偏好，存在 11 种不同的购买行为模式。我们发现，如果简单地使用同一种供应链模式，会有部分客户的特定需求难以被满足。</p><p></p><p>所以，为了让不同类型的客户需求都得到最大化满足，我们对整个供应链模式进行了改造升级，从 11 种客户行为模式中，映射出五大类型的供应链模式：第一，标准的产品按照库存生产；第二，定制化产品按照订单生产；第三，部分产品按照选型来配置生产；第四，定制化产品从源头定制设计生产；第五，特殊情况下按全柔性模式生产。</p><p></p><p>在这个过程中，对内，我们针对五种不同类型的供应链设计了相应的流程；对外，针对不同类型的客户，工厂也会遵循不同的供应链模式来进行产品生产和客户服务。</p><p></p><p>当然，这种定制化模式势必会增加内部供应链管理的难度和复杂度，这也促使我们通过数字化的手段，来降低定制化流程所带来的复杂度并保证效率。以终为始，以客户的需求为导向，不断地精细化改善企业内部的管理和服务水平，最终是为了让终端客户能够更满意，实现客户满意度与企业内部运营效率二者之间的完美平衡。</p><p></p><h4>在这个过程中，施耐德电气供应链管理的对象具体有哪些？哪些方面最具挑战？</h4><p></p><p></p><p>顾俊：施耐德电气的供应链部门也叫全球供应链。从客户下单开始，到最终把产品送到客户门口，中间整个环节里面所有的活动都属于我们供应链管辖的范围，包括工厂制造、物流中心、运输、采购、质量管理等各个环节。</p><p></p><p>其中，最有挑战性的是上游供应链的管理，也就是供应商管理。因为上游供应链不仅涉及一级供应商，还有二级供应商，甚至三级供应商，层级非常多，如果要实现精细化管理，其复杂度实际上是呈指数级增长的。</p><p></p><p>我们当然希望上游供应商能够看得更远、更全面。如果他们能够及时预见供应链上游的扰动和风险以及会对下游产业产生的影响，那我们就可以提前做一些预判，并采取相应措施来消除或减轻负面影响。</p><p></p><p>所以，当面临供应链风险时，我们必须跟上游一级供应商一起密切协作，部分二级和三级供应商也要纳入供应链管理的范围。只有这样，才能提升整个供应链管理的管控水平，提升供应链管理的精细化程度。</p><p></p><p>在这个过程中，我们需要利用一些数字化技术、<a href=\"https://xie.infoq.cn/article/844105e6ed26c1c57490fcc87\">可视化</a>\"工具来帮助企业建立透明而清晰的供应链管理系统，比如供应链上下游的血缘图，从而将整个供应链上的脉络关系梳理清楚。比如，当上游供应商的零部件出现问题时，会对企业的哪些产品产生何种影响？影响程度如何？预计何时会产生影响？应该采取什么对策进行干预？只有把这些都通过数字化的平台和应用沉淀、打通，才能够更好地管理企业供应链。</p><p></p><h4>打通整个供应链上下游的信息流并不容易，施耐德电气是如何做到的？</h4><p></p><p></p><p>顾俊：应该说我们正在努力，但确实难度非常大。有很多数据主权的问题没有解决，比如你的想法、方案很好，但是申请开放权限却很难，有些伙伴也会有一定的数据安全方面的顾虑。</p><p></p><p>但技术层面我们是可以优先做好准备的。具体来说，企业先要搭好一个良好的数字化<a href=\"https://archsummit.infoq.cn/202212/beijing\">基础架构</a>\"，底层需要有数据采集能力，中间层需要数据聚合和处理能力，上层要有很好的数据展示以及数据挖掘的能力。</p><p></p><p>我们在进行数字化转型时，也会搭建这三层架构。如果有条件，我们会利用这些数据，尽可能多去聚集、分析，不断地形成洞见，从而帮助上下游供应链进行协同管理和优化。</p><p></p><p>这里的架构就像人的骨架一样，我们需要把骨架搭好，至于需要多久才能够填满，很多时候还是要边做边看，还要跟上下游伙伴进行协商，通过分享数据洞见来实现互利共赢。我们先把这些基础架构的“舞台”搭建好，剩下的就是万事俱备只欠东风了。当然，我坚信东风迟早会来。</p><p></p><h4>施耐德电气的供应链数字化思路是什么样的？实现了哪些供应链场景的数字化？</h4><p></p><p></p><p>顾俊：施耐德电气的供应链数字化转型主要沿着三个方向进行。</p><p></p><p>第一是垂直的运营管理方向，也就是我们的工厂和物流中心内部运营管理的数字化转型；</p><p></p><p>第二是端到端的产品全生命周期方向，从产品的研发设计到工厂制造，再到客户交付和售后服务，以及产品的最终回收处理；</p><p></p><p>第三是横向的供应链价值流方向，从上游的供应商到工厂、物流中心，再到客户，整个路径是沿着供应链价值网络的方向进行流动。</p><p></p><p>目前，这三部分的数字化转型工作都在并行推进，最终目的是帮助企业管理工作变得更透明、更高效、更智能，实现生产力和竞争力的提升。</p><p></p><p>举几个实例：比如在工厂内部，我们的生产线会用 <a href=\"https://www.infoq.cn/article/gsEel0fax469NrUARbjp\">AI </a>\"技术来替代部分传统的、重复性的人工检验或者人工监控工作。通过这种方式，人就可以被释放出来去做更有价值的工作。</p><p></p><p>再比如供应链上下游，对运输物料和产品的车辆，进行实时的状态监控和行程管理，通过后台数据的计算分析，如果预判会出现延误的风险，系统可以做到及时预警并提醒相关人员采取对应的措施。</p><p></p><h4>据了解，施耐德电气还在利用数字化实现端到端供应链的碳中和，具体如何实现？</h4><p></p><p></p><p>顾俊：我们的目标是到 2040 年实现端到端供应链的<a href=\"https://www.infoq.cn/article/wK91ohatBuULkxsliMaa\">碳中和</a>\"。2050 年实现端到端价值链的净零碳排放。</p><p></p><p>其实在整个供应链体系中，我们自身运营层面的碳排放量只占不到 10% ，其余 90% 以上的碳排放量都产生在客户使用产品的过程中以及供应商制造和交付零部件的过程中。</p><p></p><p>所以，从 2021 年开始，我们就面向全球 1000 家重点供应商推出了“零碳计划”。目标是到 2025 年，把这部分供应商运营端的碳排放量削减 50%。为了达成目标，我们采取了很多措施，比如对供应商进行培训、提供咨询服务、引入减碳方案等等。此外，我们还革新了产品设计方案，采用大量绿色低碳技术来降低产品生命周期的碳排放量。从目前来看，施耐德电气已经做了很多碳减排的工作，并且还在不断加大可持续方面的投入。</p><p></p><p>举例来说，基于数字化技术，我们可以从各个用能终端处采集各类能耗信息，之后进行数据处理和分析。基于历史数据的积累和学习，数字化平台会形成一套正常状态下的基线数据标准。随后将监测到的实时数据跟基线标准进行对比，当出现异常状态时系统会自动触发报警信息给到相关人员，并可以给出相应的提示和行动建议，从而有效地管控生产运营中出现的异常能耗等问题。</p><p></p><p>换句话说，有了数字化这双“慧眼”，能够赋能企业更加清楚地洞察生产现场的运营状态以及未来的变化趋势，从而及时采取相应的管控措施，或者找到未雨绸缪的预防对策。</p><p></p><h4>施耐德电气在实现供应链数字化的过程中，经历了哪些困难和挑战？</h4><p></p><p></p><p>顾俊：主要难点在于中央的数字化团队和本地管理团队之间的协同合作问题。</p><p></p><p>过去我们开发数字化应用，很多情况下是中央团队派人，针对某家工厂的实际需求做定制化开发和落地。换句话说，中央团队会到相应的工厂把应用从头到尾全部做一遍。这么干虽然有效果，但也存在先天的缺陷：首先，开发速度会比较慢；其次，定制化程度太高，缺乏规模化效应，后期很难推广。</p><p></p><p>后来我们反思了这一模式，这里面的关键在于要先想清楚——中央团队应该做哪些事情，本地工厂的团队又应该做哪些事情，大家的工作边界要有机切分。</p><p></p><p>所以，我们后来便进行了相应调整，比如明确了中央团队的定位，着重在做数字化转型的基础性赋能平台。有了基础平台之后，本地工厂的员工，经过一些相对简单的技术培训，就可以用灵活的、图形化的、<a href=\"https://www.infoq.cn/article/UdGTsgRmdWEUxMxV3Aii\">低代码</a>\"的方式在这些平台上进行应用开发。需要强调的是，底层的标准化和规范化必须由中央统一来做，这样才能有助于数字化工作的可持续发展。</p><p></p><p>本地工厂员工掌握一定的数字化技能后，基于基础平台，可以进行特定应用的开发和落地。因为他们懂业务，更了解业务需求，在这之上开发的产品和应用，一定就是最终用户想要的；此外，基于平台，中央团队也可以和 20 多家工厂的同事一起进行开发，各自分工执行，各做所需，从而形成规模化效应，提升企业的运营效率。</p><p></p><h2>虚线型数字化组织的构建和数字化人才的培养</h2><p></p><p></p><h4>实现供应链数字化，除了持续加强技术，还需要做什么？</h4><p></p><p></p><p>顾俊：对于一家“数字化移民企业”而言，其中最关键的还是软实力。</p><p></p><p>首先，企业要从业务发展以及市场竞争的角度来确立数字化转型的整体战略，据此确定数字化发展的目标，并且制定合理的路线图计划。</p><p></p><p>接下来，就是要去落地。企业<a href=\"https://gtlc.infoq.cn/2022/wuhan\">数字化转型</a>\"，一方面需要组织的保障，在施耐德电气内部，我们采取的是一种虚线型的数字化组织来促进工作落地；另一方面，需要创造良好的数字化文化环境，HR 同事和管理团队，都要亲力亲为，利用一切场合去营造良好的数字化文化氛围，而且要全身心地投入。</p><p></p><p>第三，数字化转型的成功还在于人才的培养。施耐德电气在数字化转型的过程中，不会完全依赖外部的供应商方案。因为，现成的商业化方案可能会比较贵，而且也不一定完全合脚。所以，站在业务需求的角度来讲，一定要培养自己的数字化人才，做一些系统的开发和落地工作，同时也要找合适的外部供应商合作，落地一些优秀的解决方案。最重要的是平衡好二者之间的关系，把握好一个度。</p><p></p><h4>这种虚线型数字化组织有什么特点和优势？</h4><p></p><p></p><p>顾俊：施耐德电气数字化组织分三层：</p><p></p><p>顶层是我们的中央数字化团队，规模较小，大概十几个人；</p><p></p><p>中间层会按照不同的技术领域划分各种数字化俱乐部，比如 RPA 技术、低代码技术、BI 技术、机器学习技术等，每个俱乐部都会有一个负责人，有的来自中央团队，有的来自其他部门或者工厂。加入这些俱乐部的都是在各自技术领域内能力较强、经验较丰富的数字化技术高手，可以独立完成开发工作，也可以指导他人学习进步；</p><p></p><p>最基础一层，是每个工厂的数字化团队，这个团队也是一个非专职的虚线型团队，其中会有一个数字化团队的负责人，他会组织大家利用业余时间聚在一起学习实践。</p><p></p><p>这三个层级之间是有衔接关系的。各个工厂的数字化团队，会得到中间层俱乐部以及中央团队的支持。然后，我们会定期对人员能力进行评估，工厂数字化团队中技能水平较高的员工，就会被提拔到各个技术俱乐部中，让他有机会接触到更多的专业方面的内容，也有机会在整个中国区甚至在全球层面拥有更多的曝光机会。未来，他不仅是做自己工厂的项目，也可以做整个地区的项目。</p><p></p><p>相应的，如果有些数字化人才的表现非常突出，他们也可以再进一步，直接进入到专职的中央数字化团队，承担数字化技术专家的工作职责。</p><p></p><p>通过这种方式，我们的组织就可以更好地衔接，同时也为我们的人才发展打下更好的基础。</p><p></p><p>由于每个工厂都有一个数字化负责人，我们在整个地区层面开展工作时，会利用这个数字化负责人网络来收集各个工厂的共性需求，并将这些共性需求作为重点课题，交由各数字化俱乐部的专家进行重点攻关开发。</p><p></p><p>而对于一些工厂个性化的应用需求，就会赋能工厂团队自行开发，当然如果有需要，我们也会从各个俱乐部和中央团队抽调专家资源去支持。</p><p></p><p>这种上下协同机制的实际效果主要体现在<a href=\"https://time.geekbang.org/\">人才</a>\"的成长上面，从目前来看，每年都有很多数字化方面的技术人才不断涌现出来。</p><p></p><h4>数字化转型是一个长期探索的过程，在这个过程中，施耐德电气是怎么定计划，并据此进行考核的呢？</h4><p></p><p></p><p>顾俊：毫无疑问，企业主要以发展和盈利为目的。我们每年会设一些目标并进行分解。举例来说，每个工厂会根据年度的数字化目标进行分解，制定具体的项目计划和目标，包括每一个项目所带来的财务贡献目标。每个项目的负责人和支持人会来共同承担项目目标，对应的项目成果最后也会作为人员绩效考核的一部分。</p><p></p><p>我们整个 HR 管理是有一套绩效考核体系的，每年都会设定相应的工作任务和绩效目标对员工进行绩效管理。因此，数字化项目的绩效管理也会被纳入其中。</p><p></p><h4>施耐德电气是如何提升业务人员的数字化技能的？</h4><p></p><p></p><p>顾俊：第一点，我们并不是要求他去掌握一些非常复杂的技能，比如编程技术，或者复杂的算法开发能力，因为这些并不需要每个人都去掌握。</p><p></p><p>但是，我认为业务人员可以去尝试掌握一些门槛较低的可视化技术以及低代码开发能力，这样会比较有助于他们的工作改善。当然，这需要他们自己花一些额外的时间去学习，我们公司也会以社团的方式来组织大家一起进行系统性的学习。</p><p></p><p>第二点，关键在于数字化基础平台，比如我们做的工业互联网平台，通过低代码拖拉拽的简单操作方式，降低了使用门槛，可以让用户更快生成自己想要的应用界面。</p><p></p><p>当然，除此之外，还需要人事部门的支持，一起营造出浓郁的数字化氛围。</p><p></p><h4>一个外行人，如何跨行进行数字化技术的进阶？</h4><p></p><p></p><p>霍太稳：有些同学想转到数字化领域，但是隔行如隔山，到底应该怎么做？关于这个问题，我们对数字化人才进行了简单的划分，这也是极客邦科技双数研究院成立之后发布的第一个成果，我们叫“<a href=\"https://www.infoq.cn/minibook/WvG2KwN4tFfpjtTaxNve\">数字人才粮仓模型</a>\"”。从上到下，“数字人才粮仓模型”把数字人才分成了五层：</p><p></p><p>最上面一层是数字思维管理者，他们是决定整个企业数字化转型成败与否的关键。因为通常情况之下，数字化转型被理解为“一把手”工程，所以数字思维管理者是金字塔尖上的人群，对应企业的 CXO 层级，既要有能力确定数字企业战略、数字企业文化、数字竞争力，还要关心企业的社会责任；</p><p></p><p>第二层是数字思维业务人才，包括很多销售、运营、营销、财务、市场、品牌、产品设计等等，他们需要采取一些数字化手段提升工作效率，需要提升数字化的思维，同时，还要掌握数字工具的使用技能，要有生态协同的意识，即从思想上和工具能力上都要进行培养，来支撑业务的创新；</p><p></p><p>第三层是业务架构人才，他们是业务的架构师，扮演的是业务和技术连接者的角色，相当于一个“翻译”人员，他们往往要参与到业务战略解码中，并根据战略和业务侧的需求，实现将企业内部业务横向打通，将外部生态有效互联的业务解决方案；</p><p></p><p>第四层是技术架构人才。业务架构师更懂业务，技术架构师更懂技术，但是通常来说，他们基本上都是既懂技术又懂业务的复合型人才。技术架构人才通常横跨多个技术领域，具有技术侧的全局思维；</p><p></p><p>最下面一层是专项技术人才，这部分人才需要具备两类能力，一类是软件工程能力，知道开发体系怎么运转。开发工作在企业里都是团队作战，通常说软件工程，主要指包含需求、设计、开发、测试、部署、运维的传统瀑布式开发，或者是敏捷开发迭代的模式。另一类是专项技术能力，包括人工智能、区块链、大数据等。这两部分叠加起来是专项技术人才需要持续学习提升的部分。</p><p></p><p>顾俊：我们在数字化转型的过程中遇到比较大的挑战是——如何把业务的语言翻译成技术听得懂的语言。所以我们需要横跨两个领域的“桥梁型人才”，这类人才是非常稀缺的，也是非常有价值的，因为他既得懂业务的逻辑、流程和需求，同时又得了解数字化技术的边界、特征和价值。</p><p></p><p>如果你希望走技术路线，那么你肯定是要钻某一项或几项的数字化技术领域，不断学习提升自己的技术能力；如果说你偏向做“桥梁型人才”，除了对于技术方面的必要了解之外，还要立足于业务，可以站在一个产品经理的角度来构思数字化跟业务的结合，成为复合型人才。</p><p></p><h4>嘉宾介绍</h4><p></p><p>顾俊，目前担任施耐德电气中国区供应链绩效及数字化副总裁一职，负责中国区工厂及物流中心的精益管理体系和数字化转型发展工作，具体包括运营体系持续改进、数字化转型战略规划及路线图制定、数字化解决方案落地实施、数字化组织建设及人才发展等。顾俊毕业于清华大学机械工程及自动化专业，于 2014 年加入施耐德电气，先后担任工厂的生产经理、工艺维修经理、工厂经理等运营管理职务。在加入施耐德电气之前，曾经在汽车行业有过多年的制造运营及供应链管理从业经验。</p><p></p><p>霍太稳，极客邦科技创始人兼 CEO，InfoQ 中国创始人，极客时间创始人，TGO 鲲鹏会发起人。2007 年创立 InfoQ 中国，2014 年创立极客邦科技，2015 年发起 TGO 鲲鹏会，2017 年创立在线职业教育学习品牌极客时间，2019 年开创极客时间企业版，拓展企业服务市场。</p>",
    "publish_time": "2022-11-17 11:35:01",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "生态伙伴及用户分享与数据库PolarDB相知相识的那些事儿",
    "url": "https://www.infoq.cn/article/AZUz8DKNajbZ54I4KyNi",
    "summary": "<p>开源人真心话<br />\n与大咖畅聊“数据库开源”热点话题</p>",
    "publish_time": "2022-11-17 11:54:43",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "数据库飞刀、惊玄分享数据库PolarDB开源的历程和思考",
    "url": "https://www.infoq.cn/article/LOJVrO7rsZ8WJDCzEber",
    "summary": "<p>是什么让客户代表喊出了“国货之光”？<br />\n来开发者社区「开源人说」揭晓答案！<br />\n5位阿里云数据库超级大咖、10位阿里云数据库开源生态伙伴嘉宾 、数十位业内资深开发者将在现场进行深度交流</p>",
    "publish_time": "2022-11-17 11:55:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]