[
  {
    "title": "在优化设计过程中为什么DesignOps很重要",
    "url": "https://www.infoq.cn/article/QUbPttfgyPAucmpHxBri",
    "summary": "<p>在设计团队规模不断扩大，项目的不断发展由最新的用户界面（UI）和用户体验（UX）所主导的大环境下，它们的成功不仅取决于技能，还取决于关键的操作和用户体验指标。</p><p>&nbsp;</p><p>当设计过程有时比它们所需要的还要更复杂、分散和混乱时，必须将DesignOps作为一项战略职能。</p><p>&nbsp;</p><p>但是，DesignOps的概念已经发生了显著的变化，现在它的实际应用已经远远超出了优化自己的设计工作流的范围。当今的设计运维需要共同的文化转变和不同的思维方式：</p><p>&nbsp;</p><p>培养跨职能，包括设计师和开发人员在内，通过项目经理（PM）、利益相关方和营销人员，更好地传递想法和结果，提高最终产品的质量，并增加团队共同产生的影响。欢迎围绕已经建立的用户界面（UI）和用户体验（UX）实践使用工具、系统和服务来完善路线图，消除孤岛，减少重复性任务，帮助建立单一的事实源，并提高数字产品设计和研发的速度和质量。理解数据是一座金矿，设计过程中的每一个决策和步骤都必须基于从调查、用户、可用性测试以及用户评估中收集到的可衡量的统计数据。</p><p>&nbsp;</p><p>使用这三个概念——跨职能团队、工具和数据的使用，你可以构建更好的工作设计操作，并将其作为战略职能使用，从而产生更好的产品、更快的上市时间，甚至增加收入。</p><p>&nbsp;</p><p>尽管使用设计运维并不是一种新的实践，但直到最近才有很多公司了解它的价值。Airbnb是首批创建并确立将DesignOps战略作为其现代产品开发周期一部分的全球化公司之一。他们的目标是“通过能提高执行速度和质量的集中式工具、系统和服务来为整个产品组织提供敏捷性。”</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/f3/f3d8022eaf8602a22814c8bad0c7180f.png\" /></p><p></p><p>为了建立更有效的流程，Airbnb将其DesignOps扩展到5个不同的部分，每个部分都专注于其数字产品设计和开发的特定方面。他们的设计流量增长总监<a href=\"https://airbnb.design/designops-airbnb/\">Adrian Cleave</a>\"解释说：“我们的职能包括设计项目管理、设计工具、本地化、制作设计和团队协调人员。我们与营销、产品、设计和工程部门密切合作，尽可能地创造最佳的用户体验。”</p><p></p><h2>整合的重要性和挑战</h2><p></p><p>&nbsp;</p><p>最初，Airbnb的案例听起来像是他们只需要将团队和任务结合在一起，但要将类似的战略职能应用到成功的DesignOps中，首先需要解决以下的挑战：</p><p>&nbsp;</p><p>用户体验创建者使用的特殊工具和流程会导致设计-开发的不一致性和运维功能障碍，这些问题会影响到整个数字产品链。有一种误解，即认为存在一种适用于一切流程的解决方案，而实际上每个项目都需要在微观层面上进行探索，根据其具体情况，需要对设计运维进行调整和更改。缺乏深入的沟通和定期的多学科会议，在这些会议上用户体验（UX）和用户界面（UI）设计、开发、产品管理团队和营销团队可以共同行动，清晰地交流设计理念、原型、愿景、目标和细节等。忽视了数字产品设计和开发工具的重要性，这些工具是操作事实的单一源。没有探索和测试新的想法、新的设计方法，因此落后于用户界面（UI）和用户体验（UX）设计的新趋势，这对于非常精通新时代技术的数字消费者来说是一种排斥。</p><p></p><h2>理解DesignOps的4Ps</h2><p></p><p>&nbsp;</p><p>当谈到DesignOps时，会涉及到四个关键部分或构建模块。 我称它们为4Ps：产品（Product）、流程（Process）、人员（People）和程序（Program）。 每个环节都能为设计师和数字产品开发团队带来了各自的好处。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/50/50609962ec1c2ed7406a135fc91c5032.png\" /></p><p></p><p>&nbsp;</p><p>DesignOps中以产品为中心（Product-focused）的部分由组织思想引导。它致力于：</p><p>&nbsp;</p><p>发现并消除瓶颈。阐明数字产品的目的，了解客户的需求，并设想它将为最终用户带来的价值。执行用户和可用性测试以获得更好的用户体验（UX）。创建一个重点突出的路线图，以交付从启动到测试再到交付的高级别设计项目。概述给定产品的工作分解结构，以便团队成员知道从哪里开始和结束。定义<a href=\"https://www.infragistics.com/community/blogs/b/jason_beres/posts/build-great-user-experiences-with-user-centered-design\">以用户为中心设计</a>\"的优劣通用标准和原则，特别是针对你正在开发的产品。定义、选择并调整设计质量指标，这些指标可以在团队中任何参与给定项目的人之间共享。构建情境和项目意识，使任何参与的相关人员都能保持一致，这样更容易跟踪项目进展。</p><p>&nbsp;</p><p>&nbsp;</p><p>流程（Process）的“P”围绕着这样的一个前提展开，即DesignOps关注的是组织的优先级和运作。这将业务和具体的设计项目结合在了一起，并专注于：</p><p>&nbsp;</p><p>在跨职能团队之间制定更好的工作流程。通过与来自不同部门（项目经理、开发人员等）的团队成员的定期会议来跟踪所有正在进行的事情。保留有关战略业务目标、工作范围和文档的信息作为指导。这样，你就可以更容易地跟上品牌要求和业务目标。确定最后期限，组织任务，并确定项目的优先顺序（如果有多个项目的话）。比如，这将会帮助你规划某些功能并确定它的优先级。</p><p>&nbsp;</p><p>人员（People）的“P”强调社交化，而不仅仅是分享更新。此处设计运维的重点是为沟通需求、技能、目的和设计团队能力提供更好的方法。主要的优先事项包括：</p><p>&nbsp;</p><p>消除沟通障碍和隔阂。明确用户界面/用户体验（UI/UX）设计部门中每个人的角色。确定设计师的具体需求，并尽可能确定技能差距。传达共同的愿景和共同的目标，以构建成功的产品和/或服务。参与设计冲刺，以改进你和你的团队如何看待和理解给定设计项目的范围、特性、目标和方向，避免设计偏差。了解设计团队的能力和工作量，以避免工作倦怠。</p><p>&nbsp;</p><p>DesignOps的第四个部分则专注于程序（Program），它致力于标准化的自动化DesignOps工具和技术。它需要：</p><p>&nbsp;</p><p>依靠相同的DesignOps工具、数字资产管理程序（DAMS）或其他数字产品开发平台来简化和支持数字产品设计工作流。开发用户研究数据库存储，使产品设计和开发过程中的每个人都能轻松访问。通过全方位的设计和沟通工具，在团队成员和部门之间建立跨职能协作。从参与设计项目的任何人那里获得设计构思、评估和建设性反馈。克服沟通不畅的障碍，并解决简单的日常运作问题，例如，开发人员不知道由哪个设计师负责创建某个特性。</p><p></p><h2>结合4Ps，改进设计工作流程和操作的技巧</h2><p></p><p>&nbsp;</p><p>采用单一的操作事实源。</p><p>&nbsp;</p><p>这将帮助你和整个数字产品团队（包括市场营销人员、项目经理和开发人员）管理估计、规划和跟踪孤岛，跟踪任务和进度，并清晰地理解设计和开发规范。Gartner建议在此过程中使用通用的企业敏捷规划（EAP）工具和敏捷实践来提供帮助。</p><p>&nbsp;</p><p>在他们的“<a href=\"https://www.gartner.com/doc/reprints?id=1-28D1TLEQ&amp;ct=211208&amp;st=sb\">DesignOps：快速组织、协作和创新产品用户体验</a>\"”一文中，作者指出：</p><p>&nbsp;</p><p>“DesignOps的一个基本方面是采用敏捷工作分解结构 (WBS) 来组织用户体验工作，从与大的战略目标保持一致，到单一EAP工具中的屏幕级细节。虽然这对大多数用户体验实践者来说一开始感觉很陌生，但敏捷WBS能很好地映射到用户体验工作中。这种方法的业务和运营效益是深远的，包括更准确的计划、估计、跟踪和报告。”</p><p>&nbsp;</p><p>作为DesignOps战略的一部分，通过为管理人员、设计师、开发人员甚至利益相关方提供一个单一的工作环境，每个人都可以轻松地调整他们的工作和任务，实时测试和评论原型，消除设计切换，减少成本高昂的迭代，跟踪进度并识别瓶颈。更重要的是，整个数字产品团队将受益于对最终用户、项目时间表、设计细节、特性和功能的即时情境感知。</p><p>&nbsp;</p><p>但是由于公司和用于EAP的自动化DesignOps工具的不同，结构可能会有所不同。</p><p>&nbsp;</p><p>培养跨职能团队之间的深度沟通，并使利益相关方参与其中。</p><p>&nbsp;</p><p>你可能会问“为什么是利益相关方？”当一个原型被丢弃，一切都必须从头开始时，这会导致时间、精力、金钱的浪费并会延长流程。为了避免这种情况的发生并构建出更高效的DesignOps，请确保参与的每个人（包括利益相关方）都能参与到协作创造力中。这有助于简化设计过程，并能极大地缩短设计开发时间。</p><p>&nbsp;</p><p>通常情况下，团队可以在流程的早期进行包括设计师和利益相关方在内的冲刺工作，以探索并测试不同的想法。通过这种方式，设计师可以直接洞察设计元素如何转化为网页、移动或桌面应用程序，而开发人员可以根据设计与代码沟通潜在的问题，利益相关方可以充当代理，测试产品的可用性，以提供新鲜且独立的视角。</p><p></p><p>了解有关公司、当前设计流程、项目管理和最终用户的所有信息。</p><p></p><p>这将帮助你和你的团队评估产生投资回报（ROI）的优势领域，消除最大的挫折，解决设计过程中的痛点，并从那里开始优化。召开公司和团队会议可以为你提供这些有价值的信息。</p><p>&nbsp;</p><p>必须要有专门的DesignOps人员。</p><p></p><p>不存在一个能够处理所有流程和任务的设计师，因为到最后，他们只能做实际的设计工作。数字产品设计是一项多层次的工作，需要在特定领域中有不同经验的单位。正如需要将用户体验（UX）和用户界面（UI）设计分离并由两个不同的专家分别处理一样，也需要一个专门的DesignOps人员。</p><p>&nbsp;</p><p>他或她的职责是：</p><p>预测并管理工作和资源帮助招聘具有合适技能的设计师沟通设计标准分配适当的DesignOps工具制定敏捷的工作分解结构，以优化设计师的日常工作流程识别既定流程和改进策略之间的关键差距帮助建立更具生产力的设计文化</p><p>&nbsp;</p><p>DesignOps专家的角色取决于特定公司的需求、优劣势，以及团队当前正在开发的数字产品/服务。</p><p>&nbsp;</p><p>使用并掌握数据来衡量设计标准，区分优劣实践和设计，并建立与最终用户的最佳共鸣。</p><p></p><p>没有什么比利用可操作的数据来构思和设计下一个数字产品有更大的价值优化和质量提升了。从这个意义上说，将数据分析作为DesignOps的一部分可以激发更好的设计和更好的用户体验，甚至可以帮助你紧跟当前的设计趋势，比如数据可视化和数据故事讲述等。</p><p>&nbsp;</p><p>总而言之，DesignOps是一种实践和思维方式的结合，可以构建繁荣的文化、改进设计工作流程、促进多部门流程（如设计师与开发人员的交接）、改进产品和服务的制作方式，并使项目能够以更快的速度发展。但要实现所以这一切并建立运作良好的DesignOps，你必须通过数据进行创新和设计，促进深度沟通和创造性协作，通过采用DesignOps工具适应数字化转型，了解你的公司及其业务实践，研究并探索最终用户，并与专门的DesignOps人员合作。</p><p>&nbsp;</p><p>作者介绍：&nbsp;</p><p>创新专家Jason Beres是全球领先的企业软件制造商Infragistics的开发工具高级副总裁。Jason曾为多家酒店撰写技术文章，在全国性会议上发表演讲，并撰写/合著了10本关于软件/开发的书籍。他在开发方面的专长进一步延伸，以确保数据和分析在现代网络和移动平台上能以创新和客户驱动的方式展示。Jason是软件测试过程、数据驱动团队、客户对产品设计、开源以及过去30年数据分析和商业智能变化等技术问题方面的专家。</p><p>&nbsp;</p><p>&nbsp;</p><p>原文链接：</p><p><a href=\"https://www.infoq.com/articles/designops-improve-process/\">https://www.infoq.com/articles/designops-improve-process/</a>\"</p>",
    "publish_time": "2022-08-11 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "快手发布B端业务品牌StreamLake，专注视频化升级全链路解决方案",
    "url": "https://www.infoq.cn/article/ZHcVAsKIRY3yrjk8Z86j",
    "summary": "<p>8月10日，短视频与直播平台快手在北京召开发布会，发布视频云品牌StreamLake，正式进军B端业务领域。</p><p></p><p>快手首席技术官陈定佳，快手高级副总裁、StreamLake业务负责人于冰，快手技术副总裁、AI技术及主站技术负责人王仲远出席发布会，知乎合伙人兼CTO李大海、联通在线信息科技有限公司副总经理秦吉波、NVIDIA英伟达亚太区开发与技术总经理李曦鹏等合作伙伴代表和专家分享了视频化浪潮的趋势与需求。</p><p></p><p>当前，视频化升级正在席卷众多行业，激发出庞大的视频云需求。快手StreamLake专注于成为视频化升级助推器，将沉淀多年的音视频和AI等关键技术能力以产品化的形式对外开放，提供一站式音视频+AI解决方案。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/60/53/603138cab083979163b499b54154f653.jpg\" /></p><p>图：StreamLake品牌发布会启动仪式</p><p></p><p></p><h2>Streamlake要把“重工业”变成“轻工业”</h2><p></p><p></p><p>视频正在成为各行业连接客户最广泛的载体。来自Ericsson Mobility最新报告显示，未来六年移动数据流量增长4.38倍，其中视频流量占比将达到79%。</p><p></p><p>快手首席技术官陈定佳表示，对于下一代互联网的形态，目前还存在比较大的不确定性，但无论承载介质是什么，底层都离不开音视频和AI技术。</p><p></p><p>“我们经常思考，快手过去得到的经验，打磨过的技术，沉淀出的解决方案，能否为更多企业所用？最终，我们以内容汇聚与分发方面的大规模实践经验，将多年积累的技术能力，沉淀为一套可复用的产品体系与服务。”陈定佳表示。</p><p></p><p>在快手高级副总裁、StreamLake负责人于冰眼中，随着5G广泛部署，未来几年视频将像空气和水一样无处不在，但视频化升级面临体验痛点多，带宽成本高，创新和规模化效率低等难题，是名副其实的“重工业”。</p><p></p><p>“StreamLake要把‘重工业’变成‘轻工业’，把快手服务大规模用户所积累的基础设施、AI、音视频、算法等核心能力，通过模块化、标准化方式开放给其他企业，形成全链路服务。”</p><p></p><p>快手技术副总裁、AI技术及主站技术负责人王仲远表示，StreamLake将帮助客户加速业务创新，提升用户体验，支撑业务增长，同时降低运营成本。</p><p></p><h2>StreamLake：视频化转型操作系统</h2><p></p><p></p><p>随着网络和屏幕的迭代，用户对视频清晰度需求持续升级。卡顿率的上升、机型适配的难度增加、成本的大幅提升等成为普遍挑战。</p><p></p><p>于冰表示，解决这些挑战要从音视频的第一性原理出发思考，即更清晰、更流畅和更低成本，这三个问题相互影响，相互制约，但快手经过多年的实践，总结出一套成熟的方法论。</p><p></p><p>首先，视频压缩和增强技术能够同时兼顾三个方向，可做到同等清晰度下把视频文件压缩到更小，从而实现流畅播放，带宽占用更低，又实现在同等带宽用量条件下，显著提升视频清晰度。快手自研的KVC编解码标准，相比最新一代国际视频编码标准H.266/VVC功耗高、难以普及的困境，能将解码功耗优化到与上一代H.265/HEVC标准基本一致，同时比行业平均水平节约40%～50%带宽。</p><p></p><p>其次，为了平衡清晰和流畅的矛盾，快手提出基于大数据的QoE（Quality of Experience）优化方案，通过大规模AB实验来验证每个优化手段的效果。其中最有效手段之一是多码率自适应算法，可在网络速度和清晰度之间做最优平衡，上线后用户卡顿率大幅下降49%。这些能力都会包含在StreamLake产品中，为行业客户提供最佳实践。</p><p></p><p>最后，成本优化方面，快手提出了基于ROI（投资回报比）的视频生命周期管理方案，运用精准视频热度预测模型来提前触发视频压缩任务，从而最大化节约成本。</p><p></p><p>于冰表示，基于快手深厚的底层技术积累和沉淀，StreamLake形成了编解码算法、传输算法、AI特效、知识图谱等丰富的原子能力，以及行业领先的下一代产品矩阵，点播云、直播云、媒体处理与存储、虚拟人、内容审核、特效美化、内容理解、互动与创作、快手云剪、快手极目、音视频SDK、SoundMatrix智能会议音箱、6DoF自由视角视频等产品，辅以专业技术咨询服务，为行业客户提供场景化的解决方案。</p><p></p><p>“把所有技术细节封装成一个用于全行业视频化转型的操作系统，给用户提供交互简洁、容易接入的交付界面，又能够灵活的针对各行各业做到深度定制和优化，解决各行各业特定领域的问题。”于冰表示，StreamLake在商业模式设计上希望与合作伙伴保持同向，优化视频体验，同时让成本可控，实现业务可持续发展与客户共赢。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/fd/d5/fd4f6cfb0fab150b6a9ac506f03fedd5.png\" /></p><p>图：StreamLake OS全景图</p><p>&nbsp;</p><p></p><h2>视频AI，为业务赋能</h2><p></p><p></p><p>StreamLake的技术能力与模块中，视频AI是重要组成部分。快手技术副总裁、AI技术及主站技术负责人王仲远分享了智能视频创作、智能视频理解、数字人及XR等技术给客户带来的价值。</p><p></p><p>王仲远介绍，快手上每天有海量的视频内容诞生，每个视频在平台上需要经历内容创作、理解、分发三个环节，在帮助创作者更加便捷、智能化地进行视频内容创作，以及结构化管理海量视频内容上AI发挥着不可替代的作用，快手日均AI服务调用达到了4500亿次，总共涵盖了全球超过10万种的机型。</p><p></p><p>基于快手海量视频汇聚及分发过程沉淀的AI技术能力，面向行业合作伙伴，王仲远正式发布了视频AI的三大类解决方案：智能视频创作，智能视频理解，数字人及XR，以助力各行各业客户实现视频化、智能化升级。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/e8/73/e843e1459dc45da19088157de47ce873.png\" /></p><p>图：StreamLake视频AI全景图</p><p></p><p>在智能视频创作解决方案中，包含了内容创作环节的人像美化、智能特效、图集成片、文案成片等能力，大幅降低视频创作的门槛，提升视频创作的品质；智能视频理解解决方案，依托快手多年沉淀的多模态技术，实现海量视频的结构化管理，像管理图书一样管理短视频，应用于内容生态分析、基于兴趣的个性化推荐、智能审核、原创保护等方向。</p><p></p><p>发布会现场，王仲远首次发布了“数字人及XR解决方案”，包括传播型数字人、服务型数字人、虚拟化身数字人，快手在三个方向均有布局和成功案例。目前，快手也已与联通在线达成战略合作，双方将共同研发数字人能力开放平台。</p><p></p><h2>坚持技术开放，专注视频云和解决方案</h2><p></p><p></p><p>据了解，快手StreamLake业务2020年开始酝酿，2021年起步探索，并在今年成为独立业务，StreamLake品牌发布成为快手技术toB业务的全新起点。</p><p></p><p>基于自身大规模C端业务的锤炼和极致优化经验，以及合作伙伴的成功合作验证，快手首席技术官陈定佳对StreamLake技术toB业务充满信心。“技术toB是长期坚定的方向，我们愿意和合作伙伴一起携手，赋能用视频技术探索商业世界的每一步，实现共生双赢。”</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/b2/8d/b293fe546532a0591bff3faaa8840f8d.png\" /></p><p>图：快手音视频核心技术积累</p><p></p><p>据介绍，过去一年，快手已携手知乎、中国联通、央视频、小米等众多合作伙伴，在视频化、智能化领域展开探索。</p><p></p><p>陈定佳表示，视频化正在赋能千行百业，StreamLake将在创新、体验、规模、成本四个方面为客户提供价值，快手自身发展中所经历的快上线、提品质、扛规模、控成本四个阶段所积累的底层基础设施和技术团队将提供有力支撑。</p><p></p><p>此外，NVIDIA将与StreamLake共建生态，携手致力向客户和伙伴分享最新的硬件和生态发展，向更多的开发者、初创公司和合作伙伴提供服务与支持。</p>",
    "publish_time": "2022-08-11 10:02:41",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]