[
  {
    "title": "QCon SF闭幕主题演讲：软件设计是一种人际关系活动",
    "url": "https://www.infoq.cn/article/8wkHjRq3qLOwv8DVNYsj",
    "summary": "<p><a href=\"https://www.kentbeck.com/\">Kent Beck</a>\"是<a href=\"http://agilemanifesto.org/\">敏捷软件开发宣言</a>\"的最初签署人之一（按字母顺序排在第一位的签署人），他在本周的<a href=\"https://qconsf.com/\">QCon旧金山大会</a>\"上发表了闭幕主题演讲。他演讲的题目是“整洁第一？（Tidy First？）”，这也是他即将出版的新书的名字。</p><p>&nbsp;</p><p>首先，他介绍了自己的个人使命：帮助极客们在这个世界上获得安全感。关于这一点，他在<a href=\"https://www.facebook.com/notes/1054470145004848/\">一篇发表在Facebook的博文</a>\"中解释过。</p><p>&nbsp;</p><p>他谈到，最近重读了Ed Yourdon和Larry Constantine的著作《<a href=\"https://www.amazon.com/Structured-Design-Fundamentals-Discipline-Computer/dp/0138544719\">结构化设计</a>\"》。按照他的说法，这本书里包含软件开发的牛顿定律；对于如今的编程来说，其中的概念和思想还和这本书刚出版时一样重要。书中介绍的耦合和内聚两个概念，即使在今天，也仍然是软件工程的一大挑战，就像这本书在1975年出版时一样。</p><p>&nbsp;</p><p>他说，他花了17年的时间才学会如何解释软件设计中的内聚概念，以此为契机，他写了一系列三本书来探索软件设计。感兴趣的读者，可以在<a href=\"https://tidyfirst.substack.com/\">Substack</a>\"上阅读。</p><p>&nbsp;</p><p>他说：</p><p></p><blockquote>软件设计是一种人际关系活动。</blockquote><p></p><p></p><p>正是通过探索这些关系，软件系统才出现在了这个世界上。</p><p>&nbsp;</p><p>第一个关系是希望探索的想法和将想法变成现实的行为之间的关系。这种关系是双向的，是不断发展的——想法定义了行为，行为的存在可以催生更多的想法（“现在我看到了这个，那么那个呢……”）。在思想和行为的背后是系统结构，也就是架构，它对可见行为有着深远的影响。</p><p>&nbsp;</p><p>系统结构对行为有着深远的影响，对因行为改变而产生的想法也有深远的影响。结构影响行为，从而产生新的想法，催生行为更改需求，进而影响结构，不断循环。在“整洁第一”工作流中，我们得以暂停一下，问问自己是否需要更改结构，或者只需更改行为。如果更改影响了结构，那么要首先整理下结构——根据需要重构底层架构。不要试图同时更改结构和行为，因为那会导致系统陷入技术债务。</p><p>&nbsp;</p><p>他说，在构建系统时，特别是在必须更改系统时，涉及两种视角，分别是等待者（waiters）和变更者（changers）。等待者有了想法，就会希望尽快更改行为，尝试新事物；变更者则必须维护代码，并整理结构，为的是可以安全地更改行为。</p><p>&nbsp;</p><p>当有多个变更者负责同一产品的不同领域时，复杂性会进一步增加。等待者的动机和不同变更者的竞争性动机之间很可能出现关系紧张的情况。</p><p>&nbsp;</p><p>软件设计技能就在于保持不同生产者以及变更者和等待者之间的良好关系。</p><p>&nbsp;</p><p>通常，变更者在收到更改产品的请求时会面临这样的问题：“这段代码很乱——我应该先整理再更改吗？”这个问题的答案通常很教条：当然应该或者当然不应该——我们希望尽快更改，并且希望可以保证代码库不受技术债务的影响。遗憾的是，两者无法兼得。我们需要做出决策，而正确的答案只能是“视情况而定”。</p><p>&nbsp;</p><p>为了说明等待者-变更者生态系统中的不同关系，他画了下面这幅图：</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/0a/0ad9c171faac1ea40867ec649e7ef730.png\" /></p><p></p><p>然后，他解释了为什么大量的前期设计在20世纪90年代是一个馊主意，而且直到今天仍然是一个馊主意。他说，瀑布式开发又回来了，有些组织再次尝试根据预先定义好的时间、成本和范围来定义软件开发的成功与否。他还解释了为什么增量迭代开发始终是构建软件系统最经济可靠的方法，而且如今更是如此。</p><p>&nbsp;</p><p>他讨论了<a href=\"https://tidyfirst.substack.com/p/constantines-equivalence\">Constantine的对等概念</a>\"：软件系统的实际成本是更改系统的成本。在系统的生命周期中，维护系统的成本将使初始开发成本在整体投资中的占比变得很小。然后，他展示了维护产品的成本如何与系统耦合的成本直接相关。对系统中一个元素的更改导致了对另一个元素的级联更改，进而又导致了对另一个元素的更改，诸如此类……</p><p>&nbsp;</p><p>系统的总体成本可以看作是系统元素的耦合成本与解耦成本之和（他用了元素这个词，代码的实际性质和我们这里介绍的内容没有关系——那可以是函数、远程过程、微服务或任何其他相关的组件）。</p><p>&nbsp;</p><p>系统的底层结构（架构、设计）是耦合/解耦问题中最重要的一个因素。</p><p>&nbsp;</p><p>当考虑更改系统时，可能大多数情况下都是在没有多少级联耦合的部分进行，然而，在产品的生命周期中，可能有一些巨大的更改——其中耦合级联如此之大，以致更改成本变成了天文数字。在系统的使用周期中，这些巨大的更改很可能占了维护成本的绝大部分。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/37/37ad0d9d15f6d15a7f299aa34a2a0fbc.png\" /></p><p></p><p>最后，他鼓励听众进行小幅增量更改，尽可能保持系统结构的整洁与解耦，并采取“整洁优先”的方法进行软件维护。</p><p>&nbsp;</p><p>&nbsp;</p><p>原文链接：</p><p><a href=\"https://www.infoq.com/news/2022/10/beck-design-human-relationships/\">https://www.infoq.com/news/2022/10/beck-design-human-relationships/</a>\"</p><p></p><p>相关阅读：</p><p><a href=\"https://www.infoq.cn/article/SxEUUtjMIWxc2cvJGZK4\">只擅长构建软件是不够的，我们必须擅长构建可测试的软件 | QCon</a>\"</p><p><a href=\"https://www.infoq.cn/article/GJzzBMFovvYpiE8x2R0D\">为下一个 Log4Shell 漏洞做好准备 | QCon</a>\"</p><p><a href=\"https://www.infoq.cn/article/UyNHqr8HISLsxyyY0l2v\">如何使用区块链构建 Web 3.0 基础设施｜QCon</a>\"</p>",
    "publish_time": "2022-12-16 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "Linux 基金会宣布成立开放元宇宙基金会 | InfoQ独家快讯",
    "url": "https://www.infoq.cn/article/yEC0rDdf4y5VCyTW9bmF",
    "summary": "<p>美东时间12月15日，InfoQ独家获悉，Linux 基金会拟成立开放元宇宙基金会（Open Metaverse Foundation，简称，OMF）。</p><p></p><h2>一个面向所有人开放的元宇宙</h2><p></p><p></p><p>开放元宇宙基金会总经理Royal Obrien如此解释开放元宇宙基金会成立的初衷：</p><p></p><p>“开放元宇宙的潜力是巨大的。它可以像万维网一样具有影响力，但前提是我们必须共同努力。最好的情况是，它可以是一种不断变化但持久的沉浸式体验。它既存在于数字世界和现实世界之间，也存在于数字世界和现实世界之中。为了让元宇宙真正像互联网一样蓬勃发展，它需要成为一个面向所有人的开放的元宇宙”。</p><p></p><p>Royal Obrien介绍，近期围绕筹备开放元宇宙基金会展开了一系列工作。在今年10月，Royal Obrien团队邀请了来自不同领域的顶级专家与Linux基金会许多项目的领导者一起讨论，如何将新兴的元宇宙概念从概念转变为现实 — 从数字资产、模拟和交易，到人工智能、网络、安全和隐私以及法律等多个层面考量。</p><p></p><p>作为实现元宇宙这一奇妙旅程的下一步，“我们欢迎开放元宇宙基金会加入Linux基金会，作为另一块‘拼图’”，Royal Obrien说道。</p><p></p><p>这仅仅是个开始。</p><p></p><p>Royal Obrien认为，我们仍处于元宇宙的早期阶段。元宇宙的最终实现，是一个迭代的谜题，如果想要获得成功，就必须将不同的部分组合在一起并进行互操作。“在这个过程中，要做的工作太多了。但我们非常兴奋能一起踏上这段旅程”。</p><p></p><h2>全球逐梦元宇宙</h2><p></p><p>自2021年以来，元宇宙的概念实火。全球很多公司都在讲元宇宙的概念，认为元宇宙是或指向互联网的“终极形态”。</p><p></p><p>所谓元宇宙，是一个虚拟时空间的集合， 由一系列的增强现实（AR）， 虚拟现实（VR） 和互联网（Internet）所组成。可以简单理解为，平行于现实世界的虚拟世界，现实中人们可以做到的事，都可以在元宇宙中实现。</p><p></p><p>维基百科对元宇宙的定义是，通过虚拟增强的物理现实，呈现收敛性和物理持久性特征，基于未来互联网具有链接感知和共享特征的 3D 虚拟空间。</p><p></p><p>其实，元宇宙（Metaverse）的概念起源于科幻小说《雪崩》。</p><p></p><p>1992 年，尼尔·斯蒂芬森描述了一个人们以虚拟形象在三维空间中与各种软件进行交互的世界。他在书中这样描述这个世界，“只要带上耳机和目镜，找到一个终端，就可以通过连接进入由计算机模拟的另一个三维现实，每个人都可以在这个与真实世界平行的虚拟空间中拥有自己的分身”，这个虚拟空间，就是“元宇宙”。</p><p></p><p>20 多年后，元宇宙再一次火了，人们相信，未来有一天，小说中的畅想终究会实现。</p><p></p><p>近两年，Meta、英伟达、微软、百度、字节跳动等海内外科技大厂已相继展开对元宇宙的探索和布局。</p><p></p><p>例如去年底，Facebook 将自己改名为 Meta，以反映其对虚拟现实业务的专注程度。去年 8 月，英伟达宣布，全球首个为元宇宙建立提供基础的模拟和协作平台 — 英伟达 Omniverse™通过与 Blender 和 Adobe 集成实现大规模扩展，并将向数百万新用户开放。去年 10 月，微软公司董事长兼首席执行官萨提亚·纳德拉在谈到未来十年及以后的计算机科学研究发展趋势时表示，展望未来，他对三件事感到兴奋，其中一件事是“人机界面”的发展，他表示对元宇宙非常感兴趣。“我们在 2D 视频会议领域做了很多工作，我们也一直非常看好混合现实，我对元宇宙的意义非常感兴趣。因为对我来说，人的存在是最终极的事。如果开会的时候，你我即使不在现场，也可以看起来像真的都在现场一样，那将是一个重大的突破”。</p><p></p><p>尽管热度很高，但目前，对于元宇宙，还没有统一的明确的概念。元宇宙的实现，既仰赖人工智能、VR/VR、5G、云计算、大数据等基础设施的支持，又要求深入应用到行业中，并建立起生态，这都需要花费很长的时间。</p><p></p><p>《三体》作者刘慈欣曾有一个著名的论断：人类的面前有两条路，一条向外，通往星辰大海，一条对内，通往虚拟现实。他认为人类的未来在于前一条路，而后一条将会带来内卷，把人类带向毁灭的境地。奇幻的元宇宙时代什么时候到来，还面临很大的不确定性。</p>",
    "publish_time": "2022-12-16 10:09:41",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "作为一名技术管理者，应该如何保持进化？",
    "url": "https://www.infoq.cn/article/AEhJGG2czX92mCHtduZG",
    "summary": "<p>技术管理似乎是一个永恒的话题，因为它本身就无法用一种标准化的方式去定义，对于技术人来说，实践经验才更具备可参考性。本期《InfoQ极客有约》，我们邀请到了来自<a href=\"https://www.infoq.cn/u/growthease/publish\">网易智企</a>\"游戏行业部总经理，网易云商CTO尹竞成，关于技术领导力以及如何构建一支高效的研发团队，他有着特别的思考。</p><p>&nbsp;</p><p></p><p></p><p>本期栏目的对话内容整理如下，供读者参考回顾。</p><p>&nbsp;</p><p>InfoQ：首先请尹老师做一下自我介绍，您的职业经历有哪些？</p><p>&nbsp;</p><p>尹竞成：我2005年毕业于浙江大学计算机专业，毕业之后在日本有过两年工作经历，2008年11月加入网易后，一直持续到现在有14年时间。虽然一直在网易，但是网易内部业务比较多元，在内部有过几次转岗经历，相当于内部跳槽。</p><p>&nbsp;</p><p>我做过的业务有面向 C 端用户的应用软件，当时主要做企业邮箱的客户端开发；后来转去游戏部门做端游、手游的开发，这为后来做行业线的开发打下了基础。这段工作经历让我对游戏制作流程有所了解，也对游戏制作过程中面临的困难和挑战都有了一些体会。从2015年开始转到网易智企来做ToB的SaaS业务。目前主要负责两方面工作，一方面是网易智企旗下服务营销一体化平台网易云商的研发工作，另一方面是网易智企游戏行业线的拓展工作。</p><p>&nbsp;</p><p>网易智企有三条业务线，分别是网易易盾、网易云信和网易云商，我们有很多行业线的客户，希望以行业线的视角去在客户实际业务场景下做探索，一方面能加深我们自己的产品在客户场景下的适配性，另一方面也希望能够让用户有更加一致的用户体验。这是我目前所负责的一些工作内容。</p><p>&nbsp;</p><p>InfoQ：如果让尹老师划分您自己的工作经历，您会把它分为几个阶段？</p><p>&nbsp;</p><p>尹竞成：我的工作经历主要分为三个阶段。第一个阶段是纯码农阶段，以自己写代码为主，包括业务代码的开发、系统架构的设计和落地、老业务的重构等等，主要是以具体业务开发为主。另外，这个阶段也开始逐渐地有一些简单的管理和协调工作，但是基本上不涉及到人事、考核，也没有组织架构的视角。</p><p>&nbsp;</p><p>第二个阶段，当我开始转到 To B 业务领域，开始负责网易云商的一个完整的技术团队后，工作就变得更加复杂、多元。作为一个业务团队技术负责人，从事情的角度来看，要去做技术栈选型、架构设计、技术演进规划，以及对整个项目的交付周期、交付质量的把控，对线上问题的反馈及沟通等等，这些都要去做处理和跟进。从管理角度来看，需要根据我们业务的特点以及组织发展的阶段，去设计团队的结构，向上去争取资源，比如要招多少个人、不同岗位序列之间的人员配比，以及后面人员的培养、激励、保留等等。To B 业务的价值链相对比较长，因此我们组织内部相应会有很多的平行团队，比如市场团队、销售团队、售前团队、产品团队、售后团队等等，这时候另一个职责就是需要我们做好团队之间的沟通和协作。总之，这个阶段自己需要跟进的事情会特别碎，碎片化很明显。</p><p>&nbsp;</p><p>第三个阶段，是近两年开始负责一些业务，从一个单纯的技术向开始朝业务向发展。这个时候不再纯粹是一个技术人员，开始背业务指标。要考虑的不仅仅是怎么把具体的明确的事情做好，而是要去想清楚整个团队做什么事情的价值会更大。要想清楚我们商业模式的设计，做好产品的规划，更大、更复杂的团队组合的设计。但这个阶段我也才刚刚起步，还是在不断地学习和成长的阶段。</p><p>&nbsp;</p><p>InfoQ：您刚开始接触领导工作的时候，处于一个什么样的状态？有很多一线的技术人员，他的业务能力非常强，但是开始转管理以后，就会遇到各种各样的问题，存在一段阵痛期，您当时有没有遇到过这样的状态？</p><p>&nbsp;</p><p>尹竞成：我自己也有亲身经历和体会。在网易智企内部每年都有管理者的培训沙龙，我在负责其中一节课的授课。课前课后往往会收到很多同学的咨询，他们在刚成为一线管理者的时候其实挺痛苦。原来只需要把自己管好，但是成为管理者之后，责任变得更大，组织对他的要求是管理好整个团队，所以要关注整个团队业务的产出，也要关注每个成员的情绪、状态以及期望，还要关注团队能力的成长。举两个例子，有一种情况是当看到下属工作做得不太好的时候，恨不得自己冲上去自己把事情解决掉，自己干可能效率更高、效果更好；另一种情况是，大部分中基层管理者都是从一线提拔出来的，原来平级的同事变成了下属，这种时候在情绪表达时就会有些困扰，比如在绩效沟通的时候，表扬夸奖很容易，批评的话不好意思说出口了。</p><p>&nbsp;</p><p>如果想快速度过刚开始的阵痛期阶段，我有几点心得体会可以分享给大家：</p><p>&nbsp;</p><p>第一，心里要有预期。阵痛阶段肯定会存在，大家要做好打硬仗、打持久仗的准备。不要把成为一个管理者当作晋升了一个官阶，而是要把管理当成一门学科、成体系化的一门课程。转型肯定需要周期，也必定会有阵痛。前面也有提过，我自己刚开始做管理的时候，工作是非常碎片化的，琐碎且繁重。基层管理确实比较辛苦，大家要调整好自己的心态，认真去面对这件事情。往积极的方面想，这个阶段是非常锻炼人的。</p><p>&nbsp;</p><p>第二，不管是自己直接负责的业务工作效率，还是管理效率，都需要有所提升。我建议把事情分类，分清楚每类工作的优先级，在这个基础上主动去预见未来一个周期内的工作，做好时间的规划和管理，千万不要等着事情找上来被动响应。在向上、向下管理的时候，可以充分利用好各种管理工具，比如OKR、周报。把很多信息沉淀在工具里面，将来再去回顾、做总结的时候，也会是很好的资料。另外，随着管理幅度变大，我们往往很难关注到每个下属的工作进展，其实也没有必要关注每个下属。有的管理者会把注意力放到效率不高或者能力没那么强的同事身上，但我认为其实可以反过来想，是不是把自己的脑力资源和时间资源投入在看起来不需要你的下属身上，可能会带来更多的投资回报。管理本身就是需要找“高杠杆率”的事情去做。</p><p>&nbsp;</p><p>第三，多沟通、多交流。无论是一线员工，还是管理者，甚至更高Level的岗位，当遇到烦恼和苦闷的时候，不要自己憋在心里。沟通的对象包括上级、部门的HRBP、平行部门的Team Leader，以及业界的其他更优秀的人士等等，不要把自己闭塞在一个小的圈子里。要走向更大的圈子，收获新的思路。同时沟通本身其实也是缓解压力的一种方式。</p><p>&nbsp;</p><p>InfoQ：领导是向上沟通好还是向下沟通好，您比较认同哪一个？</p><p>&nbsp;</p><p>尹竞成：都很重要。一个优秀的管理者，向上与向下沟通都是工作中很重要的部分和内容，但是更最重要点在于沟通的主动性。我们不能总是等着领导来布置任务，也不能等着下属遇到了问题，然后再来找你沟通。我认为比较好的沟通是有规划、有节奏的，要有设计感。工作需要被动响应时，对既有时间分配和工作安排会有一定冲击，会影响工作的效率。</p><p></p><p>向上管理和向下管理目的是不一样的，向上管理的目的是去沟通资源、对齐目标；向下管理的目的除了对齐目标之外，可以给下属一些正反馈，也可以及时沟通相对不太好的工作表现，做一些牵引和引导。这两方面不冲突、不矛盾，都很重要。</p><p>&nbsp;</p><p>InfoQ：成为技术领导者以后，您是怎么分配时间的？</p><p>&nbsp;</p><p>尹竞成：我没有固定的时间比例分配，需要根据业务发展阶段以及组织成熟度来定。比如当整个业务在拼命往前冲的时候，我作为团队中的一员，会花很多时间在核心代码的编写，以及架构设计、技术选型上面。当研发团队和工作流程相当稳定下来以后，业务发展到另一个阶段，需要我往前向走，去和客户沟通、和产品沟通，我的精力就会放在另外一方面。</p><p></p><p>我认为最核心的地方其实自己要想清楚，组织把团队交给你，是希望你能够把团队带出来，你是撬动杠杆的那只手，要找到支点把团队最大的能力和效率发挥出来。至于管理者该做什么事情，与组织发展的阶段以及团队整体的成熟度有关。比如团队里有特别成熟的架构师来辅助你，那么你就不需要在编码或者架构设计上面投入特别多的精力。一个成熟的组织，团队成员能力是多元的，管理者需要充分调动发挥身边每一位同学的能力。</p><p>&nbsp;</p><p>InfoQ：一个刚进入职场的程序员，怎么判断自己是适合走技术管理者路线，还是走架构师路线？您有什么建议吗，您在带团队时有没有观察到什么特征？</p><p>&nbsp;</p><p>尹竞成：刚步入职场其实不用想太多，首先需要先把自己的基本功打好。做为程序员，职业生涯的起步阶段要先在技术深度和广度上有充分的磨练，即使成为了技术管理者技术能力也是非常重要的。团队的高管可能会空降，但是基层管理者和中层管理者往往不会空降，一般都是内部成长提拔出来的，因为这样的人会更加适应组织的文化和土壤。所以一个人想比周围的同事跑得快，必须在技术和业务上有更突出的能力。技术能力不是短时间就能练成的，需要多年的开发实践去积累经验。尤其是现在的技术发展更快，我们需要不断学习才能把握技术方向。所以一开始不要想太多，先把自己的技术做得更扎实一点会比较好。</p><p>&nbsp;</p><p>我觉得管理需要一定的天赋加上后天的锻炼和培养。对于识别自己是否有管理能力，可以先试试自己是不是可以成为一个小模块的owner，再慢慢变成一个小项目的owner，再判断自己在沟通、协调、组织等维度上是否有感知，逐步地再向技术管理者去发展。当在这方面崭露头角之后，对一个事情逐步形成自己掌控力，开始对周围的同事有影响力的时候，组织自然而然就会去考察你，给你当管理者的机会。</p><p>&nbsp;</p><p>InfoQ：一名优秀的管理者身上具备怎样的特质，怎么定义优秀？对于一名技术管理者来说，您认为是技术攻坚能力更重要，还是团队管理能力更重要？</p><p>&nbsp;</p><p>尹竞成：想成为一个技术管理者，技术能力一定是非常重要的。互联网行业并没有纯粹的管理者，任何规模的团队，任何级别都需要有直接的产出，而不是只去做好企业管理、组织协调就好了，只是在不同的阶段产出会不一样。比如作为一个技术人员，最初是交付代码完成业务需求的开发，到后来变成架构设计和演进，当成为管理者之后，对团队整体技术和业务方向就要有所把握。</p><p>&nbsp;</p><p>如果成为了一个基层的技术管理者，我认为技术攻坚能力可能是更重要的。但是当成为CTO、技术一号位之后，管理水平会变得重要起来。管理者就是要不断去寻找高杠杆率的管理活动，并且加速它的完成。对于技术管理者，假设管理着100人的研发团队，带领团队制定好目标，做好计划、沟通、反馈，通过各种方式做好团队培训、能力提长、团队激励，帮助整个团队提升效率和成绩，显示要比自己编码带来的价值更大。</p><p>&nbsp;</p><p>综合来看，我认为好的技术总监一定是复合型人才，综合的成熟度是组织成功的关键。在不同的阶段和不同团队配置下，技术和管理有不同的侧重。当成为复杂业务的技术一号位之后，管理能力显得更为重要一点。</p><p>&nbsp;</p><p>InfoQ：现在是不确定性的时代，技术如何去成就业务？和过去相比，疫情当下技术团队承担了不一样的使命和责任，也给技术人员以及技术管理者提出了新的要求，尹老师是否感受到了这样的变化，在疫情之后这样的变化是否更加明显？</p><p>&nbsp;</p><p>尹竞成：第一点也是核心点在于，互联网增速没有原来那么快了，已经过了爆发增长期。第二点在于，现在随着技术的进步、成熟，以及云服务的完善，原来很多业务需要的一些基础能力，现在不需要自己的技术团队去完成，可以去外采或者外包。原来对技术团队的要求往往是做好支撑就好了，比如完成业务需求，或者做好内部系统集成，把IT建设做好。现阶段对技术团队的要求在变化，技术团队要去完成外部采购无法完成的事情，推动业务的成功，否则就很难凸显出来团队价值。没有足够没有价值呈现，在现阶段会变成技术人员的生死线。外采的能力用来提升效率、节省成本是可以的，但是用来成就业务肯定是不够的。</p><p>&nbsp;</p><p>我觉得一个好的技术管理者，很重要是要学会像CEO一样思考。比如一个业务的CEO会考虑，我们处在一个怎样的行业和赛道，客户是谁，客户为什么用我们的产品而不用其他人的，能不能用更少的成本去交付客户的需求，能不能更超前地去交付客户的需求？那么一个优秀的技术管理者也需要考虑这些问题，并沿着这些方向去思考和前进，解决CEO的痛点。这里有几个维度：</p><p>&nbsp;</p><p>第一，一个好的技术管理者应该有行业知识，要比产品团队或者运营团队对行业有更深的理解。比如电商，不能只会做电商的业务系统开发，还需要知道仓储物流、供应链，以及电商的运营活动等等各种知识。只有深入了解行业知识和痛点，才能指导我们做好技术工作，并且做好前瞻性技术规划。</p><p>&nbsp;</p><p>第二，要有客户思维。要站在客户的角度去思考问题，理解客户的需求并解决问题；我们的产品要给客户好的使用体验。这也是网易最新文化价值观中所倡导的，要和用户在一起。</p><p>&nbsp;</p><p>第三，要有竞争思维。我们永远都处在竞争的环境。作为技术管理者需要去考虑如何帮助业务建立核心竞争力，如何去保留客户，并尽量提高客户的切换成本。</p><p>&nbsp;</p><p>第四，成本的视角。很多成本在短期内不一定能够得到有效评估，但是从中长期来看，成本结构不仅是商业模式的重要组成部分，也决定了团队成长的天花板。而且研发人员的薪酬在公司里占比较高，合理优化团队结构，保持足够的战斗力和活力，对CTO来讲非常重要。</p><p>&nbsp;</p><p>第五，CTO一定要有创新的思维和视角，包括技术创新、业务创新，也包括组织创新。我们所处的时代变化很快，技术进步也很快，我们要努力去看未来2-3年的发展趋势，并提前做好规划。</p><p>&nbsp;</p><p>我觉得一个技术负责人如果不能够像CEO一样去思考，他和CEO的交流和沟通就一定会存在错位和断档，会引发一些摩擦。</p><p>&nbsp;</p><p>InfoQ：现在有很多新技术，怎样去评估某项新技术是否要引入系统，这很考验管理者的技术决策力。怎样去培养这种技术的决策力，您有什么建议吗？</p><p>&nbsp;</p><p>尹竞成：技术管理者需要根据业务发展阶段、团队能力模型、团队成熟度等方面去看待技术选型，这是一个技术管理者的基本功。具体落地实践，可以小步快跑，我们可以从一些小的业务线、小的场景逐渐地去做探索和实践。通过小规模的发布或者一个小场景的线上用户的真实反馈，来判断业务的价值，这种真实的环境往往会带来比实验室环境更加真实有效的反馈，然后再通过小规模的试对或者试错决定是不是要向更大规模的范围推广。当然这对整个组织能力以及整个技术架构有一定要求，不一定适用于所有业务，但是要有这种思维和意识。</p><p>&nbsp;</p><p>InfoQ：如何去打造一支高效的研发团队，在您理想当中一个高效的研发团队应该是什么样子的？</p><p>&nbsp;</p><p>尹竞成：高效能的本质，是能够以较低的成本，持续地、快速地、高质量地进行交付。比如，随着业务复杂度的提升，随着团队规模的变大，系统的熵会增加，熵增会带来整体效率的降低。我们做的所有治理工作、研发效能提升工作，其实是希望能把熵控制在一个较低的水平。我们需要通过外力把组织的损耗降低。所以一个能够自我观测、持续学习、持续改进的团队，是我想打造的团队。</p><p>&nbsp;</p><p>我们在职业组织的发展过程中一定会遇到各种各样的问题，包括商业环境、组织内外部环境，以及人员变动的问题等等。一个能够随着外部环境去自我升级、自我进化的团队是优秀团队的必要因素。培养和提升团队成员的能力，要比用流程规范去约束他们或者推广效能工具平台的使用更加重要。</p><p>&nbsp;</p><p>InfoQ：您认为大企业或者超大企业与中小企业，在开展研发效能工作时会有什么不同，会侧重哪些关注点？</p><p>&nbsp;</p><p>尹竞成：大企业或者超大企业，一般都会有专门的团队去做效能提升工作；而中小企业通常顾不上效能提升，只要能保证公司运转就可以。其实并没有本质的区别，比如在大厂的创新业务里面，研发效能不是最重要的事情，小步快跑、去验证商业模式的合理性才是最重要的。从落地形态来讲，大企业会更加立体，包括效能工具、效能指标、流程规范、考核体系等等各种方式系统性的优化；而中小公司不一定有工具，自动化能力会少一点，可能会通过流程规范去约束大家把事情做好。大公司团队人员多，每个人的效能即使只提升一点，对整个组织效率提升的收益也会很可观。</p><p>&nbsp;</p><p>InfoQ：回顾您过往的经历，遇到的最大的一个挑战是什么？</p><p>&nbsp;</p><p>尹竞成：举两个例子。我们把研发效能提升看成是一个项目，要有研发投入，需要去向组织争取研发资源和时间资源，需要向老板说清楚这件事的投入以及收益分别有多少。然而刚开始在做的时候很难把收益量化，甚至短期内收益可能是负的，所以资源争取会有些困难。这个时候管理者一定要有决心和魄力。自己要坚信这件事一定是对的，自己有信心时组织和领导才会对你有信心。另外就是信任，如果每次都半途而废或者无功而返，组织对你的不信任程度就会增加。只有不断地攻城略地，为组织带来正向收益，争取资源时也会更容易一些。同时，还可以拿出过往类似项目的成效数据，来佐证我们做这件事的价值。</p><p>&nbsp;</p><p>另外，效能工具或者流程规范推广时也会遇到一些阻力。当然，如果能够争取到 CTO 或者 CEO 的支持，对于推广会带来一些便利，但不能经常利用自上而下的管理强压。任何的岗位和序列都会有工作惯性，他们习惯用原来的方式方法，习惯用原来的工具，在让他们替换成新工具时会有学习成本。用强压可能会起到反作用。需要让大家建立认知，通过一些培训或者小范围内试用，产生了效果之后，再逐步去推广和扩散，效果会更好。</p><p>&nbsp;</p><p>InfoQ：今年在 <a href=\"https://qcon.infoq.cn/2022/guangzhou?utm_source=infoq&amp;utm_medium=conference\">QCon 全球软件开发大会</a>\"上，有一个话题是，研发效能和DevOps有没有区别，大部分人都选了有区别，只有4票投给了没有区别，尹老师您怎么看待这个话题。</p><p>&nbsp;</p><p>尹竞成：我认为这个问题是有相关性的，但是大家给出的答案不一致，应该来自于视角和思考角度的不同。比如偏一线执行的员工，或者负责DevOps职能的人，会用工具去对齐自己和上游的交付标准，提高自己的开发效率，提高自己的工作自动化、数字化水平，他会认为DevOps做好了，效率就提升了，这当然没错。但如果是以一个技术负责人的视角来看，研发效能的提升应该要更加立体一点，会包括员工能力的提升体系，培训、分享、赋能等，以及效能工具包括DevOps或者其他工具的推广和使用，还有度量体系、绩效考核体系等等。在我看来，DevOps是效能提升工作中的一环，它无法代表全部。</p><p>&nbsp;</p><p>InfoQ：不同的需求之间如何去公平地度量，在度量指标方面，尹老师有哪些经验和看法？</p><p>&nbsp;</p><p>尹竞成：我个人比较反感为了考核而考核，为了度量而度量。只追求数据指标好看，动作一定会变形。我认为还是要回到本质，度量是为了我们能够以更小的成本，去创造更大的价值。所以任何指标的建立都不应该抛开业务发展的阶段以及团队能力的现状，盲目地去设定指标。</p><p>&nbsp;</p><p>指标体系大概可以分为结果指标和过程指标两类，结果指标会看交付周期、需求缺陷密度，我们可以用结果指标来评估团队整体的能力，评估交付效率和交付质量。过程指标会看缺陷的解决率，平均解决时长，以及对一些特殊项目的交付时在各个阶段交付的耗时，我们可以通过过程指标来评估我们流程体系的合理性。有了指标，还需要度量的基线，基线设定很重要。我们可以拿行业中比较优秀数据作为基线，和它进行对比。如果拿不到数据，或者我们已经处于业界比较好的水平，我建议可以和自己做对比。用过去几个季度的平均数据作为基准，每个考核周期做提升，我认为大家应该不会有意见。</p><p>&nbsp;</p><p>InfoQ：对想要提升研发效能的企业，您有什么建议？</p><p>&nbsp;</p><p>尹竞成：第一，不要盲目跟风，其他企业的不一定适合自己。一个优秀的管理者要看清楚内外部的组织环境，团队当前的状况，团队成员的能力，以及当前阶段最重要的事情是什么，找到撬动研发效能提升最重要的点去做提升。第二，不要只着眼于局部的能力，一个好的技术管理者应该有更系统、更宏观地去看待事物的能力，系统性的提升会带来更加平衡、更加综合的收益，也会更具可持续性。第三，平台和工具是冰冷的，但是研发人员是有血有肉有情绪的，他们才是第一生产力，永远也不要忽视一线人员的感受，不要去强压指标或者强推东西，要站在大家的角度去看，可以集思广益，也可以和大家去做一些共创，充分发挥大家的创造力。</p><p>&nbsp;</p><p>InfoQ：技术团队的年度规划应该怎么做？</p><p>&nbsp;</p><p>尹竞成：以业务团队为例，有几个考核的维度：第一个维度，要以业务发展的视角去考虑问题，帮助业务得到更好的业务结果是最重要的。所以在业务规划中，需要充分体现如何去绑定业务结果，能够帮助业务更快速地交付，并且有更好的效率和质量。同时在过程中要能够考虑到如何帮助业务建立核心竞争力。</p><p>&nbsp;</p><p>第二个维度，技术迭代和优化。技术体系的熵会逐渐增大，技术团队要把自己的基本盘做好，逐渐把技术债还掉。互联网的业务往往一开始都是单点切入，小步快跑，快速试错，在过往过程中一定会留下很多的技术债。要持续降低自己系统腐化的速度，逐步改良优化自己的系统。</p><p>&nbsp;</p><p>第三个维度，要考虑组织能力建设。团队的技术水平和公司比、和业界优秀水平比，还有哪些能力短板，哪些方面已经做得不错了，要对自己的能力有一个比较清楚的认知；团队成员结构和组织架构是否需要优化，人员结构要不要做调整等；团队文化建议也是一个可以考虑的维度。当然，具体的细节还是要根据团队和业务的状况因地制宜。</p>",
    "publish_time": "2022-12-16 10:37:16",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "是时候好好治理 AI 模型了！",
    "url": "https://www.infoq.cn/article/EX3yxThI7wgoRJgAAobj",
    "summary": "<p></p><blockquote>如今，有越来越多的企业将机器学习引入到不同的流程中，对机器学习模型的期待也越来越高。与这种期待相反的是，我们对机器学习治理的关注度显然不够，还没有找到好的方式让整个流程运转地更加流畅、透明度更高，甚至连最佳实践可能的样子都十分模糊。在刚刚结束的 <a href=\"https://www.infoq.cn/theme/164\">2022 &nbsp;re:Invent 大会</a>\"上，亚马逊云科技数据与机器学习副总裁 Swami Sivasubramanian 博士针对 Amazon SageMaker 发布的一系列更新，扩大了机器学习在模型生命周期中的治理规模，让模型开发初步告别了“盲盒”时代。</blockquote><p></p><p></p><h1>机器学习治理需要更进一步</h1><p></p><p></p><p>近两年，大模型的风越刮越烈，企业和开发者已经习惯于通过机器学习的方式来解决问题。显而易见的是，大模型并不是所有人都可以承担起的。如果希望在现有规模下获得好的效果，选择合适的机器学习治理流程才是可行的。</p><p></p><p>过去，我们花费了大量时间在数据治理上面，市场上也有了很多不同类型的解决方案。在刚刚结束的 2022 re:Invent 全球大会上，亚马逊云科技推出的 Amazon DataZone 便是其中之一，这是一项全新的数据管理服务，可以让用户更快、更轻松地对存储在亚马逊云科技、客户本地和第三方来源的数据进行编目、发现、共享和治理，从而消除数据目录维护的繁重工作。</p><p></p><p>我们期待通过 DataZone 这样的方案可以降低数据预处理的成本，提高模型生成的精准度，但机器学习的模型开发流程像一个不可预知的“盲盒”，仍然缺乏有效的手段保证模型上线后如预期发挥作用。</p><p></p><p>当我们把数据治理的思路类比到机器学习治理当中，能否找到一种工具降低模型的故障？目前来看，情况还不算太明朗。据 2021 年企业机器学习趋势报告显示，机器学习治理目前还处于早期发展阶段，其暴露出的具体问题有：还未出现成功案例，缺乏明确的路线图或规范性建议，目前市场上现存的一些解决方案都是由不同工具拼凑而成的，其覆盖范围还存在缺口，机器学习更是难以集成到标准化的企业 IT 流程和技术堆栈中。除此以外，由于相关的法规还不够完善，如何保障合法合规也是另一大挑战因素。</p><p></p><p>在企业对机器学习严重依赖的当下，我们是时候扩大机器学习治理的规模，让其更进一步了。这件事情由承担着企业内部大部分模型开发工作的机器学习平台来完成或许最合适。</p><p></p><h1>让越来越多的 AI 模型有效运转</h1><p></p><p></p><p>2017 年，Amazon SageMaker 首次在 &nbsp;re:Invent 大会上亮相，其极大降低了 AI 开发的门槛，让有能力改进框架和算法的开发者，尽可能少地花费精力在数据准备、部署、安装、调试等无关事情上。</p><p></p><p>过去五年，亚马逊云科技一直在稳步对 SageMaker 进行迭代升级，让其成为了企业内部被广泛使用的机器学习平台之一。在 SageMaker 发布之后，我们看到了大批一站式机器学习平台出现，让越来越多不同背景的人可以加入到这一流程中。</p><p></p><p>此时，新的问题又出现了。</p><p></p><p>首先，由于机器学习的用户组权限差异较大，企业必须给不同角色的人赋予不同的权限，以避免引入无关的人为错误，但自定义策略的过程是非常耗时的；其次，用不同的手动工具来捕获、共享模型信息很容易出错；最后，定制工具以获得模型性能的可见性是很昂贵的。</p><p></p><p>但是，大部分一站式机器学习平台还没有在治理层面有实质性进展，这也导致企业内部引入机器学习的过程并不顺利。</p><p></p><p>为了解决上述问题，亚马逊云科技2022 re:Invent 大会上推出了Amazon SageMaker 的三大机器学习治理新功能来简化访问控制，增强端到端机器学习部署的透明度、模型治理和可审计性，分别是：Role Manager、Model Cards 和 Model Dashboard。</p><p></p><p>SageMaker Role Manager&nbsp;通过自动策略创建工具帮助组织为用户定义关键权限；Model Cards&nbsp;主要是为 ML 模型文档创建单一、真实的模型文档；Model Dashboard&nbsp;为组织提供了 ML 模型性能的可见性和统一监控。</p><p></p><p>SageMaker Role Manager 有一组针对不同角色和机器学习活动的预定义策略模板，例如数据科学家或 MLOps 工程师，可以在几分钟内为 SageMaker 用户自定义权限，企业也可以定义其他角色、添加机器学习活动以及托管策略，以满足特定需求。&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/10/1085f8653f7c2dc54f6670d0a7c817b0.jpeg\" /></p><p></p><p>Model Cards 为模型信息创建了单一真实的来源，简化了整个机器学习生命周期的模型文档。对于在 SageMaker 上训练的模型，Model Cards 可以发现并自动填充细节，例如训练作业、训练数据集、模型工件以及推理环境。企业可以记录模型的详细信息，例如模型的预期用途、风险等级以及评估结果。对于合规性文档和模型证据报告，还可以将 Model Cards 导出为 PDF 文件，轻松地与客户或监管机构进行共享。&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/68/688263e3548cc808f88230419af57e4b.jpeg\" /></p><p></p><p>Model Dashboard 实现了一个用于监控所有模型的页面，借助鸟瞰图，企业可以通过与 SageMaker Model Monitor 和 SageMaker Clarify 的集成，查看生产中使用的模型、查看 Model Cards、可视化模型世系、跟踪资源以及监控模型行为。当模型未受到监控或偏离预期行为时，Model Dashboard 会自动提醒。&nbsp;&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/c7/c72f52352d08bda8acbde4df45576c17.jpeg\" /></p><p></p><p>在大部分场景下，这种治理能力带来的好处是通过最低的成本，保证模型上线并发挥效用。在一些特殊场景下，这种治理能力所发挥的作用则不止于此，比如金融、医疗等对可信度要求极高的领域。</p><p></p><p>世界最佳银行之一的 Capitec 曾表示，其产品线上的数据科学家们各有所长，可以构建不同的机器学习解决方案，机器学习工程师们管理着一个建立在 Amazon SageMaker 上的集中式建模平台，以支持所有解决方案的开发和部署。由于没有任何内置的工具，跟踪建模往往会出现文档不连贯和模型不可见的情况。通过 SageMaker Model Cards，Capitec 可以在统一的环境跟踪大量的模型元数据，而 SageMaker Model Dashboard 提供了每个模型性能的可见性。此外，SageMaker Role Manager 简化了不同产品线中数据科学家的访问管理过程。</p><p></p><h1>企业应该投资治理，还是扩大现有 AI 解决方案？</h1><p></p><p></p><p>对企业来说，现有资金到底应该投入到机器学习治理流程，还是应该继续扩展现有的机器学习解决方案呢？</p><p>如果任由机器学习在企业内部无组织地发展下去，最终会导致系统故障率越来越高，尽而降低整体的投资回报率。过去两年，我们看到了很多自动驾驶汽车的事故案例，甚至有些企业放弃了对自动驾驶的投资，这也意味着，我们需要更可靠地治理手段来保证人工智能系统的正常运转。</p><p></p><p>本质上，现代人工智能系统是一个黑匣子，这些系统建立在复杂的技术栈之上，技术栈通过获取、转换数据并将其输送到下游机器学习模型，以实现业务目标。但系统的输入和操作对用户或其他相关方是不可见的，包括数据科学家、数据工程师、UX/UI 设计师、社会科学家、系统工程师、业务主管等。</p><p></p><p>这种多样化的用户组与技术输入的结合，让人工智能系统引入了大量可能发生故障的可能。在这种高度交织的技术架构中，失败很可能被忽视，即使检测到故障，通常也需要深入调查才能找到根本原因。</p><p></p><p>机器学习治理的出现便是为了更好地构建负责任的 AI，全面实施负责任的 AI 有助于企业将风险降至最低。在很多负责任的 AI 方法中，会把利益相关者、投资回报率算进来，最终虽然能出现更好的产品，推动更高的使用率和采用率，但这不足为奇。</p><p></p><h1>一切向着负责任的 AI 方向发展</h1><p></p><p></p><p>在本届 re:invent 大会上，亚马逊云科技向我们展示了部分蓝图，其推出的众多服务就是朝着设计并构建负责任 AI 的正确方向迈出的一步，其建立在多年来对相关工作的积累，以实现机器学习数据集、模型和系统的基准测试和透明。</p><p></p><p>近年来，亚马逊云科技一直在朝着负责任的 AI 方向迈进，包括在 2020 年聘请《The Ethical Algorithm》的作者 Aaron Roth 和 Michael Kearns 作为亚马逊学者。</p><p></p><p>事实上，Gartner 预计，到 2023 年所有为 AI 开发和训练工作而招聘的人员，都需要展示自己拥有负责任的 AI 方面的专业知识。负责任的 AI 可能看起来令人生畏，因为这其中有许多子领域都需要关注（例如公平性、透明度、问责制、安全性、可靠性、隐私、安全、治理等），要在人工智能生命周期的所有阶段实施，包括设计、开发和部署。</p><p></p><p>对大部分公司而言，如果将注意力全部用在这上面可能会导致投资失败，不如设置合理的优先级并挑选合适的解决方案，通过运用 Amazon SageMaker 推出的 Role Manager、Model Cards 和 Model Dashboard 功能，将机器学习治理扩大到模型开发流程，保证每个模型上线后可发挥最大效用，最终确保在实现企业宗旨和价值观的同时，获得持续的成功并建立竞争性的市场优势。</p><p></p><p>提到 AI，我们最常说的一句话是“落地为王”，现在是时候将部分工作交由“负责任的 AI”来保证了<a href=\"https://aws.amazon.com/cn/sagemaker/ml-governance/\">（点击链接，轻松开启机器学习治理流程）。</a>\"</p>",
    "publish_time": "2022-12-16 12:08:46",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "中国开源生态图谱2022——操作系统领域",
    "url": "https://www.infoq.cn/article/ARa5HwDdOveaDKavLSc3",
    "summary": "<p>2022年8月，InfoQ 研究中心推出《中国开源发展研究分析2022》。报告中对中国开源的宏观发展的背景、目前取得的成绩、整体发展的特征进行了分析。同时也推出了基于InfoQ 研究中心研究成果的InfoQ 开源项目指数。但是因为时间等因素，《中国开源发展研究分析2022》聚焦研究了中国TOP30 开源项目。我们深知，中国开源发展百花齐放，仍有大量的项目深植于各技术领域中，并且取得了亮眼的成绩。另外，不同的技术领域开源也具有各自独特的特征。</p>\n<p>所以，InfoQ研究中心策划启动了《中国开源生态图谱系列研究》工作，技术领域涉及操作系统、数据库、云原生、大数据、前端、架构等。希望系列研究能够帮助关注中国开源世界的朋友绘制更为完整的开源全景图谱。通过对不同技术领域的研究分析，帮助读者获得更为具体的开源领域洞察。</p>\n<p>此篇是《中国开源生态图谱系列研究》的第一篇，聚焦在三大基础软件中的操作系统，通过将目前的开源操作系统项目进行分类，并结合开源基金会、开源产业联盟等生态，完整构成中国开源操作系统的生态图谱。</p>\n<p>随后，通过在《中国开源发展研究分析2022》中使用的InfoQ开源项目指数，和拓展的Gitee指数，分析和评价现有开源操作系统项目，并从中选择优秀案例供广大开发者和开源社区研究。</p>\n<h1>目录</h1>\n<ul>\n<li>生态图谱解读</li>\n<li>生态图谱企业洞察</li>\n</ul>",
    "publish_time": "2022-12-16 14:24:42",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "中国开源生态图谱2022——数据库领域",
    "url": "https://www.infoq.cn/article/pPz0K3aDcvO6pvtDBEq6",
    "summary": "<p>2022年8月，InfoQ 研究中心推出《中国开源发展研究分析2022》。报告中对中国开源的宏观发展的背景、目前取得的成绩、整体发展的特征进行了分析。同时也推出了基于InfoQ 研究中心研究成果的InfoQ 开源项目指数。但是因为时间等因素，《中国开源发展研究分析2022》聚焦研究了中国TOP30 开源项目。我们深知，中国开源发展百花齐放，仍有大量的项目深植于各技术领域中，并且取得了亮眼的成绩。另外，不同的技术领域开源也具有各自独特的特征。</p>\n<p>所以，InfoQ研究中心策划启动了《中国开源生态图谱系列研究》工作，技术领域涉及操作系统、数据库、云原生、大数据、前端、架构等。希望系列研究能够帮助关注中国开源世界的朋友绘制更为完整的开源全景图谱。通过对不同技术领域的研究分析，帮助读者获得更为具体的开源领域洞察。</p>\n<p>此篇是《中国开源生态图谱系列研究》的第二篇，聚焦在三大基础软件中的数据库，通过将目前的开源数据库项目进行分类，并结合开源基金会、开源产业联盟等生态，完整构成中国开源数据库的生态图谱。</p>\n<p>随后，通过在《中国开源发展研究分析2022》中使用的InfoQ开源项目指数，和拓展的Gitee指数，分析和评价现有开源数据库项目，并从中选择优秀案例供广大开发者和开源社区研究。</p>\n<h1>目录</h1>\n<ul>\n<li>生态图谱解读</li>\n<li>生态图谱企业洞察</li>\n</ul>",
    "publish_time": "2022-12-16 14:25:39",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "领英职场发布首位智能小助手 “小英同学”，数字化疏导职场焦虑",
    "url": "https://www.infoq.cn/article/KBdRAFqmdghQmP3B86zb",
    "summary": "<p></p><p>一年已近尾声，在2023年开始全新的篇章是很多职场人共同的愿望。面对着反复的疫情和行业的震荡，憧憬着元宇宙、Web3和AIGC等新技术实践带来的机遇，职场人在“躺”和“卷”之间努力寻找着平衡。</p><p>&nbsp;</p><p>近日，领英职场向职场人发起年末问题：“你今年的职场情绪关键词是什么？”近九成的回复者提到了“压抑”、“焦虑”和“迷茫”等词汇。但同时有超过六成的回复者也分享了今年在职场上的闪光时刻：“获得了新专利”、“试用期受到了公司认可”、“一次有质量的跳槽”，还有人坚持“努力和沉淀等待生活的惊喜”。</p><p>&nbsp;</p><p>领英职场是职场社交平台领英旗下的本土化产品，其于2021年在中国内地发布。领英职场不仅关注全球人才市场的发展趋势，也关心职场人的情绪。为了陪伴职场人适应快速变化的职场环境，缓解情绪内耗，领英职场发布首位智能小助手“小英同学”，推出更丰富的智能产品和服务，帮助职场人以更精准、更智能、更有温度的方式连接职业机会</p><p></p><h3>数字化疏导职场焦虑</h3><p></p><p>&nbsp;</p><p>据悉，领英职场智能小助手“小英同学”是领英与国内人工智能公司小冰公司合作的成果。不同于市面上常见的二次元或动画形象，“小英同学”来源于领英的一位真人员工，形象友善亲和，表达真实生动，能迅速拉近与用户的距离。</p><p>&nbsp;</p><p>在领英职场即将推出的年度职场心理测试中，“小英同学”以智能小助手的身份邀约职场人进行年终职场状态评估，还将联合心理健康服务平台“简单心理”对职场状态进行专业解读，帮助职场人探索情绪的面向，缓和内心的焦虑。</p><p>&nbsp;</p><p><img src=\"https://static001.infoq.cn/resource/image/07/f3/07d8a66134f08eaff5da02ed7fyye7f3.png\" /></p><p></p><p>首位智能小助手</p><p>&nbsp;</p><p>“领英职场是一款不断根据用户需求进化的求职产品。我们一直在探索如何通过数字技术的场景应用，让大家更好地和我们交互，感知到我们在帮助解决求职过程中的实际问题。”领英职场产品端负责人陈怡静表示，“这次领英职场与小冰合作，不仅能通过‘小英同学’这一全新的形象和方式丰富产品的体验，更能将领英一贯秉持的智能化功能和服务从隐形到具象化推向大众视野。”</p><p>&nbsp;</p><p></p><h3>“简历智能诊断”正式对外公测</h3><p></p><p>&nbsp;</p><p>在不断更迭的人才市场，技能更新与职业机会的联系更加紧密，技能标签也成为了招聘人员在匹配候选人时经常检索的关键信息。</p><p>&nbsp;</p><p>根据领英平台数据显示，2015年至2021年，从事同一职位者的职业技能组合已改变约25%，该数据预计到2027年会上升至50%。随着数字化和人工智能等技术的发展，职场人需要同步培养自身技能，重点提升数字技能、行业相关技能以及人际交往相关软技能，以抵御自动化的冲击、适应就业市场的变化。</p><p>&nbsp;</p><p>为了帮助求职者更有效率地投递目标岗位，领英职场的“简历智能诊断”正式对外公测。依托领英平台上海量的优秀职场档案，这个简历工具可提供智能化的简历修改建议，未来还将针对用户想要申请的目标岗位进行精准匹配和推荐。尤其对于职场经验有限的毕业生求职者和年轻职场人来说，他们可以迅速了解雇主需求，弥补自身短板，更高效地提升求职机会。</p><p>&nbsp;</p><p><img src=\"https://static001.infoq.cn/resource/image/36/34/361e7120284f1100515f6432d501c934.png\" /></p><p></p><p>简历智能诊断功能</p><p>&nbsp;</p>",
    "publish_time": "2022-12-16 14:47:48",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "云原生数据库走向 Serverless、Regionless 和 Modeless，探秘华为云 GaussDB",
    "url": "https://www.infoq.cn/article/FuJcuqkTB5tTDyZuSL6O",
    "summary": "<p>数字化时代，数据如泉水般源源不断地产生，围绕数据的生产、存储和消费均依赖数据库。但企业在数据库的使用上却面临种种挑战，云原生数据库给企业提供了一种新的选择。</p>\n<p>相比传统数据库，云原生数据库有哪些优势？未来它将如何演进？华为云和 InfoQ 联合出品的《探秘·云新知》，带你探秘华为云数据库 GaussDB。</p>",
    "publish_time": "2022-12-16 15:29:15",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "苹果将在欧洲开设第三方应用商店",
    "url": "https://www.infoq.cn/article/8JZTDNUQIHKLc61hUNQD",
    "summary": "<p>据彭博社报道，为了应对欧盟即将出台的数字市场法案 (DMA) ，<a href=\"https://www.infoq.cn/article/RCJHtVcEeVjad2kGJD5s\">苹果</a>\"将在iPhone和iPad上开放第三方应用商店，预计该变化将出现在明年发布的 iOS 17上。</p><p></p><p>知情人士透露，苹果的软件工程师和员工正计划对iPhone上 App Store 的运营策略进行重大调整，这一计划被称为“开放苹果平台关键要素的重大举措” ，以便公司能够在 2024 年达到欧盟严格要求。</p><p>&nbsp;</p><p>一直以来，苹果设备都只能在其官方推出的<a href=\"https://www.infoq.cn/article/ojPbTYBedH9hiWsQqmYE\">App Store</a>\"下载应用程序，开发人员需要向苹果支付 15%-30% 的费用。</p><p>&nbsp;</p><p>DMA 表示，限制安装第三方应用程序或第三方<a href=\"https://www.infoq.cn/article/yLFaiH2o6r6fqlQNxxs8\">应用商店</a>\"的行为“应该被禁止，因为这是不公平的”。为了确保竞争，像苹果这样的平台霸主应该“允许第三方软件应用程序或软件应用程序商店，提示最终用户决定该服务是否应该成为默认服务，并使这种改变能够轻松进行。”</p><p>&nbsp;</p><p>据悉，DMA 旨在制定“数字守门人规则”，以确保开放市场。欧盟已经制定了一个时间表，其中包括可能受其影响的公司通知监管机构，并由一个委员会决定他们是否真的必须做出改变。欧盟在其新闻稿中表示，被认为是数字守门人的公司必须遵守该法的最晚日期是2024年3月6日。如果违法该法律，欧盟可对一家公司最高处以其全球收入20%的罚款。</p><p>&nbsp;</p><p>不过，苹果之前坚称“侧载将破坏iPhone用户所依赖的隐私和安全保护措施，从而使人们容易受到恶意软件、诈骗、数据跟踪和其他问题的攻击”，为此，为此苹果正在考虑“强制执行某些安全措施，即使软件是在其商店之外分发的”。彭博社的 Mark Gurman 表示，苹果“仍计划向开发人员收取访问 iOS 的费用，即使是通过侧载”。</p><p>&nbsp;</p><p>这意味着，这些应用程序可能需要苹果的验证，“这一过程可能会给开发者带来费用”。目前尚不清楚苹果将如何收取这项费用，苹果没有回应置评请求。</p>",
    "publish_time": "2022-12-16 15:41:06",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "Twitter快没家了？拖欠租金、变卖家产，马斯克为了省钱用尽奇招",
    "url": "https://www.infoq.cn/article/NmgXYDUGCySPL8lqkik1",
    "summary": "<p></p><blockquote>曾豪掷 440 亿美元收购 Twitter 的马斯克，现在竟然因为“抠门”上了头条？</blockquote><p></p><p></p><p>据《纽约时报》报道，在马斯克以 440 亿美元<a href=\"https://www.infoq.cn/article/LxFCa6vY353SjMTw8qpL\">收购 Twitter</a>\" 后，为了削减成本，这家社交媒体公司已停止支付办公楼租金。</p><p></p><p>据悉，由于此前 Twitter 刚经历大规模裁员，员工数骤降，马斯克的团队一直在试图重新谈判办公室的租赁费率，但谈判进展并不顺利。因此，Twitter 已经数周未支付其全球办事处及旧金山总部的租金。</p><p></p><p>消息称，Twitter 已经收到了来自房地产公司的投诉，其中就包括拥有 Twitter 旧金山大楼的 Shorenstein 公司。目前，Shorenstein 和 Twitter 尚未回应置评请求。</p><p></p><p>除了拖欠租金，Twitter 还开始变卖公司的办公设备和家具电器。可以说，为了省钱，马斯克把一切招数都用上了。</p><p></p><h2>Twitter 办公设备大甩卖</h2><p></p><p></p><p>在 Heritage Global Partners 的拍卖网页上，一共展示了 351 件 Twitter 办公设备和家具电器。</p><p></p><p><img src=\"https://static001.geekbang.org/wechat/images/a3/a31ddd7a2e7975360135a01d955f2d7b.png\" /></p><p></p><p>小到办公桌椅、投影仪，大到电脑、咖啡机、冰箱，甚至连公司“小蓝鸟”标志雕塑、”小蓝鸟“霓虹灯、@形雕塑花盆也被挂在了拍卖网页上。</p><p></p><p><img src=\"https://static001.geekbang.org/wechat/images/34/34f72cae17e275f0b902d0fd40c3db25.png\" /></p><p></p><p><img src=\"https://static001.geekbang.org/wechat/images/b0/b0a48b0e5d03bd0d23952fd3db04a69c.png\" /></p><p></p><p><img src=\"https://static001.geekbang.org/wechat/images/47/47463bc3c4faa3a874af7af053930b55.png\" /></p><p></p><p>这些原价可能数千甚至数万美元的办公设备，大多以 25 美元或 50 美元的价格起拍。比如，这台浓缩咖啡机原价数万美元，起拍价只有 25 美元。</p><p></p><p><img src=\"https://static001.geekbang.org/wechat/images/9b/9b18332d3ba3d929868b11a9bb8654ea.png\" /></p><p></p><p>售价 2 万起的苹果电脑，起拍价也只有 50 美元。</p><p></p><p><img src=\"https://static001.geekbang.org/wechat/images/a5/a58101df560ccdb06248fbf357a52557.png\" /></p><p></p><p><img src=\"https://static001.geekbang.org/wechat/images/65/651a1ca0788bb3a48ef90ef6497ee9f5.png\" /></p><p></p><p>据悉，本次竞拍将于 2023 年 1 月 17 日 7:00 开始，次日结束。拍卖网站信息显示，这些拍品都位于 Twitter 旧金山 Market St. 的总部，Heritage Global Partners 不提供发货服务，买家需要自行安排拍品运输。此外，竞拍者只能使用美元和银行电汇，并需要支付 18% 的佣金和 8.63% 的增值税。</p><p></p><p>在 Heritage Global Partners 上，有不少公司都在拍卖办公设备和家具电器，但像 Twitter 这种知名度较高的科技企业并不常见。因此，Twitter 此举也被外界解读为公司财务状况堪忧的表现。</p><p></p><p>据美国有线电视新闻网报道，Heritage Global Partners 的负责人 Nick Dove 在接受采访时声称本次拍卖与 Twitter 的财务状况无关，他表示，任何认为拍卖是保护财务的一部分的人都是“白痴”，“我们不会选择企业不需要的资产。就像房地产经纪人不会决定他们的客户需要出售哪些房屋或建筑物一样”。</p><p></p><h2>马斯克的 Twitter 2.0：从缩减开支开始</h2><p></p><p></p><p>自马斯克以 440 亿美元收购 Twitter 以来，这位拥有多家公司的 CEO 大刀阔斧地对 Twitter 进行改革，并为缩减开支采取了一系列措施，其中包括裁员、拒绝支付员工遣散费、取消公司免费午餐计划，等等。</p><p></p><p>走马上任以来，马斯克开启了大规模裁员计划。10 月 21 日，《华盛顿邮报》援引采访和内部文件报道称，马斯克在收购 Twitter 公司的交易中告诉潜在投资者，在收购完成后，他计划裁掉这家社交媒体公司 7500 名员工中的近 75%，将该公司员工数量从 7500 人减少到仅 2000 人。</p><p></p><p>11 月，马斯克在当地时间周三凌晨向 Twitter 员工发送一封电子邮件，要求员工在周四下午 5 点之前做出选择——要么接受“极其硬核”的<a href=\"https://www.infoq.cn/article/J8E4r5V4UBAFmmzFvV9f\"> Twitter 2.0 计划</a>\"，接受长时间、高强度的工作；要么拿着三个月薪资的遣散费走人。</p><p></p><p>马斯克对 Twitter 进行的<a href=\"https://www.infoq.cn/article/1jdi4LDTycjblozS8QwV\">大刀阔斧的改革</a>\"，导致近一半的员工主动离职。有知情人透露，原先 7500 多人的硅谷巨头现在可能只剩下不到 2700 人。另外有知情人士称，Twitter 管理层曾考虑不支付前员工的遣散费，不过最终为了符合法律规定，才决定向美国员工支付最少两个月工资和一个月的遣散费。有报道称，这项决定在未来很可能有变，两名知情人士指出，Twitter 管理层正在重新考虑是否支付部分费用，或干脆面对前员工提出的诉讼。</p><p></p><p>除了裁员，据《每日邮报》11 月 15 日报道，马斯克计划取消 Twitter 旧金山总部的免费午餐，转而让员工付费。马斯克发表推文称，在过去的 12 个月里，每顿午餐的成本预计超过 400 美元，使得旧金山总部的年度餐饮服务成本达到约 1300 万美元，“考虑到几乎没有人来办公室（疫情期间在家办公），这真的特别奇怪”。</p><p></p><p>不过，马斯克的这番言论遭到了 Twitter 前员工 Tracy Hawkins 的强烈反对，Tracy Hawkins 表示，每人每天的早餐和午餐餐费约为 20-25 美元。</p><p></p><p><img src=\"https://static001.geekbang.org/wechat/images/d3/d39a4d2f3dccc044118d66816ff144ea.png\" /></p><p></p><p>此外，一份诉讼文件显示，Twitter 拒绝支付马斯克接管公司当周产生的近 19.8 万美元的私人包机费用。</p><p></p><h2>Twitter 的现金流还好吗？</h2><p></p><p></p><p>在收购 Twitter 后，马斯克不止一次地表示，Twitter 收入大幅下降，亏损严重。至于裁员，马斯克也将其归结为公司每天亏损超过 400 万美元上，不裁员“别无选择”。</p><p></p><p>马斯克在 11 月 4 日发布的推文中称，收入下降是因为维权组织向广告商施压。</p><p></p><p>此前，马斯克曾公开质疑苹果削减了在 Twitter 上的广告投放，并称苹果曾威胁要将 Twitter 从 App Store 下架。在马斯克参观完苹果总部后，他表示苹果已经全面恢复在 Twitter 上的广告投放。马斯克称：“感谢苹果全面恢复广告投放。我们看到广告商恢复在推特上做广告，这是一个好迹象。”“广告方面更令人担忧的因素是整个行业的广告投放量下降，Twitter 也无法幸免。”“尽管广告商确实恢复了广告投放，但所有公司的广告支出总体上都在下降。”</p><p></p><p>在增收上，马斯克一直冲在最前面。为了获得更多收入，本月稍早前，Twitter 宣布重新推出蓝 V 认证付费服务。此前，因为有人冒充认证用户，蓝 V 认证付费服务暂停数周，目前已经重新上线。蓝 V 认证服务每月向 Web 用户收费 8 美元，向通过 App Store 购买的 iOS 用户收费 11 美元。</p><p></p><p>除了蓝 V 认证，Twitter 还将推出不同颜色的认证标识，如面向企业帐号推出金色认证标识，面向政治帐号推出灰色认证标识。</p><p></p><p>一面是缩减开支，一面是多举措增加营收，除此之外，马斯克还出售大量特斯拉股票，今年以来合计套现数百亿美元。这些举措都将为 Twitter 的现金流提供保障。</p><p></p>",
    "publish_time": "2022-12-16 15:53:49",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "告别空窗白屏，飞猪客户端启动体感极致优化实践",
    "url": "https://www.infoq.cn/article/kFpvLPFzII5q6qIEEfV8",
    "summary": "<p></p><h2>背景</h2><p></p><p></p><p>启动优化在客户端永远是一个绕不开的话题，几乎所有APP都持续在此投入精力，追求极致的秒出、直出。最近几年也一直有讨论几大头部APP启动快慢问题的声音出现，拼多多、支付宝都是业界公认在启动方面做的特别突出的。由此可见，APP的打开速度，体感流畅性，用户内心已经默默记在了小本本上，甚至可能在潜意识里影响了他的打开行为。</p><p></p><p>对于飞猪来说，首页是用户可见的飞猪首个页面，是全行业的流量入口，飞猪的门面，它给用户理解“飞猪是什么样子的”奠定了基调。业务设计和产品为了打造飞猪独特的心智、给予用户创新性的交互体验以及增加入口的吸引力，飞猪使用了大量的动图和视频能力，很多新颖的交互方式和设计在业界也具有独创性。</p><p>可变高banner &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 行程卡抽屉 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;顶部动画</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/0c/d5/0c01c317fca25718811d638be43e70d5.gif\" /></p><p></p><p></p><p>&nbsp;</p><p>但是随着交互复杂度的不断增加，首页的渲染路径越来越长，页面结构层级越来越深，在交互复杂度上已经逐渐赶超手淘。这也导致首页体验的根基-性能，开始逐渐受到影响，如白屏、卡顿、闪动、加载慢等。以上问题已经逐渐影响到了用户的使用体感，因此针对首页性能问题的集中梳理与优化，已经迫在眉睫。</p><p></p><p>双十一之前，我们针对以上问题进行了一波集中优化，包括启动速度和启动体感，最终基本达到了冷启动和首次安装全部直出的效果：</p><p></p><p>冷启动：</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/47/43/47be42d9cf3a74f8de7b55a2d74e9343.gif\" /></p><p></p><p></p><p>首次安装：</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/8d/36/8d9c1f3d93ba3cfe9da616491b731a36.gif\" /></p><p></p><p></p><h2>启动度量方式演进</h2><p></p><p></p><h3>启动时长</h3><p></p><p></p><p>业界最通用的度量方式，从启动开始，并设置某一时间点作为启动结束，通过埋点上报的方式统计APP的启动时长。它的好处是能够从宏观上来统计APP在所有用户上的启动时长，从而进行启动分析。问题在于结束时间点的设定，什么时间点能够认定为首页启动结束呢？是首页开始加载，还是首页上的元素全部加载完成，还是首页可交互？这没有一个标准的答案。而且这些数据是否能够完美代表用户的启动体感，这里要打一个大大的问号，比如启动过程中首页有一段时间的白屏，有几张图片没有加载出来，这些是很难通过启动时长来完整表达的。</p><p></p><h3>分帧录屏</h3><p></p><p></p><p>分帧录屏示例：</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/ec/55/ecd4e10ca3c15e63a1eac887bb5ea055.png\" /></p><p></p><p>通过分帧录屏，能够比较清晰的分析APP启动过程中每一帧的状态，哪些帧是白屏的，哪些帧是空窗的，其他APP在启动过程中用了哪些“黑科技”，通过这种方式都能猜出个大概。并且，这种方式是最接近用户体感的，如果从体感角度出发，能帮助我们发现大量之前没有发现的问题。在这种度量标准下，完美的启动就是以16ms为一帧，每一帧都完整有内容，无白屏无空窗。问题是这种方式很难从宏观角度分析问题，单个case波动较大。</p><p></p><h3>启动时长+分帧录屏</h3><p></p><p></p><p>最好的启动方式是宏观的启动时长+微观的分帧录屏，二者结合起来，即能以用户为视角出发进行优化，也能从宏观上保证整体的启动性能。</p><p></p><h2>优化方案</h2><p></p><p></p><p>本次优化将启动体感分为两个阶段，一是启动流程的优化，二是启动后首页交互优化。</p><p></p><h3>启动流程优化</h3><p></p><p></p><p>根据这次的目标，要从效果上做到录屏逐帧肉眼直出，所以除了关注统计指标外，首次把录屏效果纳入进来，因此更要关注加载中的细节体感，数据为辅，以人的体感要求为目标。</p><p></p><h4>1. 启动速度优化-启动项编排</h4><p></p><p></p><p>通过统一的启动调度器来管理启动任务，合理分配CPU资源，并按照任务类别进行合理的调度编排，以此来优化启动速度。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/60/7d/6083bacd12695a880719091084eb587d.png\" /></p><p></p><p>如下图所示：启动编排最核心的是要梳理启动项的优先级以及依赖关系，找到满足最少必要依赖前提下的最长路径，然后对该路径上的节点一一进行优化，其余的启动项按照优先级安排在启动过程中并行执行。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/c8/e2/c85aff9a567d5f9f1ee1dd0553fea6e2.png\" /></p><p></p><p>红色是核心任务组，黄色是阻塞任务组，绿色是预执行任务组</p><p></p><p>最终，我们梳理出了进首页前必须的阻塞任务共26个，他们执行过程中由于存在不可拆分的长耗时任务，以及依赖关系，会出现一些等待，因此预执行任务组中也有一部分任务会穿插进去填补这些空隙。</p><p>进而我们可以得到目前飞猪启动阶段中的一条最长任务路径。可以看到，后续如果我们还能有对阻塞请求有策略或性能上的优化的话，那么启动速度就还能再加快一些。</p><p></p><p>最终90%设备启动耗时提升超过1秒。</p><p></p><p>以上瀑布流均为进入首页前的启动项流程，对于进入首页后和首页并行的启动项，由京杭两地基础线与业务线的同学合作优化，结合业务场景，合理编排任务，将首页前3s的帧率由30-40帧优化到50帧以上。</p><p></p><h4>2.缓存图片加载优化</h4><p></p><p></p><p>本地存在图片缓存的优化场景：</p><p></p><p>1.&nbsp;图片load加速：启动阶段，即使图片在磁盘中，图片的寻址也非常慢。通过提前解析缓存数据，建立图片索引，能减少几十到上百毫秒的耗时。</p><p>2.&nbsp;view预创建：通过提前创建主体容器，将图片加载的时机提前。</p><p>3.&nbsp;图片加载优化： 我们使用的phenix图片库，经过手淘封装后，又被飞猪封装了一层，内部增加了许多逻辑判断，因此使用效率上要比原生的phenix要慢，我们跳过了封装库的使用，直接调用phenix加载图片，能减少几十毫秒的耗时</p><p>4.&nbsp;嵌套容器渲染滞后：通过一定策略截取上一次的图片，绕过容器加载直接覆盖到指定位置，可实现模块的直出效果，并能够模拟点击。</p><p></p><p></p><blockquote>PS：以上问题在其他页面影响可以忽略不计，但在首页启动阶段，资源吃紧，小问题变大问题。</blockquote><p></p><p></p><h4>3.图片切换优化</h4><p></p><p></p><p>图片切换过程中，正常流程会将原图清除，待新图下载好后再渲染，导致存在一定时间的空窗期，造成闪白。</p><p>纯图场景：纯图场景不纯在图文不符的问题，可延后原图的清除时间，作为placeholder覆盖，待新图下载好后可做到平滑切换。图文场景：图文同时存在，由于文字的渲染速度较快，必须将前图清除，否则会出现图文不符的问题，这种情况使用打底图覆盖，避免纯白背景。</p><p></p><h4>4.完全无图片缓存</h4><p></p><p></p><p>常见场景：大促胶囊，榜单及其他动态模块。</p><p></p><p>动态组件增加的场景，由于其不确定性，无法提前内置图片，无法遮盖，只能寄希望于网络速度。</p><p></p><p>首页与二级页资源分配：这种场景下网络资源异常重要，但同时也有二级页在做资源已经图片的预加载，因此需要合理按照优先级分配加载时机和带宽，平衡首页与二级页的优化效果。</p><p></p><p>渐进式图片加载：为了更快的内容填充，我们借鉴了微信大图浏览的图片加载方式。图片两段式加载，优先加载缩略图，原图下载成功后再替换。</p><p></p><p>首页独立缓存区：目前APP内所有的图片资源缓存都由图片库统一管理，在二级页浏览图片较多后，首页的图片缓存会被清理，考虑到首页图片的优先级较高，可开辟一块独立的首页缓存，不与APP中其他图片共享资源，保证缓存不被清理。</p><p></p><h4>5.首次安装体验优化</h4><p></p><p></p><p>首次安装处于一个完全无缓存的情况，各个APP在这种情况下表现都不太好，会出现大面积的空窗。</p><p></p><p>iOS：iOS端飞猪在权限申请阶段，会有一个idfa浮层在上方遮盖，用户点击完成后首页已基本完成渲染过程，所以飞猪iOS端在首次安装场景下是天然直出的。Android：Android不存在idfa浮层，我们借鉴了iOS的场景，将闪屏的时间做了延长，规避掉了首次安装大面积白屏的问题。支付宝首次安装必须登录，所以不存在此问题。</p><p></p><h3>启动后优化</h3><p></p><p></p><p>结合优化前收集到的槽点，我们把优化重点放在了信息流图片加载速度，进入首页前几秒的卡顿问题和首页资源管控上。</p><p></p><h4>1.网络图片加载速度优化</h4><p></p><p></p><p>网络图片加载速度受网络速度影响，首页信息流快速滑动过程中，会有大量的承接页预加载请求和视频的缓存加载请求等等，极大的影响了网络加载速度。</p><p></p><p>通过视频预加载优化与直出预加载优化减轻了信息流快速滑动过程中的网络压力，将网络图片的加载速度稳定在了300ms左右。</p><p></p><p>信息流视频缓存控制流程如下：</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/99/02/99d192bf9478b14e0d740d493226a202.png\" /></p><p></p><p>优化后效果如下：</p><p></p><p>横轴是信息流图片加载数量，纵轴是图片加载耗时，橙线是优化后的效果</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/cb/f4/cb75afc21518yyac8e21d81de41f80f4.png\" /></p><p></p><p></p><h4>2.首页启动项编排优化</h4><p></p><p>目前有较多的启动项任务在首页刚出现时开始执行，导致APP启动后首页在几秒内处于非常卡顿的状态。核心思路是将这部分启动项重新梳理，按照优先级放到合适的时机去执行同时又不对原有逻辑造成影响，避免大量启动项堆积造成的卡顿。</p><p></p><p>优化后将首页启动后3s内的帧率从10-30帧稳定到了50帧以上</p><p></p><h4>3.资源位管控</h4><p></p><p></p><p>之前首页pop没有针对运营配置高帧gif浮层做强管控，很可能上线不符合标准的资源导致首页卡顿，需要建立更加完善的管控机制。目前CRM加强了对图片资源的管控，可以针对不同图片类型限制图片大小，图片尺寸与格式限制，同时可以检测gif动图的帧率并对其进行限制。</p><p></p><h4>4.首页CPU占用优化</h4><p></p><p></p><p>目前首页有多处使用lottie的场景，lottie在正常播放过程中会占用一定的CPU资源，如首页顶部的刷新头，动画播放过程中会占用30%左右的CPU，哪怕是一个很小的lottie动画。且首页是常驻在APP的生命周期内的，会将这一影响带到其他页面。</p><p></p><p>这次将首页的lottie场景全部统一收口改造，隐藏、离开页面、不在可视范围内等所有情况将所有lottie一律暂停播放。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/4f/6b/4f1aa89de50aa1d264eddbbd918dda6b.png\" /></p><p></p><p></p><h2>优化效果</h2><p></p><p></p><h4>Android端启动时间优化</h4><p></p><p></p><p>Android端在优化完成后，90%&nbsp;设备启动耗时加快了&nbsp;1116ms，缩短超过1s。</p><p></p><p>从上到下分别为飞猪、手淘、优酷、闲鱼、支付宝：</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/b9/ec/b9b0308fb4da679087d4aca813a8c7ec.png\" /></p><p></p><p></p><h4>优化前后对比-冷启动</h4><p></p><p></p><p></p><blockquote>以下对比均来自3、4年前的设备，目前属于中低端机型。所有对比均已包含启动速度优化，无需对比启动速度。</blockquote><p></p><p></p><p>右侧视频为优化后效果-iOS</p><p>设备：iPhone 11 Pro Max</p><p></p><p>未优化之前的焦点图空窗时间较长，其他组件包括金刚，特卖和榜单也能明显的看到从白到加载的过程。优化后在用户能看到的第一帧开始，所有组件已经全部加载完成了。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/e3/f6/e38f0aae281610b52563741cb4f814f6.gif\" /></p><p></p><p>右侧为优化后的效果-Android</p><p>设备：小米 CC</p><p>Android端之前的启动体验较差，会有大面积的白屏情况，现在可以做到首页的直出</p><p><img src=\"https://static001.infoq.cn/resource/image/f5/a3/f514aa303210b530e763df897709dda3.gif\" /></p><p></p><p></p><h4>优化前后对比-首次安装</h4><p></p><p>右侧为优化后的效果-Android</p><p>设备：vivo nex-3s</p><p></p><p>针对首次安装的情况，我们同样做了处理，由于首次安装本地毫无缓存，所以不可避免的会出现较长时间的大面积白屏，预期让用户停留在白屏阶段，不如让用户“等一下”，能够直接看到完整的首页。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/fd/a6/fdfac7e1ce0bca3617843d5e8b667ea6.gif\" /></p><p></p><p></p><h4>APP横向对比-冷启动</h4><p></p><p>从左到右分别是飞猪、手淘、闲鱼、优酷、支付宝</p><p></p><blockquote>下面图片为方便对比，做了慢放处理</blockquote><p></p><p>设备：iPhone 11 Pro Max - iOS</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/db/7d/db080e62b1ebc99yyd852c6e587acb7d.gif\" /></p><p></p><p>设备：vivo nex-3s - Android</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/61/f3/617a67efd784c39cdb40d82cdcd842f3.gif\" /></p><p></p><p></p><h4>猪客和其他APP的分帧对比</h4><p></p><p></p><p>我们测试团队开发的视频分帧对比能力在本次优化中起到了重要作用，通过分帧对比，我们能够从细节中分析其他APP的优化方案，以及我们自身存在的问题，并逐步对齐并超越。目前该能力已基本完成了产品化，能够做到每日全自动录制多个APP的启动状态并给出分帧报告。在双十一期间首页变阵频繁，资源位、氛围变化大的情况下保证了首页能够及时发现问题并予以修复。</p><p></p><p>分帧效果：</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/11/01/11c07f929ecfc0b2e681ebc710a85201.png\" /></p><p></p><p></p><h2>后续计划</h2><p></p><p></p><p>性能治理和包大小治理一样，打江山容易守江山难，制定一套规范（交互规范，资源规范，开发规范）以及日常的监控措施，才能够让首页启动体验稳定保持，这才是这次首页体验优化的重中之重。</p><p></p><h3>1. 体感标准度量与制订</h3><p></p><p></p><p>单纯的启动时长无法完整表达体感，结合视频分帧，能够更合理的模拟人的体感视觉。若能做到16ms的视频分帧，那么根据每次启动记录到的分帧数据，可以设立标准区分出正常帧与异常帧。异常帧可以是白屏帧，图片未加载出的空窗帧等等，完美的启动体验每一帧都是无白屏无空窗的。通过计算异常帧在总帧数中的百分比，可以设定一个体感标准。当然启动时长作为辅助指标，也应该在参考范围内。</p><p></p><h3>2. 监控与维护</h3><p></p><p></p><p>通过设定体感标准，每天或每段时间进行一次自动化体感检测，若不符合标准，则进行体感报警，督促开发进行优化。目前能够做到每天自动化给出分帧报告，但是并不具备自动化识别能力，这也是我们下一阶段要做的事情。</p><p></p><p>规范的制定同样重要，什么种类，优先级的组件要使用何种优化方式，复用方式，是否内置等等；所有的资源位图片大小的标准，gif的标准，lottie的标准，poplayer的标准等等，需要严格制定与执行；在业务先赢的基础上，交互的复杂度最高水位在哪，不能无限制的追求交互的新鲜感而忽略最基础的体感。</p>",
    "publish_time": "2022-12-16 17:06:16",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "Kubernetes 1.26 版本正式发布：改进 Windows 支持，加强网络安全和管理功能",
    "url": "https://www.infoq.cn/article/97LDs46oamxHYLAhp5uK",
    "summary": "<p>近日，<a href=\"https://kubernetes.io/blog/2022/12/09/kubernetes-v1-26-release/\">Kubernetes 1.26</a>\" 正式发布。该版本总共包括 37 项增强功能：其中 11 项将升级为稳定版，10 项为毕业到 Beta，另外 16 项正在进入 Alpha 版，还有十二个功能已被弃用或删除。</p><p>&nbsp;</p><p>Kubernetes在企业中被广泛使用，这也让<a href=\"https://www.infoq.cn/article/zFR1q0chGl6SwFd1QMiD\">Kubernetes</a>\"成为黑客的攻击目标。新版本中，Kubernetes发布工件签名现已升级至beta版。此功能在v1.24版初次引入，是Kubernetes发布过程安全性方面的一大重要里程碑。新版本中，所有发布工件均使用cosign进行无密钥签名，且可验证二进制工件与镜像。</p><p>&nbsp;</p><p>新版本支持高权限<a href=\"https://www.infoq.cn/article/hhk37_UC1FgJFCQyIk7c\">容器</a>\"，允许容器以类似于主机上所运行进程的方式获取权限。Windows节点中的功能支持被称为HostProcess容器，现已升级为稳定版，允许用户通过高权限容器访问主机资源（包括网络资源）。</p><p>&nbsp;</p><p>这个版本也成为首个使用新的registry.k8s.io容器镜像注册表进行发布的版本。原先的k8s.gcr.io镜像注册表不再发布1.26版本的容器镜像标签，只会继续更新1.25及之前的版本标签。</p><p>&nbsp;</p><p>另外，随着容器运行时接口（CRI）的采用和dockershim在1.24版中被移除，CRI已经成为Kubernetes与不同容器运行时进行交互的唯一官方指定方式。各个kubelet会通过协商使用CRI版本及节点上的容器运行时。</p><p>&nbsp;</p><p>在之前的版本中，Kubernetes项目推荐使用CRI v1版本，但kubelet仍可协商使用CRI v1 alpha2，该版本已被弃用。但是，Kubernetes 1.26将不再支持CRI v1alpha2，因此如果容器运行时不支持CRI v1，则移除后kubelet将无法注册节点。也就是说，Kubernetes 1.26不再支持containerd的次要版本1.5及更早版本。如果开发者要继续使用containerd，则需要升级至containerd 1.6.0或更高版本，之后才能将节点升级至Kubernetes v1.26。同样的情况也适用于其他只支持v1alpha2的容器运行时。</p><p>&nbsp;</p><p>此外，Kubernetes的多项指标迎来改进，如指标框架扩展升级至alpha、组件健康服务水平指标（Component Health Service Level Indicators）升级至alpha。现在，各Kubernetes组件均已支持功能指标。用户可以检查组件指标端点的kubernetes_feature_enabled以跟踪是否启用了各活动功能门。</p><p>&nbsp;</p><p>更多信息查看：</p><p><a href=\"https://kubernetes.io/blog/2022/12/09/kubernetes-v1-26-release/\">https://kubernetes.io/blog/2022/12/09/kubernetes-v1-26-release/</a>\"</p>",
    "publish_time": "2022-12-16 17:46:35",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]