[
  {
    "title": "如何将人工智能技术更好地应用到实际商业场景？｜专访网易智企算法专家李雨珂",
    "url": "https://www.infoq.cn/article/EN6D7qupmStSK1MLZsaG",
    "summary": "<p>随着AI技术的应用深度与广度不断延伸，AI技术为实际业务场景所带来的价值已经成为共识，然而，如何才能以更低的成本引入AI技术，如何能够以更加轻量化的方式使用AI技术，成为值得思考的问题。</p><p>&nbsp;</p><p>为此，InfoQ记者有幸在<a href=\"https://qcon.infoq.cn/2022/shanghai/track/1470\">2022 QCon全球软件开发大会上海站</a>\"的现场，采访了网易智企算法专家李雨珂。目前，他负责数字内容风控领域的人工智能算法研究，并在QCon发表了《AI服务效率升级，在智能数字内容风控中实践AI生产增效》的主题演讲，关于如何助力人工智能生产增效，他有着特别的思考。</p><p>&nbsp;</p><p>以下是视频采访的全部内容，为方便读者查看，视频下方也附上了文字内容。</p><p>&nbsp;</p><p></p><p></p><p>InfoQ：感谢李老师参加QCon全球软件开发大会，先请您做下自我介绍</p><p>&nbsp;</p><p>李雨珂：我目前在网易智企旗下的网易易盾，最近一段时间主要在做基于 AI 的数字内容风控相关的技术，我也是网易智企技术委员会下面 AI 分委会的负责人。</p><p>&nbsp;</p><p>InfoQ：网易智企技术委员会在整个网易智企是扮演着什么样的角色？以及网易智企技术委员会的主要职能是什么？</p><p>&nbsp;</p><p>李雨珂：技术岗位会被分成很多类型，如果按照水平的方式去做管理有一个好处，就是不同的技术岗位能够得到比较好的发展，在整体的发展方向上可以有一致性。实际上，这对于商业的部门来讲，不一定是最好的方式。就好像我们去找客服，如果有一个专属的客服，需求响应速度是非常快的，而且你的体验也会非常好。但是如果你的客服需要通过排队去等待，这个体验就会比较差。所以我们真实的组织架构，是把不同的技术岗位拆解到不同的业务当中去，也就能够有更强的战斗力，或者让这些团队的技术人员对于相关的业务能够更加的熟悉，或者说更懂得商业。因此基于现在的组织形式，我们会去让各个业务团队的研发代表站出来组成一个技术委员会，相当于是从一个水平的角度去做支撑。</p><p>&nbsp;</p><p>从我个人的角度理解，技术委员会主要起到以下几个作用：</p><p>&nbsp;</p><p>第一个方面，能够做一些技术上的复用，至少不要重复去造轮子。这种复用包括两个方面，其一，有一些能力我们可以直接通过 API 的形式去使用；其二，也可以去参考别人技术上的解决方案，看看他们是怎么去做的，在我们自己的真实问题中可以做借鉴；第二个方面，我们整个事业部层面会有一些水平的任务需要做支撑，技术委员会比较适合去做整体的推动和关注。举个例子，账号是比较适合从整个大部门的角度去做关注的，还有一些基础数据的问题，也更加适合从大的部门去做整理；第三个方面，由技术的负责人一起去想一些技术分享的主题会更加合适，让不同团队之间相互知道大家在做什么事情。在这个过程中也可以相互学习、相互借鉴，将其用在自己的业务领域里；最后，因为有了技术委员会，它会对不同业务的发展情况以及技术的使用情况有全局的概览，也更方便我们去做整体技术发展方向的讨论和制定。</p><p>&nbsp;</p><p>InfoQ：在《人工智能技术应用实践白皮书》中了解到，网易智企已经将AI技术在内容风控、音视频、自然语言对话三个领域进行了实践，请您分别介绍下网易智企在以上三个领域针对性的解决方案。</p><p>&nbsp;</p><p>李雨珂：首先，我会讲一些共性的方向，第一部分的共同点，它真正地解决了业务场景中的实际问题，并不是为了应用这个 AI 技术而去用它。举个例子，像在内容风控场景中，它是有复杂场景下的一些困难目标识别问题；在自然对话场景下，它会有复杂的客户需求需要解决；第二部分的共同点，在应用 AI 的过程中，我们都非常关注 AI 的效率，即引入了新的技术，但是不能让这个技术带来更多的开销，希望能够轻量级地去应用 AI 技术，所以在这些解决方案中都有相关的体现。</p><p>&nbsp;</p><p>展开来讲，在内容风控场景下，我们会在算法层面做一些调优，去帮助复杂场景的识别效果进行提升；在音视频场景，我们会有降噪、场景分析以及超分辨率等等，以 AI 为主导的技术去帮助我们提升音视频方向的体验；在自然对话场景，我们也会通过特征检索方式的优化，用一些对话的框架以及沉淀的行业知识，帮助我们去解决复杂的客户需求。</p><p>&nbsp;&nbsp;&nbsp;</p><p>InfoQ：由于行业场景不同，导致不同行业面临的内容风控的需求也有所差异，比如游戏行业，未成年人监管以及玩家信息合规是一个关注的重点；在金融行业，身份认证、营销欺诈等等也是需要关注的风险问题......请问网易易盾是如何满足不同行业的内容风控需求的？</p><p>&nbsp;</p><p>李雨珂：第一方面是数据上的支撑，我们前期聚集到了某一个行业比较多的客户。在这样的前提下，我们做了相关的数据分析，针对于不同的客户，他们有怎样的属性、关键问题等等。得到的结果是，有一些可能跟我们的理解比较一致，有一些可能超出我们的理解，无论是怎样的发现都对我们理解这个行业是有帮助的。</p><p>&nbsp;</p><p>第二个方面是水平地建立技术上的能力，比如针对未成年人的技术、特征检索技术等等，基于这些能力，针对不同行业的解决方案就会更加灵活一些。这里可以打个比方，当足球教练排兵布阵时，如果有更多类型的队员进行选择，排兵布阵就会更加容易。</p><p>&nbsp;</p><p>第三个方面是在对接客户时，我们会形成一个小团队，其中包括技术同学、客户运营同学、策略同学等等。这些同学组织在一起会贴近客户，服务于客户的一些真实问题。在这个过程中，我们各个岗位的同学会更了解客户，进而更了解这个行业。</p><p>&nbsp;</p><p>最后一点，我们观察到部门的管理者其实是有在关注一些新兴的行业，给我们增加了一些新兴行业的理解和洞察，帮助我们去找一些新的应用。</p><p>&nbsp;</p><p>InfoQ：目前市场上针对内容风控的这个场景解决方案有很多，请您列举一下网易易盾核心的优势</p><p>&nbsp;</p><p>李雨珂：这个问题不同岗位的同学可能有不同的答案，我可以讲一下我自己的理解。首先站在我们自身，我们就是一直长期坚持去做这么一件事情，所以我们的技术同学对于行业有非常深入的理解。因此在解决问题的时候，也会更加得心应手一些。</p><p>&nbsp;</p><p>其次可以站在客户的视角去看，客户接入一般会经历 POC 的过程，这个过程固然很重要，但是客户正式接入了以后，实际上才是一个真正的起点。我们需要做很多和客户共同成长的事情，帮助客户去解决真正的问题。在解决问题的过程中，我们也不会刻意回避一些困难的问题，而是尽自己所能去做到尽善尽美。我们的技术人员也会主动识别现存的问题，帮助客户去想解决方案，这样的心态才是核心能力的体现。</p><p>&nbsp;</p><p>InfoQ：在内容风控场景中，由于系统中涉及的数据维度多，不同系统对于数据的标准也有所不同，使得数据成为非常核心的内容，请问您是如何看待数据标准这个问题？</p><p>&nbsp;</p><p>李雨珂：数据标准在内容风控场景里确实是一个很重要的问题。因为从人的视角来看，很多东西都是很主观的，但是对于机器来讲，没有办法得到一个认知上的结果。所以我们在做前期模型的时候，会更加照顾机器的感受，还会制定一些偏客观的标准，帮助机器先积累一些比较基础的能力。当有了这些基础能力以后，我们会在技术上做进一步的工作，帮助机器去靠近人的认识，这是我们在初始阶段做的一些事情。最近的话我们开始在思考让模型能够连续输出一些结果，更加方便在做判断的时候进行调控。</p><p>&nbsp;</p><p>此外，从我们这么长时间做这件事情来看，我们不能太低估模型的能力。因为一开始我们会觉得数据标准模型可能没有办法 Hold 住，但经过很长时间的实践，我发现模型对于一些复杂困难的数据标准，它也是有一定的能力。因此这里有一个比较关键的点，不要让数据标准成为技术生长的限制，希望未来能够让我们的技术能力去适应更复杂的数据标准。</p><p>&nbsp;</p><p>InfoQ：在《人工智能技术应用实践白皮书》的最后一章中，我们提到了三方面的AI前沿技术，如多模态、无监督与超大规模AI系统以及工程自动化，请您再概括下这三方面技术在未来的潜力</p><p>&nbsp;</p><p>李雨珂：我可能会从实用的角度来讲这几个比较新的方向。这些话题其实都是比较吸引人的，但是怎样把它应用到实际的商业场景中，是一个值得讨论的问题。</p><p>&nbsp;</p><p>多模态确实能够帮助我们去提升效果，但是实际应用起来，它的成本开销也会逐步的上升。这就相当于我们要多付出 50% 的工作量去多解决 0.1% 的问题。所以在接下来的工作中，我们从实用性的角度出发，更多考虑在怎样的时机去引入多模态的技术；无监督和超大规模也在近一段时间非常的火爆，从我们的角度来看，它要在线上直接应用可能还有一段距离，我们使用可能会围绕以下几个方面：第一个，帮助我们去生成更多的数据，或者帮助我们去找寻更多合适的数据用于下游的训练；第二个，基于预训练模型，怎么应用才能帮助我们得到更好的下游效果；第三个，思考怎样利用它去做特征检索工作。</p><p>&nbsp;</p><p>关于工程自动化，这固然是一个很好的工具，但我始终相信一个好的工具需要有好的人来使用才能发挥最大的作用。工程自动化帮助我们在做成熟业务的时候去提升效率，但是它同时也限制了做这些业务的灵活性。所以在这个过程中，可能需要考虑效率和灵活性之间的平衡，以及怎样培养更适合的人去使用这个平台，发挥出它最大的作用。</p><p>&nbsp;</p><p>InfoQ：明年，您个人的工作重心和规划有哪些？有哪些重点关注的新方向？</p><p>&nbsp;</p><p>李雨珂：一年多以前，我个人更多会关注怎样用前沿的技术，来帮助我们的业务场景做效果提升，但近期以及未来的工作重点，会转向怎样去提升 AI 在使用过程中的效率。具体来讲，在数据层面，我可能会更加关注数据科学这个方向，看看如何能够在数据层面做更高效的事情，希望未来能够更少使用人工的数据标注；在算法层面，过去很长一段时间大家都在讲大力出奇迹，我个人希望在未来，我们可以多看看怎样精简一个训练，去获得更高效的结果；在服务层面的工作其实会更加细致、全面，这可能也是我自己更看重的一个方向，怎样在服务层面去做效率上的提升，能够支持更多类型的AI服务。</p>",
    "publish_time": "2022-12-02 08:53:06",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "如何用一款数据库解决企业的核心问题？｜专访矩阵起源创始人兼研发负责人张颖峰",
    "url": "https://www.infoq.cn/article/hNZaroEktW9RYXeyGekC",
    "summary": "<p>入行近20年，张颖峰先后负责搜索引擎内核、大数据系统、分布式高可用基础架构，一路见证了互联网科技的发展与变迁。回忆创业之初，他便想寻找一种能够将互联网核心技术标准化的载体。直到目前，他仍然在该领域深耕，并担任着<a href=\"https://www.infoq.cn/u/matrixorigin/publish\">矩阵起源</a>\"创始人兼研发负责人一职。</p><p>&nbsp;</p><p>恰逢 2022 QCon 全球软件开发大会·上海站召开之际，InfoQ 记者有幸在活动现场采访到了张颖峰。在采访过程中，他谈到了 <a href=\"https://xie.infoq.cn/article/2ecb15c650ea1dc82f8f3d41e\">HSTAP</a>\" 这一概念被提出的初衷和背景，以及他对于国产数据库发展现状的理解。</p><p>&nbsp;</p><p>以下是视频采访的全部内容，为方便读者查看，视频下方也附上了文字内容。</p><p>&nbsp;</p><p></p><p></p><p>InfoQ：感谢张老师来参加 QCon 全球软件大会上海站，首先请张老师做下自我介绍</p><p>&nbsp;</p><p>张颖峰：我早年从事芯片行业、物理基础设施，后来很快就创业了，创业时我主要做企业信息化软件开发。在这个过程中，我发觉自己其实不太喜欢定制化的策略，也不认为这就是 To B 软件的发展趋势，所以我一直在寻找应用软件中相对标准化的领域，后来我加盟到一家海外创业的搜索引擎公司，我认为这个领域确实是能够做到这一点。在这个公司我做了很长时间，不仅参与了搜索引擎从零到一的完整开发过程，还参与了以搜索引擎为核心的整套互联网业务，包括电商、广告、交友、社区等等。这些业务全部参与过后，我离开了这家公司，又到了多家甲方公司、乙方创业公司等等，在这些公司当中我的角色一样，一直是负责基础架构的建设，包括数据智能建设。</p><p></p><p>将近 20 年下来，我的初衷一直没有发生变化，就是想寻找一种在应用软件领域能够标准化的东西，它能够将互联网科技以标准化的方式去展现给一些企业，让企业能够受惠于这些科技，直到最后我发现这种载体只能是数据库，所以我就开始参与创业，创立了矩阵起源这家公司。</p><p>&nbsp;</p><p>InfoQ：矩阵起源所提的 MatrixOne 是面向未来的超融合异构数据库，光是听到这个概念我想就会让很多人眼前一亮，也请您来聊一聊我们打造 MatrixOne 这款产品的初衷、背景？以及我们为何会选择提出 HSTAP 这一概念，希望它解决行业中哪些现存的问题？</p><p>&nbsp;</p><p>张颖峰：刚才我在介绍自己经历的时候也提到了，创业的初衷就是给企业提供一种相对标准化的解决方案，过去我们经历了早期的互联网大爆炸，也经历了后面的移动互联网大爆炸，所以在一开始的互联网早期架构，我们造了最原始的、最简陋的轮子，一直到后面跟随着业务发展，跟上了整个工业界最新的技术，在整个过程当中我们其实一直都围绕 ABC 三个领域去做，就是 AI、大数据、云，这些技术本质上就是互联网科技最核心的体现。</p><p>&nbsp;</p><p>再后面我又进入到传统企业，我发现这些公司想要用到这些互联网科技非常难，根本原因就在于他们缺乏人才的积累和沉淀。如果能够有一种载体把这些互联网核心技术标准化起来，就能帮助其他行业很快地应用起来，这个是创办矩阵起源的初衷。</p><p>&nbsp;</p><p>这个梦想是比较大的，但是所谓千里之行总要从第一步走起，所以我们一开始决定还是先解决企业从信息化到数字化过程中的核心问题，就是它的业务中台和数据中台怎么来建设，怎么样能够以更低的成本建设。所以我们现在提出来“HSTAP”的概念，它分别对应企业的业务中台、企业的数据中台还有数据如何流转。我们希望用一款数据库把企业最基础的业务中台和数据中台以最低的成本建设好，这样企业就不用操心技术上的事情，它只关心自己的业务就可以了。</p><p>&nbsp;</p><p>InfoQ：在选择一款数据库产品时，除了考虑性能、引入成本以外，学习成本也是需要考虑的核心要素之一，想了解下 MatrixOne 对于开发者以及运维人员的学习门槛是怎样的？</p><p>&nbsp;</p><p>张颖峰：我们现在以云上数据库为更主导的方向，对于云上来讲，用户是免运维的；另一方面，我们是开源数据库，我们把数据运行在 Kubernetes 里面，通过对整个弹性架构的屏蔽，尽力屏蔽掉了数据库内部对于外部的复杂度。</p><p></p><p>对于开发者来说，他只需要关心自己所用的 SQL 语言是什么就可以了；对于运维人员，特别是云下这里，我们会提供可观测性的平台，支持将数据库内部的一些指标或者日志导出，随时去观测。但这并不意味着我们把这些数据提供出来之后，就把复杂度暴露给用户，这只是帮助用户去做一些监控方面的事情。</p><p>&nbsp;</p><p>InfoQ：您刚才提到在整个研发过程当中相当于把技术难度留给我们团队自己，所以在研发的过程中，我们有遇到过最大的技术挑战是什么？后面是怎么解决的？</p><p>&nbsp;</p><p>张颖峰：我觉得最大的技术挑战其实是联调，就像前面提到的，我们数据库是从头来写，这里面包含三块：一块是我们计算从头开始写，一块是存储引擎也从头开始写，还有一块是架构也需要从头开始搭建。大家分别从头开始去干这件事，最后总要有交汇的时候，这个交汇就比较痛苦，因为不仅仅需要自己组件的联通和稳定，还要确保整条链路从头到尾串下来，这里面需要协调和需要相互协作的事情非常多，这个过程我们前前后后经历了不止一次，这是我们整个开发过程当中遇到的最主要挑战。</p><p>&nbsp;</p><p>后来是怎么解决的呢？实际上也没有太多的秘密，主要是依靠大家的协作意识，很多时候要站在对方角度去看这个问题应该怎么去做，然后通过紧密的沟通和协作，在比较短的时间内把整个流程调通。</p><p>&nbsp;</p><p>InfoQ：MatrixOne 从一开始就坚定地选择了开源这条路，原因是什么？</p><p>&nbsp;</p><p>张颖峰：首先，我们作为一家数据库公司，一定是技术驱动的，开源本质上就比较技术范儿，或者说是工程师范儿一点，这样也可以吸引优秀的人才更愿意加入我们公司。因为对于初创公司来说，招募团队也是件很难的事情，为了让更多的人关注我们，开源也是非常友好的。截止为止，我们已经收到来自开源社区的重要贡献，也有人因为开源加入到了我们团队。</p><p>&nbsp;</p><p>另外就是站在产品角度，让用户能够快速地根据他的诉求不断去试错，他能够体验到跟随一款数据库成长的过程，然后在这个过程当中建立信任感。最后，从开源的本质上来说，它其实是国产数据库技术走向国际舞台过程中，不可或缺的一件事情。我们大家不能总认为开源软件是拿来主义，我们也要回馈社区。</p><p>&nbsp;</p><p>InfoQ：展望明年， MatrixOne还将有哪些迭代计划？</p><p>&nbsp;</p><p>张颖峰：目前，我们刚刚完成了整个云原生 HTAP 架构的联调，预计在明年让云原生 HTAP 这套体系能够稳定地对用户提供服务。同时，云上数据库托管平台也会同期提供服务，这是我们从中期来看最直接的目标。但这只是我们的 baseline，接下来会把 HTAP 逐渐升级到 HSTAP，这就是我演讲中提到的 transform 能力，这个对于整个 HTAP 布局的成功应该说是至关重要的。</p><p>&nbsp;</p><p>InfoQ：近几年，我们能看到国内数据库行业的发展是非常迅猛的，无论是在创新、差异化还是生态方面，大家都开始“卷”起来了。若想在国内数据库市场中拉开更具竞争的格局，您觉得需要在哪些方面持续投入？</p><p>&nbsp;</p><p>张颖峰：我倒不认为这是卷起来，因为相对 To C，中国 To B 的发展一直处于比较弱势的局面，目前大家也都意识到了这个问题，都希望 To B 能够成长起来，而 To B 成长起来最应该做到各层次的标准化，数据库首当其冲就应该先标准化起来。</p><p></p><p>因此，数据库作为 To B 行业的一个先锋领域，如果有更多厂商能够一起进入到这个行业，把这个行业真得做大，可能是更加重要的一件事情。我们非常高兴看到有那么多伙伴能关注数据库革新与发展，并有越来越多的人加入，共建优良的数据生态。矩阵起源也很高兴一起贡献力量，未来，我们也会基于 MatrixOne 培养和建设整个数据大生态。</p><p>&nbsp;</p><p>然而，要想把这个领域做大需要多方面投入。站在我们自身的角度出发，对人才一直有更进一步的需求。我们需要更多对基础架构，对底层领域熟悉的人才参与进来。尤其是站在整个 To B 行业来说，这个行业为什么发展难，因为全部都是定制化的，若想在这个过程中帮助到企业，也能够培养他们自己的数字化人才，这其实也是一件双赢的事情。</p>",
    "publish_time": "2022-12-02 11:39:34",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "如何玩转数据？re:Invent Day 3 重大发布速览！",
    "url": "https://www.infoq.cn/article/fsXxGA2mIJtwRWJwp4Hh",
    "summary": "<p>re:Invent Day 3，亚马逊云科技高级副总裁Swami Sivasubramanian 分享数据管理经验，围绕数据的相关产品相继发布。</p>",
    "publish_time": "2022-12-02 12:15:12",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]