[
  {
    "title": "网易智企：如何做好 to B 服务这件事",
    "url": "https://www.infoq.cn/article/CTK8kyEqEJ2843oo4fxk",
    "summary": "<p>早在2002年，网易 POPO 即时通讯软件就已上线，到了2013 年，网易又曾与中国电信合力打造易信，沉淀了即时通讯相关的技术。随着移动互联网时代到来，网易各类 C 端产品也相继涌现，在与内部其他事业部的打磨中，又进一步积累了企业级 IM 云服务的实践经验。2015 年，提供融合通信云服务的<a href=\"https://xie.infoq.cn/article/32c79a1f939eda19552157f79\">网易云信</a>\"顺势推出，其将已经验证过的通信与音视频 PaaS 化服务推向市场。</p><p>&nbsp;</p><p>作为网易智企的第一块业务，成立七年的网易云信累计服务了超过&nbsp;150 万企业开发者，成功发送了&nbsp;20000 亿条消息，全球注册应用数超&nbsp;58 万，累计覆盖智能终端 SDK 数超过&nbsp;224 亿。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/22/22a669deb5794f2c8f13c733aa799526.png\" /></p><p></p><p>网易云信能取得如此成绩的原因之一便是顺应了互联网的发展趋势。2015 年，随着“互联网+”战略的首次正式提出，中国移动互联网迎来了爆发式增长，各大巨头也纷纷开始发力 to B 业务，网易智企便是网易的 to B 的“先锋”。</p><p>&nbsp;</p><p>当时，国内通信基础设施持续完善，带来了通信质量提升，为更多场景与互联网高效连接提供了重要保障。同时，传统企业快速接纳“互联网+”创新模式，极大丰富了移动互联网的应用与服务。这为网易云信的诞生提供了土壤。</p><p>&nbsp;</p><p>在这个服务过程中，网易也看到了信息安全的重要性，网易智企旗下主打安全牌的网易易盾也应运而生。</p><p>&nbsp;</p><p>网易易盾最初的想法是拦截垃圾邮件，但随着形形色色的内容涌现，有害内容增多、真假信息掺杂的情况逐渐成为横亘在业务发展道路上的一座大山，内容风控的重要性和必要性开始被广泛接受。网易易盾也开始向着成为一套解决各类数字风控痛点的体系化产品演进。</p><p>&nbsp;</p><p>如今，网易易盾终端覆盖量超 25 亿，累计检测数据量超 2 万亿，处理移动安全风险超 1400 亿，抵御外挂威胁超&nbsp;700 亿。</p><p>&nbsp;</p><p>顺应时代、“做正确的事”，被市场验证是有效的，这个理念也被刻进了网易智企的成长基因中。</p><p>&nbsp;</p><p></p><h2>深入技术</h2><p></p><p>&nbsp;</p><p>当前，在各行各业数字化深度推进的当下，技术的深度挖掘和普及应用成为不可逆转的趋势。</p><p>&nbsp;</p><p>在过去七年，网易云信紧密围绕 IM 即时通讯和音视频两大核心技术，不仅在大规模分布式传输网络、高性能通信服务、高效视频编码、智能音频处理、弱网体验保障等云通信关键技术上取得了诸多突破，还在与客户深度碰撞的场景化技术上不断优化，比如：智码超清技术、音频空间音效、语音/视频特效、虚拟形象等。</p><p>&nbsp;</p><p>除此之外，网易云信在计算机视觉、机器学习等 AI 技术与传统算法和基础通信能力结合等方面进行着持续探索，获得了海内外各项赛事、顶级学术会议、权威机构的广泛认可。</p><p>&nbsp;</p><p>今年，网易云信&nbsp;AI 音频研究成果获得了全球顶级声学、语音及信号处理会议 ICASSP 2022 认可，并受邀在会议上向学术和工业界做研究报告；在全球计算机视觉和模式识别领域顶级会议 CVPR 上，网易云信的视频超分技术以明显优势获得冠军。</p><p>&nbsp;</p><p>同时，网易易盾多年来一直积极参与多项国家/行业标准的起草制定，如参与起草信通院《人脸信息处理合规操作指南》、参编中国科学院信息工程研究所《信息安全技术-互联网信息服务安全通用要求》（国标）、参与起草人社部、公安部《网络与信息安全管理员国家职业技能标准》（国标）等。</p><p>&nbsp;</p><p>2021年，在安全行业门户FreeBuf发布的《CCSIP 2021中国网络安全产业全景图》(第二版)中，网易易盾全产品线再次入选恶意内容检测、舆情检测、业务反欺诈、账户安全等多个分类。</p><p>&nbsp;</p><p>近日，随着跨区域的线上沟通、远程协同办公、远程医疗、在线教育等新场景线上场景的激增，网易智企融合两大业务的技术优势，推出了安全通一站式解决方案。用户只需将客户端集成网易云信 SDK 即可与通信服务建立连接，并直接对接网易易盾内容安全服务。由于通信服务管理和内容安全检测服务是混合部署的，所以一定程度上也帮助用户降低了成本。</p><p>&nbsp;</p><p>另外，网易智企也在今年推出了<a href=\"https://www.infoq.cn/article/gQfuWEDMSjw15YdoyoD5\">“易+”开源计划</a>\"，先后开源了网易会议组件、低延时直播方案、<a href=\"https://xie.infoq.cn/article/b0009682428e7799589e3bf2c\">GameSentry</a>\" 等工具。其中，网易会议组件能帮助各行各业用户快速构建稳定可靠、高清易用的专属会议系统；低延时直播方案成为业界首个开源的低延时直播方案，推动着直播行业的整体发展；GameSentry 则是游戏安全战场的“哨兵”，守护游戏安全的第一道防线。</p><p>&nbsp;</p><p>&nbsp;</p><p></p><h2>理解场景</h2><p></p><p>&nbsp;</p><p>网易副总裁、网易智企总经理阮良也曾在交流中表示，to B 面对的是一个个特定行业、特定场景里的组织，最大的挑战在于是否真的了解客户，是否真的理解场景。</p><p>&nbsp;</p><p>网易智企的思路是，先从擅长的领域切入，比如泛互联网中的游戏，再逐渐拓展到传统行业。</p><p>&nbsp;</p><p>作为在全球拥有超过 1 亿注册用户的头部游戏分发平台，火烈鸟网络前不久与网易智企合作，希望寻求一整套完备的解决方案，既能履行好企业合规要求和未成年人保护义务，又能与用户形成更好的交互方式，提升用户游戏体验，进而促进新的增长。</p><p>&nbsp;</p><p>网易智企为火烈鸟网络提供了一套“组合拳”：网易易盾的内容安全机审和号码认证、网易云信的 IM 专业版，以及网易云商的一体化服务营销。</p><p>&nbsp;</p><p>除了泛互联网行业，在传统行业的“互联网+”场景中，网易智企也在发挥着技术价值。网易智企与新华三展开深度合作，联合共创软硬一体的医医协作解决方案。</p><p>&nbsp;</p><p>在远程病理诊断中，借助新华三云屏终端载体，病理切片图像转化为 4K 超高清视频信号，并通过 4K 视频会议系统实时传输，让专家在千里之外完成病理阅片、出具专业的诊断意见。</p><p>&nbsp;</p><p>为解决疫情下的就业问题，网易智企为滨江区人力社保局定制了一个“零接触云招聘”系统，以线上视频面试代替了线下面对面交流。除此之外，网易智企还先后在浙江、河南等地落地了人工审核基地，构建起了全国性的互联网内容审核服务网络，释放了更多的就业机会。</p><p>&nbsp;</p><p>面对未来未知的机遇和挑战，网易智企如何更好地发展与应对，我们拭目以待。</p>",
    "publish_time": "2022-11-07 11:41:24",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]