[
  {
    "title": "红帽发布全球企业级开源现状调查报告：八成受访企业倾向选择企业开源软件",
    "url": "https://www.infoq.cn/article/UF9axyOmpWZIXwJGFsKQ",
    "summary": "<p>近日，红帽发布2022年企业级开源现状调查报告，这是红帽第四年进行该调查。结果发现，92% 的受访IT 决策者认为，企业级开源解决方案非常有助于解决他们面临的与疫情相关的挑战。早在疫情开始之前，许多企业就已经开始向开放混合云过渡。 无论是有意的架构选择，还是在日新月异的市场环境中被迫为之，使用开源开发模式，以及开源代码构建的云计算和不间断服务对几乎所有行业的企业来说都越来越重要。此外，供应商支持、安全性都会影响企业对开源软件的选择。</p><p></p><h2>企业级开源增长趋势明显</h2><p></p><p>在今年的调查中，82%的IT决策者表示更倾向于选择为开源社区做出贡献的供应商，原因集中在供应商更加熟悉开源流程、会帮助维持健康的开源社区、对企业所需功能的开发有影响力、解决技术挑战的效率更高。</p><p><img src=\"https://static001.infoq.cn/resource/image/19/e3/19624c96d832807db179b6a7d40530e3.jpg\" /></p><p></p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/52/c3/52f9cba0e0dbcbf848be6f250b7e64c3.jpg\" /></p><p></p><p>安全性也是企业级开源的一大优势。89%的受访者认为企业级开源软件比专有软件更安全或者同样安全。大体上，这些数值与去年的调查结果类似，但是“更安全”这个选项的比例增加了百分之四，这与十多年前将开源软件安全视为弱点的主流认知相比发生了很大的观念变化。</p><p>&nbsp;</p><p>从安全角度来看，是什么让企业级开源如此有优势？</p><p>&nbsp;</p><p>开源安全如今最大的优势在于“团队可以为内部应用使用经过测试的开源代码”，这反映出开源代码在企业内部得到了广泛应用。52%的受访者认为安全补丁有据可查，51%的受访者认为供应商及时为企业级开源漏洞提供补丁，44%的受访者认为相比于专有软件有更多人审查和测试代码。</p><p><img src=\"https://static001.infoq.cn/resource/image/bf/7a/bfa82c6f9c1e437eac73667a19yy557a.jpg\" /></p><p>最近几年，企业级开源在持续获得专有软件的市场份额。根据红帽的调查，这种趋势在接下来两年会持续下去，受访者公司中使用的专有软件占软件总数的比例将下降百分之八。与此同时，预计企业级开源软件的比例将上涨5%，基于社区的开源软件比例将上涨3%。</p><p>&nbsp;</p><p>企业级开源的应用也已经延伸到新涌现出的重要技术工作负载，其中80%的受访者计划增加企业级开源在人工智能、机器学习、边缘计算和物联网等领域的应用。这种趋势出现的很大一部分原因在于参与调查的IT决策者认为企业级开源越来越受欢迎，其中77%表示相比一年以前，现在他们对企业级开源的看法更加积极。</p><p><img src=\"https://static001.infoq.cn/resource/image/c5/7f/c55fee121fdcdda7c1c71f806687cc7f.jpg\" /></p><p>在具体应用层面，62%的企业会选择将企业级开源软件用在IT基础架构现代化的过程中，54%的企业会在数字化转型中应用。容器、Kubernetes以及大量补充性的云原生开源项目都是典型的新兴软件类别，这些构成的软件生态系统正在不断发展中。70%参与调查的IT决策者所在的公司正在使用Kubernetes，几乎三分之一的决策者计划在接下来12个月内大幅增加对容器的使用。</p><p><img src=\"https://static001.infoq.cn/resource/image/0e/14/0ee5b4d4d5b5286b3545fdbd87359214.jpg\" /></p><p>即便企业级开源已经成为很多企业的主流选择，但也有部分企业出于对技术支持水平的担忧、对兼容性的担忧、对代码本身安全性的顾虑以及内部员工缺乏管理和支持企业级开源技术技能而放缓使用脚步，但从长远来看，企业级开源技术的应用度将逐渐升高。</p><p></p><p>作为一种战略资源，企业级开源具有多种重要特性，超过75%的受访者同意企业级开源技术能带来灵活性，确保其公司可以及时利用最新创新，有助于公司利用混合云基础架构，并且是其安全战略的重要组成部分。</p><p>&nbsp;</p><p>作为企业级开源最重要的供应商之一，红帽在近期的全球峰会上针对企业当前在应用开源软件中存在的问题发布了一系列解决方案。</p><p></p><h2>红帽企业Linux 9来了</h2><p></p><p>红帽Linux可以看作是一个未来创新的平台，不论是物理机、虚拟机、私有云、公有云还是边缘，甚至是汽车操作系统，Linux 9都支持，红帽会把一致性、稳定性、安全性作为Linux 9未来发展的中心，同时简化混合云基础架构，让用户在公有云、私有云中都有一致的体验，提高开发效率。</p><p>&nbsp;</p><p>在之前，红帽已经有了汽车级 Linux 项目，但如今和通用汽车进行了合作，开发了汽车专用 Linux 发行版。通用汽车在 Ultifi 平台上实施连续功能安全认证，简化了车载软件系统更新开发过程，过去的安全认证通常需要花费六个月到一年的时间做认证。而车载操作系统只是红帽在汽车这个边缘市场工作的一小部分，开发连接车辆的云基础设施更为复杂。车联网的大部分关键计算虽然都发生在边缘，但大量数据需要发送到云端处理。</p><p>&nbsp;</p><p>这些工作不是靠红帽和汽车制造商就能完成的，需要包括 GPU 等芯片制造商在内的众多合作伙伴的努力。为此，红帽在峰会上推出了红帽边缘 (RedHat Edge) 计划来加快企业采用边缘计算架构。这套新的跨产品组合边缘功能将专注于通过降低复杂度、加快部署、增强安全能力，增强从数据中心到边缘系统的一致性，帮助客户和合作伙伴更好地适应边缘计算。</p><p></p><p>事实上，近几年红帽的很多应用创新都发生在边缘端。比如，过去一年里红帽已开始将 RHEL 和红帽 OpenShift 等主打产品推向边缘，红帽希望将其在数据中心的这些能力带到边缘。</p><p>&nbsp;</p><p>此外，既然是做边缘计算，就要更加自动化，人力在边缘端的管控力有限，所以要透过自动化的方式控制边缘计算。</p><p></p><h2>安全是最重要的话题</h2><p></p><p>&nbsp;</p><p>毫无疑问，不管有多少功能，最重要的还是安全，安全永远是所有IT使用者，包括所有人都最关心的事情。如今，黑客对开源的攻击发生在整个供应链层面，红帽也在不断扩展安全能力。</p><p>&nbsp;</p><p>红帽认为安全是供应链的安全，所谓供应链是一个循环的概念，从基础设施到开发、运维和交付，每个环节都需要安全，缺一不可，不只是说应用安全就可以了，软件本身的开发模式，甚至开发中的签名功能，都需要保证安全性，并且尽量自动化整个过程。</p><p>&nbsp;</p><p>面向未来，红帽会持续在品牌，社区与生态、产品与行业、协同扩展方面努力。</p>",
    "publish_time": "2022-06-27 11:03:48"
  },
  {
    "title": "首都在线龚宏绩：用生态赋能企业出海 实现多方共赢 | TGO 专访",
    "url": "https://www.infoq.cn/article/PmPSOLYH7rLm0OJ0SyMF",
    "summary": "<p>嘉宾介绍：龚宏绩，首都在线海外事业部 CTO&amp;副总经理，TGO 鲲鹏会（广州）学员。</p><p>曾先后供职于 SurfControl、腾讯、魅族、三七互娱等公司，担任开发、运维等高级管理职位。自 2021 年加入首都在线以来，龚宏绩先生一直致力于通过高效、稳定的云基础设施助力中国企业出海。</p><p></p><p>“折腾”是龚宏绩对自己职业生涯的评价之一。一直能够踩中时代风口的他，不仅敢折腾，而且更善于折腾。自 2021 年加入首都在线以来，龚宏绩一直在“折腾”一件大事——通过云服务助力中国企业出海。</p><p></p><p>同事们对他的评价是，工作专注、效率高。龚宏绩表示，高效的工作得益于详细的工作计划以及四象限计划表，特别是四象限计划表更贴近工作中的执行阶段，让他把精力集中在重要紧急的事情上，进而提高工作效率。</p><p></p><p>而专注对待每一件重要的事，从他工作与生活的细节中可以窥见一斑。龚宏绩工作时全身心的投入其中，不被外界所打扰；工作结束陪家人时，也会沉浸其中，比如他会直接参与到小孩的活动中，而不是在旁边看着孩子玩耍。</p><p></p><p>对龚宏绩而言，折腾是对自己敏锐洞察力的信心，而专注和高效的风格是他对公司、客户以及家人的尊重，而他的这一风格，也在首都在线的团队中留下了深深的烙印。</p><p></p><h3>提升企业全球竞争力，云服务商成重要推手</h3><p></p><p></p><p>从早期的互联网社交、视频和短视频、互联网工具等数字化产业出海，到现在传统企业积极借助数字化技术进行出海，中国企业通过全方位数字化转型和创新，在海外实现产品升级和品牌升级，提升全球竞争力。</p><p>越来越多的企业在进行全球业务布局时，将自己原有的数据中心迁移上云，或者通过混合云的方式，方便其全球化的运营和管理，同时更便捷地服务客户，提升客户体验。龚宏绩表示，“鼓励企业出海参与全球化竞争是一项国家战略，云服务商应该尽全力为他们提供稳定、可靠、落地的一站式的云上云下服务，帮助中国各产业提高全球竞争力。”</p><p></p><p>在谋划出海的过程中，企业对云服务提供商在全球基础设施覆盖、云计算技术的稳定性、安全合规以及合作伙伴解决方案的丰富性等均有着较高的要求。</p><p></p><p>有着多年甲方工作经历的龚宏绩，对出海企业的心态特别理解。在他看来，出海企业对云服务商提出的要求都十分合理，因为这些企业直接面对、服务的可能是几百万、上千万的用户，云服务一旦出现问题，大量的用户体验将受到影响。</p><p></p><p>据龚宏绩介绍，云计算服务商在最基础的服务部分应着重考虑稳定性，在创新层上应尽力为企业客户提供更大的便捷性，比如数据的实时监控、更快的服务速度等；云服务商在自身安全合规的前提下，应组织企业客户定期对不同国家的数据、网络、安全合规要求进行学习；另外，云服务商还应做好服务方的生态，提供一揽子解决方案，为出海企业助力。</p><p></p><p>拥有“全球化思维，本地化行动”是企业出海取得成功的关键。而能够为数字经济提供技术支撑，同时在全球范围内高效配置资源，加强不同国家和地区的安全合规，推动企业围绕当地用户需求创新产品、服务和体验的云计算服务商，已经成为企业实现“全球化思维，本地化行动”的重要推动力。</p><p></p><h3>用产品与服务构筑出海能力，破局国内企业出海核心痛点</h3><p></p><p></p><p>天下大势，合久必分，分久必合，企业需求也会如此变化。近五年，中小企业、传统产业，都在寻求把原有业务转云，让云服务商提供企业基础架构组件。当前，别是一些中大型公司，又有从云上转到云下的需求。企业的需求基于市场变化，优秀的云服务商也要具备灵活调整服务边界的能力。</p><p></p><p>据龚宏绩介绍，首都在线就是一家具有全球服务能力的国际化云计算服务商，通过建设稳定、优质的全球网络，向客户提供一站式云上云下服务，助力中国企业出海。</p><p></p><p>谈到与同行之间的优势，他表示，经过十余年的投入和优化，在网络层面，首都在线已形成全球一张网，全球所有站点都用内网的方式打通；在交付能力上，首都在线能够适应客户的定制化需求。产品人员、研发人员、解决方案人员以快速响应客户需求，并迅速落地；而服务一直是首都在线生存的核心，目前也在不断优化和提升相关能力。</p><p></p><p>在服务能力方面，首都在线背后存在一支强大的运营团队，可以实现从资源的采购、转运到最后部署上线的全过程管理；另外结合客户业务特点、行业特点，制定精细化运营、服务方案，并且不断提高资源周转率、使用率，最大限度降低客户使用成本。同时，通过一些完整的解决方案，满足客户行业需求、提高终端用户使用体验。</p><p></p><p>比如，在全球同服加速方案中，首都在线为客户提供专属优化的本地多线 BGP 带宽、本地 DDOS 防护，将游戏客户端请求就近接入，并利用全球云互联专线加速分发到游戏服（中心节点）。让游戏玩家享受到流畅且高性能的游戏体验，同时也大大提高了服务可用性；在混合云组网的方案中，通过云 + 裸金属 + 自建 + 混合云方式应对业务独享、安全、冗余的架构，同时满足业务爆发式增长的需求。</p><p>龚宏绩把首都在线云服务的基础部分称为底座，公司的战略是把底座打稳，然后再通过团队的行业解决方案能力，在一个个不同行业落地生根。当服务同一个行业里的大量不同客户后，团队就很清楚客户的需求点在哪了，甚至已经比客户还懂客户的需求。</p><p></p><h3>构建服务方生态体系，提供一揽子解决方案</h3><p></p><p></p><p>几年前，出海对很多中国企业来说，还是一道选择题。现在，它已经变成一道必答题。“独木不成林，一人不为众”，单凭云服务商自身的资源和力量难以更好地满足客户的诉求。因此，云生态服务方的生态建设也进入了新阶段，通过集合生态伙伴能力，满足更多出海企业客户“用好云”的诉求。</p><p></p><p>据龚宏绩介绍，首都在线围绕企业出海建立的生态同盟已初具规模，可以为客户提供一揽子解决方案。比如，通过与 AWS 的战略合作，首都在线全球网络布局、特别是跨大洋、跨大洲的光缆和通信能力方面，实现重要补充；另外在整个互联网生态，特别是 PaaS 和 SaaS 产品部分，能够满足客户的诸多特殊需求。</p><p>不仅如此，首都在线还与其他众多专业厂商牵手建立战略联盟，丰富公司产品线，为用户提供更全面的高质量 IaaS 公有 / 私有云服务，以及 PaaS 层和 SaaS 产品服务。同时，首都在线也成为客户与生态伙伴之间沟通的桥梁，帮助其改善产品体验与服务。</p><p></p><p>“公司专注自己的优势领域，在一些特殊的场景、特殊的产品上，选择与全球优选的服务商合作。以首都在线全球化数据中心为基础，共建基础、开放、高效的云平台，实现多方共赢。”龚宏绩说道。</p><p>除了提供优质的产品及服务外，合规与安全也是企业出海的“生命线”。龚宏绩称，不触碰、不接触用户数据，是首都在线服务客户的安全底线。公司除了在资源规划和平台部署时会对安全合规做整体考量之外，还会邀请生态企业中的专业法律顾问团队，为客户提供不同国家、地区对数据、网络、安全的法律法规要求的学习培训。</p><p></p><p>龚宏绩认为，客户独特的行业特性，以及在出海时面对全球各地用户的独特需求，使得云服务商需要具备整合生态，锚定伙伴能力提升，提供更完整解决方案的能力。同时，还要具备足够开放的心态去真正赋能生态伙伴、发展生态系统，加强更多应用落地，助力出海企业业务不断地推进、下沉，这才是国际化云服务商未来的生存之道。</p><p></p><p></p><h3>Q&amp;A</h3><p></p><p>&nbsp;云边协同可以将边缘计算节点的算力、存储等资源和云计算资源进行统一进行协调，在我们服务的客户中，云计算解决哪方面的需求？边缘节点解决哪方面的需求？</p><p>A：云计算解决的是集中统一，资源统一管理、服务集中调配的问题；边缘计算将网络边缘上的计算、网络与存储资源组成统一的平台为用户提供服务，使数据在源头附近就能得到及时有效的处理。比如，短视频或直播行业，因行业覆盖范围广，各地方网络质量不一样，要保证主播、用户有比较好的延时体验，计算部分放在云上，视频调度、流媒体的部分就用边缘覆盖，以保证主播和粉丝的用户体验。</p><p></p><p>&nbsp;企业出海会经历业务从落地、逐渐发展到爆发的阶段，首都在线是如何做到在企业业务不同阶段，云资源能够顺滑的实现调整？有什么方式可以为客户节省成本？</p><p>A：首都在线背后有一个强大的资源运营的团队。运营团队成员，一方面会去做年度的计划、客户的规划；另外一方面做精细化运营，比如教育行业，客户业务高峰期是在白天；游戏客户的业务高峰期在晚上八点到十点。结合行业特点、客户访谈信息，以及客户自身业务发展情况等，通过精细化运营的手段，不断提高资源周转率、使用率，最大限度降低使用成本。</p><p>首都在线向客户提供全球资源服务，包括不同的节点之间也有专业运营的团队在在背后支撑，我们可以用最短的时间实现需求从提出到落地。公司从资源的采购、资源转运到最后部署上线，背后都有一套完整的运营系统在支撑。</p><p></p><p>&nbsp;在用户的数据隐私方面，首都在线的解决方案是什么？</p><p>A：首都在线非常清楚的知道自己是中立的云服务提供商，公司不触碰、不接触用户数据，这是安全底线；当用户需要数据安全的时候，我们会向用户提供关键的建议，甚至在必要且能够保证客户数据安全的情况下，给用户提供数据安全方面的服务，但我们的底线是永远不碰用户数据。</p><p></p><p></p><p></p><h3>关于 TGO 鲲鹏会</h3><p></p><p>TGO 鲲鹏会是极客邦旗下科技领导者聚集和交流的组织，学员由 CTO、架构师、技术 VP、具有技术背景的 CEO 等组成，目前已经在北京、上海、深圳、广州、杭州、成都、硅谷、南京、台北、厦门、武汉、苏州等 12 个城市定期举办学习活动。</p><p>TGO 鲲鹏会采用了“学员共建”的组织形式，希望通过“共建、自治”的方式维护各城市的健康发展，为学员提供必要的服务，帮助学员个人更好地学习和成长，助力学员企业之间更好地合作与交流。加入 TGO 鲲鹏会，全方位提升自身价值，成为卓越科技领导者！</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/4c/4c5129d041d7023b2c328ccaa1b96277.png\" /></p><p></p><p></p><p>点击阅读原文或扫码加入TGO鲲鹏会！</p>",
    "publish_time": "2022-06-27 10:25:39"
  },
  {
    "title": "中台产品经理的进阶思考｜InfoQ大会早班车第4期",
    "url": "https://www.infoq.cn/article/94zRDf3fged5KsySLbvx",
    "summary": "<p>刘光月老师拥有十余年产品经验，她见证了一个又一个亿级用户产品的成长。本期我们连线京东产品总监刘光月，和你一起聊聊她在中台产品设计、产品运营方面的思考，期待对你有所启发。</p>\n<p>首届PCon全球产品创新大会即将落地北京，<a href=\"http://pcon.infoq.cn/2022/beijing/schedule?utm_source=infoq&amp;utm_medium=zaobanche\">点击查看最新日程</a>。</p>",
    "publish_time": "2022-06-27 10:15:49"
  },
  {
    "title": "平安消费金融高并发业务架构演进实践与思考",
    "url": "https://www.infoq.cn/article/yL2dLq6M3O02WRW2A80C",
    "summary": "<p>在最近短短几年中，平安消费金融业务迎来爆发式增长，业务系统也从单体应用一步步演进到微服务架构的一百多个应用，这个过程经历了一系列的微服务架构的建设规划、升级、落地及架构不断演进，目前系统日交易金额10亿+，良好的支持了业务系统高并发、高可用及弹性扩展能力。</p>\n<p>本次演讲主要介绍互联网消费金融的业务架构特性，如何在业务订单量、成交金额高并发增长业务同时，应对监管、安全、风控要求下设计合理架构；如何对内对接海量银行内部系统，对外采集风控审批业务数据源；以及在架构演进过程遇到的问题及思考。</p>\n<p>另外，美的、微众银行、福特汽车等企业都来大会演讲啦，快来<a href=\"http://gk.link/a/11siC\">ArchSummit深圳站一睹为快～</a></p>",
    "publish_time": "2022-06-27 10:12:26"
  },
  {
    "title": "中国工商银行软件开发中心代码扫描建设之路",
    "url": "https://www.infoq.cn/article/i0CftJvEiF8mbisle4NJ",
    "summary": "<p>为满足不断变化和日益增长的市场需求，中国工商银行软件开发中心（以下简称工行软开）一直在探索提升组织级 IT 效能，DevOps 作为近年来兴起的软件工程文化和实践，目标是缩短开发周期，提高部署频率和更可靠的发布，这与工行软开的诉求不谋而合。随着工行软开 DevOps 转型深入推进，产品交付质量和速度都在快速提升，软件质量管控作为 DevOps 转型中的重要组成部分，代码扫描手段在保障软件高质量交付过程中起到了重要作用。</p><p></p><h2>一、代码扫描中心建设背景</h2><p></p><p></p><p>为了保证产品质量，工行软开基于研发过程建设了强制执行的质量门禁，以及完善的测试体系，有效地守护了软件质量。但是随着业务研发规模的不断增长，为满足不断变化和日益增长的市场需求，对软件质量守护和效能提升提出了更高要求，对研发赋能、统一质量视图、质效度量及工具链支撑等全流程代码质量管控有迫切需求。主要体现在以下 4 个方面：</p><p></p><h3>编码辅助能力不足</h3><p></p><p></p><p>质量门禁平均每月强制打回大量静态代码扫描问题，先污染后治理成本高，问题事后治理困难，急需编码实时辅助工具，降低编码成本，提高本地编码质量。</p><p></p><h3>扫描工具共享生态不完善</h3><p></p><p></p><p>代码扫描组件、规则库建设不统一，共享生态不够完善，存在规则重复建设问题，需要一个标准化的扫描工具管理平台。</p><p></p><h3>代码质效数字化管理待完善</h3><p></p><p></p><p>缺少开发者视角的全面代码质效数字化视图，提升团队代码质量缺少统一科学数据指导，无法客观全面的挖掘团队能力短板，帮助开发提升研发效能。</p><p></p><h3>工具链支撑不够完善</h3><p></p><p></p><p>随着数字化转型的不断推进，应用开发需求快速增长，同时面临的安全风险也越来越大，为实现各类漏洞排查、技术规范检查快速高效，保证研发质量，急需进一步提升工具链排查的自动化能力。</p><p></p><h2>二、代码扫描中心建设思路</h2><p></p><p></p><p>针对以上问题，建设代码扫描中心，通过提供 IDE 编码辅助、建设扫描工具共享生态及数字化质效度量体系，实现研发全流程的工具支撑及数字化的精准质效度量，从而全面提升研发效能。</p><p></p><p><img src=\"https://static001.geekbang.org/wechat/images/bb/bb7d519c43383712c773bd2bc88226d5.png\" /></p><p></p><h2>三、代码扫描中心实施方案</h2><p></p><p></p><p>根据扫描中心建设思路，主要对以下六个领域实施建设：</p><p></p><h3>建设本地研发助手</h3><p></p><p></p><p>建设研发助手，打造一个集合多种编码辅助功能的本地插件，在编码阶段提供实时代码质量检查及标准资产快速检索复用的能力，有效辅助开发在编码过程中潜移默化的学习并提升开发能力，同时提高编码质量、提升编码效率，赋能开发。</p><p></p><p>利用编码阶段的实时代码质量检查，将代码扫描由编码后向编码中推进，在编码阶段提供实时规范检查及修改建议，不仅解决了编码后缺陷治理困难的问题，同时帮助开发在编码中不断学习并提升开发能力。另外，对标准化代码及构件进行管控，帮助开发人员完成快速引入，辅助标准化资产编写、快速上传，支持开发人员修改和完善标准化资产，实现标准资产快速检索复用，提升开发人员效能。</p><p></p><h3>建设自助代码扫描流水线</h3><p></p><p></p><p>通过搭建云端的基础运行环境，将 JENKINS、执行机等全部云化管理，业务代码逻辑与基础运行环境完全解耦，实现环境按需自动弹性伸缩，为全行代码的快速扫描提供了有力保障。</p><p></p><p>建设可复用、可定制、可编排的自助代码扫描流水线前后端服务，实现流水线调度、编排等核心功能，为基础组件提供自助快速串接流水线能力，将代码资产、代码缺陷等进行集中管理，为技术管理、安全管控、测试质量管控提供一体化支撑能力，有效提升专项排查效能、团队自查能力。</p><p></p><p><img src=\"https://static001.geekbang.org/wechat/images/ce/cebe502711d7513683e9434fef81f49c.png\" /></p><p></p><h3>统一管理扫描规则</h3><p></p><p></p><p>通过对扫描规则进行标准化的统一管理，提升规则可读性及可执行性，实现规则资源合理利用。首先，对规则进行分层管理，根据开发组织层级和专项内容对规则进行分级分类管理，按照不同方向对规则进行分层，同时增加关键字方便查询使用。其次，对历史规则进行信息完善，增加规则标签信息，如唯一标识、大小分类、背景来源、扫描范围、作用效率等，帮助完善规则信息。最后，建立规则关系图，剔除无效规则、重复规则，将分层规则向上集成，按照开发组织层级进行规则继承管理，对于强制级别规则必须启用，实现规则的标准化管理。</p><p></p><p>通过对扫描规则的分层管理、信息完善和建立规则关系图，为工行软开提供统一的标准化扫描规则管理，避免产生规则孤岛状态，减少资源浪费，有效提升研发效能。</p><p></p><h3>建设扫描工具共享生态</h3><p></p><p></p><p>建设统一的扫描工具管理平台，支撑扫描工具共建共享，有效避免重复建设。通过提供统一快捷的扫描工具管理页面，实现扫描工具的审批上线、快速配置、实时更新等。同时将扫描引擎与扫描规则解耦部署，扫描规则更新实时生效，实现扫描规则热加载。</p><p></p><h3>建设质效度量全视图</h3><p></p><p></p><p>覆盖本地编码、持续集成、持续部署、持续交付的多维度度量指标，建设质效度量全视图，为团队提供全面直观的数字化代码质量度量，为开发提供个人维度度量视图，助力团队和个人挖掘开发能力短板、聚焦能力成长，为提升开发效能提供有力抓手。</p><p></p><h3>组建虚拟专家团队</h3><p></p><p></p><p>成立流水线专家团队，对扫描工具接入进行准入管控，在技术管理、安全管控、测试质量管控等领域提供专业的组件接入审查及支持，保障流水线运行安全稳定。</p><p></p><h2>四、未来展望</h2><p></p><p></p><p>依托 DevOps 理念，工行软开金融科技全面建立需求、研发、投产、生产运营统一协作的研发运营一体化机制，不断提高研发供给能力和研发质效，优化 DevOps 工具体系和流程，建设高效能、自动化的工具链。未来将继续聚焦安全稳定和快速交付的目标，持续完善 DevOps 研发运营一体化能力，不断推进数字化转型进程。</p>",
    "publish_time": "2022-06-27 14:52:55",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "AI落地的新范式，就“藏”在下一场软件基础设施的重大升级里",
    "url": "https://www.infoq.cn/article/lj4SMzSjJxNMYrGf5lob",
    "summary": "<p>2014年，刚成立1年的数据智能基础软件供应商九章云极DataCanvas董事长方磊曾在一封发给投资人的邮件中谈到自己的创业设想。</p><p></p><p>这个设想的核心观点是，容器技术自2012年出现后，给分析行业带来了很大的改变，容器化的方式统一了分析流程的运行基础。而且，与容器结合后，机器学习、深度学习等不再只是在上层增光添彩的小工具，而成为了标准化的基础设施。</p><p></p><p>如今再回头去看，令方磊感到庆幸地是，创业这9年来，九章云极DataCanvas基本还是按照最初定下的方向走在前进的路上。“我们选择了一个对的赛道，并一直坚持着”。</p><p></p><h2>创业初心：为数据科学家打造协作平台</h2><p></p><p></p><h3>萌芽于硅谷车库</h3><p></p><p></p><p>从清华大学电子工程系毕业后，方磊赴美攻读硕士和博士。2009年，方磊加入微软研究院孵化的项目“云计算平台”，主导开发了管理全球超过20万台服务器的数据中心管理监控系统。</p><p></p><p>2011年，方磊加入微软必应搜索团队，主要负责设计并开发基于下一代大数据技术的索引处理架构，以及基于机器学习的搜索语义理解。</p><p></p><p>在工作之余，方磊经常利用周末时间拉上当时一起在美国读硕士时的同窗好友尚明栋，一起研究做车库项目，想各种idea。</p><p></p><p>2013年前后，美国的数据科学平台创业迎来爆发期，加之，公有云的技术环境形成，促使新一代数据和人工智能（Data AI）的公司不断孵化出来....Databricks、Snowflake等一批后来崛起为头部的公司大都是从这个时候起步的。</p><p></p><p>嗅到这样的趋势后，方磊和尚明栋觉得，应该顺势而为，做点事情。方磊认为，数据科学平台热潮之下，在数据科学领域还存在新的创业机会。而且这也是自己的职业领域，是最擅长的方向。</p><p></p><p>二人一拍即合，决定在数据科学平台领域创业。</p><p></p><h3>回国创业</h3><p></p><p></p><p>与国外火热的创投势头不同。当时在国内，数据科学还不是流行的概念。那会儿火遍大街小巷的创业风向还是O2O。九章云极DataCanvas算是国内最早一批做自动化数据科学平台的供应商。</p><p></p><p>好在开局顺利，回国不久，九章云极DataCanvas就拿到了第一笔天使轮融资。凭着这笔启动资金，方磊和尚明栋又招了5-6个研发人员，团队决定先把公司的第一款产品研发出来。</p><p></p><p>用方磊的话说，这是一款有着很简单的初心的产品，一个帮助数据科学家更好地协作的平台。</p><p></p><p>早先在微软担任数据工程师期间，方磊发现团队的八百多名工程师都在一个叫Aether的系统上协作，Aether系统上有1万多个模块，十几万个项目。该平台资源调配灵活，整个团队在上面执行数据分析任务，不仅可以做到井然有序，而且非常高效。</p><p></p><p>像Aether这样的系统，当时还主要在大厂内部使用。受到启发，方磊决定打造出一个更广泛使用的数据科学平台，帮助更多企业的数据科学家和数据工程师更好地建模分析和协作办公。</p><p></p><h3>从工程师到技术创业者</h3><p></p><p></p><p>转眼到了2015年底，方磊和团队发现，他们埋头做了2年的产品，其实并没有真正的付费用户。</p><p></p><p>“技术人创业经常遇到的一个很大的问题是，很难意识到市场到底要什么。我们那时更多还是从程序员的视角来做事。我们创始团队的背景都是比较优秀的程序员，一路走来都比较顺利，但对市场的估计不足。像我在微软这样的大企业做研发工作，离市场很远，对市场的感觉不够。我们前两年主要在写代码，其实应该先去调研市场”，方磊回忆。</p><p></p><p>对技术出身的创业者来说，「从技术到产品」很容易实现，但要实现「从产品到商品」却很难，后者要跨越的Gap可能要远远大过前者。因为从产品到商品并不是简单的销售问题，其成功的关键取决于对市场需求的精准洞察。</p><p></p><p>方磊发现，在中国，要想把数据和算法变成生意，就要服务头部的大客户，因为大型企业有数据，而且有数据处理的需求。只有跟真实的需求对接，才能感受到市场需求带来的动能。</p><p></p><p>于是，团队决定，在产品开发完结后，就开始专攻私有客户，找到真正能「付费的人」。</p><p></p><p>方磊把目光瞄向了金融行业，先从银行切入。因为在当时，金融行业的信息化程度要远远高于其他行业。银行也是当时国内IT预算最高的企业之一。</p><p></p><p>某城商行是DataCanvas数据科学平台的早期客户。“到今天，中国前一百家银行里，超过50家是我们的客户了”，言谈间，方磊展露自信。</p><p></p><p>“以前我们走了很多弯路，来为自己的某些认知买单”。从数据科学工程师到技术创业者，最开始创业时，方磊更多地是感到兴奋，因为有太多的未知的东西等着他去学习和探索。</p><p></p><p>后来迈过一些坎后，他越来越认识到，“AI创业的核心应该是一个‘Business’，而不是一场‘Move’”。</p><p></p><h2>构建数据智能基础软件版图</h2><p></p><p></p><h3>从AI模型搭建到让模型真正用起来</h3><p></p><p></p><p>这种“Business”的意识后来也在公司的产品战略和路线规划上鲜明地体现出来。</p><p></p><p>方磊向InfoQ表示，他规划产品路线的思路是，遵循技术的发展脉络，以及技术在产业中的落地过程。</p><p></p><p>经过9年迭代，DataCanvas自动化数据科学平台不断扩展为一个大而全的家族，包括DataCanvas APS 自动机器学习平台、DataCanvas RT 实时决策中心、DataCanvas DAT 自动机器学习工具包、DingoDB实时交互式分析数据库等，提供企业级AI应用所需的平台软件产品及解决方案。</p><p></p><p>AI模型的建立是企业在进行数据分析时面临的第一个痛点问题，建造AI模型很难，且技术门槛高。因此，降低门槛是首要解决的问题。从早期拖拉拽的形式，到后来开源自动机器学习平台建模，这些产品核心的出发点在于降低门槛。</p><p></p><p>九章云极的DataCanvas APS自动机器学习平台应用了容器、微服务、Devops等云原生技术，内置统计分析、机器学习、深度学习算法等100多种算法模型，通过APS平台，企业可以更灵活便捷地开发和部署AI模型。</p><p></p><p>门槛降低了以后，利用大数据做出的很多模型如何使用？也就是如何解决人工智能的推理问题。在推理运行过程中会发现，以往BI只是展示，不存在运行的概念。而现在有了模型、有了建模平台、推理平台后，推理运行时，就会发现缺少一些东西，比如实时数据能力不足，无法实时地运行模型。</p><p></p><p>因此，为了更好地在业务场景中应用模型，九章云极DataCanvas推出了DataCanvas RT 实时决策中心这款产品，该产品将多种数据流接入实时处理并分析，将ETL、业务模型、机器学习、人工智能、可视化扩展到实时数据分析。</p><p></p><p>整体来说，九章云极DataCanvas的产品矩阵，沿着一条连贯的轴线在走 —— 把数据变成模型，让模型变简单，让模型真正用起来。</p><p></p><h3>开源DAT和DingoDB数据库</h3><p></p><p></p><p>去年10月，九章云极DataCanvas在开源方面推出了两个大动作：宣布将面向自主建模、自动建模的DataCanvas DAT 自动机器学习工具包和面向高并发、能够做实时分析的DingoDB实时交互式分析数据库开源出来。</p><p></p><p>这两款产品主要解决了两个问题：DAT让AutoML变简单，将自动机器学习建模的能力下沉；DingoDB则能让实时数据分析变得越来越快。</p><p></p><p>DAT 的所有项目都是以开源方式来开发的。（开源地址：<a href=\"https://github.com/DataCanvasIO\">https://github.com/DataCanvasIO</a>\"）。DAT（DataCanvas AutoML Toolkit）是一个自动机器学习工具套件包，它包含了首个AutoML开源架构 Hypernets和一系列功能强大的 AutoML 开源工具，从底层的通用自动机器学习框架到用于结构化及非结构化领域端到端的自动建模工具。</p><p></p><p>DAT 包含 DeepTables、Hypernets、HyperGBM、HyperTS、&nbsp;Cooka、HyperBoard&nbsp;、HyperCtl。DAT 性能突破了机器学习建模过程中存在的不均衡、概念漂移、泛化能力、大规模数据4大难点。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/12/0b/12a5801a8d215e8yy29d7829077a1f0b.png\" /></p><p></p><p>DAT自动机器学习工具包</p><p></p><p>DingoDB （开源地址：<a href=\"https://github.com/dingodb/dingo\">https://github.com/dingodb/dingo</a>\"）是新一代集分析与服务于一体的实时分析数据库 HSAP(Hybrid Serving &amp; Analytical Processing)，支持高频修改和查询、实时交互式分析、实时多维分析。通过 DingoDB，数据能实时的接入、实时存储，能够提供一种简洁化的方式，让用户能够快速进行分析，并对分析的结果能够得到及时的应答。</p><p></p><p>方磊对InfoQ表示，之所以选择开源这两个项目的核心技术，目标是进一步降低企业应用AI技术的门槛，希望让开发者和生态伙伴更好地在开源项目的技术基础上迭代自己的产品。“软件是基础设施，相比应用软件，开源是基础软件的‘主战场’，开源有利于让更多人使用，有利于形成事实标准。而当基础设施标准化后，成本就会下降。”</p><p></p><h3>云中云战略</h3><p></p><p></p><p>2021年，伴随着创业进入第8个年头，九章云极DataCanvas进行了一次重大的战略升级，正式发布了“云中云”（An AI Cloud in the Clouds）战略。</p><p></p><p>云中云战略是指，将自主研发的数据智能基础软件及相关AI能力，嵌入到千行百业的行业云、区域云、企业云、联盟云等千朵云中，形成千云之中的AI云。</p><p></p><p>从为企业打造数据智能基础架构到打造千朵云生态里的数据智能基础架构，这一转变背后，体现了怎样的思考？</p><p></p><p>“在云化的大背景下，如果今天还去卖软件可能就落伍了，因为现在大量硬件的算力由云提供商提供，是与他们竞争还是合作？如果合作，你的云是什么位置？如果在每个云里，你在PaaS层，那就是‘云中云’。还有一个问题是，进入到什么样的云中去？是公有云，私有云，还是混合云，又或者是行业云，地域云，企业云 ... ？这些都是不同的云，在这里面找到什么样的位置，你就具有什么样的价值。”</p><p></p><p>方磊试图用「终局」的思想给出一个答案。</p><p></p><p>在中国的云计算市场，云碎片化特征突出，千行百业都有自己的云。或许5年后，中国</p><p></p><p>会有一千多云。在这一千多云中，会有很多供应商入驻。假设九章云极DataCanvas入驻了千朵云中的30%， 那么就成为“云中云”。而且，在这三百朵云里，入驻的产品间可以互联互通，大家共享一个模型市场或数据市场，这里面就有很多潜在的商机。成为云中云之后，九章云极DataCanvas的数据智能基础架构和AI能力就可以实现事半功倍地随云输出，满足不同云生态的需求。</p><p></p><p>“为了做到云中云，首先我们要进入一千朵云中的若干朵云里去，其次我们还要把进入的这些云连接起来，这样才有网络效应”。方磊表示，九章云极DataCanvas目前在进入云和深入云的阶段，正在和多家银行、运营商、云厂商等合作，推进云化工作。</p><p></p><h3>数字化转型下半场将是数据智能的升级</h3><p></p><p></p><p>在应用落地方面，九章云极DataCanvas自动化数据科学平台目前重点布局金融行业，服务银行、保险、基金、证券、资管等金融机构，公司约有50%以上的营收来自金融行业。</p><p></p><p>此外，公司业务还逐渐扩展到了通信、交通、制造业、航空、零售等十几个行业和政府机构，帮助这些行业应用机器学习平台解决实际业务问题。</p><p></p><p>这些行业也是当下火热的数字化转型浪潮的“排头兵”。方磊认为，现阶段，国内企业的数字化转型已经进入下半场，尤其是在金融等先进行业。</p><p></p><p>数字化转型上半场的核心标志是信息化（包括线上化）。信息化解决的是，将数据进行数字化处理录入电脑的过程，线上化解决的是业务通过线上、线下更无缝衔接的问题。但本质上，信息化解决的都是流程自动化的问题，它并不智能。</p><p></p><p>方磊认为，数字化转型的下半场将是智能化，是决策自动化。到了下半场，企业做数字化转型，将不仅仅依赖信息管理部门，而将更多依赖人工智能技术以及数据科学技术来建立自己的护城河。而决策智能实现的“底座”就是数据智能基础架构。</p><p></p><h2>AI落地会通过软件基础设施升级来实现</h2><p></p><p></p><h3>发力「数据智能基础软件」</h3><p></p><p></p><p>方磊表示，以前开发一个流程软件，需要数据库、中间件、消息队列等技术，开发AI应用则需要算法平台作支撑。开发一个AI应用，模型如果是在线运行，就需要进行实时数据处理方能运行。此外，还需要对数据进行整理和标注，AI应用的数据标注要做好AI的模型的安全等工作。方磊认为，随着数据的存储、处理、实时性等需求的不断攀升，整个数据基础设施与系统架构已经来到了迭代升级的机会窗口。</p><p></p><p>因此，九章云极DataCanvas一直侧重在AI基础软件的细分赛道 —— 数据智能基础软件上做布局，并将公司定位为数据智能基础软件供应商。目前九章云极DataCanvas主要在算法平台和实时数据上发力。</p><p></p><h3>软件将成为新的基础设施</h3><p></p><p>从自动化数据科学平台供应商到数据智能基础软件供应商，九章云极DataCanvas希望定义标准化数据智能基础架构的未来。</p><p></p><p>数据科学（平台）采用机器学习算法，在数据上构建模型来解决不同的业务问题。以前，企业使用数据的方式很简单，如统计、展示等。如果要用算法做自动化处理，把模型在企业每个业务里用起来，各行业都将会从以前的流程自动化的阶段转向决策驱动的自动化的阶段。</p><p></p><p>在这个过程中，产生了一些新的基础软件的需求。原来流程的基础软件，很多是传统的数据库、数据仓库，而新的基础软件可能是算法平台，是AI落地中需要用到的数据库等。九章云极DataCanvas提供的就是这些基础软件，用以支撑各行业开发自动化的AI应用。</p><p></p><p>“我们这个时代所经历的基础设施升级将不仅仅是高铁等传统的基建，和包括数据中心建设、算力建设在内的新基建，软件也将会成为一种新的基础设施。在这个过程中，会有一些基础性的软件成为标准品牌。我们本质上是在这个领域里面去竞争”，方磊预测, “未来，软件基础设施会经历一场重大升级，而一千朵行业云里面的软件基础设施升级会是数据智能领域的下一个历史性机遇”。</p><p></p><h3>基础架构的升级将驱动AI落地</h3><p></p><p></p><p>AI如何实现落地，是业内普遍关注的问题。很多AI头部公司在AI算法技术上已经取得了领先优势，但普遍在技术落地、商业化变现上面临较大的挑战。</p><p></p><p>落地难，盈利难、上市难，这几年AI公司所遭遇的一系列困境，不禁让人们反思，算法到底是不是AI创业公司的“护城河”？AI的商业化落地之路到底能不能走通？</p><p></p><p>2016年，阿尔法狗打败了人类最顶尖的围棋棋手，一时间令科技圈对人工智能所展现出的巨大力量感到“震动”，自此也掀起了第三次AI浪潮。与此同时，在新一波人工智能浪潮翻滚之下，AI创业如火如荼。</p><p></p><p>AI有不同的商业模式，简单来说，包括卖算法，卖软件，卖硬件，或者走系统集成路线等。</p><p></p><p>在早期，很多AI创业公司选择卖算法，很少有人走软件这条路。</p><p></p><p>方磊认为，这是因为，当时AI给了大家很多想象，AI算法是“性感”的，可以解决很多具体的问题，比如减少坏账，检验残次品，AI也可以参与到很多大型的集成项目中，例如安防。很多AI公司采取帮助企业解决具体问题来收费的商业模式。而如果定位成一件软件公司，很容易将格局讲小了。</p><p></p><p>而“卖软件”与“卖算法”这两种商业模式存在显著的差异。</p><p></p><p>方磊表示，卖软件的核心逻辑是希望人人都可以把它用起来，或者每个公司都有能力自己把它用起来，比如通过卖软件，让企业具备搭建AI模型的能力，帮助企业业务开发系统，而非解决最终的具体问题。</p><p></p><p>而卖算法的逻辑是，通过算法的优势来赚钱。但这一模式存在的问题是，如果未来出现了更先进的算法，且这一更先进的算法可以很快通过论文、开源等方式传遍世界。从这个角度看，算法可能存在阶段性的壁垒，但不存在持续性的壁垒。</p><p></p><p>方磊认为，相比算法，软件的壁垒更高。因为软件的积累所形成的护城河有时间效应，短时间内很难被复制和超越。例如，微软的Excel，这一有着40年积累的软件，很难有人凭空再写出一个来。也正因此，核心软件容易存在被“卡脖子”的风险，而算法则没有被卡脖子这一说。</p><p></p><p>相较之下，九章云极DataCanvas一开始就选择走了一种通过软件赋能的路线。</p><p></p><p>“这种商业模式在刚开始时，会走的比较慢。但一开始AI可能想象太高远了，很多公司并没有走这条路。事实上，我认为这样的一条路可能是AI商业化方面，至少是非常理性的一条路，也是最能落地、必然可以走通的一条路，”方磊表示，“因为，卖软件本身的商业模式是通的。软件是一个非常成熟的商业模式，历史上，通过卖基础软件，例如卖数据库和操作系统，每次软件技术革命都实现了落地。”</p><p></p><p>而，基础软件，则将会成为AI落地中一条主流的道路。方磊解释道，因为AI的需求必须通过新的应用来实现，一定需要下面有可运行的基础软件。通过数据智能基础架构，企业可以自主地开发AI应用。而且，随着数据智能基础架构的不断完善和升级，AI应用会更容易落地，落地效率也会更高。</p><p></p><p>采访嘉宾介绍：</p><p></p><p>方磊，博士，九章云极DataCanvas公司董事长，中国人工智能学会委员，中关村高聚工程人才。原微软必应（Bing）搜索部门数据科学家，并作为早期团队成员参与开发微软云计算平台：Windows Azure。拥有近二十年大数据分析管理经验，是人工智能、大数据等前沿技术掌舵者。在算法、分布式系统、设计验证等领域发表论文19余篇，引用超过700次。受邀作为核心参编专家参与多项金融科技蓝皮书、人工智能相关标准制定工作，并在人工智能、大数据、AI基础设施等领域中多次受聘为智库专家、理事、常务理事等职务。</p>",
    "publish_time": "2022-06-27 13:44:10",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "数字化不是试出来，而是蹚出来的｜行知数字中国 × 富士康史喆",
    "url": "https://www.infoq.cn/article/RLvHd5iAzWlK97JkiWha",
    "summary": "<p>数字经济时代，数字技术正快速向实体经济渗入，数字化转型成了各家企业的必修课。本着“推动数字人才全面发展”的使命，探求中国数字化发展的切片，极客邦科技InfoQ现重磅推出《行知数字中国》视频栏目，通过访谈、探访等形式记录和传递极客邦眼中的数字中国，希望能为业界带来启发。</p>\n<p>《行知数字中国》第一期，InfoQ邀请到了富士康科技集团首席数字官史喆博士，来分享制造业实施数字化转型的路径和方式。史博士还从制造业延伸开去，总结了一些传统企业做数字化转型的方法论。</p>\n<p>本期完整版将于7月4日上线，敬请关注。</p>",
    "publish_time": "2022-06-27 13:39:19",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]