[
  {
    "title": "不要把自己“困死”：论大型企业的项目协调管理",
    "url": "https://www.infoq.cn/article/FzVSOWKXSWNP7aMtXEjv",
    "summary": "<p>当组织的“改进”想法可以通过给已经在做的工作重贴标签而迅速采纳时，你可以很容易地看出，那不会取得多大的成果。这不是真正的变革，这只是重新包装。&nbsp;</p><p>&nbsp;</p><p>表面上看，<a href=\"https://www.tasktop.com/value-stream-management/\">价值流管理</a>\"的概念听起来很好：谁不想生成一个价值流？ 但通常情况下，最终，价值流管理与企业长期以来所做的事情没有太大区别：在大型企业中使用项目管理实践协调不同团队的工作。</p><p></p><h2>价值流只是传统组织的一件外衣</h2><p></p><p>传统组织是由“孤岛”或专注于单个相关技能集的部门组成，包括：应用开发、数据中心运营、质量保证、市场营销、业务管理、风险管理等等。</p><p>&nbsp;</p><p>在这些组织中，“企业”有了开发新产品或改进现有产品的想法，就像流水线上的工人一样，在开发的不同阶段，来自不同部门的人围绕这个想法开展工作，直到在这条“流水线”的尽头下线可供客户使用的东西。&nbsp;</p><p>&nbsp;</p><p>这种“流水线”模式的问题是，团队之间会为交接所累，对于所生产的产品的价值，团队得到的反馈极少，而他们却要据此来做决策（参见图1）。</p><p>&nbsp;</p><p>他们会以为“企业”知道客户想要什么，所以把重心放在尽量减少生产“价值”时所花费的时间和精力上。但是，由于缺少反馈，组织忽略了<a href=\"https://www.infoq.com/articles/empiricism-business-agility/\">最大的浪费源：向客户提供不符合客户需求的东西。</a>\"</p><p>&nbsp;</p><p>因此，即使是一个经过优化的“价值流”，也往往只是以更快的速度产生浪费。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/0d/0da0af495187693d18fd1da474c6c65e.jpeg\" /></p><p></p><p>图1：“流水线”模型 vs. 获得授权的自治敏捷团队</p><p>&nbsp;</p><p>尽管这样叫，但价值流并不关注价值，而是把工作当成“生产线“来管理。每交付完一个“想法”，就开始关注下一个想法。几乎没有什么“学习”过程，因为想法是从“专家”那里自上而下地流向实施和交付这些想法的团队，后者往往很少甚至不对所交付的价值进行衡量，也很少甚至得不到反馈。当以这种方式实施时，价值流就不是敏捷的，因为他们从未收集和检查过反馈，也从未根据反馈调整其方法。</p><p>&nbsp;</p><p>这个缺陷似乎很容易弥补：只需增加反馈。在每次发布时，衡量下客户的体验是改善了，还是没变化，还是变差了，然后将结果反馈到构思新改进的过程中。这样一来，价值流就真得成了一个循环，关于价值的实验在其中得到了检验。增加反馈循环是有帮助的，但前提是那些循环非常快；如果很慢，需要数月甚至更长时间才能获得针对最初想法的反馈，那么在改善所提供的价值方面，它们就没有多大效果了。</p><p>&nbsp;</p><p>当价值流只是现有筒仓式组织的一件外衣时，从有想法到可以测试所经过的时间太长了，无法为快速测试想法带来真正有用的帮助。如果运行这些价值实验只需几天或一两个星期，那么组织就可以相对快速地决定什么东西有价值，但如果需要数月甚至更长的时间，那么组织就会浪费大量的时间和精力来构建客户既不想要也不需要的东西。</p><p></p><h2>制造思维如何削弱了敏捷性</h2><p></p><p>价值流概念与背后的敏捷和精益生产思维之间的矛盾，表现为多种不同的方式。制造的目标是按照标准规格生产出完全相同的标准产品副本，没有浪费或变化。它会将任何对可预测性的扰动视为需要消除的不良缺陷。精益生产是一种旨在最大限度地减少生产浪费的方法。</p><p>&nbsp;</p><p>敏捷方法的目标是确定需要解决的问题，并针对这些问题制定解决方案。在解决这些问题的过程中，很重要的一点是消除浪费和障碍，因为那可以帮助团队集中精力，用一个精心构建的解决方案来解决正确的问题，但是有些东西，从生产的角度来看会被称为浪费，比如错误问题的解决方案，在团队构建、交付给客户并度量结果之前，是根本无法预见到的。从另一个角度来看，优化产品的构建方式并不能防止生产出对客户没有任何用处的产品。</p><p>&nbsp;</p><p>制造思维完全符合传统组织的理念，即“专家”最擅长的是设计产品，他们以市场研究为基础，以自己的专业知识为依托。制造过程的目标是要完美地实现交给他们的产品定义。他们可能会调整规格，简化产品制造过程，但他们并不关心正在制造的产品是否正确。同样，这完全符合传统组织自上而下的控制理念。</p><p>&nbsp;</p><p>敏捷方法所要构建的产品一般都是一次性的。其目标不是构建一个标准产品的副本，因为在构建的时候还没有完全理解客户的实际需求。其目标是要发现什么才是正确的产品。对于有些产品，一旦组织了解了客户的需求，就可能需要制造更多这样的产品，这时，敏捷实践就不那么有用了，制造流程则会更适用。</p><p>&nbsp;</p><p>当客户的需求正在出现或快速变化时，自上而下的过程无法对反馈做出足够快的响应。更适合这种情况的流程是科学方法的一个变体——形成假设，实验检验，检查结果，并根据结果来调整方法。</p><p></p><h2>价值流会削弱团队的权力</h2><p></p><p>此外，价值流方法可能会削弱团队的权力，而这可能会导致团队成员的冷漠。<a href=\"https://www.youtube.com/watch?v=Ulx5d6nhqz8\">研究表明</a>\"，当团队有一个要实现的目标，可以自由决定向客户提供什么以达成这个目标，并自由决定如何工作以向客户提供解决方案时，他们的表现最好。在这种情况下，团队成员的自主性和目的性都很强，积极性也会很高。</p><p>&nbsp;</p><p>当许多团队必须协同工作时，就像他们在价值流中所做的那样，不能简单地给他们制定一个宽泛的总体目标，然后由他们自己决定要交付什么以及如何交付。管理价值流的人定义解决方案并将工作分配给团队，尽管他们可以给团队留一些决定工作方式的空间，但前提是赋予团队的这种自由不会造成团队之间的冲突。 在现实中，处于价值流中的团队只是在执行工作任务，这导致他们的内在动机水平低于他们可以自由定义解决方案的情况。为了做好工作，他们可能仍然会表现出高水平的专业精神，但他们缺乏拥有解决方案时的目的感。</p><p></p><h2>为什么组织会把自己困住？</h2><p></p><p>对于上述情况，他们中的许多人都比我们更了解，但他们觉得自己无法做得更好。他们的“产品”很庞大，不可能由一个小型跨职能团队开发和交付，甚至不可能像<a href=\"https://www.scrum.org/resources/scaling-scrum\">Nexus</a>\"那样少数几个跨职能团队协同工作。即使产品可以由一个小型跨职能团队开发，组织孤岛和技术专业化也会给组建跨职能团队造成障碍，因为没有一个具备合适技能的小团体可以开发产品。</p><p>&nbsp;</p><p>当这种情况发生时，组织会尝试创建更大的团队，团队成员在团队之间共享。在协调由兼职成员组成的团队时，他们通常会使用价值流的概念，协调人们跨多个项目开展工作。组织被卡住了，因为他们的产品太大了，他们的组织太分散了，他们无法以其他任何方式工作。 虽然称之为价值流，但它并不能改变一个基本的事实，即他们必须简化产品和组织才能获得更好的结果。</p><p></p><h2>价值流、产品和软件架构</h2><p></p><p>通常，价值流并不能解决的一个根本问题是，组织的“产品”庞大而零散，这就需要一个庞大而且零散的组织来开发和交付。这些“产品”实际上是不同功能的大集合，对它们感兴趣的潜在客户群也可能非常庞大，而且需求也很零散。这些功能的范围往往涵盖了整个业务线，确实非常广泛。</p><p>&nbsp;</p><p>这些“产品”的架构往往也庞大而零散，由许多不同的系统拼凑而成，这些系统开发了许多年，有时是几十年，用途也各不相同。它们的开发和维护由不同的团队负责，导致了一个筒仓式的组织结构。因此，根据定义，这些拼凑起来的“产品”的架构也是筒仓式的。</p><p>&nbsp;</p><p>通常，为了将所有这些不同的系统和团队联系在一起，组织会成立程序架构团队，负责整个价值流团队的整体软件架构。程序架构团队需要协调价值流团队创建的各种软件架构，以消除冗余并推广通用架构元素。</p><p>&nbsp;</p><p>当程序架构团队决定使用会产生浪费的 “预先”架构方法（由基于猜测而非事实的质量属性要求驱动的）时，他们将所有这些不同的架构组件联系在一起的努力往往会失败。结果，他们拖延了价值流团队的工作，提供了可能不符合这些团队要求的架构，而且很可能不得不反复重构。</p><p>&nbsp;</p><p>或者，程序架构团队可能会决定，在比较好地了解了每个价值流的QAR后再创建程序架构，这会导致波及每个价值流的延迟，并且随着了解的QAR越来越多，可能还需要重构。无论哪种方式，程序架构团队的方法都会放大跨团队的依赖性，从而扼杀了自主性，造成延迟和工作浪费。&nbsp;</p><p></p><h2>要想获得更好的结果，就要采取不同的方法</h2><p></p><p>价值流管理方法的基本问题是，需要很长的时间才能获得有价值的反馈，因此，大多数的产品决策都是基于直觉，而直觉很可能是错误的，也无法通过更严格的价值流管理来解决。虽然反馈循环的速度可以通过专注于消除过程浪费来逐步改善，但通常，那并不足以实现一个组织需要的巨大改进。</p><p>&nbsp;</p><p>为了解决问题，高管们经常寻找会引发急剧变化的短期解决方案，而管理咨询公司则非常乐意向他们推销这类快速解决方案。遗憾的是，他们所期望的结果几乎从来都没能实现。价值流无法解决的问题，其解决方案往往会引发急剧变化，甚至是革命性的，而时间跨度以年为单位。组织要收拾的烂摊子并不是一夜之间出现的，也就不是一朝一夕能解决的。</p><p>&nbsp;</p><p>如果组织想让他们的业务变得更加敏捷、响应更加迅速，那需要一个过程。这个过程涉及到很多工作，需要准备很长的时间。简而言之，包括：</p><p>他们需要简化产品。如上所述，相对来说，许多组织的“产品”都很零散，没有重点，为许多不同的人做了大量的事，但通常无法满足任何特定群体的需求。通常，这涉及到一组应用程序，它们以某种方式支持某条业务线，但它们是零散的，而且不完整。在这种情况下，组织无法做到让<a href=\"http://www.laputan.org/mud/\">这些大泥球快</a>\"速响应不断变化的客户需求。</p><p>&nbsp;</p><p>为此，组织需要围绕尚未满足的特定客户（当前或潜在客户）的具体需求来<a href=\"https://www.pragmaticinstitute.com/resources/articles/product/untangling-products-focus-on-desired-outcomes-to-decrease-product-complexity/\">创新产品</a>\"。组织不需要一下子就做到这一点，它应该将现有“产品”分解成更小、更聚焦的产品；这个过程非常有破坏性，会导致一团混乱，让所有努力都付诸东流。因此，组织要专注于特定的机会，把握契机，走上一条更好的路，而不需要试图一下子清理好整个大泥球。</p><p>&nbsp;</p><p>围绕这些新产品，他们需要组建和发展充分授权的跨职能自管理团队。这样可以减少团队之间的交接，<a href=\"https://www.scrum.org/resources/blog/if-you-want-go-faster-try-empowering-your-teams\">缩短决策延迟</a>\"，这是妨碍价值流方法产生组织所期望的结果的两个主要因素。</p><p>&nbsp;</p><p>对于这些充分授权的团队需要但不具备的技能，可以由专家提供支持，他们可以暂时加入团队，传授知识，或指导团队成员学习新技能。在这个过程中，要确保专家在团队需要的时候可以抽出时间，而不是像平常那样，让团队等待稀缺、昂贵的专家资源来提供帮助。这可能意味着要在短期内雇用更多的专家来支持团队，至少在团队自己能够应对之前。</p><p>&nbsp;</p><p>他们需要逐步将遗留的单体应用分解成比较小的产品和支持平台。这涉及到一些技术和方法，帮助团队<a href=\"https://www.infoq.com/articles/mvp-mva-legacy/?itm_source=infoq&amp;itm_campaign=user_page&amp;itm_medium=link\">分解遗留应用</a>\"，从“大泥球”中慢慢创建出可重用的服务，并针对这个过程中使用的模式和框架逐步<a href=\"https://www.scrum.org/resources/whitepaper-you-cant-scale-enterprise-agility-without-architecture\">创建出可重用代码的平台</a>\"。 随着这些平台的发展，组织需要奖励对共享平台做出贡献的团队，避免团队出现只关注自己当前需求的自然倾向。这意味着要创造一种技术卓越、成功共享、崇尚专业精神的文化，超越团队并渗透到组织中。</p><p>&nbsp;</p><p>他们需要衡量团队交付给客户的结果，并帮助他们提高交付价值的能力。这意味着团队必须经常向客户交付，度量结果，并<a href=\"https://www.scrum.org/resources/using-measurement-improve-scrum-team-performance\">通过检查结果和进行相应调整来改进</a>\"。</p><p>&nbsp;</p><p>他们需要将重复、单调、容易出错的手工任务自动化，让团队专注于交付价值，经常向客户提供有潜在价值的产品增量，持续不断地构建、测试和部署软件。如果团队不得不把精力花费在手工处理这些任务上，那么他们将无法足够快速地收集反馈信息，及时做出决策。此外，执行繁琐任务的人很容易犯错，造成浪费，而纠正错误时又会延误工作。将这些重复性的任务自动化有助于提高人们的工作效率，减少错误。总的来说，人们广泛将这类任务作为<a href=\"https://aws.amazon.com/devops/what-is-devops/\">DevOps实践</a>\"来讨论，没有它们，团队就无法运行有效的反馈循环。</p><p>&nbsp;</p><p>当一个组织始终如一地以这种方式对待新出现的机会，并专注提高收集和响应客户反馈的速度时，它就会逐个产品、逐个团队地打造其敏捷性。这种稳定、一致的方法不是很快捷，但它可以不断地取得增量进展，随着时间的推移，带来明显的改善。</p><p></p><h2>小结</h2><p></p><p>做同样的事情却期待不同的结果，那是一种精神错乱，然而，组织却在不断地避免真正的变革，因为他们觉得这会耗费太长的时间，而且会有很大的破坏性。真正的变革是有破坏性的，与组织的文化背道而驰，而且可能持续很长的时间，但只进行表面的变革只会使组织面临更大的挑战，而这样的变革只会招致嘲讽。</p><p>&nbsp;</p><p>通常，组织缺乏一个足够快的反馈循环来指导他们开展工作，使他们能够尝试新的想法并进行实验。此外，他们试图不惜一切代价避免失败，这使得他们不能进行有风险的实验。因为不能进行小而快的实验，所以他们会对那些最终未能达标的想法做过度投资，这使他们更不愿意进行实验了。&nbsp;</p><p>&nbsp;</p><p>对于需要数百或数千人开发的大型产品来说，是没有办法做到敏捷的，因为<a href=\"https://www.infoq.com/articles/dual-operating-impedes-agility/\">这样的大型组织无法运行快速的反馈循环</a>\"。解决办法不是创造一种伪敏捷，使传统组织变得稍微敏捷些；解决办法应该是打破传统的组织结构，大幅提高组织的敏捷性。</p><p>&nbsp;</p><p>这个旅程的第一步是将复杂的产品分解成更简单的产品，与客户结果和细分市场相一致，并通过一个内部开发的公共平台相互连接。充分授权的跨职能自主团队将围绕这些产品开展工作，自行提供各种技术支持，这有助于消除团队之间的依赖关系，减少浪费。</p><p>&nbsp;</p><p>原文链接：</p><p><a href=\"https://www.infoq.com/articles/value-streams-stuck-past/\">https://www.infoq.com/articles/value-streams-stuck-past/</a>\"</p><p></p><p>相关阅读：</p><p><a href=\"https://www.infoq.cn/article/V5R45xKtTVizcIeg6fFS\">2023，可观测性需求将迎来“爆发之年”？ | 解读可观测技术的 2022</a>\"</p><p><a href=\"https://www.infoq.cn/article/VDwdDmSiTZglv6cthqCp\">如何用数据来提升系统质量</a>\"</p><p><a href=\"https://www.infoq.cn/article/oiYyLTdpp4Yx1iFhs4A8\">覆盖数万研发人员，字节跳动首次公开效能度量核心技术！</a>\"</p>",
    "publish_time": "2023-01-04 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "高性能且小巧的脚本语言 LuaJIT",
    "url": "https://www.infoq.cn/article/db7fc516aa9b4d4875a812a99",
    "summary": "<p></p><h2>What's JIT?</h2><p></p><p>Just-In-Time or JIT 是指在程序运行时进行代码编译的技术，像 Java，Python（这里指PyPy）、LuaJIT 都引入了这种技术。</p><p></p><p>一般 JIT 编译器与解释器一同工作，大部分时间代码由解释器进行转换成机器码进行运行，当某些代码运行的次数超过设定的阈值时，就会触发 JIT 编译进行工作，JIT 编译器会把这些热点代码编译为机器码，当下次运行到这些代码时，就不用解析器进行解释转换了，可以直接运行机器码来提高程序的运行速度。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/65/65701ad7b11c68919fa7a3a92f38f0c4.png\" /></p><p></p><h2>How does work of LuaJIT?</h2><p></p><p>顾名思义，LuaJIT 是一种即时(JIT) 编译器。这意味着函数是按需编译的，即当它们首先运行时。这既确保了应用程序的快速启动，也有助于避免无用的工作。例如，未使用的函数根本不会被编译。</p><p></p><p>另一种编译方法称为提前(AOT) 编译。这里所有的东西都是在运行任何函数之前编译的。这是许多语言的经典方式，例如 C、C++、Go、Rust 等等。</p><p></p><p>当启动 LuaJIT 时，一切都像在标准 Lua 中一样进行：初始化 Lua 核心，加载标准库并分析命令行。然后通常会加载第一个 Lua 源代码文件并将其转换为 Lua 字节码。最后运行初始主块的函数......</p><p></p><p>example.lua:</p><p></p><p><code lang=\"lua\">local s = \"hello,world!\"\n\nfor i=1,10000 do\n    for j=1,10000 do\n        string.find(s, \"ll\", 1, true)\n    end\nend\n</code></p><p></p><p>上面代码中，它会被先转换成 LuaJIT 自己定义的字节码，我们可以用下面的命令来查看：</p><p></p><p><code lang=\"bash\">$ luajit -bl example.lua\n</code></p><p></p><p><code lang=\"bash\">-- BYTECODE -- example.lua:0-8\n0001    KSTR     0   0      ; \"hello,world!\"\n0002    KSHORT   1   1\n0003    KSHORT   2 10000\n0004    KSHORT   3   1\n0005    FORI     1 =&gt; 0019\n0006 =&gt; KSHORT   5   1\n0007    KSHORT   6 10000\n0008    KSHORT   7   1\n0009    FORI     5 =&gt; 0018\n0010 =&gt; GGET     9   1      ; \"string\"\n0011    TGETS    9   9   2  ; \"find\"\n0012    MOV     10   0\n0013    KSTR    11   3      ; \"ll\"\n0014    KSHORT  12   1\n0015    KPRI    13   2\n0016    CALL     9   1   5\n0017    FORL     5 =&gt; 0010\n0018 =&gt; FORL     1 =&gt; 0006\n0019 =&gt; RET0     0   1\n</code></p><p></p><p>然后这些字节码再交给解释器去执行，当执行达到阈值设定时，就会触发 JIT 编译器的工作，LuaJIT 会先将它转换成 IR 中间码，然后转换成对应平台的机器码</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/d7/d71b8320b66c6e9217d017b0075f9cd6.png\" /></p><p></p><p></p><h2>Not Yet Implemented</h2><p></p><p>在 LuaJIT 中，当 JIT 编译器编译成功后就会生成一个 trace 类型的 GC 对象，但是并不是所有的代码 LuaJIT 都能够成功编译。</p><p></p><p>当 LuaJIT 遇到不支持的函数或代码（一般叫它：NYI）时，就会中止当前的编译工作，重新回退到解释器执行的模式去。</p><p></p><p>例如上面的 string.find() 函数，只有 LuaJIT 2.1 以上的版本才支持，我们可以执行添加 -jv 选项来显示有关 JIT 编译器进度的详细信息。</p><p></p><p><code lang=\"bash\">$ luajit -v\nLuaJIT 2.0.5 -- Copyright (C) 2005-2017 Mike Pall. http://luajit.org/\n\n$ luajit -jv example.lua\n[TRACE --- example.lua:4 -- NYI: FastFunc string.find at example.lua:5]\n</code></p><p></p><p>当 LuaJIT 版本为 2.0.5 时，就会提示你 NYI: FastFunc string.find at example.lua:5，意思就是说LuaJIT 编译器不支持编译 example.lua 文件的第 5 行代码，第 5 行代码就是 string.find(s, \"ll\", 1, true)</p><p></p><p>当我们切换到 luajit-2.1.0-beta3 后，再执行看看：</p><p></p><p><code lang=\"bash\">$ luajit-2.1.0-beta3 -jv example.lua\n[TRACE   1 example.lua:4 loop]\n[TRACE   2 (1/3) example.lua:3 -&gt; 1]\n</code></p><p></p><p>TRACE 后面接着是数字，说明 JIT 编译成功了</p><p></p><h2>How does maintain speed of LuaJIT?</h2><p></p><p>要保证 LuaJIT 的运行速度时，就要避免使用 NYI 函数，如果调用 C 函数的话，尽量使用 LuaJIT 的 ffi 库来调用 C 函数。</p><p></p><p>尽量保持使用最新的 LuaJIT 版本，LuaJIT 的 2.1 版本加入了很多原先不支持的 NYI 函数，例如 string.find() 等，所以尽量使用最新版本来提升可被 JIT 编译的函数的数量。</p><p></p><p>如果需要使用 NYI 函数时，可以去看看网上或 OpenResty 中有没有对应替代函数。</p><p></p><h2>Speed Test between JIT and None-JIT</h2><p></p><p>那么，有 JIT 和没有 JIT 之间的速度差异到底有大呢？</p><p></p><p>由于 LuaJIT 2.0.5 的 JIT 不支持 string.find()，不会触发 JIT 的编译工作，所以我们可以用上面的代码，然后用 LuaJIT 2.0.5 和 LuaJIT 2.1.0-beta3 分别来执行测试下有 JIT 和 没有 JIT 之间代码执行的速度：</p><p></p><p>example.lua:</p><p></p><p><code lang=\"lua\">local s = \"hello,world!\"\n\nfor i=1,10000 do\n    for j=1,10000 do\n        string.find(s, \"ll\", 1, true)\n    end\nend\n</code></p><p></p><p>LuaJIT 2.0.5 的执行速度：</p><p></p><p><code lang=\"bash\"># 第一次测试\n$ time luajit-2.0.5 example.lua\nluajit-2.0.5 example.lua  2.14s user 0.00s system 99% cpu 2.140 total\n\n# 第二次测试\n$ time luajit-2.0.5 example.lua\nluajit-2.0.5 example.lua  2.17s user 0.00s system 99% cpu 2.169 total\n\n# 第三次测试\n$ time luajit-2.0.5 example.lua\nluajit-2.0.5 example.lua  2.17s user 0.00s system 99% cpu 2.176 total\n</code></p><p></p><p>LuaJIT 2.1.0-beta3 的执行速度：</p><p></p><p><code lang=\"bash\"># 第一次测试\n$ time luajit-2.1.0-beta3 example.lua\nluajit-2.1.0-beta3 example.lua  0.03s user 0.00s system 99% cpu 0.026 total\n\n# 第二次测试\n$ time luajit-2.1.0-beta3 example.lua\nluajit-2.1.0-beta3 example.lua  0.02s user 0.00s system 99% cpu 0.024 total\n\n# 第三次测试\n$ time luajit-2.1.0-beta3 example.lua\nluajit-2.1.0-beta3 example.lua  0.03s user 0.00s system 99% cpu 0.026 total\n</code></p><p></p><p>可以看到，两个的速度相差了差不多 100 倍，</p>",
    "publish_time": "2023-01-04 10:11:15",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "营销投入都去哪儿了？虎彩集团用区块链搞定追溯和信任问题",
    "url": "https://www.infoq.cn/article/bDJVbHPBaSHgbc5WpxBe",
    "summary": "<p>“我知道我的广告费至少浪费了一半，但我不知道是哪一半”，这是著名广告大师约翰·沃纳梅克提出的“哥德巴赫猜想”。即便是到了互联网时代的流量营销场景下，这个“魔咒”不仅没能破除，反而愈演愈烈。流量投入如流水，数据表现也不差，但实际转化就是屈指可数——很多企业的互联网营销都陷入了这样的怪圈。</p><p></p><p>成立于 1989 年的<a href=\"http://www.hucais.com/\">虎彩集团</a>\"，拥有亚太地区最大的按需出版印刷工厂，主要业务涉及印刷包装、按需出版、鲜檬摄影和泰山原浆啤酒。相较于传统印刷业务，鲜檬摄影和泰山原浆啤酒是数字化营销的主阵地。最初，虎彩集团投入使用区块链技术，目的就是解决“哥德巴赫猜想”的问题，利用<a href=\"https://xie.infoq.cn/article/9b83d5f763704c59d785fb7dc\">区块链</a>\"的公正、透明、可信机制，更好地连接消费者，让广告投入效果变得可追踪。</p><p></p><p>“借助区块链技术，我们清楚每一分钱都投到了哪些渠道、有没有带来效果、具体带来了什么效果、哪个渠道的投入产出比更高等等。目前，从前端的消费者连接，到获客拉新下单支付，我们都有统一的平台，整个交易在线上就可以完成；同时，在后台我们也建设了业务中台和数据中台，通过业务中台可以沉淀和支持前端的创新，基于数据中台还可以对会员打标签、做精准营销、精准投放。”在 InfoQ《超级连麦. 数智大脑》直播中，虎彩集团创新应用中心总经理<a href=\"https://archsummit.infoq.cn/2021/shenzhen/presentation/3772\">袁运亮</a>\"表示。</p><p></p><p>随着场景营销模式的推进，虎彩集团慢慢发现很多合作场景不只是面向个人，还要面向企业，而企业之间的合作通常会存在信任的问题，比如，企业 A 帮企业 B 做了引流和获客，那么这个数据究竟准不准？应该以谁的数据为标准？为了解决这一问题，虎彩集团又推出了场景营销，面对商城、蜂巢、社区等不同的场景，支持对应的合作模式。</p><p></p><p>在此基础上，虎彩集团进一步开发了异业联盟链——在里面，不同企业服务于类似的客户群体，但彼此之间又没有竞争关系，而是互补关系，基于这一前提，可以实现企业间的会员共享、流量引导以及精准的联合营销。</p><p></p><p>据了解，袁运亮所在的创新应用中心是虎彩集团数字化转型的主力军，除了<a href=\"https://www.infoq.cn/article/X9IT0Oj6awQNRQUFNsyg\">数字化营销</a>\"，自 2018 年来，虎彩集团还围绕<a href=\"https://www.infoq.cn/theme/161\">数字化供应链</a>\"、数字化经营管理基本实现了各个业务模块的在线化和数字化。</p><p></p><p></p><blockquote>本期 InfoQ《超级连麦. 数智大脑》，由虎彩集团创新应用中心总经理袁运亮，对话极客邦科技创始人兼 CEO 霍太稳（Kevin），和 InfoQ 极客传媒数字化主编高玉娴，探讨企业如何借助区块链技术，消除数字化营销障碍。内容有删减，感兴趣的同学可进入“霍太稳视频号”或“InfoQ 视频号”观看直播回放。</blockquote><p></p><p></p><p></p><h2>从见效更快的营销场景切入，增加数字化投入信心</h2><p></p><p></p><h5>InfoQ：虎彩集团是一家什么样的公司？</h5><p></p><p></p><p>袁运亮：虎彩集团成立于 1989 年，此前主要经营包装印刷，包括烟包、酒包、电子、日化等包装设计、印刷制作等业务，被誉为中国印刷行业的黄埔军校，一直引领中国印刷产业，为印刷行业培养了大量的人才。</p><p></p><p>除了印刷包装之外，虎彩集团还有其他三块业务，包括：按需出版、鲜檬摄影和泰山原浆啤酒。出版事业部主要的业务是图书的按需印刷和出版，服务于出版社和教育机构，现在也针对个人和企业提供一本起印的在线印刷服务，目前拥有亚洲最大的按需印刷<a href=\"https://www.infoq.cn/article/3dePZg9FS9v3ms7WVwXo\">数字化工厂</a>\"。</p><p></p><p>摄影业务这块，我们主要是通过整合影楼、拍摄基地、摄影师、化妆师等资源，提供婚拍、亲子和写真等服务，还有硬产品的个性化设计和定制，比如相册相框、家俬家纺、陶瓷摆件等等，定位是影像垂直生态平台，以前也是服务于影楼的 B2B 业务，现在也直接 2C 了。</p><p></p><p>此外，啤酒就是泰山原浆啤酒，这块可能很多人都听过、甚至喝过，在电梯广告应该看到过，我们的啤酒主打的是鲜啤，7 天鲜啤，保质期只有 7 天，口感醇厚，与其他工业啤酒有较大差异，我们泰啤现在是中国原浆啤酒第一品牌，目前有 3000 多家门店，覆盖全国，也是新零售模式，线上线下。</p><p></p><h5>InfoQ：在虎彩集团推动数字化转型的过程中，遇到过什么挑战？</h5><p></p><p></p><p>袁运亮：虎彩集团是一个比较传统的公司，从管理层的思维认知方面来说，一开始虽然有一些认知，但还不是很深刻。他们不知道数字化技术具体能帮助现有的传统业务带来什么价值，心里也有比较大的顾虑。</p><p></p><p>所以，我们当时在做顶层设计的时候，会着重找准一些切入点，优先推进一些比较小的项目，从点到线到面去推广数字化，通过让管理层看到相应的成果，无论是效率的提高还是成本的降低，从而提升大家的信心，在这基础上慢慢加快后续的投入。</p><p></p><p>除了管理层思维跟认知之外，后来我们发现，企业还非常缺数字化的<a href=\"https://www.infoq.cn/video/Q7iEvAi0XxZdtkcFgHlB\">人才</a>\"，正因如此，内部提不出来跟业务相匹配的数字化需求，最终导致数字化的效果不佳。所以，虎彩集团后来也陆续招聘了大量的数字化人才，包括营销、技术、管理等方面各类人才。</p><p></p><h5>InfoQ：最初虎彩集团是从哪些切入点开始的？</h5><p></p><p></p><p>袁运亮：虎彩的传统业务主要是针对 B 端大客户的，过去的合作关系和流程还是比较稳定的，所以，我们就先在鲜檬摄影和泰山啤酒这两块新的业务去做尝试。</p><p></p><p>具体来说，切入点还是营销。因为营销能最快体现数字化的价值，通过吸引线上客户，能直接帮助企业带来收入。以摄影业务为例，过去，摄影都是老客带新客，于是，我们就想是不是可以通过技术手段把这种“老带新”的方式，从线下搬到线上，解决时空限制的问题。加上一些推荐奖励的机制，后续的效果还是不错的，然后我们就逐渐把这种方式延伸到了其他领域。</p><p></p><p></p><h5>InfoQ：虎彩集团在数字化营销、数字化供应链、数字化经营管理等维度陆续开展了数字化转型工作，是否可以介绍一下目前三个方向下的转型进展和成果？</h5><p></p><p></p><p>袁运亮：虽然营销数字化、供应链数字化，以及经营管理数字化三部分的工作是同步推进的，但是，因为不同业务的情况不一样，转型的进展也不同。其中，比较传统的 toB 业务进展相对慢一点，直接连接消费者的 toC 业务进展会更快一点。</p><p></p><p>首先，还是数字化营销部分，由于摄影和啤酒都是直接面向消费者的，所以一定要通过线上方式做营销。一开始，我们也是从公域去获客，然后引流到<a href=\"https://www.infoq.cn/article/C0P2bZbE1IVrCkTZvGWi\">私域</a>\"。但是现在流量越来越贵，获取难度越来越大，流量的精准度也有限，导致早期我们投入了很多钱，但效果不是很明显。</p><p></p><p>所以，后来我们开始采用区块链技术去做流量追踪，就是希望投入的每一分钱，都知道投到了哪些渠道、有没有带来效果、具体带来了什么效果、哪个渠道的投入产出比更高等等。目前，从前端的消费者连接，到获客拉新下单支付，我们都有统一的平台，整个交易在线上就可以完成；同时，在后台我们也建设了业务中台和数据中台，通过业务中台可以沉淀和支持前端的创新，基于数据中台还可以对会员打标签、做精准营销、精准投放。</p><p></p><p>其次，是供应链的数字化。过去，采购计划、生产仓储等供应链相关的工作都是各做各的，无论是系统还是数据都是割裂的，没有进行协同。目前，我们通过与第三方公司的合作正在打造集成供应链平台，主要就是为了打通采购计划、生产仓储和物流，让供应链的不同阶段可以进行高效协同，从而发挥数据的价值，最终支持工厂的柔性供应和柔性生产。</p><p></p><p>再者，就是经营管理的数字化。目前，我们几乎把所有的流程都实现了线上化，包括采购、考勤、出差，甚至是绩效考核、招聘入职、合同签订等等，全部线上化。这不仅大大提高了各个流程的工作效率，同时也基于初步的数据应用，包括 BI 报表、营销生产大屏等等，可以辅助管理层进行运营决策。未来，我们希望可以做到真正的全流程的数据驱动运营和决策，实现经营管理的数字化。</p><p></p><h2>从全民营销到场景营销再到异业联盟，用区块链解决信任问题</h2><p></p><p></p><h5>InfoQ：针对不同产品和业务类型，数字化营销的策略和手段会有什么差异？请举例说明。</h5><p></p><p></p><p>袁运亮：确实，2B 和 2C 业务的营销方式很不一样。比如，印刷业务主要还是服务于大 B 客户，针对这些大客户，我们目前还是主要通过一对一的线下营销方式去触达，包括定期的拜访计划，或者通过展会、大会等各种线下的渠道进行营销拓展。</p><p></p><p>当然，还有一些小客户，他们一般会有定制化的需求：第一，体现自己的品牌；第二，降低成本；第三，定制个性化包装元素。通常来说，他们是缺少数字化能力的，也没有技术人员的支持。所以，对于这些客户，我们会提供一些数字化工具和平台，让他们通过自己的渠道去获客，在他们接单之后，再帮他们去做包装印刷。</p><p></p><p>摄影和啤酒两个新业务的营销模式就比较多元化。现在，我们主要采用 C2B2M 的模式去为门店赋能，各大门店通常都会有一个对应的“云店”，从下单、收款，到物流配货、活动管理、会员管理等一系列操作，都会通过相应的数字化工具完成，从而帮助门店提高运营效率，解决获客、物流配送、会员运营等各种问题。对于门店而言，只要经营好自己的生意就可以了。</p><p></p><h5>InfoQ：虎彩提出基于区块链技术打造营销平台，背后的思路和逻辑是什么？具体解决了数字化营销的哪些具体问题？</h5><p></p><p></p><p>袁运亮：区块链技术是虎彩集团工业互联网的五大能力之一，这五大能力具体包括了大平台、大数据、智能工厂、智慧物流以及区块链。那么，虎彩通过区块链解决了数字化营销的哪些问题？事实上，我们分了几个阶段：</p><p></p><p>第一，从鲜檬业务切入，如前面所说，把“老带客、老带新”的模式线上化，实现全民营销，然后利用区块链追踪新客户的来源，确保信息不会被篡改、是真实的，并且不会丢失。同时，我们也可以据此及时地奖励老客户，让他们更有积极性去引荐新客户；</p><p></p><p>第二，如今越来越多的营销数字化合作场景不只是面向个人，还要面向企业，而企业之间的合作通常会存在信任的问题，比如，企业 A 帮企业 B 做了引流和获客，那么这个数据究竟准不准？应该以谁的<a href=\"https://xie.infoq.cn/article/83bf769058e8dac7f97b359a1\">数据</a>\"为标准？为了解决这一问题，我们又推出了场景营销，面对商城、蜂巢、社区等不同的场景，支持对应的合作模式；</p><p></p><p>第三，随着场景营销模式的推进，我们又摸索出了其他的合作模式。比如鲜啤业务，我们定位基本上是 25~45 岁相对高收入的人群，那么，我们是不是可以跟服务于相似的客户群体的企业去合作，把会员进行共享？所以，我们开发了异业<a href=\"https://xie.infoq.cn/article/c3c62d174b253106636322b5f\">联盟链</a>\"，在里面，不同企业服务于类似的客户群体，但彼此之间又没有竞争关系，而是互补关系，在这一前提下，就可以实现会员的共享、流量的引导以及精准的联合营销。</p><p></p><p>总结而言，基于区块链营销平台，我们提供了三大核心功能：一是针对普通消费者的全民营销；二是针对特定场景和渠道的场景营销；三是针对服务于相类似客户的企业异业联盟。其中，区块链主要解决的就是信任和追溯的问题。</p><p></p><h5>InfoQ：是否可以具体介绍一下虎彩区块链营销平台的技术框架？</h5><p></p><p></p><p>袁运亮：其实我们用的也是比较主流的互联网技术，比如，在前端会用 Vue、React 、wepack 等技术栈，后端会基于比较主流的 springboot、redis、MongoDB、Mysql 以及 OSS 还有 MQ 等主流的一些技术和中间件去做。</p><p></p><p>在区块链方面，首先，我们自己研发了一个区块链服务层，在这之上开发了很多的智能合约（solidity/go/java），可以实现自动的分佣、自动的对账以及自动的结算，所有动作根据既定规则自动去执行，而不用再通过手工去做统计和计算。</p><p></p><p>在区块链底层，我们目前也支持比较多的主流底层框架，包括现在国际主流的 Hyperledger Fabric，以及现在国内比较流行 fisco bcos, 也正在跟长安链沟通，我们也通过了他们链引擎计划的审核，后续，我们也会基于长安链去做一些场景的探索。</p><p></p><h2>追赶数字化浪潮，技术从业者要亲自下场、不要观望</h2><p></p><p></p><h5>InfoQ：区块链营销平台本质上是区块链 + 营销的跨学科融合，在虎彩搭建这一平台的过程中，是如何进行人才培养的？</h5><p></p><p></p><p>袁运亮：做营销数字化，人才是非常重要的，没有人才，很多事情没有办法完成。</p><p></p><p>而对于人才培养，我们主要是通过训战结合的方式。虎彩集团有一个专门的培训学院，它会根据业务的需求开发一系列课程，同时邀请内部和外部的专家一起共创和教学，通过多维度、多层次的课程体系，一般是一年期，分多个阶段，每个阶段学完都要在工作中实战，然后还有导师制，有疑问随时约导师时间咨询，还有各个阶段的作业输出及最终毕业的答辩，保证了学以致用，理论和实践结合。</p><p></p><p>此外，在集团内部，针对高管每年也会有两次的集训，主要就是针对数字化营销这类前沿的知识的体系化培训。同时，在线上我们还有自己的网上课程，叫“云课”。在上面，员工可以选择自己感兴趣的课程，学习完成后还有对应的认证，对于想要参与内部竟聘或者职级认证的员工，这也是很好的提升渠道。通过这些方式源源不断的为虎彩培养各类<a href=\"https://www.infoq.cn/video/sCrEs13sPIU5xUTwVNkT\">人才</a>\"。</p><p></p><h5>InfoQ：在极客邦数字人才粮仓模型中，业务架构师是复合型人才的典型代表，他们的岗位能力主要被划分为六种思维模式和六种执行能力，可以具体介绍一下吗？</h5><p></p><p></p><p>霍太稳：其实我们也是在和很多公司的 HR 以及科技部门的一号位进行沟通的过程中发现，很多人对于如何进行数字化转型以及如何有针对性地培养数字化人才并不是非常清楚。</p><p></p><p>所以，我们在今年成立了极客邦双数研究院，第一个研究成果就是推出了“数字人才粮仓模型”，在这个数字模型中，我们把人才给分成了 5 类，包括数字思维管理人才、数字思维业务人才、业务架构人才、技术架构人才和专项技术人才。</p><p></p><p>而所谓的“双六模型”其实指的是面向业务架构人才，我们重点强调的“6 个思维”和“6 个能力”。其中，“6 个思维”包括了架构思维、流程思维、数据思维、产品思维、生态思维和历史思维，同时，这“6 个思维”又对应着“6 个能力”，比如，架构思维对应的是系统分析能力，流程思维对应的是流程建模能力，数据思维对应的是数据建模能力，产品思维对应的是产品建模能力，生态思维对应的是软件工程能力，历史思维对应的则是领导力。</p><p></p><p>通过这样一个模型，就可以呈现出来，作为一个合格的业务架构师，起码要了解哪些技术和哪些业务，如何才能把企业的数字化战略通过架构方式展现出来，帮助技术人员更好地去落地。而对企业来说，在进行人才培养的时候也能够更有针对性。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/87/83/87cc62ae17ca266fdd220b50157a9d83.png\" /></p><p></p><h5>InfoQ：作为 ArchSummit 的讲师，您如何看待线下大会这样的学习场景？</h5><p></p><p></p><p>袁运亮：我觉得这种大会是很开拓视野的，也能让参会者借此结交更多志同道合的朋友。</p><p></p><p>如今，技术更新迭代是很快的，网上的信息也铺天盖地，但是缺点是它们都很碎片化、很零散，这让很多技术从业者变得无所适从。所以，我认为 InfoQ 举办的一系列<a href=\"https://www.infoq.cn/article/NM7wNWeVLHSfpyjD29uz\">技术大会</a>\"的价值是可以给技术从业者提供一个指引或者方向，让大家少走很多弯路。</p><p></p><p>同时，线下大会的场景也能帮助参会者扩展他的朋友圈，把这么多优秀的技术从业者同时聚集到同一个时空下是很不容易的，这对于技术从业者的个人成长和职业发展也很有帮助。比如，我们可以借此了解各大公司都在使用哪些主流技术，他们用到了什么样的程度，自己的公司是不是要跟进。通过线下的交流和面对面的交谈，很多工作上的困惑也可以慢慢解开。</p><p></p><h5>InfoQ：您个人在传统企业和互联网公司都有从业经验，对于技术从业者来说，如果要赶上数字化浪潮，您还有什么建议？</h5><p></p><p></p><p>袁运亮：主要还是要亲自下场，不要观望。我们发现，现在很多互联网行业和科技企业的人才，很多还是在观望的状态，到底传统企业做数字化靠不靠谱，以及大家到了传统企业之后能不能适应，这些都是大家顾虑的关键点。但无论如何，数字化时代确实已经到来了。现在，数字经济占 GDP 的比重越来越高，数字化的浪潮非常明显，那么，技术从业者还有什么理由去怀疑、去犹豫，不亲自下场，不亲自去尝试呢？这的确是一个非常好的窗口期。</p><p></p><p>如果等到整个传统企业数字化都进行到中后期了，你再想着去切入就真的有点晚了。换句话说，无论你做哪个行业，前期进入的时候肯定会有风险，但是收益也是更大的。并且，当你用自己擅长的数字化技术真正帮助企业完成了转型，甚至找到了第二增长曲线，从中获得的价值感也是完全不一样的。</p><p></p><h4>嘉宾介绍</h4><p></p><p></p><p>袁运亮，虎彩集团创新应用中心总经理，亚洲区块链产业研究院专家委员，CSA 区块链安全工作组专家。曾任职于汇丰、阿里巴巴、美的集团等公司，并担任技术专家、技术架构负责人、技术委员会委员。深入理解区块链原理和相关核心技术，对架构和开发以区块链为中心的企业级平台有丰富的经验。对区块链 + 行业应用有较深的理解和丰富的实践经验，包括工业制造、新零售、供应链金融、数字化营销、政务、新能源、物流、公益等。</p><p></p><p>霍太稳，极客邦科技创始人兼 CEO，InfoQ 中国创始人，极客时间创始人，TGO 鲲鹏会发起人。2007 年创立 InfoQ 中国，2014 年创立极客邦科技，2015 年发起 TGO 鲲鹏会，2017 年创立在线职业教育学习品牌极客时间，2019 年开创极客时间企业版，拓展企业服务市场。</p>",
    "publish_time": "2023-01-04 14:34:07",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]