[
  {
    "title": "一个品牌、三个提升、五维布局｜工行数字化转型的思路和实践",
    "url": "https://www.infoq.cn/article/pc7ihipY5vPdizqktlE5",
    "summary": "<p>数字化转型没有放之四海而皆准的标准定义，但确实存在一些共同点，比如都“以用户为中心，以数据为驱动，以科技创新引领变革，以构建生态连接资源”。而工商银行对于数字化转型的定义是“以服务实体经济和人民群众需要为主线，以数据和技术为关键要素，以全行各领域业务科技煲汤式融合为重要推动力，以业务模式和管理模式变革为突出特征，进一步强化以客户为中心，高质量提升用户体验、业务效率和经营价值。”</p><p></p><p>基于以上定义，工商银行制定了数字化转型的整体思路——“1、3、5”。其中，“1”是指打造“数字工行(D-ICBC)”品牌，“3”是指三个提升目标，“5”是指五维数字化转型布局。本分享将对工行围绕这一思路的具体实践和场景应用进行拆解，希望给各行业数字化带来启发。</p><p></p><p>本文整理自中国工商银行软件开发中心总经理室金融科技专家许宜在高质量数字化转型创新发展大会暨中国信通院“铸基计划”年度会议的演讲分享，主题为《工商银行高质量数字化转型实践》。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/f8/98/f86a07f828bffc3907c55df9da3ef498.jpeg\" /></p><p></p><p>以下是演讲实录（经InfoQ编辑整理）：</p><p></p><p></p><h2>为什么要做数字化转型？</h2><p></p><p></p><p>当前全球新一代的科技革命和产业革命深入发展，以数字化、智能化为主要特征的第四次工业革命，对各行各业都产生了深刻的影响，同时也带来了前所未有的机遇和挑战。可以说，数字化转型已经成为了当今时代全球每一个企业的必答题。</p><p></p><p>此外，当前数字化转型也已经纳入了我们国家的战略，国家通过政策引领和顶层设计，对我国现阶段科技创新发展和数字化转型做出了系统谋划和战略部署，明确了数字经济发展的战略地位。最近，国务院印发了《数字中国建设整体布局规划》，其中指出建设数字中国是数字时代推进中国式现代化的重要引擎，也是构建国家竞争新优势的有力支撑。</p><p></p><p>工商银行一直坚持数字化的发展，及时把握科技与产业变革的趋势。去年2月份，工商银行发布了集团的数字化品牌：数字工行(D-ICBC)，全面开启数字工行的新征程，全力融入金融数字化转型的浪潮，为数字经济的高质量发展贡献工行智慧和力量。</p><p></p><p></p><h2>工商银行的数字化转型方法论</h2><p></p><p></p><p>数字化转型没有放之四海而皆准的标准定义，但确实存在一些共同点，比如都“以用户为中心，以数据为驱动，以科技创新引领变革，以构建生态连接资源”。而工商银行对于数字化转型的定义是“以服务实体经济和人民群众需要为主线，以数据和技术为关键要素，以全行各领域业务科技煲汤式融合为重要推动力，以业务模式和管理模式变革为突出特征，进一步强化以客户为中心，高质量提升用户体验、业务效率和经营价值。”</p><p></p><p>基于以上的定义，工行制定了数字化转型的整体思路，可以用“1、3、5”进行概括。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/ec/86/ecb68228225820bf9ec87e6a43061d86.png\" /></p><p></p><p>“1”是打造数字工行（D-ICBC）品牌。</p><p></p><p>“3”是三个提升目标：第一，提升用户体验，以用户为中心，解决好服务过程中的断点、堵点、难点等体验问题；第二，提高业务效率，从业务流程的视角进行审视，进行流程的优化改进甚至再造，并且实现自动化的处理，以实现高效的决策和运营；第三，提升经营的价值，通过数字化的手段实现业务模式和管理模式的重塑与创新，强调创造性地改变原有核心业务的模式，实现业务的跨越式升级。</p><p></p><p>“5”是五维的数字化转型布局，也就是数字技术、数字资产，数字生态，数字基建和数字基因。</p><p></p><p>重点来看一看五维具体的含义。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/cb/7b/cbf81bf4f819dcfa031c2897529cd07b.png\" /></p><p></p><p>其中，数字基建是基础部分，重在高水平的科技自立自强，适度超前打造支撑未来发展的信息基础设施。数字技术和数字资产是两大关键驱动力，数字技术重在打造先进可控的硬核科技，提升数字技术创新驱动能力，掌握发展的自主权。而数字资产成为了一个新型的生产要素，重在做实做强做活数据的新要素，提升数字资产智能应用的能力。数字生态是通过API开放平台、金融云平台，构建开放的生态，打造金融与消费互联网、产业互联网、政务互联网紧密融合的数字共同体。数字基因则是贯穿以上四个方面的内在动力，重在建设敏捷协同的组织机制，培养和集聚高水平的人才，提升数字化灵活创新的能力。</p><p></p><p>在五维布局中，数字技术是数字化转型的第一动力。我们从2015年开始就通过自主研发，全面布局了云计算、分布式、&nbsp;大数据、人工智能、区块链等，加上5G的新技术，推出了自主可控的十大技术体系，形成了企业级技术能力，为数字化转型和业务创新提供技术上的支撑。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/ce/ab/ce0e728c51288a2340718eb5a79d94ab.png\" /></p><p></p><p>其中，“云+分布式”的技术体系具备了15万+的节点，34万+的容器，行内有95%的应用都采用了开放平台，日均服务调度次数超过160亿，从而提供了高性能的联机服务能力。此外，我们还有全栈信创的大数据服务云同业，具备EB级的存储，拥有5000多个节点。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/cb/7b/cbf81bf4f819dcfa031c2897529cd07b.png\" /></p><p></p><p>数据资产是加快数字化转型的新动能，工行充分发挥数据要素的作用，做实数据基础，盘活数据资产，驱动运营模式、风控模式和业务模式的创新，目前已经建立起了功能完备，算法齐全的数据中台体系，沉淀数据超过40PB，形成6万个共享指标，推出1000多个数据服务，夯实了用数赋智的基础。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/fc/e2/fc40463617e91a931466e787947387e2.png\" /></p><p></p><p>数字生态方面，工行主要依托“API体系+金融生态云”双轮驱动的开放服务生态体系，重点在数字政务、数字产业、数字乡村等领域，为政府和企业提供端到端的解决方案，更好支持生态融合共建。API平台的价值，实际就是把我们的能力输出出去，融入到企业的场景当中去提供服务，也就是开放银行的思路。目前API对外输出16大类4600余个服务，金融生态云提供了21个SAAS产品，租户已达到7.4万。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/76/75/76d78dabeaebde1b019ac108dfece375.png\" /></p><p></p><p></p><p>值得注意的是，技术也是一把双刃剑，通过大数据、人工智能等新技术提高金融服务能力的同时，同样可能派生风险。如果不加以管控，甚至滥用，就会破坏数字化转型的可持续性。工行在数字化转型的过程中，积极应对算法歧视、信息泄露、数字鸿沟等金融科技伦理的挑战，本着科技向善的理念，通过夯实安全的基础、推动金融普惠、加强共享输出等方面的实践，持续推进金融科技伦理的建设。</p><p></p><p></p><h2>工行数字化转型实际应用场景</h2><p></p><p></p><p>数字政务方面，依托数字技术基座，工商银行打造了1+N（1个政务服务平台+N个政务垂直行业）的数字政务服务体系，目前在全国落地了300多个政务合作场景，积极助力政务服务的一网通办，具体已经上线了10项全国通办的政务事项，以及400余项属地专有的政务事项。向社保、财政、政法等垂直领域输出“行业+金融”一站式服务，让“数据多走路、群众少跑腿”。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/0y/18/0yy2c5b9888889f7e9de767790c58418.png\" /></p><p></p><p></p><p>以“工银安心链”为例：面对教培行业退费难、甚至卷款跑路等监管难题，面对公益慈善捐款专款专用，农民工工资按时足额发放等资金监管领域的民生诉求，我们利用区块链数据可追溯、防篡改等特性，打造了“工银安心链”数据产品，解决各方信息不对称、资金流向不透明、资金监管难等痛点问题，实现源头可溯、过程可查和责任可追，助力国家监管政策高效落地，加强全社会的信用体系建设。目前上线的资金管理单位达到了844家，监管资金的体量达到了4184亿元。</p><p></p><p>数字产业服务方面，我们利用数字技术重构了金融服务。比如，产业链建设上通过数字供应链平台，服务20余万家上下游企业；普惠金融生态上面向小微企业搭建了金融生态圈，同时推出了一系列的普惠数据产品，更好服务于客户的融资需求；通用支撑上，通过像党建工会云，财务管理云等金融生态云，为各行业提供了垂直领域的解决方案。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/b2/7a/b2afcbed31fbf2cc6b714587e85a3e7a.png\" /></p><p></p><p></p><p>以普惠金融应用创新为例：通过切入小微企业的生产经营各类场景，充分挖掘企业结算、收单、资产等等多维度的数据价值，通过“数据+模型”驱动，打造了商户贷、e抵快贷、e企快贷等普惠的拳头产品，满足小微企业各类的融资需求。其中商户贷是最近的产品创新之一，我们和银联合作，同业首家应用了隐私计算的技术，推出了“商户贷”数字产品，保障客户数据安全的同时，实现了小微收单商户的精准授信，上线8个月，贷款的余额超过64亿，服务小微商户达到3.4万户。</p><p></p><p>数字乡村方面，为响应国家乡村振兴战略，工行一直致力于深化“业务+科技”的双向融合，期望将工行打造成金融服务乡村振兴主力银行，乡村客户满意银行。在服务渠道方面，线上打造了“兴农通”APP，用户数达到298.6万人，线下挂牌了普惠金融服务点近4千家；平台创新方面，通过数字乡村综合服务平台与一千余家的县级农业农村部门合作，通过兴农撮合平台撮合农产品的供需意向1万余项，服务的农业经营主体超过10万家；在产品创新方面，在“工银兴农贷”提供贷款达到3.4万亿的同时，种植E贷也已经实现了种植领域上涉农贷款的创新突破。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/8a/9f/8a79da1bc29e3267123ed9f638d1ce9f.png\" /></p><p></p><p>以“数字乡村”综合服务平台为例：这个平台结合了人工智能、区块链以及卫星遥感等新技术，通过“一窗受理”的方式，为农业农村的管理部门、村委会提供了涵盖“党务、政务、村务、财务、金融服务”的一站式数字化综合解决方案，协助建立集体资产的监督管理服务的体系，提高乡村数字化治理的效能。</p><p></p><p></p><h2>关于数字化转型的未来展望</h2><p></p><p></p><p>我们认为，目前工行的数字化转型与很多企业一样，仍然在路上。为了在数字化道路上能够走得更深更远，我们将着重做好三个方面的转变和两个方向的转型：</p><p></p><p>三个转变：一是转意识，我们认为需要保持开放的心态，避免固步自封，提高数字化的认知高度，把握时代发展的机遇；二是转模式，要积极探索业务模式、管理模式和运营模式的创新与重塑；三是转组织，要鼓励组织架构和体制机制的创新，加快科技创新与市场响应。</p><p></p><p>两个转型：一是推动好从局部到全链路的转型，重点关注面向客户交互的局部数字化，也就是触点的数字化，更加转向全链路的数字化转型，对银行的前、中、后台都需要重点关注；二是因地制宜推动部门级、产品级、企业级的数字化转型，以问题为导向，因地制宜选择数字化转型的路径，在部门级、产品级和企业级分别都能够做好重点的突破。</p><p></p><p>数字化转型任重而道远，但是我们相信，道虽远，行则将至，事虽难，做则必成。工行愿意与各机构和企业加大合作，共建开放共赢的“数字共同体”，为“数字中国”建设增砖添瓦，共同服务于人民对于美好生活的向往与追求。</p>",
    "publish_time": "2023-03-17 11:06:28",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]