[
  {
    "title": "百度回应Bing成中国桌面搜索第一；阿里回应大裁员传闻；文心一言市场负责人怒怼科大讯飞｜Q资讯",
    "url": "https://www.infoq.cn/article/5l5RpCxs8PPxXHPwLWYY",
    "summary": "<p></p><h2>科技公司&nbsp;</h2><p></p><p></p><h4>文心一言市场负责人怒怼科大讯飞：别动不动就碰瓷</h4><p></p><p>&nbsp;</p><p>针对<a href=\"https://xie.infoq.cn/article/28d32c82f05e5c841f2fd3e0c\">科大讯飞</a>\"因 AI 小作文股价大跌一事，百度文心一言市场负责人张全文在朋友圈怒怼，称“听闻有友商把自己股价大跌，归咎于有人利用文心一言写了篇命题小作文，也是醉了。先别说小作文这事真假（目前看来只怕是策划痕迹太重），如果 AI 作文有这本事，百度员工自己先炒一下自己股价不香吗？中国发展自己的大模型技术挺不容易的把精力放到正事上吧，还请友商解决好自己的问题，别动不动就碰瓷别人，大家的眼睛都雪亮的。”</p><p>&nbsp;</p><p>此前，科大讯飞股价24日午后意外大幅下跌8.82%。对此，科大讯飞回应表示，“股价下跌系某生成式AI写作虚假小作文导致，谣传风险为不实消息。”据悉，有人利用文心一言写做了一篇“科大讯飞出现重大风险的警示文”，该消息流出后引发广泛关注。&nbsp;</p><p></p><h4>阿里云首席安全科学家吴翰清离职，投身AI短视频创业</h4><p></p><p>&nbsp;</p><p>据报道，阿里巴巴研究员吴翰清已于近期离职，钉钉显示其离职时间是5月19日。在阿里内部，研究员的职级为P10。据悉，吴翰清离职后，选择 AI 短视频赛道创业，已经close一轮融资。对于上述消息，截至发稿，阿里尚未回应。</p><p>&nbsp;</p><p>吴翰清在行业人称“道哥”，是中国年轻一代顶级黑客，阿里云首席安全科学家。公开资料显示，吴翰清于2005年加入阿里，参与创建阿里巴巴、淘宝、支付宝、阿里云的应用安全体系。23岁成为阿里最年轻的高级技术专家，是阿里安全从无到有、从有到强的亲历者。2015年9月，阿里云发生自建立以来最大的DDoS攻击，被称为901事件。身为“云盾”的负责人，30岁的吴翰清亲自带领团队抵御了这场风波，也因此一战成名，被称为“中国最强大的黑客”。</p><p></p><h4>阿里云被曝裁员比例达7%，官方回应正常操作</h4><p></p><p>&nbsp;</p><p>5月23日下午，有猎头透露杭州大厂裁员进行时，“这次比例不小，杭州找工作要地狱级难度了。”该大厂被业内人士指向阿里巴巴，包括淘宝天猫业务和阿里云业务。其中，淘宝天猫被曝出“裁员25%”。一位<a href=\"https://www.infoq.cn/article/epIkKqEufthFWNRmTKFW\">阿里云智能</a>\"内部人士透露：“每年公司会进行正常的组织岗位和人员优化。此次人员调整的时间为5月份，是在4月底发放完年终奖后启动的，整体优化比例约7%，补偿标准为N+1+1，未休的年假、陪伴假等均可折现。”</p><p>&nbsp;</p><p>而阿里巴巴方面回应表示，“这只是正常的组织岗位和人员优化”。阿里巴巴集团宣布，2023年六大业务集团总计需新招15000人，其中校招超过3000人。同时表示，“近日，关于淘宝天猫、阿里云、菜鸟、本地生活各个业务裁员谣言传得很厉害，但谣言就是谣言。我们的招聘正在紧锣密鼓的进行。”</p><p></p><h4>小米集团：4月正式组建了AI实验室大模型团队</h4><p></p><p>&nbsp;</p><p>小米集团发布公告称，4月正式组建了AI实验室大模型团队，目前AI领域相关人员超1200人；将不断挖掘AI相关的用户场景，发挥自身技术优势，并以开放的态度与合作伙伴开拓更多机会。</p><p>&nbsp;</p><p>据悉，栾剑是小米技术委员会AI实验室大模型团队负责人，向AI实验室主任王斌汇报。对于大模型，雷军表示，全力以赴坚决拥抱。雷军还透露“正在研发一些有趣的技术和产品，等打磨好了再给大家展示”。小米总裁卢伟冰表示，会积极拥抱大模型，但不会像 Open AI 一样做通用大模型，而是会深度和业务结合协同，利用 AI 技术提升内部效率。</p><p></p><h4>百度搜索回应 Bing 成中国桌面搜索第一：该数据很离谱</h4><p></p><p>&nbsp;</p><p>据网络流量分析平台Statcounter数据，4月，微软旗下搜索引擎必应（Bing）在中国桌面搜索引擎市场的份额升至37.4%，超越百度成为中国第一大桌面搜索引擎；百度位列第二，份额降至27.01%。</p><p>&nbsp;</p><p>5月25日，针对“百度桌面搜索中国市场份额被必应超越”一事，百度集团副总裁、搜索平台负责人肖阳回应称，这是一个很离谱的数据，过去一段时间百度搜索在桌面端市场份额的市场份额是保持稳定领先的。据另一位百度内部人士补充，内部数据显示百度搜索的市场份额一直高于必应，但涉及商业机密不便对外透露具体数据。肖阳表示，百度有自信在中文的搜索引擎市场保持市场份额第一。</p><p></p><h4>AIGC 培训机构学费 1 万元/天“收割”打工人</h4><p></p><p>&nbsp;</p><p>据报道，某培训机构开设的课程主要面向企业，时长6个小时，一天讲完，费用是1.8万元，最多可以100人同时听。在宣传中，机构并不回避助力学员“搞钱”的说法，有机构的教学大纲中专门留有多个篇章讲“如何搞钱”，如“拿到谷歌百万年薪 offer”、“第一波红利”、“开撸网赚项目”等。</p><p>&nbsp;</p><p>业内专家认为，相关课程只能解决“原来不会用，培训以后会用”的问题，更多有深度的内容还需要慢慢沉淀。对于正在职场或者求职的人来说，要冷静辨别，结合自身实际情况，切莫被招生广告收割。</p><p></p><h4>车圈“地震”：长城汽车实名举报比亚迪，比亚迪强势回应</h4><p></p><p>&nbsp;</p><p>5月25日，长城汽车就比亚迪秦 PLUS DM-i、宋 PLUS DM-i 采用常压油箱，涉嫌整车蒸发污染物排放不达标的问题进行举报。对此，比亚迪发布声明回应称坚决反对任何形式的不正当竞争行为。检测机构中汽研则表示正在了解和处理。</p><p>&nbsp;</p><p>舆论发酵之后，长城汽车、比亚迪午后双双跳水，其中长城汽车跌超7%，比亚迪跌超2%。此外，比亚迪集团品牌及公关处总经理李云飞也对此事进行了表态：吹灭别人的灯，并不会让自己更加光明。阻挡别人的路，也不会让自己行得更远。</p><p></p><h4>京东云推出全网比价功能：买贵就赔</h4><p></p><p>&nbsp;</p><p>5月23日，继阿里云、腾讯云、移动云等宣布产品降价后，京东云宣布其全系核心产品参与比价，掀起中国云市场的首次公开比价大战。本次比价活动涉及京东云全系核心产品，包含：计算、存储、网络、数据库、中间件、安全、视频服务、云电脑。</p><p>&nbsp;</p><p>京东云拿出的具体措施有两条：第一，承诺全系核心产品的官网列表价均低于特定云厂商官网对标的产品列表价格；第二，实际成交单价将在特定云厂商实际成交最低单价的基础上再打九折。据悉，“特定云厂商”指的是阿里云、华为云和腾讯云。</p><p></p><h4>PC 销售不景气，联想 Q1 裁员4000多人</h4><p></p><p>&nbsp;</p><p>据外媒消息，联想表示，在2023年1-3月期间，该公司裁员了约5%，这是由于 PC 市场不景气导致的。根据财报，联想 Q1 营收126亿美元同比下降 24%，税前利润下降75%至1.3亿美元。其中，PC和智能设备消费群组收入下97.9亿美元，同比下降 33.3%。</p><p>&nbsp;</p><p>截至2022年9月底，该集团全球员工数量约为8.2万人，裁员5%意味着减少4100人。不过，也有消息称联想裁员的比例约为8%-9%。联想高管表示，裁员是对联想员工队伍的再平衡，“有些员工需要离开公司，因为这是我们持续管理人力资源的方式。”他补充道，关键在于如何部署我们的资源，而不是关注有多少名员工。</p><p>&nbsp;</p><p></p><h2>IT业界</h2><p></p><p></p><h4>微软甩出王炸：Windows 系统全面接入 AI 助手</h4><p></p><p>&nbsp;</p><p>当地时间5月23日，微软 CEO 萨蒂亚·纳德拉宣布，正在为 Windows 11 添加人工智能助手“Windows Copilot”。根据展示，Windows Copilot 位于电脑的右侧边栏，能够在各种基本操作和任务中帮助用户，包括回答问题、总结信息，编辑文档、调整计算机设置等。</p><p>&nbsp;</p><p>以前，用户如果想要调整系统，需要通过繁琐的操作才能实现。未来用户可以直接向 Windows Copilot 提问“如何调整系统更好地完成工作”，系统能够直接生成操作建议，用户只需点击“yes”按钮，它就能帮助用户对系统进行调整和改善。同时，微软表示，未来 OpenAI 将开始使用必应作为 ChatGPT 的默认搜索引擎。</p><p></p><h4>PostgreSQL 16 发布首个 Beta 版本</h4><p></p><p>&nbsp;</p><p>该版本值得关注的几大方面分别是性能、逻辑复制增强、开发者体验、安全功能、监控与管理等，例如此版本增加了更多的查询并行性，包括允许FULL和RIGHT连接并行执行，并且可以对string_agg和array_agg聚合函数进行并行执行。PostgreSQL 16可以在SELECT DISTINCT查询中使用增量排序。还有一些窗口查询优化、RANGE和LIST分区查找改进以及支持RIGHT和OUTER查询中的“反连接”。</p><p>&nbsp;</p><p>&nbsp;</p>",
    "publish_time": "2023-05-27 17:04:27",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "蚂蚁金服开源生态构建与基础软件技术开源布局",
    "url": "https://www.infoq.cn/article/S5eOai854I3xK9sYKS0r",
    "summary": "<p>很荣幸参加了 5.24 上午由蚂蚁金服策划的“开源生态构建与基础软件技术开源项目”交流活动。</p><p></p><p>这次交流会主要是从开源生态构建与基础软件技术开源项目出发，结合国际经验与蚂蚁实践，探讨如何通过开源培养技术人才、构建活跃的技术生态，并提升关键软件技术的创新升级。</p><p></p><p>Linux 基金会亚太区开源布道者主席李建盛老师介绍了“开源的价值与中国开源现状”，李建盛老师在谈开源理解的时候，提到了两点，一是开源理念对财产所有权带来的变化，对商业模式产生了挑战，专用软件卖的不是软件，是使用权。而开源是对于原来这种所有权的恢复，一种新时代的新认知。过去40年证明了开源这种运动能活下来，并在社会上发生很重要的作用。</p><p></p><p>另外一个具有挑战的事是组织管理方式，来自互联网虚拟这种组织结构，其激励模式、合作方式、权利分配、利益分配，所有这些都给我们所有人启示和挑战。就像所有公司一样，基于项目的共同体其实相对来说也成功不多，但是那些成功比如说Linux，它是给了我们新的启示，这是一个我们需要去学习和可以注意的地方。基于相同兴趣或者一些相同理念组织成虚拟共同体，这是前所未有的合作模式，可以让两个身处不同角落的人可以协作，是非常神奇的。</p><p></p><p>开源能够解决很多问题，而它又是基于开放透明的原则，从商业的角度来讲是构建 Trust 的非常重要原则，开源就是非常重要构建商业模式的基础。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/ed/ed28cd664b387968156143abdfd598b2.png\" /></p><p></p><p>蚂蚁集团开源委员会主席，基础设施委员会主席何征宇介绍了“蚂蚁开源理念与核心开源项目”，从整个软件行业来看，基础软件这个领域和开源有非常大的关系，首先大家耳熟能详一些技术软件像操作系统、中间件、数据库，这些东西是作为基础软件的代表，支撑了整个数字经济行业，不管是数字产业化或者产业数字化，里面都有这些软件的身影。未来，像人工智能或者工业互联网、IoT 等新的智能应用场景，也离不开基础软件。</p><p></p><p>中国基础软件发展和开源实际上和开源也是紧密相关的，整体来看，基础软件和平台软件、应用软件最关键的区别是落地的难度，也就是说有多少人用。基础软件之所以基础，就是它要被大量的应用场景所锤炼，基础软件核心问题就是必须要在千万级用户市场上才有可能发展壮大，市场是必要条件，但还不充分。</p><p></p><p>目前国内基础软件的难点在于，市场小，而美国生产一个软件，天然就拥有了全世界的市场，中国生产一个软件首先是在中国市场内。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/b7/b79592c046fe01cd478149bdb05347ac.png\" /></p><p></p><p>我们现在要做什么事情呢，到国际游戏规则中，去捍卫中国软件在国际社群里的话语权。</p><p></p><p>目前很多通讯企业在讲5G标准、6G标准，我们在和国际大企业竞争。</p><p></p><p>在软件行业，我们跟通信领域一个巨大区别除了有RETF标准化组织以外，开源组织除了几个开源大基金会，其实某种意义上来说也是一个标准，实际上我们在国际技术标准主导权上是缺失的。</p><p></p><p>这个缺失背后，也暴露了另一个问题，那就是人才的吸引、人才培养上的短板。虽然中国有大量的工程师红利，但是真正的工程师红利如何转向高质量的软件红利，或者占领一定的国际技术标准，这里有巨大的 Gap。</p><p></p><p>第三个挑战是，我们整个生态配套是比较弱的，在谈核心高级技术的同时，也要看核心周围的配套，缺少配套设施，再核心东西也无法到场景里面发挥作用。</p><p></p><p>针对这些场景问题，蚂蚁集团的主张是：</p><p></p><p>第一，蚂蚁前十年在闷头写代码，也写了很多开源项目和工具，例如 Ant Design，这只是冰山一角，蚂蚁实质上已经有1600多个开源仓库，社区头部项目有一百多个。</p><p></p><p>第二，提升社会对开源的认知，开源某种意义上是一个投影，是技术能力在社会上或者在社群里的投影。成立开源委员会实际上也是想尝试解决上述问题，包括行业问题，包括蚂蚁自身的问题，就是立足这两个基本点去推动不仅是蚂蚁内部开源软件发展，也包括这个行业的发展。</p><p></p><p>现在整个行业社会就是处于数字化转型的转折期，蚂蚁在帮助商家数字化过程中实际也发现一些问题或者有一定积累，这些积累帮助我们发现抽象出来几个大的问题，不仅八千万商家还有蚂蚁很多 ToB 服务，包括区块链、数据服务等等，就是一些共性问题。</p><p></p><p>蚂蚁最擅长的是安全可信，对金融行业来讲这很关键，数字化最怕的是没有枉法的数字世界，所以安全可信能力是蚂蚁在技术投资过程中一直非常重视的东西，是我们基本立足点。</p><p></p><p>第二个就是效率问题，高效协作，达成共识，用数字化方法达成统一的目标。</p><p>蚂蚁最擅长解决问题，包括用TuGraph解决数据分析的问题，用隐私计算解决可信的问题，用区块链解决大工程协作或者互相认证的一系列问题。</p><p></p><p>蚂蚁整体对开源的期待，还是回到开源最本质的东西，蚂蚁愿意把代码分享出去，让大家一起看，一起修改，提高整个行业的活力，蚂蚁的发展得益于数字经济的快速发展，我们也希望能够通过蚂蚁共享和参与能够进一步提升或加快数字经济的过程。</p><p></p><p>蚂蚁集团隐语隐私计算总经理、隐语开源框架负责人介绍了王磊“用开源促进隐私计算技术的迭代成长”。隐语作为蚂蚁开源当中的一个框架，是蚂蚁开源下的一个技术产品。</p><p></p><p>隐语的产生背景，要从整个国家数据要素战略出发，数据作为生产要素，非常容易被复制、被拷贝，这样就不可避免在流通过程中存在安全以及用户隐私问题。</p><p></p><p>大体上可以把隐私计算分成两大类技术，一类是确保数据计算过程和安全的技术，一类是确保结果安全。什么是过程安全和结果安全？</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/68/68402051288336ab204880784dfaeaa3.png\" /></p><p></p><p>这个图可以看到我们把多方融合计算做了抽象，刚开始是来自多方原始数据，他们汇聚到一个地方进行融合计算，最后输出结果。这里面可以看到它有两种锁，一种是空心的白色锁，这个锁其实是传统的系统安全或者网络安全解决问题，隐私计算过程其实是解决计算过程中这把实心锁，要确保计算过程中它是安全的，不会有任何的信息泄露。</p><p></p><p>传统计算安全可能是多方数据融合，我们会找第三方来去充当安全核心，但是在隐私计算里面就是要把对人的信任转化成对技术的信任。</p><p></p><p>第二个结果发布的安全性，在发布结果上需要去通过加噪声的方式，去解决通过计算结果反馈给原始信息的动作。</p><p></p><p>隐私计算能解决什么问题？它能够保护用户隐私，因为在计算过程中不会泄露任何信息。在结果中通过加噪方式可以做结果混淆，保护用户隐私，可以保护数据价值。因为所有计算过程可控的，数据可用不可见，数据无法复制，这样对企业或者机构或者有数据价值的公司，在数据使用过程中可以避免通过数据拷贝导致价值损失。</p><p></p><p>隐语是蚂蚁开源的可信隐私计算框架，它汇聚了七种计算技术，每一种技术都有长短板，通过这种技术汇聚，可以在不同场景中针对用户需求去采集不同技术方案，来解决更多的问题。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/a3/a301fe341f79b9dab4a58ec4d8eba17b.png\" /></p><p></p><p>第二，隐私计算本身是安全属性非常强的技术，蚂蚁在安全方面有非常强的积累，隐语也是通过蚂蚁安全团队去做非常多安全测试，来保证安全产品能真正达到安全效果。</p><p></p><p>第三，隐语是一个多模块设计方案，通过这种模型可以让不同层级的人来进行贡献。因为隐私计算是集工程、AI算法和安全多领域综合性技术，很少有某一个专家能够精通所有技术，隐语提供一个很好平台，可以让每一个类型的专家专注于自己的能力，把框架最后集成起来。</p><p></p><p>隐语为什么选择开源？从隐私计算行业来说，还是处于一个早期发展阶段，它面临着非常多的问题，一个是技术难、门槛高、场景少。但是通过开源希望能解决这些问题。</p><p></p><p>面对场景少这个难题，现在隐私计算真正能够规模使用的，其实就是营销、分控，但是从国家数据要素战略来看，它绝对不只这些场景，国家是希望数据能够真正发挥到赋能实体经济，助力整个经济发展的目的。因此蚂蚁是希望通过隐私计算的普及，能够让更多的行业了解隐私计算能做什么，从而能够去基于隐私计算，去发现更多的数据融合和数据赋能实体经济的场景。</p><p></p><p>最后非常希望整个社会能够一起参与到隐语的共建中，一起把隐私计算技术和隐私计算行业做起来。</p>",
    "publish_time": "2023-05-27 18:26:24",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]