[
  {
    "title": "“初代”数字孪生巨头，如何把虚拟孪生应用于产品全生命周期管理",
    "url": "https://www.infoq.cn/article/N2gWCU0NhYWjmyxwwy2R",
    "summary": "<p>达索系统（Dassault Systemes）成立于1981年，最初是法国达索宇航（Dassault Aviation，欧洲战斗机三雄之一“阵风”制造商）的信息化部门，1981年从达索宇航分离独立发展。如今，<a href=\"https://www.3ds.com/zh-hans/?utm_campaign=202306_chi_3dxp_dassaultsystemes_zh_CMP2164_gilt&amp;utm_medium=cpc&amp;utm_source=baidu&amp;utm_content=search&amp;utm_term=site-dassault-brand-dassault-dasuoxitong-pc\">达索系统</a>\"已经是全球头部工业软件提供商，主要提供三维体验平台（3DExperience），涵盖设计、仿真、制造、协作、数据智能等解决方案，服务于11大行业，是全球几乎所有飞机制造商的技术服务商，也为全球90%的汽车制造企业提供一体化的解决方案。</p><p></p><p>经过40多年的积淀，达索系统跨越了从三维建模（CAD）、数字样机（DMU）到产品生命周期管理（PLM）再到三维体验平台的技术升级，并且在上世纪末就提出了对产品从设计研发、仿真验证到生产制造、使用维护的全生命周期进行数字化的理念。而在<a href=\"https://xie.infoq.cn/article/dc15615d5d5f0eae10972fb89\">数字孪生</a>\"受关注度持续攀升的今天，达索系统进一步提出了虚拟孪生的概念，强调关注数字化对象的历史演进和对未来发展进行预测。</p><p></p><p>在最新一期的 InfoQ《<a href=\"https://www.infoq.cn/theme/192\">超级连麦. 数智大脑</a>\"》直播中，达索系统技术咨询部业务咨询高级经理杨宠介绍了虚拟孪生的概念及其与数字孪生的异同，同时揭示了虚拟孪生技术在产品全生命周期中具体如何发挥作用，从而帮助企业更好地反馈和优化业务结果，减少成本浪费，实现高质量发展。</p><p></p><p>以下是分享全文（经 InfoQ 进行不改变原意的编辑整理）（点击链接可查看完整<a href=\"https://www.infoq.cn/video/axF9GTTK8NAZpglDfCsb\">直播回放</a>\"）：</p><p></p><h2>虚拟孪生≠数字孪生</h2><p></p><p></p><p>达索系统的企业宗旨是利用我们的软件和产品，去推动企业持续创新，最终实现产品、自然和生命的和谐状态。而这个宗旨的实现与虚拟孪生技术紧密相连。</p><p></p><p>大家可能对数字孪生的概念比较熟悉，根据Gartner的定义，它指的是现实世界实体的数字表达，体现的形式和核心要素是软件对象或者模型镜像。在这基础上，达索在2020年提出了虚拟孪生的概念，它不仅仅是现实世界实体的数字表达，还包含了这个数字化对象的演进历史，比如它从哪里来，如何经过设计、仿真、验证，最终制造出来成为一个实体。除此之外，还包括对它未来的预测，比如这个实体产品在使用过程中如何运作、如何更好地进行维修保养服务等等。</p><p></p><p>换句话说，虚拟孪生涵盖了产品全生命周期的过程。那么，我们为什么要提出这样一个概念呢？</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/55/5550bf06ac9ef5141f00dd5e11afa2c4.png\" /></p><p></p><p>从上图中，我们可以看到，左边是实体在虚拟世界的一个数字镜像，右边是现实世界的产品。我们认为，一个产品最早都是从虚拟开始的，包括需求调研、功能设计、逻辑设计，到三维模型定义，以及后面的仿真验证、工艺设计，再到产线上把实物制造出来。</p><p></p><p>虚实之间的关系，首先是一个从虚到实的过程（称为V2R，Virtual to Real）。在虚拟世界里，经过研发、设计并且制造出来的物理实体，最后要交付给客户进行实际的使用或者运行。而在运行过程中，会产生大量的数据，包括IoT数据以及使用过程中机器的传感器数据等等。</p><p></p><p>所以，这时候还会有另外一个回路，我们称为R2V，即从Real到Virtual的过程。也就是说，我们在现实世界中获取到的知识、积累的数据会反馈到虚拟世界，对虚拟世界的下一代产品提供更多提升、创新的机会。</p><p></p><p>这就是虚拟孪生的重要目的，即利用数字化的手段从性能表现、成本控制等各个方面去更好地改造我们的现实世界。</p><p></p><p>另外，对于我们国家而言，虚拟孪生的意义可能还要更加具像化。根据我国的发展规划，到2035年，要实现人均国民生产总值2万到3万美元的跨越，而要实现这个远景目标，一个重要的途径就是高质量发展。落实高质量发展，主要有两大抓手，一是<a href=\"https://www.infoq.cn/article/LBC3Rujd6xFoYfS2duGf\">数字经济</a>\"，二是绿色发展，其中数字经济又包括了数字产业化和产业数字化。而我们认为，虚拟孪生概念很好地贴合了产业数字化的发展课题，它能够更好地帮助企业利用数字技术改造传统制造业。</p><p></p><p>那么，如何构建虚拟孪生呢？它有三个基本要素，分别是数字模型、全量全要素数据，以及人的协作。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/a9/a9c7b87b9bb719e02a9f893f09815698.png\" /></p><p></p><p>其中，模型指的就是在数字世界中的精准模型，从广义上来说，它们不仅仅是大家比较熟悉的三维模型，还包含了产品前端市场需求分解后的工程需求模型体系，以及前面提到的功能设计、逻辑设计、仿真、工艺设计再到三维建模的体系化的工程模型体系，同时也包括产线的布局规划，比如产线机器人如何运作等等；</p><p></p><p>第二个要素是<a href=\"https://www.infoq.cn/article/Au8A0GLJcHPNJQp3Vizx\">数据</a>\"，也就是在模型的基础上叠加全量、全要素的数据。所谓全量，指的是深度的问题，也就是说数据数量必须要足够完整，而全要素指的是数据的种类和维度必须齐全，它们将影响模型的精准度；</p><p></p><p>第三个要素是人的协作。因为不管技术如何演进，最终的产品都是为人服务的，因此，我们希望在构建虚拟孪生的过程中，不仅要整合企业内部的员工，还要从研发、工艺到设计和供应链，实现跨生态链的连接，把供应商体系、消费者等角色也纳入进来，从而确保产品在整个全生命周期过程中，都有更好的体验。</p><p></p><h2>虚拟孪生如何在产品全生命周期发挥作用</h2><p></p><p></p><p>下面具体看看虚拟孪生在整个产品全生命周期的各个阶段如何发挥作用。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/f6/f60bd6b5fbe5fdd8513be223dfcfed5d.png\" /></p><p></p><p>首先，从设计阶段开始，以动力电池行业为例，对于电芯、电池包等这些原材料的选择，整个过程就可以放到虚拟环境中进行，比如对电池的分子级别的分析，对电池包热分析、老化分析、强度的仿真等等；再比如汽车行业的自动驾驶技术研发，如果要在物理世界对自动驾驶进行合规性认证，需要一辆车日夜不停地跑数百年的时间，才能完成所有场景的验证，这时候，只需要把车辆的动力学模型，叠加上环境模型，放到虚拟世界进行充分的仿真验证，就可以快速推动自动驾驶技术的研发速度和技术成熟度。</p><p></p><p>往下，进入工艺设计、规划阶段，这个过程要看工装设备、<a href=\"https://www.infoq.cn/article/1fSLGpl1K3OYX6AgLZ34\">产线机器人</a>\"、总装线的布局等等是否合理。还以汽车为例，比如从冲压、焊装、涂装再到总装，机器人效率是否够高，产线整体节能减排效果是否最优，机械臂是否都达到了规范的操作角度等等，这些问题都可以反馈到虚拟孪生系统中进行仿真和评估。</p><p></p><p>再往后是制造和供应链环节，在这个过程中，企业需要考虑市场需求与产线生产能力的匹配，包括生产的排程等等，这些规划在正式投产之前就可以先在虚拟环境进行分析验证。而在具体制造过程中，关键是生产的执行、产线设备状况、产品质量管理、仓库管理等等，每个环节相关数据的收集，最后都会反馈到具体的制造执行中。</p><p></p><p>最后是服务环节，比如利用大数据分析和仿真模拟，可以进行预防性的维修保养，在产品还没有发生问题的时候，就可以提前提出维修保养的时间建议，甚至为其提前准备好维护的零部件，从而降低产品运行过程中可能发生的宕机的概率和时间。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/da/da3763085134407613094b00b983e61b.png\" /></p><p>虚拟孪生在航空业产品全生命周期的应用</p><p></p><h2>虚拟孪生应用案例及未来展望</h2><p></p><p></p><p>以下跟大家分享几个虚拟孪生的典型应用案例：</p><p></p><p>第一个是优化产线布局的案例。大家知道，如果一个产线真正布置到车间里之后发现问题再进行调整和优化，成本是非常高的，因此，我们帮助一个客户在产线设计阶段就完成了完整的虚拟验证，验证每个机器人和工作单元是不是进行了最优的操作，产线的节拍是否合适，从而保证产线在真正进入工厂之后，能够一次性成功投产，并且布局效能最高。</p><p></p><p>第二个是服务优化的案例。以航空发动机为例，它是飞机的核心部件，只有使得飞机飞起来才能创造价值，停在地面都是成本，所以，我们可以利用虚拟孪生为航空发动机提供设备服务保障，确保它的可靠运行，减少故障带来的成本损失。</p><p></p><p>比如，在运行过程中，航空发动机上大量传感器会持续把运行数据传输到地面的数据中心，在拿到这些数据之后，我们就可以进行充分的分析，一旦发现故障可能性，就可以及时采取应对措施，包括预测分析发动机可能在多长时间后发生什么类型的故障，然后提前在相应的维修网点配备维修备件，在飞机抵达目的地之后及时提供备件更换服务，确保发动机的可靠性。</p><p></p><p>第三个是产品设计环节的案例。我们知道，快消品行业非常注重对用户需求满足和体验优化，但与此同时，还要兼顾成本控制。这时候，可以在设计研发阶段引入虚拟孪生，通过反复的What-If分析，评估采用方案A和方案B的结果，目标成本可以达到什么程度，具体可以满足哪些客户需求等等，通过在设计阶段进行多方案的比对，从而在成本控制和客户需求之间达到一个更优的平衡。</p><p></p><p>最后，展望虚拟孪生技术，我们认为，它不仅可以赋能制造业的产品生命周期过程，甚至还可以在生命科学等领域创造价值。比如，对于医生来说，可以在为病人进行手术之前，在虚拟孪生环境基于相关的模型进行虚拟演练，从而提高手术的成功率，为病人提供更好的医疗服务。这实际上就体现了达索系统通过虚拟孪生实现产品、自然与生命的和谐状态的企业宗旨。</p><p></p><h4>嘉宾介绍：</h4><p></p><p>杨宠，达索系统技术咨询部业务咨询高级经理。华中科技大学工学博士。曾供职于盖德信息技术有限公司 、国际商业机器有限公司（IBM） 、参数技术软件有限公司（PTC） ，为多家制造业企业提供过业务咨询和数字化咨询服务。</p><p></p><p>延展阅读：<a href=\"https://www.infoq.cn/article/1fSLGpl1K3OYX6AgLZ34\">《揭秘“灯塔工厂”的 AI 应用案例和规模化策略》</a>\"</p>",
    "publish_time": "2023-07-24 08:30:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]