[
  {
    "title": "支撑百万行代码核心系统运转，太平洋保险与OceanBase的升级之路",
    "url": "https://www.infoq.cn/article/fGutdaZ4SmcEjS9BDV9r",
    "summary": "<p>根据国资委 79 号文件，关键行业、关键企业被要求到 2027 年百分百完成信创替代，替换范围包括芯片、操作系统、中间件、数据库等领域。这也意味着：自 2023 年开始，企业将进入信创关键成果期，没有太多试错可能，每一个环节的选型都需要慎重抉择，才有可能在 2027 年完成信创体系的整体建立。</p><p></p><p>作为基础软件的关键一环，数据库选型一直是很多企业头疼的问题，一旦选错将会影响未来数年甚至更久的业务开展，尤其是在当前信创体系建设的关键成果期，时间紧张，更换难度极高。据相关媒体统计，国内市场当前存在二百多种数据库产品，这无疑大大增加了选型难度。</p><p></p><p>那么，如何从广泛的产品中选择一款符合信创要求的数据库，并保证其与整个信创体系的上下游完美适配？解绑 Oracle 只是其中一环，如何做到与广泛存在的 Oracle 相关服务全面解绑？更换为国产数据库之后，如何保证性能不受影响，甚至还能有所提升？这些问题，太平洋保险用了一年的亲身实践给出了答案。</p><p></p><h1>成功解绑，一年完成 80 余个重要业务全栈国产升级</h1><p></p><p></p><p>作为国内金融保险头部企业之一，太平洋保险在 2022 年底完成了 80 余个重要业务系统的全栈国产升级。据悉，太平洋保险在硬件上选用了海光芯片，在软件上选用了 OceanBase 分布式数据库和统信 UOS 操作系统软件系统。</p><p></p><p>2021 年初，太平洋保险启动了国产分布式数据库的调研工作，从功能、性能、易用性、完整性、可移植性、可靠性、扩展性、安全性等指标进行综合评估，最终选择用 OceanBase 进行数据库的升级。</p><p></p><p>一方面，作为自 2010 年开始完全自主研发的分布式关系型数据库，OceanBase 连续 10 年稳定支撑双 11，如今已应用于超过 1/4 国内头部金融机构，高可用、高性能、在线扩展等已经完成验证，高度兼容 SQL 标准和主流关系数据库，并且成本相对较低。</p><p></p><p>另一方面，OceanBase 本身已与信创体系广泛的上下游完成了适配，可以在企业内部与其他国产软硬件高效协同。</p><p></p><p>在评估阶段，太平洋保险遇到的一大核心难关是原有体系与传统数据库绑定过深。太平洋保险此次首先升级的核心系统“太保 95500 客服系统”（下文简称：P17），拥有百万行代码，与传统数据库绑定程度非常深，还采用了很多传统数据库生态的配套产品，如自定义锁、自治事务、嵌套表、索引组织表、cognos 等。</p><p></p><p>作为太保产、寿、健康、长江等所有子公司客服系统的整合，P17 涵盖了几乎所有子公司业务的服务入口功能，对于系统时效性、数据流转的稳定性、复杂报表处理和响应速度的要求非常高。这意味着 P17 这款在太平洋保险最“古老”的系统之一，不仅在过去累积使用了非常多以传统数据库为主的适配工具，还在内部处于“牵一发动全身”的地位。</p><p></p><p>不仅如此，太平洋保险还希望替换传统数据库服务器，包括 OLTP 以及 OLAP 类型的应用，解决服务总体拥有成本高以及每年维保费用高的问题。</p><p></p><p>借着将数据库升级至国产数据库的机会，太平洋保险还希望建立分布式数据库服务能力体系，提升 IT 中心对于分布式数据库从设计、开发、质量到运维的技术自主掌控能力，真正用好分布式数据库技术，实现企业整体降本增效的目的。</p><p></p><p>如上诉求意味着，太平洋保险需要准备好传统数据库生态产品替换的全套方案及相关预案，新的数据库不仅要支持过去所有的业务数据架构，还要能够面向未来具备可扩展性。</p><p></p><h1>全面迁移：交易成功率达四个九，性能全面提升</h1><p></p><p></p><p>数据库选型确定后，由太保集团数智研究院、P17 项目组、数据库团队与 OceanBase 厂商组成的联合攻坚组，共同协作进行技术和项目攻坚，共梳理出 321 个 oracleJob、176 张 cognos 报表、665 项视图改造、15 项五千五百多处语法兼容改造，以及针对 DS 的数据导入导出组件重构等。攻坚组用国产分布式架构彻底替代传统商用主备架构，重点破除数据库与操作系统、中间件之间的耦合。</p><p></p><p>如何低成本平稳升级？项目组巧妙地利用 OceanBase 单集群内同时兼容 MySQL 和 Oracle 两种主流数据库生态，实现了分散业务系统的全面整合，最大程度降低了现有系统的扩展和迁移改造成本；利用迁移评估、数据迁移、实时数据同步和增量数据订阅于一体的数据传输服务，实现了低风险、低成本、高效率的数据流通，构建了稳定、安全的数据架构。据悉，在 OceanBase 为太平洋保险打造的智能决策服务平台中，MySQL 租户与寿险统一承保平台 oracle 租户共用集群，总计 40 个集群里有 20 个 MySQL 租户，140 多个 Oracle 租户。</p><p></p><p>“我们厂商跟用户侧希望达到的效果是稳定与原数据库兼容，给到用户侧信心，让双方的工作变简单，变得标准化、流程化、制式化，使双方降低人力投入。”蚂蚁集团 OceanBase 华东区金融技术服务总监郭文谈道。</p><p></p><p>在标准化兼容过程中，项目组从寿险、科技到产险，到健康险和后续的养老险，已经实现了数百套系统的落地实践；制定 33 类标准规范和 28 类最佳实践，打磨出 16 款数据库的专项工具，攻坚各项难点，最终实现目标。</p><p></p><p>在建设整体分布式数据库服务能力体系时，项目组从数据库应用设计、存储、转储等方面优化出了全栈信创分布式数据库功能架构。</p><p></p><p>具体而言，项目组对于 OceanBase 应用设计原则是尽可能让数据访问、操作在内存中完成，每天定期合并释放 memstore 内存及删除记录空间，最大限度减少写放大、读放大。基于 OceanBase 存储架构，项目组在设计集群时核心业务系统集群独立部署，控制集群租户数量、合理利用分区优化数据生命周期管理，以最小化容灾、备份数据集，减少转储次数进而减少非计划合并次数，避免读毛刺现象。</p><p></p><p>工具创新让数据库系统升级得以顺利加速推进。项目组自研了“指南针”、索引建议助手、OMS 迁移工具等。以应用改造预评估工具“指南针”为例，它能够对 Oracle 数据库进行改造全面评估预扫描，包括近 20 个检查大类近 200 多个检查项，能够对存储过程代码进行扫描分析，并给出问题原因、代码位置、建议，弥补了存储过程改造问题排查工具的空白；能够辅助识别冗余大表、冗余索引，有助“数据库减负”。“指南针”提升了项目组问题排查的效率，缩短了项目周期从而降低应用改造成本。</p><p></p><p>在 P17 系统迁移过程中，“指南针”扫描出了约 6000 个改造项。如果采用人工方式进行排查，平均每 2 个问题需要 1 小时。对比来看，“指南针”为单个项目节约人力成本 12.6 人月。</p><p></p><p>“OceanBase 存储的压缩性能非常卓越，很省硬件成本”，太保集团数智研究院首席数据库专家林春解释道，保险企业都有很多大数据库，面临很大的分布式改造压力，但是迁移到 OceanBase 后不用再做分布式改造了，又能做到数据资源密集利用，非常有价值。</p><p></p><p>OceanBase 无损容灾、异地多活技术和混合负载（HTAP）的高性能分布式计算引擎能力再一次经受住了考验。据悉，项目组将 Paxos 一致性算法运用于数据库主备副本之间的同步，实现了在多数派副本正常的情况下保证数据不丢失和服务不中断（RPO=0，RTO&lt;30）；通过改进 LSM 树解决了集中式数据库无法平衡“性能”和“压缩”的难题，降低了海量数据存储的成本；通过向量化引擎、优化器改写优化能力和大规模分布式并行执行技术显著提升了处理性能。</p><p></p><p>OceanBase 让太平洋保险对于数据库系统有了更强的掌控力。林春表示：“选择一个国产的分布式数据库，最重要的就是技术兜底能力。那么，bug 的修复就是技术兜底能力一个很好的印证。如果你没有对内核的掌控，没有办法以这么快的速度修复 bug。”OceanBase 400 多万行代码都是自己一行一行写出来的，蚂蚁集团 OceanBase 副总裁王爽谈道：“完全自主研发，完全可控，我们不依赖于任何一个开源软件。”</p><p></p><p>从 2022 年 12 月 18 号至今，P17 核心系统已经成功运行了 200 多天，确保太平洋保险交易成功率达到了 99.99%。过往，很多人对国产数据库的评价是：需要几个不同的数据库组合在一起才能达到原来一个传统数据库的性能。如今，太平洋保险使用 OceanBase 数据库实现了寿险交易系统的替换，监管报送批量场景性能提升 3 倍。</p><p></p><p>现在，太平洋保险全栈信创数据库已投产上线并在稳定运行。据悉，在保持高运行性能、高可用能力的同时，太平洋保险数据库软件维保费用大幅降低，设备投入也得到节省。其中，OceanBase 的高级压缩技术，结合“数据库瘦身”，让太平洋保险的存储容量平均节省 80% 以上。与此同时，太平洋保险分析型数据库的数据加工处理能力提升 10 倍，构建起了全面的实时数据处理和服务能力。应用系统方面，太平洋保险全栈信创数据库的弹性扩缩容、处理速度、数据加工能力均实现大幅提升，为集团数字化转型打下了坚实的技术基础。</p><p></p><p>如果说 P17 客服系统成功完成 OceanBase 迁移上线并平稳运行，是太保集团第一个核心攻坚成功的信创数字化转型标杆系统，具有里程碑意义；那么可以说，太保集团的全栈国产化实践则为金融保险行业起到了很好的示范作用。</p><p></p><p>在蚂蚁集团 OceanBase 副总裁王爽看来：“信创不是简单替换，关键是带来的好处是什么？我们认为集中式数据库或传统的数据库转向分布式数据库，是一次对系统实现升级的机会。我跟很多用户聊过，目前分布式数据库的性能已经不是问题，稳定性才是所有升级的第一要素。信创首先是‘创’，然后才是‘信’。创是一定要有创新，信是可控，所以我们认为实现可持续的自主可控才是符合信创标准的产品。”OceanBase 满足了“数字经济”时代各行业数字化转型对基础设施架构的新需要。</p>",
    "publish_time": "2023-07-20 00:04:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "持续集成的关键：产品反馈驱动创实践",
    "url": "https://www.infoq.cn/article/wYLteaRbYxU8pgQIairg",
    "summary": "<p>缩短持续集成（CI）系统的反馈时间并优化测试方法和类，可为开发团队带来更为有效的反馈。据 Tobias Geyer 所说，CI 系统是开发过程中的重要一部分，且应被重视起来。</p><p></p><p>Tobias Geyer 在<a href=\"https://romaniatesting.ro/\">2023年罗马尼亚测试大会</a>\"上以测试人员的身份谈到了集成系统的改进问题。</p><p>在 Geyer 刚入职时，公司的持续集成系统是一台堆在桌子底下的老旧开发电脑，没人负责也没人有时间做维护。他说，这台电脑的速度太慢导致反馈周期非常长，开发人员完全忽视了 CI 系统的反馈。</p><p></p><p>Geyer 称，优化反馈时间的一个捷径是在工作时间跳过不必要的构建步骤，并将构建限制为每晚一次。</p><p>一个更难处理的瓶颈问题则是磁盘的 I/O。构建读取和写入的数据量太大，磁盘没办法跟得上。Geyer 说他最后找到 IT 部门的人把 CI 系统从开发电脑挪到了数据中心的虚拟机上，解决了磁盘的 I/O 问题，并将系统扩展到了两台机器上，使其能够并行运行更多的构建。</p><p></p><p>他们将测试按执行快慢分为几类，在快反馈 CI 构建中只运行测试的一个子集，速度慢的测试则被放到了执行频率更低的专用构建中。Geyer 解释道，这么做让他们得到的反馈依旧完整，且大部分反馈要比之前快上许多。</p><p></p><p>Geyer 描述了他们是如何优化测试的方法和类：</p><p></p><p></p><blockquote>在找出运行缓慢的测试后，我们将其当作技术债务来处理。为改进测试，我们给开发者们提出了“测试债务预算”，开发者们对这些问题的处理方式各不相同：将测试数据精简，只保留有关数据，从而缩短测试的设置时间引入模拟测试，不再需要预加载任何测试数据让产品代码更具可测试性，使原本需要集成测试的部分可被单元测试替代完成</blockquote><p></p><p></p><p>Geyer 总结，不一定要深刻理解技术领域才能带来影响：</p><p></p><p></p><blockquote>我可以利用我测量、实验和协作的测试技巧让事情变得更好，即使这也意味着别人必须去完成实际的实施工作。</blockquote><p></p><p></p><p>InfoQ 就 CI 系统的改进话题采访了 Tobias Geyer。</p><p></p><p>InfoQ：可以给出一个跳过构建步骤的例子吗？</p><p></p><p></p><blockquote>Tobias Geyer：效果最明显的例子是我们的产品混淆。每个产品构建在交付给客户之前都会被混淆，而这些被混淆的产品很明显是需要经过测试的。但产品混淆过程至少需要三十分钟，因此我们在白天跳过这一步骤，并在晚上将产品混淆并进行测试。</blockquote><p></p><p></p><p>InfoQ：你们对构建过程和平台有什么重要的变动吗？</p><p></p><p></p><blockquote>Geyer：我们将我们的构建系统从 Ant 和 Windows 的批处理迁移到了 Gradle。主要工作是由我们的团队中的开发者们完成，我负责处理所有与测试执行相关的工作。引入测试 CI 系统这一改变虽然明显但仍然重要，我们得以在不中断正常开发流程的前提下，准备并测试 CI 系统中的变更（如插件更新、新增构建节点等等）。</blockquote><p></p><p></p><p>InfoQ：你们是如何鼓励在不同团队间的持续集成知识共享？</p><p></p><p></p><blockquote>Geyer：我是在公司的其他部门中寻找有过在 CI 系统上工作经历且具备类似技术栈的人。我们定期开会讨论（CI 系统）最近更新和大家所面临的问题。很多时候某个团队对问题的解决方案是可以被复用的。能看到其他人的进展和他们的结果是很好的。有时候一些团队想要引入的变更会在他们的团队内部遇到阻力，“其他团队有过这方面的正向经验”，这句话有助于说服他人。</blockquote><p></p><p></p><p>InfoQ：对于不满自己 CI 解决方案的团队，你有什么建议吗？</p><p></p><p></p><blockquote>Geyer：像是对待其他软件开发项目一样看待（CI 系统）。把困扰自己的问题列出来，用对待 bug 的方式处理它们。也就是说，对这些问题进行优先级排序、分析，并合作修复。我想强调“合作”这点，和 IT 部门的探讨对我们修复部分问题而言至关重要。</blockquote><p></p><p></p><p>原文链接：</p><p><a href=\"https://www.infoq.com/news/2023/06/CI-product-feedback/\">Treat Your CI System as a Product for Faster and Better Feedback</a>\"</p><p></p><p>相关阅读：</p><p><a href=\"https://www.infoq.cn/article/H7CJpGyk0BRjUTAqIXbM\">Terraform引入新的CI/CD工具，增加对Azure Linux的支持</a>\"</p><p><a href=\"https://www.infoq.cn/article/LFa4ESMJOMY66HtTjYsG\">中国企业研发高效能白皮书-CI/CD篇</a>\"</p>",
    "publish_time": "2023-07-20 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "零代码应用实例",
    "url": "https://www.infoq.cn/article/s3MWmlribcpmjKQZeNI6",
    "summary": "<p>明道云迄今已经发布过《各行业零代码应用案例集锦》，也发表了我们服务各行业标杆客户的客户故事。不少客户表示：案例看过无数，但还是缺少了一些真实上手的感觉，有限的文字难以充分表达客户的使用效果和案例中的精妙设计。<br />\n为此，明道云正式推出《零代码应用实例》（No Code, True Case）系列内容。它将收录明道云团队为真实客户做过的POC应用或脱敏后的交付项目，你可以免费下载安装这些应用，亲自上手体验。<br />\n作为首卷《零代码应用实例》，我们优先把绝大部分企业都需要的人事、财务费控、销售管理应用实例收录其中。此外还有建材行业的复杂报价系统、软件行业的项目管理，以及内外协同的工单中心，展示明道云在不同行业的需求满足度和使用灵活性。后续，我们将继续增添更多具备行业代表性和参考价值的应用实例。<br />\n事不宜迟，点击下载，即可领取《零代码应用实例》。</p>\n<h3>目录：</h3>\n<ul>\n<li>导语</li>\n<li>全人事管理</li>\n<li>销售漏斗管理</li>\n<li>复杂报价系统</li>\n<li>软件项目管理</li>\n<li>内外协同的工单中心</li>\n<li>RPIC：一个简明的信息架构方法</li>\n<li>关于明道云</li>\n</ul>",
    "publish_time": "2023-07-20 08:33:15",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "钉钉音视频算法开放升级：远场拾音等技术被应用于多款生态硬件产品",
    "url": "https://www.infoq.cn/article/cprBlO6ku2rN9O7IhECE",
    "summary": "<p>7月19日，钉钉音视频在InfoComm北京展会上公布最新生态开放进展：截至目前，硬件生态合作伙伴已突破70家，认证品牌达50家，认证硬件已超过250款，覆盖会议大屏、分体式设备、视频会议一体机、USB音视频外设等。基于钉钉音视频的算法开放新策略，远场拾音、智能导播、智能音频算法等技术已被应用在英特尔、影石Insta360、创通联达等硬件厂商的多款生态硬件中。</p><p></p><p>此外，钉钉会议的一系列产品升级也集中亮相，通过融入<a href=\"https://www.infoq.cn/article/6YjkNdjohVMLBYeM9j6G\">AI技术</a>\"，为用户、生态伙伴提供更智能、高效的云会议产品，新增功能包含：会议智能纪要、对话控制会议操作、对话生成虚拟背景等。</p><p></p><h3>音视频生态持续扩大，亿联、新华三等品牌加入钉钉朋友圈</h3><p></p><p></p><p>钉钉音视频朋友圈再扩容，亿联、新华三等品牌加入，目前合作伙伴数量已突破70家。</p><p></p><p>InfoComm现场，钉钉联合TCL、鸿合、Insta360、联想等30多家行业领先硬件品牌联合展示了软硬一体的视频会议解决方案，其中也包含与MAXHUB、罗技、Jabra等硬件厂商发布的多款钉钉会议Rooms专款解决方案，让人与人、会议室与人、会议室与会议室之间的协作更加高效。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/57/af/579e010fcbab32b9e42d5e9bcc9f44af.png\" /></p><p></p><p>去年3月，钉钉音视频就宣布硬件全面生态化，面向生态开放音视频的五大认证体系，包括Rooms认证、Sip认证、钉闪会认证、模组认证、外设认证。除了基础的认证合作，钉钉音视频也在持续发掘用户与生态伙伴的更深层次需求，逐步开放自己最核心的音视频算法与工程化能力，与硬件伙伴做产品共创，这是钉钉音视频生态开放的更进一步。</p><p></p><h3>音视频开放算法已商用落地，远场拾音等技术被应用于多款生态硬件</h3><p></p><p></p><p>在InfoComm展会上，钉钉音视频事业部负责人赵加雨介绍，目前钉钉的音视频开放算法已商用落地，远场拾音、智能导播、智能音频算法等技术已被应用于英特尔、影石Insta360、创通联达等厂商的合作硬件产品中。钉钉将这些核心技术原子化后，以算法、软件、硬件、整机等多种方式向产业链伙伴开放，联合打造体验更佳的软硬一体视频会议产品。对于企业来说，则可以根据预算、使用习惯、会议室规模，灵活采购不同的解决方案，享受更智能的音视频会议体验。</p><p></p><p>视频会议行业这几年经历了很大的变化。随着企业恢复线下办公、混合办公成为常态后，越来越多的硬件厂商加入到这一赛道中，音视频软硬一体解决方案也就成了行业市场的重要命题。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/5e/0f/5e1717a12078e518f4a536e6b937780f.png\" /></p><p></p><p>赵加雨表示，传统或跨行的硬件厂商想要进入视频会议行业，会受限于音视频应用对于音频质量、实时性、视频质量等方面的门槛制约。而此番钉钉音视频的开放升级，正是为了提供一个不仅开放流量、也开放技术的平台，与产业链硬件厂商优势互补，提升他们的产品能力，并降低视频会议行业的准入门槛，构建一个开放共赢的合作生态。</p><p></p><h3>视频会议融入AI，升级推出会议智能纪要、对话控制会议操作能力</h3><p></p><p></p><p>面向AI时代，钉钉视频会议率先将最新的AI大模型能力落地于开会协作场景，后续可通过唤起“/”斜杠智能助手，实现一系列<a href=\"https://xie.infoq.cn/article/9c7fe60d095aca8ac0f5168b1\">智能化</a>\"的功能，比如：</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/c9/d8/c9650bb05d47831234738c7f0eb605d8.png\" /></p><p></p><p>升级钉钉闪记功能，不仅能生成一份含速记、音频和视频画面的完整会议纪要，自动整理摘要与代办，还能将录制内容智能分章节、分发言人，方便用户一键回顾定位。此外，钉钉闪记不仅可以在会后帮用户做总结，在会中也可以一键唤起，为用户总结前面大家讨论的内容，让后加入会议的成员快速了解会议讨论的背景；</p><p></p><p>推出对话控制会议操作功能，用户通过自然语言就能完成各种指令，比如让智能助理帮你投屏、开美颜、设置全员静音等，无需再关心具体功能的入口。同时，用户还可以向智能助理提问，如“听不到声音、怎么加人、等候室怎么使用”，降低产品的使用门槛；</p><p></p><p>推出对话生成虚拟背景功能，引入大模型文生图能力，通过自然语言帮助用户生成个性化虚拟背景，提升开会氛围。</p><p></p><p>赵加雨表示，作为目前中国最多人使用的视频会议产品之一，钉钉音视频将始终致力于实现企业、用户全面数字化的工作方式，利用新的技术拓展新的场景，并通过更深层次的开放策略推动音视频行业、产业链的升级发展。</p>",
    "publish_time": "2023-07-20 10:40:37",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "揭秘高新技术发展最新趋势，程序猿视角下的技术革新感悟 ｜ 社区征文",
    "url": "https://www.infoq.cn/article/95af9d8f5d24e2880e11938d2",
    "summary": "<p></p><h2>目录</h2><p></p><p>引言功能实践，生成式 AI 到底靠谱么？影响深远，数据架构真的很强大么？程序员内耗，低代码已经”过气“了么？降本增效，软件框架真的有那么强大么？新兴技术未来发展方向新型技术未来面临挑战结语</p><p></p><h2>引言</h2><p></p><p></p><blockquote>在过去的半年时间里，随着全球数字化进程的进一步加快，新兴技术在各行各业得到了广泛的应用，并对社会和经济产生了深远的影响。一直处于蓬勃发展的IT圈，高新技术的诞生和发展层出不穷，未来的高新技术发展方向在哪里？能给人类带来什么样的影响？接下来将对其中几个比较火的领域进行盘点，探讨它们对行业、社会和个人生活的影响，并展望未来可能带来的机遇和挑战。</blockquote><p></p><p></p><h2>功能实践，生成式 AI 到底靠谱么？</h2><p></p><p>首先来了解一下生成式AI，生成式 AI 是指通过机器学习算法，让计算机能够从给定的数据中生成新的、合理的数据。截至目前，生成式 AI 已经在图像处理、语音识别、自然语言处理等领域得到广泛应用。比如，图像生成模型可以生成逼真的照片，语音生成模型可以生成流畅自然的语音，甚至在音视频比较火的当下，可以生成出比真人还要真的AI主播。</p><p>&nbsp;</p><p>此外，生成式 AI 对于行业和社会的影响也是非常深远的。生成式AI的重点发展领域还有很多，比如，在医疗行业中，生成式 AI 可以帮助医生更快、更准地诊断病情，提高诊断准确率；在金融行业中，生成式 AI 可以帮助分析师更准确地预测股票走势，提高投资效益；在文化艺术领域中，生成式 AI 可以创造出更多样化、更具创意性的艺术作品。</p><p>&nbsp;</p><p>个人认为，在未来一段时期内，生成式 AI 还有很大的发展空间。比如，它可以用于为游戏开发者创造出更具有冒险性质的游戏世界，为 VR 设备提供更多样化、更逼真的场景和角色。此外，深度学习和内容生成技术，可以让聊天机器人和虚拟助手能够帮助企业自动化人工日常执行的任务，以及会出现更多的智能聊天机器人。最后，生成式AI可以给虚拟世界合成内容的基础，元宇宙通过这些AI生成的内容，快速且低成本地创建、维护、更新，可以成为一种全新的自动更新机制。</p><p>&nbsp;</p><p>与此同时，生成式 AI 也面临一些挑战，比如如何保证生成的数据的准确性和可靠性，数据是生成式AI的核心资源，数据质量直接关系到模型质量和输出质量，也就是数据的准确性和可靠性。</p><p>&nbsp;</p><p>以目前的阶段来说，如何获取高质量、高准确性、高可信性的数据，是一个亟待解决的课题。又如，模型的效率问题，大家都知道模型是生成式AI的核心技术，模型效率直接关乎到模型性能和输出效果，如何提高模型的训练速度、推理速度、压缩率，是一个继续完善的技术问题。再如，数据安全、隐私和伦理道德是生成式AI的核心价值体现，在技术层面干预和预防和防止潜在的数据泄露和隐私问题，以及遵循社会伦理道德，保证生成式AI的可信赖性、可持续性、透明性，这也是非常值得关注和急需解决的问题。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/67/677f4ead8285000410938244ee99e2ca.png\" /></p><p></p><p></p><h2>影响深远，数据架构真的很强大么？</h2><p></p><p>再来了解一下数据架构，数据架构指的是如何组织和管理数据的结构和流程。在过去的半年中，数据架构经历了一些重要的变革。例如，数据湖成为了新的热门技术，它可以将各种数据源汇集到一个统一的存储库中，从而更好地支持数据分析和挖掘，实现了数据的整合和统一处理。又如，用于”商业智能目的“的大规模数据存储，通过存储来自各种来源的数据，并针对查询和分析进行了优化，通常使用维度数据模型，支持更快、更高效的报告和数据分析，帮助根据数据驱动的洞察力做出更好的建议。</p><p>&nbsp;</p><p>受到企业的数字化转型进程的步伐加快的影响，数据架构对于行业和社会的影响也非常深远。比如，在医疗行业中，数据架构可以帮助医生更好地管理患者的病历和诊断结果，提高医疗服务的质量和效率。</p><p>&nbsp;</p><p>又如，在金融行业中，数据架构可以帮助分析师更好地预测市场趋势，提高投资效益，以及更好的帮助银行对用户进行风控管理工作。再如，在教育领域中，数据架构可以帮助学校教师更好地了解学生的学习情况，因材施教，提供针对性的教育工作。最后，在数据安全越来越重要当下，未来一段时间内，关于数据治理也是一个非常关键的一环，通过数据治理可以将数据作为战略资源进行管理和维护，确保数据可靠、一致，以及特定人员访问等。</p><p>&nbsp;</p><p>在未来一段时期内，数据架构将会继续发展，而且其应用场景将更加广泛。例如，在智能家居领域中，数据架构可以帮助用户更好地管理家庭设备和信息，提供更智能化、更个性化的家居服务。又如，在金融服务行业，会持续把数据中心推向云端，让公共云中的数据管理得到进一步的发展。再如，各种事务的SQL化进程，用于存储和处理大规模数据的数据库，提供高可扩展性和灵活性，也让数据库领域发生革命性的技术变革。</p><p>&nbsp;</p><p>同时，数据架构也面临着一些挑战，例如，如何保障数据的安全性和隐私性，数据权属界定不清晰，造成无法有效回应多元数据主体利益诉求，这也是在客观上阻碍了数据的顺畅流通，成为数据价值的掣肘原因。再如，如何防止数据泄露和滥用，尤其是政企数据汇集的情景下，缺乏数据安全保障、数据泄露风险应对，以及数据被滥用的现象，也是需要亟待解决的痛点。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/df/dfadc8b85b6d30f190174687bbe0ccf4.png\" /></p><p></p><p></p><h2>程序员内耗，低代码已经”过气“了么？</h2><p></p><p>关于低代码的知识点，低代码是指通过简单的可视化界面和拖拽式编程，让非专业程序员也可以轻松地开发出应用程序。在过去的半年中，低代码平台得到了广泛的关注和应用。例如，微软推出的 Power Apps 平台可以帮助企业用户快速构建企业级应用程序，而 Google 推出的 AppSheet 平台则可以帮助普通用户快速构建自己的移动应用程序，以及国内阿里巴巴推出的宜搭平台给广大企业提供一套低成本的企业应用搭建解决方案。</p><p>&nbsp;</p><p>近两年互联网行业内提出的”降本增效“，使得企业为了自身良性发展，催生了一些新的技术来支撑，低代码就是其中的一项重要技术实现，低代码对于行业和社会的影响也非常深远。例如，在企业领域中，低代码可以帮助企业更快速地开发出符合自己需求的应用程序，提高工作效率和竞争力。再如，在教育领域中，低代码可以帮助学生更容易地学习编程知识，提高编程技能和创新能力。又如，在医疗领域中，低代码可以帮助医生更快速地开发出适用于自己的医疗应用程序，提高医疗服务的质量和效率。最后，低代码也可以帮助社会团体、组织更快速地开发出适合实际需要的社会公益性应用程序，满足不同公益组织的不同需求。</p><p>&nbsp;</p><p>在未来的一段时间内，低代码平台将会继续发展，其技术会更加的成熟和完善，其应用场景将更加广泛。比如，在智能制造领域中，低代码可以帮助制造企业更快速地开发出符合自己需求的生产控制系统，提高生产效率和品质。又如，低代码会增强集成能力，加强与其他系统和服务的集成接入能力，让开发者能够更加轻松、高效地连接到各种数据源、API和第三方服务，提供更多的灵活性和功能性。再如，低代码会扩展AI和机器学习能力，未来将会集成更多的AI功能和机器学习功能，让开发人员能够利用这些技术来创建更加智能化的应用程序。最后，低代码平台会推出更多行业、领域的专业化解决方案，满足更多行业、领域的需求，方便开发者更加快速地构建适用于特定行业的应用程序。</p><p>&nbsp;</p><p>同时，低代码平台也面临着一些挑战，例如，如何保障应用程序的安全性和可靠性，因为低代码使用方便，容易被开发人员滥用，甚至为了实现效率而忽视了合规性的开发，为了加强平台的安全性，企业需要加强权限管控来控制人员的可访问性，访问权限设置依然是一个比较复杂的问题。再如，低代码平台标准化和合规性的挑战，由于低代码平台的快速发展迭代，给使用的企业带来了不小的标准化和合规性方面的挑战。最后，低代码平台以方面、快捷的开发方式而受到大规模的实际应用，但是企业实际应用中，低代码对于复杂的业务场景的支持仍有局限性，缺乏灵活性和可扩展性，这也是亟待解决的问题。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/15/15c5a330de216e1820e35b4301ce0abe.png\" /></p><p></p><p></p><h2>降本增效，软件框架真的有那么强大么？</h2><p></p><p>在过去的半年中，关于软件框架领域，如Serverless 架构、前端框架、编程语言等技术也都迎来了新的发展。例如，Serverless 架构以运行成本更低、自动扩缩容、事件驱动和NoOps，自动根据调用量扩展运行代码所需的容器，可以帮助企业降低 IT 成本，提高开发效率。又如，前端框架为前端开发提供了更加丰富的组件和工具，微前端架构、组件化、模块化等特点，举个例子，Vue 3带给开发者全新的编码体验，同时拥有强大的社区支持；还有就是微前端，把前端应用拆分成独立、可自由组合的微应用，极大提高开发效率与应用的可维护性。再如，编程语言的发展让开发人员可以更高效地编写代码，受到人工智能快速发展的影响，Python语言也得到了更好的推广和发展，Python以一种多用途、高级的编程语言，以及简洁、易读的语法而著称，Python的开发者社区和丰富的库，让它成为机器学习和数据分析等领域的首选语言。</p><p>&nbsp;</p><p>在未来一段时期内，软件框架将会继续发展，而且其应用场景将更加广泛。例如，人工智能快速发展，Python语言会得到更好的推广和发展，Python的开发者社区和丰富的库会更加的完善、多样性，让它成为更多领域的首选语言。又如，随着互联网的不断发展，Web应用程序的需求也在不断增长，因此JavaScript会继续得到发展，JavaScript还可以用于移动应用程序和桌面应用程序的开发，因此它的前景非常好。再如，随着云原生技术的不断普及和发展，逐渐演进成为一种应用云化开发、部署和运行的主流方式，Serverless 架构作为云原生开发的核心组成部分，这就让Serverless 架构更好的发展和完善，更好地帮助企业和开发者实现敏捷创新。</p><p>&nbsp;</p><p>同时，软件框架也面临着一些挑战，例如，Serverless 架构正呈现出与边缘计算等其他技术的整合、功能即服务，面临供应商锁定、估算成本难、冷启动、安全风险等挑战。再如，随着现在全球互联网大环境的恶化影响，各大互联网企业都在进行人员优化和”降本增效“的操作，对很大一部分前端开发者的工作冲击很大，很多人被迫失业，这就造成了JavaScript语言使用面的缩小，结合低代码的快速发展，前端领域的开发逐渐呈现多元化趋势，也就间接的阻碍了JavaScript的发展。再如，Python语言的自身特点，又决定了一些缺点，比如代码的可读性和可维护性，尤其是在维护和更新迭代时候经常会遇到这种情况，这也是Python语言持续普及的一个阻力点。</p><p><img src=\"https://static001.geekbang.org/infoq/e1/e130f8be902af0193c6723620cd8d92e.png\" /></p><p></p><p>这些新兴技术正在深刻改变我们的生活和工作方式，并对未来产生深远影响。例如，人工智能技术正在改变我们与世界交互的方式，大数据技术正在推动各行各业的数字化转型，云计算技术正在改变我们的生活方式。</p><p>&nbsp;</p><p></p><h2>新兴技术未来发展方向</h2><p></p><p>&nbsp;</p><p>展望未来，新兴技术将在各个领域继续发挥重要作用，推动社会和经济发展。我们可以期待，在未来的几年里，新兴技术将在以下几个方面带来更大的影响：</p><p>人工智能技术将在更多领域得到应用，并在医疗、教育、交通等领域发挥重要作用。大数据技术将帮助企业提升运营效率，发现新的商业机会。云计算技术将进一步普及，并在各行各业发挥重要作用。软件技术将更加成熟，为开发人员提供更加丰富的工具和平台。硬件技术将更加先进，为新兴技术的应用提供更加强大的支持。</p><p></p><h2>新型技术未来面临挑战</h2><p></p><p>新兴技术的快速发展，为我们带来了巨大的机遇，也带来了一些挑战。我们需要积极应对这些挑战，才能更好地利用新兴技术，推动社会和经济发展。</p><p>数据安全是新兴技术面临的一个重要挑战。随着数据量的不断增长，数据安全问题也越来越严重。我们需要加强数据安全保护，确保数据安全可靠。算法歧视是另一个新兴技术面临的挑战。人工智能算法可能会产生算法歧视，导致对某些群体的不公平对待。我们需要加强算法监管，防止算法歧视的发生。技术失业是新兴技术可能带来的另一个挑战。新兴技术可能会导致一些传统行业的衰退，从而导致技术失业。我们需要积极应对技术失业问题，帮助人们转型升级。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/fa/fa6a1da8a3a3201878ffbba43406b32f.png\" /></p><p></p><p></p><h2>结语</h2><p></p><p>新兴技术的快速发展，将给我们带来巨大的机遇和挑战。我们需要积极应对这些挑战，才能更好地利用新兴技术，推动社会和经济发展。未来，随着这些新技术的不断发展和进步，它们的应用场景将更加广泛，影响力也将更加深远。</p><p>&nbsp;</p><p>在这个快速发展的时代，我们需要不断学习和跟进新兴技术的发展动态，以保持竞争力和创新力。无论你是技术专家、从业者，还是对技术感兴趣的爱好者，都要保持一颗持续学习的心态，在自己擅长的领域持续深耕，才能牢牢把握住技术发展的方向，才能紧跟高新技术的发展步伐，才能不会被技术浪潮所淘汰！</p>",
    "publish_time": "2023-07-20 10:16:04",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "苹果市值数秒暴涨600亿美元！秘密开发大模型Apple GPT，员工自曝：复制的ChatGPT！",
    "url": "https://www.infoq.cn/article/qW7LiC9hoPEiD0MZYtDJ",
    "summary": "<p></p><blockquote>闷声干大事的苹果，还有多少惊喜是大家不知道的？</blockquote><p></p><p></p><h2>消息称苹果正秘密开发Apple GPT</h2><p></p><p>&nbsp;</p><p>据彭博社 7 月 19 日<a href=\"https://www.bloomberg.com/news/articles/2023-07-19/apple-preps-ajax-generative-ai-apple-gpt-to-rival-openai-and-google?sref=gni836kR#xj4y7vzkg\">报道</a>\"，苹果公司已经建立了一个名为“Ajax”的大语言模型框架，并在此基础上打造一款聊天机器人，有工程师将其称为“Apple GPT”。</p><p>&nbsp;</p><p>据悉，Apple GPT 的使用界面与 OpenAI 的 ChatGPT 颇为相似。苹果可能会借此机会向 OpenAI、Alphabet 旗下的谷歌和其他科技厂商的同类产品发起挑战。但截至目前，苹果还没想好要如何将这些技术交付给消费者。</p><p>&nbsp;</p><p>彭博社援引知情人士消息，最近几个月来，苹果方面已经开始将 AI 开发作为一项重要工作，有多个团队在项目中相互配合，具体工作则包括尝试解决与 AI 技术相关的潜在隐私问题。</p><p>&nbsp;</p><p>苹果公司机器学习与 AI 主管 John Giannandrea 和苹果最高软件工程主管 Craig Federighi 是这项工作的主要负责人。但知情人士提到，二人在苹果内部并未形成统一战线。Giannandrea 明确表示希望采取更为保守的作法，先观望一下其他厂商的近期进展再说。</p><p></p><h4>Apple GPT背后的大语言模型框架 Ajax</h4><p></p><p>&nbsp;</p><p>知情人士透露，苹果的大语言模型框架 Ajax 最初是在去年创建而成，旨在将苹果的机器学习开发体系统一起来。</p><p>&nbsp;</p><p>Ajax 以谷歌机器学习框架 Google Jax 为基础，苹果的系统运行在Google Cloud 云端，其云服务则由 Google Cloud、亚马逊云科技和自家基础设施共同支撑。</p><p>&nbsp;</p><p>目前，苹果已经以 Ajax 为基础，对搜索、Siri 和地图开展了 AI 相关改进。知情人士解释称，Ajax 目前正被用于创建大语言模型，并作为内部 ChatGPT 风格工具的基础。</p><p></p><h4>苹果员工：Apple GPT 是对 Bard、ChatGPT 和 Bing AI 的复制</h4><p></p><p>&nbsp;</p><p>知情人士还指出，苹果的这款聊天机器人是一支小型工程团队去年年底的实验性产物。虽然曾尝试在苹果内部推出，但最终因生成式 AI 的安全问题而被叫停。随后苹果加大了人员投入规模，不过目前这套系统仍须特殊批准方可访问。另外还有一项重要警告：其任何输出结果均不可用于面向客户的功能开发。</p><p>&nbsp;</p><p>尽管如此，苹果员工仍在使用 Apple GPT 协助产品的原型设计，它还能根据接触过的训练数据总结文本并回答问题。</p><p>&nbsp;</p><p>苹果员工提到，该公司的工具实际上就是对 Bard、ChatGPT 和 Bing AI 的复制，并不包含任何新颖的功能或技术。该系统能够以 Web 应用的形式开放访问，且在设计上极为精简、并不适合公众使用。因此，苹果目前还没有对外发布的计划，只是在积极改进其底层模型。</p><p>&nbsp;</p><p>除此之外，苹果也在尝试确定消费者到底如何看待生成式 AI 技术。该公司目前正陆续开展多项举措——包括跨 AI、软件工程团队以及云服务工程团队间的协同努力，为一切重要的新功能提供基础设施。尽管苹果方面尚未制定具体计划，但知情人士认为该公司应该会在明年内发布一项关于 AI 的重大公告。</p><p></p><h2>苹果AI，从领先者变成落后者</h2><p></p><p>&nbsp;</p><p>最近几个月，生成式 AI 技术浪潮席卷全球，国内外多个巨头纷纷入局，相继推出 AI 大模型。一片喧嚣下，苹果始终保持低调，一直没有在公开场合提到自家 AI 大模型进展。</p><p>&nbsp;</p><p>如今随着消息的曝出，苹果 AI 大模型终于不再蒙上一层面纱。市场也给出了积极反应，7 月 19 日苹果股价最高上涨了 2.3%，刷新盘中历史高位至 198.23 美元。评论称几秒内苹果的市值就暴增了超过 600 亿美元。</p><p>&nbsp;</p><p>尽管市场反响热烈，但一些技术专家认为苹果在人工智能方面的进展可能有点太慢了。</p><p>&nbsp;</p><p>科技分析师兼策略师 Michael Gartenberg 表示，苹果在人工智能领域已经落后，因为苹果设备的人工智能语音助手 Siri 等功能远不如最新的生成式人工智能工具先进。Gartenberg 评论道：“在人工智能方面，尤其是 Siri，苹果已经从领先者变成了落后者。”</p><p>&nbsp;</p><p><a href=\"https://www.infoq.cn/article/XmxcLr0ezIK4hWoeBjLO\">Siri 语音助手</a>\"作为苹果主要 AI 产品，近年来始终停滞不前。</p><p>&nbsp;</p><p>有分析认为，苹果的技术发展理念给 Siri 压上了一块沉重的大石。The Information 报道称，苹果公司高管 Richard Williamson 拍板决定每年只对 Siri 进行一次更新，用以匹配公司其他新款硬件和 iOS 系统的更新节奏。这显然会拖慢 Siri 的前进脚步。但 Williamson 本人随后驳斥了这种说法，还带头在 2012 年灾难性的 Apple Maps 功能推出时提出离职。另一位同样先后参与过 Siri 与 Apple Maps 项目的高管 Scott Forstall 也在同年离职。</p><p>&nbsp;</p><p>也有声音认为，苹果的“围墙花园”理念阻碍了 Siri 的进步，导致其在调用 iOS 功能时表现不错，但却很难与第三方服务顺畅对接。</p><p>&nbsp;</p><p>此外，苹果内部出现了管理职能障碍，Siri 项目不断经历着走马换将，策略连续性的缺失也让情况不断恶化。2018 年，The Information 发布了一份关于 Siri 团队成员变动的报告。可以看到，苹果内部对于 Siri 的基本定位出现了难以调和的分歧 —— 到底该专注于搜索/检索功能，还是成长为能执行复杂任务的助手？</p><p>&nbsp;</p><p>这些分歧源自 Steve Jobs 本人最初给 Siri 定下的框架，但随后演变成不同派系之间“争抢地盘与话语权的对抗”。正如一位前苹果员工在接受 The Information 采访时所言，“Jobs 在 Siri 推出后的第二天去世了，苹果也由此失掉了前进的方向。”这样的论断，确实符合 Siri 在之后多年里停滞不前的客观现实。</p><p></p><h2>苹果如何应对 AI 大模型风暴？</h2><p></p><p>&nbsp;</p><p>在 AI 大模型浪潮出现以前，苹果还能拿出 Siri 与其他 AI 产品相抗衡。2018 年，苹果聘请了曾在谷歌负责搜索和 AI 业务的 Giannandrea，由其负责扩大苹果的 AI 业务。</p><p>&nbsp;</p><p>随着去年 OpenAI&nbsp;ChatGPT、谷歌 Bard 和微软 Bing AI 的相继推出，苹果明显被打得措手不及。尽管苹果多年来一直尝试将 AI 功能整合进自家产品，但如今却在熙熙攘攘的生成式工具市场上落了后，根本拿不出同样能根据文本提示词输出文章、图像甚至是视频的工具。</p><p>&nbsp;</p><p>虽然在产品进度上明显落后，但苹果对这波 AI 大模型浪潮仍旧给予足够的重视。在公开场合中，苹果掌门人库克多次提到公司对 AI 的态度。</p><p>&nbsp;</p><p>库克在今年 5 月的电话会议上表示，尽管这项技术颇具潜力，但仍存在“许多问题需要解决”。他还提到，苹果将在更多产品中引入 AI，不过会首先“深思熟虑一番”。</p><p>&nbsp;</p><p>与此同时，库克在采访时则强调，他个人在用 ChatGPT，苹果公司也在“密切关注”这波潮流。</p><p>在幕后，苹果越来越担心错过设备运行方式的潜在重大转变。生成式 AI 的确有望改变人们与手机、计算机和其他技术的交互方式。</p><p>&nbsp;</p><p>在尝试开发自有 AI 工具的同时，苹果公司也对 OpenAI 的技术开展了企业实验。他们还考虑与OpenAI 签署一份更大的合同，意味着苹果可能会像微软、Shutterstock 和 Salesforce 那样从 OpenAI 处获取技术授权。</p><p>&nbsp;</p><p>目前，苹果正积极聘请更多生成式 AI 领域的专家。在官方网站上，苹果正在招聘“对大语言模型和生成式 AI 拥有深入了解”的工程师，并承诺将努力运用这项技术、帮助“人们在 iPhone 及其他设备上交流、创建、连接和消费媒体内容”。</p><p>&nbsp;</p><p>知情人士指出，苹果的 LLM 技术集成思路主要集中在 Siri，由语音助手代表用户执行更多任务。此外，根据彭博社今年 4 月的报道，苹果公司正计划推出一项代号为 Quartz 的新健康指导服务，其需要配合 Apple Watch 并通过 AI 制定个性化健康计划。此外还有苹果电动汽车，据称其届时将搭载 AI 驱动的自动驾驶功能。</p>",
    "publish_time": "2023-07-20 14:13:01",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]