[
  {
    "title": "百分点科技正式发布数据科学基础平台",
    "url": "https://www.infoq.cn/article/9sNSgBAUxsco2usLJpPl",
    "summary": "<p>3 月 30 日，由百分点科技主办的“ 2023 数据科学峰会”在北京金隅智造工场·科技秀场成功召开。此次大会以“数据·进阶”为主题，邀请权威专家学者以科学视角和全球视野解读数据科学、数字政府建设及数字化业务，在现场重磅推出一站式数据价值实现平台，并联合全球权威咨询机构 <a href=\"https://www.infoq.cn/article/AkkcQgZIZK26glVAe17o\">IDC</a>\" 发布首份数据能力进阶白皮书。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/69/692d48cee9d095f8692f4fdb8e2a4e07.png\" /></p><p></p><p></p><h2>权威专家趋势洞见</h2><p></p><p></p><p>当前，数字经济成为全球经济增长的关键动力，也成为我国经济发展的新引擎，带动产业数智化转型进入纵深阶段。数据科学以其价值的基础性和技术的集大成性成为新一代信息技术浪潮中浓墨重彩的一笔。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/39/39418f897ab918a170b9e4054561832e.png\" /></p><p></p><p>北京大学数学科学学院、光华管理学院教授，中国科学院院士陈松蹊从统计学科的角度阐述了数据科学的发展历程。他表示，数字中国建设，释放数据生产力是关键。真正要把生产力释放出来，不能只靠存储和算力等基础设施建设，更需要“数据文化”建设，尤其是场景驱动的数据分析等数据科学“软”实力建设。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/56/56df9f1c58660cbaa68a181f08cab50b.png\" /></p><p></p><p>北京大学政府管理学院副院长黄璜介绍，新时期数字政府建设，需要在推进国家治理现代化总体目标下提升政府治理能力，建立“用数据”和“治数据”思维，形成多层次数据治理体系，通过治理与技术架构平台化，统筹资源与能力建设，实现决策支持数据化、协同治理平台化、服务交互智能化。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/4a/4adc949344bd51777f1076581318f2eb.png\" /></p><p></p><p>上海纽约大学全球杰出商学讲席教授陈宇新认为，目前应用型人才较多，进一步原创性的突破要从更基础的数学理论上发掘潜力。对于数字经济来说，数据质量的认证将会变得非常重要，认证和确认数据源可靠性的技术或服务将会兴起。</p><p>&nbsp;</p><p></p><h2>IDC 首份数据能力进阶白皮书正式发布</h2><p></p><p></p><p>聚焦数字化转型的痛点和需求，百分点科技联合全球权威咨询机构 IDC 重磅发布首份数据能力进阶白皮书——《用数据创造价值 以智能激发增长——数据科学基础平台白皮书》，IDC 中国副总裁兼首席分析师武连峰出席大会并进行了正式发布。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/f7/f754cdbe635b0474e5b6b99d01cf84ad.png\" /></p><p></p><p>在《白皮书》中，调研数据显示，政企普遍对基础设施承载能力、行业经验成果、全流程一体化数据应用能力以及数据方法论等较为关注，其中“一体化数据链路能力，支持端到端的数据价值实现”占比达到29%。</p><p>&nbsp;</p><p>武连峰表示，数字化业务时代已经来临，数据要素在资金、客户、运营、创新等领域创造价值，需要打造数据获取与治理、数据挖掘与展示、数据变现与创新三大能力。在此基础上，他提出聚焦组织数字化转型的核心需求、将数据科学纳入发展战略、评估数据就绪度与成熟度、选用可持续迭代的全栈能力平台、选择合适的数据科学服务商等八大策略。</p><p></p><p></p><h2>数据科学持续进阶 百分点科技重磅产品发布</h2><p></p><p></p><p>随着数字经济持续增长，政企机构进入数字化转型的纵深阶段，大量的数据需要进入到可分析、可解释、可参与预测和决策的场景中来，并加速实现由数据驱动的全面业务整合和创新。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/2b/2bcf56af53f4572744b69d87f3f3e0f7.png\" /></p><p></p><p>百分点科技董事长兼 CEO 苏萌表示，数据科学在过去 50 年里从 1.0 的小数据时代，2.0 的大数据时代，走入了 3.0 的 AI 时代，未来将迈向数据原生时代。当下市场需求不再是断点式技术和工具，而是端到端的数据科学解决方案，在长链条里实现数据价值。</p><p></p><p>随着数据科学通用工具的一体化和平台化、领域知识的程序化和服务化，交互方式的自然语言化，数据科学技术将像互联网一样普惠大众，业务和决策人员将可以跨过程序员直接与数据进行交互，提高分析和决策效率。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/d7/d7bee8eaa6df647b4aa3628f090b1833.png\" /></p><p></p><p>为此，<a href=\"https://www.infoq.cn/article/gmreAOyFEktdSoZzapHd\">百分点科技</a>\"基于十多年的理论和技术积淀，推出一站式数据价值实现平台——百分点数据科学基础平台（ DeepMatrix ），服务于数据工程师、数据分析师和数据科学家，助力便捷高效地将数据转化为业务知识并辅助决策和行动，最终释放数据价值。</p><p></p><p>百分点科技 CTO 刘译璟介绍，数据科学基础平台具备两大特征。首先是知识化，平台不断沉淀领域中的数据科学知识，包括程序性知识、事实性知识和概念性知识。传统企业的数字化转型面临着冷启动问题，平台能够借助行业内已有的专业知识为其破局。其次是智能化，数据科学基础平台内置了智能辅助开发系统，可以自动化地辅助开发者选择方案以及完成数据适配，并智能化地进行方案精调和改进。同时，能够在数据治理的多个环节依托知识库及语义理解等智能技术帮助开发者提高效率。</p><p></p><p></p><h2>立足全球视野 聚焦产业实践</h2><p></p><p></p><p>在此次大会上，来自产业链上下游的知名企业领袖同台分享了数智化转型中的经验、问题与思考，立体而全面展示了当前产业发展现状。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/4f/4fde466b7d81ca69a27d22a3d11776ec.png\" /></p><p></p><p>中国中免科技信息部总经理徐刚表示，数字化转型是企业发展的必然选择，而数据是转型的关键，需要十年育“数”，立足长远，拉通全链条数据，形成内外部数据生态圈，应用数据科学指导业务决策，打造以客户为中心的全流程数据支撑能力，用数据驱动企业效能提升。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/21/2172e0bf2ac3836803d3856dc3df26c8.png\" /></p><p></p><p>华为 EBG 全球公共事业系统部数字化转型咨询规划总监王煜认为，以数据为核心的数字化转型，需要以“数据”为生产要素，以 5G、云、AI 等 <a href=\"https://www.infoq.cn/article/mWqDclNHFXPRjbmKZKMX\">ICT</a>\" 技术为生产工具，以软件为载体，以服务为目的，从而实现企业管理和运营效率的提升，以及产品和商业模式的创新。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/d0/d0e7f8815f945f61165fe74a7a16ce87.png\" /></p><p></p><p>百度智能云智慧城市总经理刘捷表示，AI 知识增强大模型出现，推动城市由感知智能向认知智能迈进，通过数据驱动和 AI 赋能，城市数字化场景持续创新，实现洞察有深度、治理有精度、兴业有高度、惠民有温度，城市生活越来越幸福。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/d3/d39915d4ce34b6a62194e1eef342d2a2.png\" /></p><p></p><p>最后，在以“全球视野下的数据科学发展趋势与展望”为主题的圆桌对话环节，来自学界、咨询机构、企业的专家分别从不同的角度进行解读，不断进行思想碰撞。对于数字经济发展的未来趋势，数字技术与产业深度融合成为各方共识。</p>",
    "publish_time": "2023-04-04 09:35:25",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "从8000元起步到年产值超800亿，藏在郊县里的农牧数字化探索者",
    "url": "https://www.infoq.cn/article/1mdmikVizJFiI3WS5oij",
    "summary": "<p>今时今日的农户为什么通过手机 App 或小程序就可以照看养鸡场，甚至一个人一年就能养上数万只鸡？本期《行知数字中国》走进位于郊县的广东温氏股份，在数字化成为企业“必修课”的今天，温氏却早已打下 30 多年的信息化基础，并发展为年产值超 800 亿的农业龙头企业。</p>\n<p>作为一个农业企业，驱动温氏敢为人先落地信息化、数字化的原因是什么？在这个过程中，温氏又是如何思考并实践数字化的？让我们一起来揭秘答案。</p>",
    "publish_time": "2023-04-04 12:22:57",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "农牧数字化：IT 要冲到前面去引领，“天花板”才能被打开",
    "url": "https://www.infoq.cn/article/Hup8kmUYBGCGTlP6LpHG",
    "summary": "<p></p><p></p><blockquote>出品｜InfoQ ·《行知数字中国》访谈主持｜霍太稳，极客邦科技创始人兼 CEO访谈嘉宾｜蒋荣金，温氏股份总裁助理、数字化牵头人 ；邝颖杰，温氏数字流程部&nbsp;IT&nbsp;技术中心主任</blockquote><p></p><p></p><p>在企业数字化的进程中，农业行业的数字化往往不会受到太多的关注；然而，数字化始终是推动我国乡村振兴的一股重要力量。</p><p></p><p>2023 年 2 月 13 日，我国发布《中共中央 国务院关于做好 2023 年全面推进乡村振兴重点工作的意见》（2023 年中央一号文件），明确指出要深入实施数字乡村发展行动，推动数字化应用场景研发推广；加快农业农村大数据应用，推进智慧农业发展。</p><p></p><p>本期《行知数字中国》走进广东农业龙头企业温氏股份，40 年前从“七户八股”和 8000 元人民币起步，发展到今天，温氏已经成为年产值 800 多亿元的企业。</p><p></p><p>虽然坐落于云浮新兴这个当时还是一个小乡镇的偏远地区，但温氏始终遵循“用科学 办实事”的精神，与时代同频共振。在数字化成为企业“必修课”的今天，温氏早已打下 30 多年的信息化基础，从上世纪 90 年代开始使用计算机记账，到后来又成为最早涉足数字化转型的农业企业。</p><p></p><p>让人尤为好奇的是，作为一个农业企业，驱动温氏敢为人先落地信息化、数字化的原因是什么？在这个过程中，温氏又是如何思考并实践数字化的？本期<a href=\"https://www.infoq.cn/album/79\">《行知数字中国》</a>\"将为你揭秘温氏股份的数字化故事，<a href=\"https://www.infoq.cn/video/1mdmikVizJFiI3WS5oij\">点击此处链接可查看视频</a>\"。</p><p></p><h2>基因里早已写下数字化</h2><p></p><p></p><p>农业企业发展主要由两大技术支撑：一是生物技术，主要指育种、兽医、营养，这是农业企业的核心能力；二是 IT 技术，这是农业企业实现精细化管理的必要手段。</p><p></p><p>据温氏数字流程部 IT 技术中心主任邝颖杰回忆，早在一台电脑价格高达 2 万元的 90 年代，温氏就毅然选择与华南农业大学计算机系合作推进信息化，开创畜牧养殖电脑管理的先河。这是温氏使用 IT 技术进行自我“武装”的开端。谈及背后的原因，邝颖杰介绍，当时温氏的业务规模迅速扩大，传统通过手工记录每个养殖场的生产层级、账本、结算单的方式已经无法为继，于是催生了利用信息技术进行自动化管理的需求。</p><p>在国内信息化发展仍然处于初步探索的 90 年代，IT 技术人员是非常稀缺的人才，加上温氏的业务体量和资源投入还比较有限，其信息化的建设主要还是原来外部力量的支持。</p><p></p><p>最初，温氏主要通过与华南农业大学计算机系进行全面合作，把高校专家请到温氏，由双方合作开发局域网范围内的专业户管理等业务系统；此后，2005 年温氏开始与金蝶进一步合作建设集中式管理系统；2010 年启动养殖物联网相关技术的探索和研究；2015 年投入“互联网 +”建设；2018 年作为网易数帆第一批数字化建设的种子用户，温氏与之合作建设统一大数据平台；2021 年与华为合作，启动数字化转型，提出打造全方位的数字化体系。</p><p></p><p>温氏的信息化和数字化，在自己的发展节奏里，有条不紊地进行。</p><p></p><p>“温氏会一直紧追时代进步，不管是生物技术、IT 技术还是管理技术，都会向先进学习，不断提升自我。这是我们变革的动力。”温氏股份总裁助理、数字化牵头人蒋荣金在访谈中强调，数字化可以理解为温氏对用科学、办实事精神的传承，是会不断深入直至‘为我所用’的技术和手段。</p><p></p><h2>让养殖农户走出鸡舍</h2><p></p><p></p><p>可以看到，温氏对技术投入的价值深信不疑，但这种坚信并非迷信，而是来自于实实在在的业务获益。</p><p>以鸡场养殖场景为例，在肉鸡饲养行业尚没有引入自动化、信息化的传统人工饲养模式下，人均饲养约 5000 只鸡 / 年。但到了今天，以温氏的勒竹三黄笼养小区为例，单批次可养 3.5 万，单人单栋年可养 4.8 批次，单人年产能可达 16.8 万只。</p><p></p><p>据邝颖杰介绍，养殖效率大幅提高的背后，源于自动化、机械化、集成化、AI、软硬件结合等各种数字化手段的支撑。</p><p></p><p>十多年前，在传统的人工饲养模式下，养鸡农户往往不敢轻易离开养殖场，他们不但需要亲自喂料、清粪，很多时候还要睡在养殖场里，以防出现异常或者突发情况，比如鸡舍温度异常或者缺水。为了及时跟进鸡的生长情况，农户还需要每天对鸡进行抽查，使用人工秤对其进行称重。</p><p></p><p>这种纯靠人工的养殖模式，不但效率低，而且极度依赖农户个人经验，比如，如何通过鸡的叫声辨别它们的健康状况，这需要农户长时间的经验积累，对新人的培养周期和成本比较高，很难快速复制。</p><p></p><p>随着时代的变迁，农户年纪渐长，而年轻的“农二代”“农三代”从事畜牧业的意愿越来越低，有经验的农户的数量会越来越少。这时候，借助技术实现养殖方式的智能化、自动化、机械化，成了解决以上问题的重要手段。</p><p></p><p>邝颖杰表示，在温氏养殖场生产管理逐步机械自动化系统和设备后，现在的鸡舍实现了自动喂水、自动喂料、自动清粪，以及环境自动控制等等。并且，农户通过手机 App 或小程序就可以“照看”养鸡场，包括监控鸡群鸭群的叫声分贝值以判断活跃状态，有异常就自动反馈，还可以实时监控温度、湿度、通风量等指标，甚至什么季节适合养什么品种的鸡，应该是怎么样的温度和湿度，系统都可以提前预设好。</p><p></p><p>这意味着，农户再也不需要长时间待在鸡舍里，工作体验大大提升，帮助养殖场吸引更多年轻且高精尖的人才加入，人均劳动效率和产值也得以大幅提高。与此同时，通过把丰富的养殖经验沉淀到数字化系统中，则在很大程度上解决了对人的依赖，即便是经验尚浅的新手，也能快速上手。</p><p></p><p></p><h2>IT 人员要从后方冲到前面做引领</h2><p></p><p></p><p>不过，回顾整个数字化历程，蒋荣金表示，温氏也遇到了一系列挑战。尽管合作伙伴带来了先进的方法和理念，但温氏必须从中探索出属于自己的特色数字化路径，蒋荣金认为这是其数字化转型最大的挑战之一。他指出，外部的专家经验更多是理论层面的，可以起到指引和指导作用，但落地实践要与自身业务结合，这要求温氏所有参与数字化转型的人才都要深度参与，特别是文档以及方案输出，尽量亲自完成。</p><p></p><p>“比如说某个项目是华为在承接，我们会规定由对方交付 70% 的内容，我们自己要交付 30% 内容，通过联合团队的模式，由华为带着我们的人共同完成，最终完成项目落地。”邝颖杰表示，这有助于内部培养数字化人才，能够为组织持续发展练就“肌肉”。</p><p></p><p>显然，这对 IT 技术团队的能力提出了全新的要求。在信息化时期，温氏股份的信息中心基本是由 IT 人员组成，IT 人员只需要等待业务部门的需求，实现需求并上线就基本完事。“但如果再以这样的形式发展 10 年，IT 部门的天花板永远都不会被打开。”邝颖杰强调，数字化时代，IT 人员不能只在后方干活，而是需要冲到前面去引领。</p><p></p><p>业务人员也是同理，业务部门原来处于“弱改进”状态，想要推进变革也存在较大的难度。为了让 IT 跟业务能深度融合，温氏前两年组建“数字流程部”，把 IT 人员和各业务线的精英抽调至数字化转型团队里面，让业务与 IT 一同去重新审视业务流程，把控每一个可以实现降本增效的环节，从而推进流程变革和数字化项目落地。</p><p></p><p>某种程度上，当数字化转型团队里有了业务人才，也就有了与业务部门对话的“权威性”，同时这些业务人才也因为身处数字化团队，与 IT 人员有了更深入的交集之后，也更能从全局的视角去思考和提需求。</p><p></p><h2>温氏数字化的三个特色</h2><p></p><p></p><p>值得一提的是，数字化建设非常考验企业的耐心和耐力的投入。对于大多数企业而言，短期内做一个项目或者一个系统实际上难以见效，很多时候往往需要三四年甚至更长时间才能体现出价值。而总结当前温氏数字化转型的独特路径，主要涵盖几个方面：</p><p></p><p>首先是“点线面”结合的推进方式，“面”是指用蓝图作为整体策划，“点”是指高效进行类似 MVP 的速效项目，挖掘落地的数字化场景；找到切入点、有所突破后再拉成“线”，让业务线能更全面地理解数字化，让管理者感受到数字化对业务的赋能作用，见到实效，也就能更深入理解公司发展蓝图。</p><p></p><p>第二个特色是强调价值导向，不追求大而全，也不追求高大上的技术应用，踏踏实实立足于场景，从最大的、业务亟需突破的痛点的角度去探索。对外要价值：IT 项目必须要量化价值才能开展，不量化价值则不予立项。对内也要价值：数字化转型的基础是流程建设，温氏为此重新探索了符合新时期数字化要求的流程，打牢基础。</p><p></p><p>“哪怕只是一个很小的流程点，经过重新梳理和设计，都有可能给业务带来显著的价值。”邝颖杰举例道，温氏以前是以批发的模式销售鸡，经销商分布在全国各地，原来线下销售是难以管控，任意降价销售的情况时有出现。后来把销售平台的审批流程做了改善，不同的降价区间需要走不同级别的审批流程，如此一来降价卖鸡的现象就迅速减少，原有的利润空间也就不容易被打破。</p><p></p><p>第三个特色是“长短结合”，短期目标和中期目标相辅相成，温氏把数字化转型之路分成三个阶段：2020～2023 年的目标是打好数字化基础，2024～2025 年的目标是深化应用，这些短期目标都是为了能在后期“形成一个面”，构建起温氏的特色数字化转型之路。</p><p></p><p></p><h2>围绕全产业链重构</h2><p></p><p></p><p>进入数字化时代，温氏的目标远不止于赋能“养殖”本身，而是变成围绕全产业链进行多方面重构。整体来看，利用数字化技术，温氏实现了“智能养殖”“数据中台”“技术应用的拓展”等多方面的升级，包括利用农业物联网技术来监控猪和鸡的生长指标，通过智能养殖大数据平台对养殖风险进行预测和预警，此外还在采购和销售链条上线了同时面向供应商和消费者的线上商城。</p><p></p><p>另一方面，温氏通过数字化管理实现业财一体化：不但将温氏股份业务链条上的数据全部与财务数据打通，实现人、财、物以及产、供、销等各个环节的全面对接，还建设了财务共享中心，逐步实现财务人员、业务、流程、数据的高度集中，财务重心从一般企业的核算与编报表转变为预算、分析以及向管理层提供决策信息。</p><p></p><p>因此，从生态圈的维度来看，温氏的数字化之路也可以视为“农户连接”“供应商连接”“经销商连接”的生态建设进程，对应地打造人财物覆盖的系统、生态圈全覆盖的系统以及下游客户以及消费者的全覆盖系统。</p><p>“怎么样服务好农户，服务好客户，服务好我们自己内部的员工，怎么样把这帮人连接起来，成为公司里齐心前进的一股力量。”蒋荣金强调，温氏非常期望能通过数字化找到一条好的路径去解决各项挑战。</p><p></p><h2>写在最后</h2><p></p><p></p><p>古话有云“农业靠天吃饭”，尽管在技术的助力下，畜牧养殖已经可以实现生产现场跟信息系统的对接，但农业的数字化转型相比起其他领域，整体的数字化建设基础还是处于比较薄弱的阶段，其未来发展仍面临多重挑战：</p><p></p><p>首先，由于养殖农户的数字化转型意识不足，因此数字化建设应用的推广还存在一定的阻力；其次，畜牧养殖的主体是“活物”，是“带毛的产品”，其形态不像工业产品般标准，数字化管理难度较大；第三，防疫要求高对数字化维护运营带来挑战；第四，既懂农业又理解 IT 的复合型人才和产品人才，目前仍存在很大的缺口。此外，由于农业养殖场大多在偏僻的农村或郊区，地域分散，因此整体数字化成本会偏高，但农业企业整体的利润率又普遍偏低，所以很多农业企业也做不到长期持续地支撑数字化投入。</p><p></p><p>对于温氏而言，即便面对这些重重困难，也开辟出了一条自己的数字化之路。用蒋荣金的话说，这是因为他们非常注重寻找数字化和业务结合的“价值点”。“我们不是说要使用一个多么新的技术，或者说应用一台多先进的设备，应用一个多么前沿的方案。”蒋荣金强调，我们要考虑企业的承受能力，把价值点找出来，让业务认可、企业得益才是数字化转型的关键。</p><p></p><p>总而言之，数字化对企业来说从来不是一蹴而就的事，“务实”是温氏数字化的关键词，即便下定决心推进数字化转型，但温氏也并非盲目将命运押注于此，而是务实地思考转型的本质，结合现实情况合理地投入人力、物力。这种心态和理念成为其数字化顺利推行的重要因素。</p><p></p><p>更值一提的是，温氏在这个过程中尤为注重数字化给农户带来的价值，让农户“用更少的劳动力，更少的时间，能够赚到更多的钱”，最终目的是提升效率，帮助更多的养殖户或者农民发家致富。这正是这家从郊县走出来的农牧企业特有的企业责任，也恰恰是温氏得以成功的关键。</p><p></p><p>如果你对《行知数字中国》栏目或者更多企业数字化转型案例感兴趣，欢迎关注「InfoQ数字化经纬」公众号，我们将持续为您推送更多、更优质的数字化案例内容和线上线下活动。</p>",
    "publish_time": "2023-04-04 12:38:58",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "刚刚！AI赛道又跑出一个IPO",
    "url": "https://www.infoq.cn/article/TgDwhWZ8vi7cGUJ6UoSs",
    "summary": "<p></p><blockquote>据悉，云天励飞是业内少有的拥有横跨算法、芯片和大数据能力的人工智能企业。</blockquote><p></p><p></p><h2>云天励飞成功上市</h2><p></p><p></p><p>4月4日，深圳云天励飞技术股份有限公司（以下简称“云天励飞”）正式在上交所科创板上市，股票代码688343。截至发稿前，<a href=\"https://www.infoq.cn/article/dbLYT47GWIIccobhQap5\">云天励飞</a>\"股价为 100.37 元 / 股，市值达 356.45 亿元。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/79/79d7deee349c4facf2557bb7c9f114ac.jpeg\" /></p><p></p><p>据了解，云天励飞成立于2014年，是拥有算法、芯片和大数据全栈式能力的人工智能企业。云天励飞董事长兼CEO陈宁博士曾任中兴通讯 IC 技术总监，公司首席科学家王孝宇博士曾任 SNAP 首席研究科学家。自成立起，云天励飞就深耕人工智能领域，搭建了人工智能算法平台、人工智能芯片平台，并具备了算法<a href=\"https://www.infoq.cn/article/LRDYqxQeiWuV18ig2whL\">芯片</a>\"化能力，面向下游场景提供 “端云协同”的 AI 产品及解决方案。</p><p></p><p>截至2023年1月，云天励飞已授权专利400余项（含境外专利25项），其中发明专利300余项，已登记的软件著作权160余项。相关发明专利覆盖了人脸识别软件算法、图像处理技术、人工智能芯片设计等计算机视觉及人工智能核心技术领域。</p><p></p><p>凭借“算法芯片化”的核心能力和“端云协同”的技术路线，目前，云天励飞已经在深圳、东莞、青岛、成都、杭州、上海、北京等多个城市实现项目落地，并打造了深圳巴士集团智慧公交OD项目、深圳龙华智能运算平台、青岛崂山智慧社区项目、深圳中心书城项目、深圳富士康智慧园区项目、深圳元平智慧校园等项目。</p><p></p><p>云天励飞董事长兼CEO陈宁博士表示：今天，云天励飞在科创板成功上市，这既是我们创业路上重要的里程碑，也是崭新征程的起点。“功不唐捐，玉汝于成，行而不辍，未来可期”！</p><p></p><h2>去年营收超5亿元，研发支出占比过半</h2><p></p><p></p><p>营收数据方面，招股书显示，报告期内（2019-2021年以及2022年1-6月），云天励飞的营业收入分别为2.3亿元、4.26亿元、5.66亿元、1.85亿元，净亏损分别为5.1亿元、3.98亿元、3.9亿元和2.3亿元。云天励飞在招股书中表示，公司所在的人工智能领域存在前期研发投入高的特点，在产品实现规模化销售前，公司需要持续进行投入。</p><p></p><p>同时，云天励飞坦承，未来一段时间，由于<a href=\"https://www.infoq.cn/minibook/G0mJVbQDuB4v0RTlDPWg\">人工智能行业</a>\"属于技术密集型行业，存在持续进行高强度研发的需求，该公司收入规模有可能无法支撑其进行持续大规模研发投入和市场开拓等活动，可能将面临持续亏损的风险。即使将来能够实现盈利，亦未必能在其后期间保持盈利。预计首次公开发行后，该公司短期内无法现金分红。</p><p></p><p>研发支出方面，报告期内，公司的研发投入分别为 1.99 亿元、2.19 亿元、2.95 亿元和 1.47 亿元，占营业收入的比例分别为 86.79%、51.42%、52.17%和 79.13%。</p><p></p><p>云天励飞在招股书中表示，公司自成立以来注重技术研发团队的建设，截至 2022 年 6 月末，公司拥有一支覆盖人工智能算法、人工智能芯片、大数据处理三大技术平台的 511 人的研发团队。截至报告期末，公司研发团队中，有 167 人拥有硕士及以上的相关学历。</p><p></p><p>在行业竞争方面，云天励飞在招股书中提到，近年来，国内人工智能行业发展迅速，竞争愈加激烈。在视觉人工智能领域，国内主要企业除云天励飞外还包括商汤科技、旷视科技、依图科技、云从科技等，该等企业与云天励飞业务和盈利模式更接近，都主要聚焦在视觉人工智能技术和产品的研发和应用，依赖自身技术先进性和创新性生存和发展。</p><p></p><p>此外，海康威视、大华股份、宇视科技、苏州科达、东方网力等传统安防厂商，以通信设备起家的华为和以视频存储硬件起家的浪潮等企业也通过产业链延伸的方式涉足行业，该等企业更多是立足在其既有的产品优势基础上，通过切入视觉人工智能行业来巩固和扩大其在既有产品领域的优势，行业在此基础上形成百花齐放的局面。同时，在人工智能芯片领域，亦有寒武纪、英伟达等重要参与方。</p><p></p><h2>“算法芯片化”与“端云协同”</h2><p></p><p></p><p>据介绍，云天励飞的核心能力是“算法芯片化”，让算法和芯片这两大技术能够相互配合，为解决方案和应用场景更高效地赋能。</p><p></p><p>云天励飞董事长兼CEO陈宁此前在接受采访时曾谈到，算法芯片化不等于“算法+芯片”，而是指一种算法与芯片融合发展的设计理念和流程，是基于设计者对算法的深刻的理解，把里面共性的操作提炼出来去设计芯片架构。</p><p></p><p>算法方面，云天励飞的算法项目作为工信部的国家人工智能重点任务揭榜。2018 年，云天励飞获得被誉为“中国智能科学技术最高奖”的吴文俊人工智能科学技术奖。</p><p></p><p>芯片方面，云天励飞通过自定义指令集、处理器架构及工具链的协同设计，自主研发芯片并已实现流片、量产及市场化销售。2019年云天励飞自研芯片 DeepEye1000实现独立商用，2022年底新一代芯片DeepEdge 10开始流片，预计今年量产投入使用。</p><p></p><p>能够配合“算法芯片化”能力，实现面向场景的快速落地，则依赖于端云协同的技术路线。</p><p></p><p>端云协同指通过端侧和云侧的深度交互，优化算力算法在端侧和云侧的动态分配。传统的方案是：终端负责采集数据，采集到的数据直接传输到云端，由云端分析处理数据，但这不仅为传输带来巨大压力，云端输出数据处理结果时也往往存在时延。而采用端云协同路径的方案是：终端不仅负责采集数据，同时也负责部分的数据的识别和分析，处理数据后，仅上传与场景业务需求相关的特征要素，这样一来，不仅可以减缓传输的压力，云端分析也能够更快。</p><p></p><p>在端侧，云天励飞应用自研的AI芯，部署可重定义智能相机，实现数据的高效采集和前端处理；在云侧，与基于云天励飞自有算法和大数据分析技术为核心的业务系统高度适配，从而根据不同业务场景需求进行灵活调整，实现数据的前端智能采集和云端处理。</p><p></p><p>通过算力前置，实现终端分布式算力与云端中心算力的动态平衡；通过在终端设备中部署公司的可重定义芯片，实现云端业务系统与终端设备的动态适配，大幅提升AI解决方案整体的动态适应能力和灵活处理能力，加速AI解决方案的推广与落地。</p>",
    "publish_time": "2023-04-04 12:40:57",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]