[
  {
    "title": "工商银行大数据平台助力全行数字化转型之路",
    "url": "https://www.infoq.cn/article/FuBdGKz3IUQef0gchvNO",
    "summary": "<p>在当前的金融行业中，面临着前所未有的数据增长和技术变革。随着大数据和人工智能的兴起，银行业面临着巨大的转型挑战和机遇。一方面，数据量的激增带来了存储和处理的问题；另一方面，客户对个性化和即时服务的需求日益增加。在这样的背景下，中国工商银行通过建立先进的大数据平台，致力于应对这些挑战并抓住这些机遇。</p>\n<p>在FCon 全球科技大会上，中国工商银行 /大数据和人工智能实验室/部门经理袁一详细介绍了数据平台的发展历程、实时数据处理的重要性、架构的演变、数据集成工具EasyDI的应用、适应不同场景的多样化数据库，以及未来的发展方向。以下为要点内容：</p>\n<ol>\n<li><strong>发展历程与总体架构</strong>：介绍了工行数据平台多年来的演变，突出技术进步和数据处理方法的转变。</li>\n<li><strong>实时数据仓库</strong>：强调实时数据处理在银行运营中的重要性，以及从传统批量处理方法的转变。</li>\n<li><strong>架构演化</strong>：涵盖了系统架构随时间的逐步变化，解决了挑战并引入了创新。</li>\n<li><strong>EasyDI（数据集成）</strong>：重点介绍了工行的数据分析平台EasyDI，在数据集成和分析中的关键作用。</li>\n<li><strong>多样化数据库适应不同场景</strong>：讨论了针对特定运营需求和场景选择不同数据库技术的用途。</li>\n<li><strong>未来展望</strong>：提供了银行数据管理策略和技术未来发展方向的见解。</li>\n</ol>\n<p><strong>活动推荐：</strong></p>\n<p>QCon 全球软件开发大会（上海站）即将在 12 月 28-29 日开始，届时将围绕 GenAI和通用大模型应用探索、AI Agent 与行业融合应用的前景、LLM 时代的性能优化、智能化信创软件 IDE、面向人工智能时代的架构、性能工程：提升效率和创新的新方法等专题进行交流。现在购票，享 9 折优惠，立减￥680！咨询购票请联系：18514549229（微信同手机号）。</p>",
    "publish_time": "2023-12-14 10:19:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "用友发布数据资产入表解决方案 加速激发数据要素价值",
    "url": "https://www.infoq.cn/article/Rz9Fg3sErszImZKG3Aze",
    "summary": "<p>12月13日，用友BIP数据资产入表解决方案正式发布，助力盘活企业数据资产、激发数据要素价值。用友通过提供咨询、设计、产品、交付、运营等全流程的解决方案与服务，帮助企业完成数据资产基础入表、统一数据治理和释放数据价值，并拉通数据服务到数据交易的通路，增强企业数据的开放、流通和变现能力，加速数据要素的社会级流转。</p><p></p><h2>数据要素市场化提速 企业加速数智化转型</h2><p></p><p></p><p>数据要素是数字经济的主要驱动力。数据要素价值的充分释放，将促进产业链全要素的生产力提升，助推经济高质量发展。数据对企业的生产经营和运营管理能够产生巨大价值，已经成为企业越来越重要的一个战略资源和极具价值的资产。企业只有真正挖掘和释放出数据的价值，才有望成为数智化时代的领先者。</p><p></p><p>数据价值的释放要求企业加速推进数智化转型。企业数智化转型的核心之一就是要释放数据的价值，通过新的数据要素驱动企业的创新发展，实现经营和管理的变革。作为全球领先的企业数智化软件与服务提供商，用友在服务众多行业领先企业数智化建设的过程当中，总结提炼出企业数智化进阶模型，即“企业数智化1-2-3”。处在不同发展阶段、不同行业的企业，可以参考此模型，在数智化1、2、3层级，分别重点推进云化连接（用云）、数据驱动（用数）、智能运营（赋智），从而构建数智化能力、发挥数据价值、创新应用，加速数智化进程。目前，多数企业处在数智化2层级，通过升级数智底座、全面推进数据治理，释放数据要素价值、管好用好数据资产，实现数据驱动的业务流程与决策、管理行动等。</p><p></p><p>用友网络科技股份有限公司高级副总裁杜宇在致辞中指出：“企业首先要树立‘数据是资产’的理念，分三个阶段即数据资源化、数据资产化、数据资本化，对数据进行运用、释放数据价值。在新的数据要素市场中，用友将从全产业视角，发挥35年的积累，即懂企业、知场景、强平台、聚生态的众多优势，助力企业全面融入数据要素市场实现创新发展。”</p><p></p><p>数据资产化是数据要素市场化的重要起点，当前，企业数据资产入表进入倒计时。财政部会计司于2023年8月发布《企业数据资源相关会计处理暂行规定》为企业数据资产入表提供了操作指引，将于2024年1月1日起施行。企业数据资产入表对企业的经营和组织发展都会带来影响，包括增资产、提利润，提高盈利水平，改善资产负债率；真实反映数据价值，重塑企业估值体系；重塑部门权责，成本中心变利润中心等。</p><p></p><h2>用友BIP数据资产入表解决方案正式发布</h2><p></p><p></p><p>当前企业数据资产入表和全面激发数据价值，还面临着诸多挑战。如在完成数据资产入表基础工作之前，企业需梳理清楚哪些数据属于数据资产、哪些数据属于资源、哪些工作项可以作为数据资产成本，这些成本哪些归入无形资产、哪些归入存货，完成初始计量后、如何处理后续计量，以及如何快速应对审计、进行数据资产的披露。</p><p></p><p>同时，要全面激发数据价值，企业还需关注数据在企业内部的应用场景、做好统一数据治理与数据中台的建设、关注数据资产的变现与数据安全等问题，以及需要遵循完善、科学的数据管理体系建设评定标准。</p><p>为助力企业充分发挥数据生产要素价值，实现数据驱动业务，用友网络大型企业客户事业群首席数据官张旭现场正式发布用友BIP数据资产入表解决方案，通过三个层级帮助企业完成数据资产入表和数据要素价值产出。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/9b/9b1253dc55cb1a871406563539f9f81e.png\" /></p><p>用友BIP数据资产入表解决方案正式发布</p><p></p><p>用友BIP数据资产入表解决方案一共涵盖了3个层级12个关键工作，即通过数据盘点、数据登记/确权、数据资产判定、数据成本归集以及列表与披露等5个关键工作完成基础入表工作；通过统一的数据治理、构建全生命周期的数据管理体系和实现全面数据服务，激发企业内部数据价值；通过确定数据要素交易场景、制定数据战略与组织变革、搭建数据交易平台和实现企业数据资本化，最终完成数据要素的社会级流转。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/6f/6f71609354170f318a7ccca6800f6f19.png\" /></p><p>图为用友BIP数据资产入表解决方案整体服务框架</p><p></p><p>完成基础入表工作</p><p></p><p>其中，在完成基础入表工作阶段，用友BIP通过入表系统帮企业实现敏捷高效的数据资源盘点、内外结合的数据产权确认与登记体系，依托权威生态及基于广泛实践进行数据资产判定，同时预制成本项、快速归集数据资产相关成本，最后基于平台自动形成披露报告初版内容。</p><p></p><p>激发企业内部数据价值</p><p></p><p>完成基础入表工作之后，企业需要进一步进行统一数据治理、激活企业内数据价值。用友“六横三纵”数据治理体系，即数据架构管理、数据标准管理、数据质量管理、数据安全管理、数据生命周期管理和数据应用管理等“六横”，以及管理组织、制度/流程和技术/平等“三纵”为企业进行以业务价值为导向的全局数据治理提供保障。同时，基于用友iuap数据中台，为企业构建一站式数据采集、加工、治理和应用的数据底座。在这个阶段，企业充分激活数据价值，可实现涵盖展现级、分析级、控制级、决策级和创新级的全面的数据服务。</p><p></p><p>数据要素的社会级流转</p><p></p><p>最后，在数据要素场景规划上，用友基于广泛应用经验为企业提供完整的社会级数据服务场景的五维模型，以促进企业数据在社会级的广泛流通。同时，在企业数据交易环节，提供核心关键节点的全面技术支撑能力体系，可以覆盖数据交易全生命周期。</p><p></p><p>数据资产入表对于企业而言，不只是一项财务工作，其最终的目的是充分激发数据要素，为企业创造全新价值，是企业数智化转型的关键环节。用友BIP数据资产入表解决方案帮助企业实现从数据资源化，走向数据资产化、数据资本化。</p><p></p><h2>《全球数据要素企业应用研究中心》揭牌成立</h2><p></p><p></p><p>当前，我国的数据要素生态框架已成雏形。与其他生产要素相比，数据具有可复制、非消耗、边际成本接近于零等新特性，对其他生产要素具有放大、叠加、倍增作用。同时，相比其他要素，数据要素还具有越用越有价值的优势。</p><p></p><p>用友自1988年创立以来，始终专注于企业软件与服务领域，通过35年持续深耕，已经构建了完备的数据应用服务能力，包括数据咨询、数据服务、数据应用服务和大模型等数智化产品与服务，并沉淀了一套完整的数据服务能力体系以及一批行业的数智化领先实践。</p><p></p><p>国际数据管理协会是一个全球性的专业组织，由数据管理和相关的专业人士组成，自成立以来，一直致力于数据管理和数字化的研究、实践及相关知识体系的建设，先后发行了《DAMA数据管理字典》和《DAMA数据管理知识体系》等。该知识体系目前已被广泛使用，并已成为业界的标杆和权威。</p><p></p><p>国际数据管理协会-中国分会(DAMA China)与国际数据管理高级研究院主席胡本立在会上表示，数据的产生和使用是不断循环的过程，数据方面的问题需要人（群）与人（群）间达成共识来解决。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/81/81f2c4e574a8a9d6214c0999f44f2e35.png\" /></p><p>用友网络副总裁罗小江（图左）与国际数据管理协会-中国分会、国际数据管理高级研究院负责人吴大有（图右）为《全球数据要素企业应用研究中心》进行揭牌</p><p></p><p>为推进企业高效释放数据产能，并利用数据要素为社会创造出更大价值、助力数字中国建设，用友联合国际数据管理协会-中国分会、国际数据管理高级研究院揭牌成立《全球数据要素企业应用研究中心》，以探索企业数据资产的产品化场景、推动企业数据交易。同时，通过产学研用开放合作、共享共创，发掘数据要素价值、共建繁荣数据生态。</p><p></p><p>在这一波的数据建设浪潮中，加速数智化转型是释放数据价值的关键步骤。用友希望通过全球领先的数智商业创新平台用友BIP的创新产品和服务持续服务企业的数智化建设与运营，实现数据驱动和智能运营，让数智化在中国和全球更多的企业与公共组织成功。</p>",
    "publish_time": "2023-12-14 10:26:59",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]