[
  {
    "title": "中国企业研发高效能白皮书-ChatOps篇",
    "url": "https://www.infoq.cn/article/R4vwRbrR5DNEPhKei4Kv",
    "summary": "<p>近年来中国企业研发正在从粗放型走向精益型，研发工作的“高效能”成为几乎每个研发团队共同的追求。</p><p></p><p>中国软件服务产业也在近 5-10 年中得到了飞速发展，技术服务的边界不断拓展，赋能研发高效的产品层出不穷，适合中国研发环境的技术服务体系在不断完善。从结果上看，中国企业正在高效能研发的路径上快速前进。</p><p></p><p>本份报告以中国高效能研发企业为研究对象，尝试解读市场中具有代表性的高效能研发解决方案。本次报告由五个篇章组成，如 CI/CD、企业级架构、价值流管理等主题。研究小组期待可以通过研究，帮助中国企业研发团队获得高效能研发新知。</p><p></p><p>ChatOps 篇是本次报告的第二篇章，主要研究了 ChatOps 是如何帮助研发团队提升效率。该篇章不仅说明了 ChatOps 的概念和技术结构，而且对 ChatOps 市场的发展历程和趋势进行了研究与洞察。</p><p></p><p>此外，根据 InfoQ 研究中心 2023 年 1 月发布的中国技术成熟度评估曲线，ChatOps 处于准成熟技术阶段，这表明目前是采用 ChatOps 技术较为合适的时间点。</p><p></p><p>同时，通过极狐 GitLab ChatOps 的实例，读者可以更好地了解 ChatOps 是如何在决策支持、研发自动化以及运维自动化三大场景赋能团队研发效率方面的。</p><p></p><h2>目录</h2><p></p><p></p><h3>ChatOps 概念和背景介绍</h3><p></p><p>什么是 ChatOps？</p><p></p><p>ChatOps 有哪些特征？</p><p></p><p>ChatOps 的技术结构</p><p></p><h3>ChatOps 行业发展概况</h3><p></p><p>ChatOps 发展历程</p><p></p><p>ChatOps 市场发展趋势展望</p><p></p><h3>极狐 GitLab ChatOps</h3><p></p><p>极狐 GitLab ChatOps 使用场景</p><p></p><p>为什么选择极狐 GitLab ChatOps？</p><p></p><p>极狐 GitLab ChatOps 生态版图</p><p></p><p>扫码下载报告</p><p><img src=\"https://static001.geekbang.org/infoq/22/22116f5d410b7601da030e5fa0c6e8b4.png\" /></p><p></p>",
    "publish_time": "2023-06-30 10:38:31",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "独家对话金蝶李帆：企业级PaaS平台将如何引领企业的科技创新？",
    "url": "https://www.infoq.cn/article/M45ssycoZyWGh1P3I3hW",
    "summary": "<p>历时三十年的发展，金蝶已经陪伴了超过 740 万家企业走过信息化的 0 到 1，再从 1 到 N 的过程。这是一个怎样的历程？金蝶的底层技术演进逻辑是什么？金蝶又是如何看待企业数字化转型的？展望未来，金蝶的发展方向又将走向何方？</p><p></p><p>时值金蝶三十而立之年，InfoQ《C 位面对面》栏目有幸邀请到了金蝶中国副总裁、研发平台副总经理、金蝶云·苍穹平台部总经理李帆。他在金蝶从事产品研发已经二十余年，关于上述问题，他的理解又是怎样的呢？</p><p></p><p></p><h1>从金蝶的转型，看中国企业数字化转型大势</h1><p></p><p></p><p>将时间回溯到 2020 年，金蝶国际软件集团创始人、董事会主席兼首席执行官徐少春提出：“到 2023 年用云订阅模式再造一个金蝶。”而我们从金蝶发布的 2022 年财报中可以看到，金蝶云业务收入已连续三年增长超过 30%，截至目前，金蝶在云订阅模式转型方面已经交出了一份十分亮眼的成绩单。</p><p></p><p>谈及向云订阅模式转型的初衷，李帆认为金蝶主要看到了三个方面的契机：第一，随着云计算、大数据、物联网、移动互联网、人工智能等新一代信息技术的发展，互联网技术应用从消费互联网逐渐延展到产业互联网，创新技术给企业的变革带来了新契机，因此，金蝶率先开始了向云订阅模式进行转型；</p><p></p><p>第二，随着企业级应用与 新的数字化技术的不断融合，企业对于 IT 的诉求变得越来越深入和广泛，促使金蝶需要不断进行创新和变革；</p><p></p><p>第三，得益于中国数字经济的快速发展，中国企业对国产软件厂商的信心也在不断增强。党的二十大报告提出，到 2035 年我国要实现高水平科技自立自强，进入创新型国家前列，并强调“增强自主创新能力”。</p><p></p><p>当然，机会总是留给有准备的人。面对时代的契机，企业也需要有勇气去打破固有的产品、服务以及思维，敢于去做一些颠覆式的创新。众所周知，自 2014 年开始，金蝶创始人徐少春每年都有一“砸”，这代表了金蝶“破而后立“的发展决心。李帆在采访时也表达了相似的观点，他表示金蝶之所以能够向云订阅模式成功转型，与金蝶创新文化的基因是分不开的。</p><p></p><p>除此以外，李帆进一步补充道，转型的初衷还是要回归商业本质，以客户为中心，持续地去陪伴客户成长，帮助客户成功。</p><p></p><p>“企业在数字化转型的过程中，面临的最大挑战是如何能让传统的信息系统一步步过渡到数字化平台，让原有资源投入继续发挥价值的同时，引入更多新的技术来支撑业务快速发展。”这就要求软件厂商能够提供一套可持续的方法体系，进行可持续地迭代与优化，而不是颠覆式地废弃既往大量的信息化投资。出于对企业需求的考量，金蝶最终转向了云订阅的服务模式，一方面可以满足企业业务创新和管理变革的需求；另一方面，也倒逼金蝶在产品和服务不断改进和优化，真正做到顺应市场需求，和客户一起成长。</p><p></p><h1>数字化的终极阶段：数“治”企业，自主创新</h1><p></p><p></p><p>做了三十年企业管理软件的金蝶，在时代的机遇面前不仅敢于求变，同时也有着自己独特的思考。</p><p></p><p>金蝶基于过往对中国五百强企业客户的调研，大致可以将企业数字化转型分为四个阶段：第一阶段是信息化，即 IT 仅作为一种工具来辅助业务；第二阶段是数字化，真正做到了 IT 和业务融合；第三阶段是智能化，尤其是随着 ChatGPT 的持续火热，大家更深刻地意识到智能化技术对企业带来的影响；第四阶段便是数字化转型的终极目标，用数据来治理企业。</p><p></p><p>那么，具备了怎样的特征才可以算作是数治企业呢？</p><p></p><p>李帆认为，首先数据要“看得清”。但数据可视化阶段的建设并不是一件容易的事情，企业只是做了可视化看板、大屏并不够，还需要确保这些数据是实时更新、准确且全面的；接下来，进入到数据诊断的阶段，需要看这些数据能否发现业务上的问题与改进点，帮助业务去做诊断，真正发挥数据的价值；做完数据诊断后，数据要能够根据业务的形态、行业类型等多重维度，形成行业领域的模型，为企业未来发展做出精准的预测；最后便是利用数据分析的结果，帮助企业的管理者和业务人员进行研判和决策支持。</p><p></p><p>“总结来说，数据驱动决策离不开两件事：第一，保证数据的标准化、准确性、完整性；第二，数治企业离不开 AI，需要用 AI 技术帮助数据发挥价值。”李帆补充道。</p><p></p><p>针对前者，李帆介绍了金蝶统一的数字化底座、可组装企业级 PaaS 平台——金蝶云·苍穹。它为企业提供了完整的数据链路开发、数据治理体系、数据服务体系，通过从数据汇聚层统一数据交换，到统一数据资产建设，统一数据资产管理，统一数据服务到数据应用，实现数据资产化，资产价值化。</p><p></p><p>此外，金蝶云·苍穹也一直在数据智能方面进行大量投入，例如增强以数据编织和 AI 为核心，为企业提供数据和智能分析的能力，让企业通过 AI 技术提升用户体验、提升生产效率、辅助决策等多方面价值。</p><p></p><h1>大型企业需要怎样的 PaaS 平台？</h1><p></p><p></p><p>身处多变的时代，企业都希望能够拥有一个韧性的组织模式和技术架构，以支撑企业业务的高速发展。如果没有平台进行支撑，每一个应用都需要单独地去构建，企业的投入成本、响应速度以及应用的可靠性、安全性等方面都会受到影响。</p><p></p><p>正是在数字化转型目标的驱动下，PaaS 平台的重要性愈发凸显，也使得 PaaS 领域成为了各家追逐的主战场。目前，Gartner 将市场上的 PaaS 归为了两大类：一类是高控制力，即资源的管理与控制类平台；另一类是高生产力，即提供生产力工具类平台，主要面向上层应用。</p><p></p><p>但即便如此，企业面对纷繁复杂的 PaaS 平台，仍然不能很好地厘清到底什么样的 PaaS 平台更适合自身业务场景。关于 PaaS 平台的技术选型问题，李帆也在采访过程中表达了自己的看法，总结起来是四个关键词：可靠、敏捷、智能、开放。</p><p></p><p>第一，大型企业往往对业务连续性、数据安全保护等方面有着更高的要求，PaaS 平台是否安全可靠便尤为重要；</p><p>第二，该平台是否具备敏捷能力，能否有效地降低软件开发成本，提升企业的生产力；</p><p>第三，数字化的终极阶段是用数据治理企业，数据智能对于企业的重要性不言而喻；</p><p>第四，对于大型企业而言，多家 PaaS 平台共存是非常普遍的情况，这就要求 PaaS 平台需要具备融合开放的能力。“但针对开放性而言，业内并没有统一的标准来定义一个系统是否足够开放，很多人似乎认为提供 API 就是开放，但它仅仅是开放性中的一个维度。”</p><p></p><p>为了进一步阐释开放性的定义，金蝶总结出了“五可开放模型”：</p><p>可获得性：这个产品 / 服务是否方便使用者去获取它，简单来说，能否从官网上直接进行体验。此外，是否提供了开发者社区等平台，帮助用户学习它，这也是可获得性的一种表现；可访问性：是否能够与外部系统进行访问交互；可扩展性：由于标准化的应用软件并不能满足企业百分之百的需求，就需要系统支持可扩展、可自定义；可组装性：是否可以进行原子化，自有能力能否与其他企业提供的能力进行组装；可适配性：是否适配国产主流芯片、服务器、操作系统和数据库等。</p><p></p><p>其中，可组装性一直是金蝶倡导的重要理念，即让企业像搭积木一样去构建数字化能力，以应对未来的不确定性。为此，李帆为我们介绍了金蝶帮助海信集团落地可组装思想的案例。</p><p></p><p>海信集团作为国内家电行业的领导厂商，同时也是一家全球化企业，其 IT 系统的构建经历了多个阶段，非常复杂。如何整合复杂庞大的系统，形成能够快速响应的数字化能力，是金蝶在服务之初就需要重点思考的问题。经过双方不断的深入研究和探讨，最终双方选择把财务作为转型的第一步，在财务系统建设中引入先进的中台架构，利用微服务、容器化、低代码、大数据和人工智能等技术，基于可组装企业级 PaaS 平台 - 金蝶云·苍穹打造统一可复用的技术能力中心。经过多年的共创共建，基于可组装的思想，海信财务中台搭建了近 20 个可复用的能力中心，帮助海信融合了多套复杂的异构系统，实现了敏态前台实时响应业务变化，稳态中台支持财务内控和高效核算的数字化能力目标。</p><p></p><p>财务中台项目建设既是创新平台技术实践，同时也寄托了财务人员进行财务转型的希望。可以说，财务中台的落地已经成为金蝶与海信双方基于金蝶云·苍穹数字化底座、携手探索企业数字化转型过程中极具代表性的成果之一。</p><p></p><h1>未来展望：向全球领导厂商去迈进</h1><p></p><p></p><p>纵观过去三十年的发展史，金蝶经历了从 DOS 到 Windows 平台的转型，从财务软件到 ERP 的转型，也经历了从 ERP 到企业云服务的转型。今年，金蝶即将迎来成立三十周年的纪念日，在新的起点上再出发，金蝶将会带来哪些新变化呢？</p><p></p><p>智能化、可组装、行业化以及全球化，是李帆为我们透露的未来金蝶云产品四个关键演进方向。</p><p></p><p>具体而言，在智能化层面，持续将智能化技术引入各产品线，尤其是大模型技术使用场景的不断深入与成熟，后续需要将大模型的理解能力最大化，来服务企业的内部场景；在可组装层面，不能只去解决组装性的问题，更多地要关注 PBC 被打包的业务能力，更深入地研究产品化的内容；在行业化层面，需要沉淀更多的行业能力到平台层，继而更好地服务行业客户；在全球化层面，李帆表示：“我们希望在三十而立的时候，金蝶软件能够从本土软件的领导厂商开始向全球领导厂商迈进。”</p><p></p><p>据悉，在今年 8 月 8 日的全球创见者大会上，金蝶将发布一系列重磅产品和服务。届时，金蝶将以怎样的姿态奔赴下一程？让我们一起共同期待！</p><p></p>",
    "publish_time": "2023-06-30 10:39:01",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "中国企业研发高效能白皮书-CI/CD篇",
    "url": "https://www.infoq.cn/article/LFa4ESMJOMY66HtTjYsG",
    "summary": "<p>近年来中国企业研发正在从粗放型走向精益型，研发工作的“高效能”成为几乎每个研发团队共同的追求。</p><p></p><p>中国软件服务产业也在近 5-10 年中得到了飞速发展，技术服务的边界不断拓展，赋能研发高效的产品层出不穷，适合中国研发环境的技术服务体系在不断完善。从结果上看，中国企业正在高效能研发的路径上快速前进。</p><p></p><p>本份报告以中国高效能研发企业为研究对象，尝试解读市场中具有代表性的高效能研发解决方案。本次报告由五个篇章组成，如 CI/CD、企业级架构、价值流管理等主题。研究小组期待可以通过研究，帮助中国企业研发团队获得高效能研发新知。</p><p></p><p>CI/CD 篇是本次报告的第一篇章，主要研究了 CI/CD 工具是如何帮助研发团队提升效率。该篇章不仅阐述了 CI/CD 的起源与发展背景，而且对 CI/CD 市场的相关数据、厂商分布进行了研究与洞察。此外，研究发现，CI/CD 主要通过持续性、自动化、可追溯、高效迭代四大抓手赋能研发团队。</p><p></p><p>同时，通过极狐 GitLab CI/CD 的实例，读者可以更好地了解 CI/CD 是如何通过四大核心优势赋能团队研发效率方面的。</p><p></p><h2>目录</h2><p></p><p></p><h3>CI/CD 概念和背景介绍</h3><p></p><p>CI/CD 的概念——关于 CI/CD</p><p></p><p>CI/CD 发展的阶段——历经三阶段，平台型产品站上历史舞台</p><p></p><p>CI/CD 的价值——CI/CD 赋能研发的四大抓手</p><p></p><p>CI/CD 的流程结构——CI/CD 流程结构创新赋能研发效率</p><p></p><h3>CI/CD 行业发展概况</h3><p></p><p>CI/CD 市场基础数据——CI/CD 市场蓬勃发展</p><p></p><p>CI/CD 市场厂商分布——CI/CD 行业厂商矩阵逐步形成</p><p></p><p>CI/CD 市场特征洞察——行业发展推动市场需求呈现新特征</p><p></p><h3>极狐 GitLab CI/CD：带您开启新世界大门</h3><p></p><p>极狐 GitLab CI/CD 简介——GitLab CI/CD 使用前和工作流</p><p></p><p>极狐 GitLab CI/CD 特征——极狐 GitLab CI/CD 四大核心优势</p><p></p><p>极狐 GitLab CI/CD 真实用户使用反馈</p><p></p><p>扫码下载报告</p><p><img src=\"https://static001.geekbang.org/infoq/61/615b7c6a27842f75257030df8d87cecd.png\" /></p><p></p>",
    "publish_time": "2023-06-30 10:59:39",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "视频处理系统精细化演进，成本与体验之间如何找寻平衡点？",
    "url": "https://www.infoq.cn/article/ZozY8uOaKktbamYSmIiU",
    "summary": "<p>在视频的发展历程中，对于体验感的极致追求贯穿始终。</p><p></p><p>从短视频到直播，从云游戏到 VR 电竞，从视频会议到虚拟机器人，尽管应用场景在不断变化，但不变的是，用户的需求始终是以更加高清、更低延时，更强的沉浸性和交互性为导向。在这样的需求推动下，视频处理精细化成为了行业的必然发展方向。然而，这种精细化的演进之路却并非一帆风顺，需要在成本和体验之间找寻最佳的平衡点。当前，互联网的流量 80% 来自视频，仅短视频领域的用户规模就达到 5 亿。如何能够把大量视频以更加高效、高性价比的方式计算、存储、传播是对视频平台最大的挑战。</p><p></p><p>近日，InfoQ 与 Intel 联合打造的「<a href=\"https://www.infoq.cn/article/qf5THpWjlXKOyPKiA3wR\">英特尔® 至强®&nbsp;实战课</a>\"」，特邀火山引擎点播多媒体平台技术负责人张清源与英特尔云计算资深架构师陆扬进行分享，二位针对如何更好地拥抱视频化浪潮，如何实现更精细化的视频处理，如何平衡成本与体验等众多实际问题展开探讨。InfoQ 将本场分享内容整理成文，希望对大家有所帮助。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/6c/6c710d93229c838ae798777c6aa44277.png\" /></p><p></p><p></p><h2>成本与体验到底是不是零和博弈？</h2><p></p><p></p><p>随着短视频行业的蓬勃崛起和 AI、异构等技术的快速发展，视频处理系统的架构发生了很大的变化。在视频处理的演变过程中，逐渐出现端云结合的处理方式，进而实现了更加灵活和多样的视频处理体验。张清源以点播业务为例，介绍了视频处理的基本工作模式。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/c2/c20bb2811c02bc404ac02aa20b4643f5.png\" /></p><p></p><p>点播链路主要分为四个部分：端侧生产、云端生产、审核和下发。端侧生产是指使用移动设备拍摄视频，并进行增强和编辑，然后将视频上传至云端发布。其次是云端生产，包含两个流程：视频处理系统对视频进行处理，生成不同档位的视频；审核系统对视频进行合规审核。完成这两个流程后，视频可以进行下发，通过下发系统最终在播放器上播放。</p><p></p><p>当前，字节点播业务规模庞大。从计算方面来看，视频处理系统规模已经达到数百万核，预计不久的将来可能达到千万核。存储容量已经达到 EB 级别，带宽规模超过 100TB。因此，点播业务的成本巨大。</p><p>点播业务的成本主要由存储成本、转码成本、CDN 带宽成本等构成，其中 CDN 带宽成本占到整体成本的 70% 以上。点播业务的体验主要指播放体验。播放体验受到 QoS 指标（播放失败率、起播时间、卡顿率、视频质量等）、QoE 指标（播放次数、播放时长、完播率等）等多项指标的影响，且 QoS 指标也会对 QoE 指标产生影响。那么，如何优化成本和体验呢？</p><p></p><p>在成本方面，<a href=\"https://www.infoq.cn/article/zeyou9a4e4YYieNEi0Ot\">火山引擎</a>\"分别针对影响带宽成本、计算成本和存储成本的因素进行优化。例如，调整视频的码率可以降低带宽成本。同时，还可以减少不必要的数据传输，避免浪费带宽，优化缓存机制，减少不必要的数据缓存。对于计算成本，利用异构资源和工程优化来降低计算成本。在存储方面，采取转冷存储或删除低观看率的档位等措施来节省存储成本。</p><p></p><p>在提升体验方面，视频处理系统最主要的是对画质进行处理。而在播放端，包括首帧优化、移动端后处理等都可以改善播放体验。此外，还可以优化卡顿问题和同步性，以提升整体体验。</p><p></p><p>尽管单独优化某一方面可以采取很多措施，但成本和体验存在置换关系。例如，下发低档位的视频或调整转码参数可以降低成本，但会导致体验略有损失。预加载可以优化首帧和提升体验，但也会增加数据浪费和带宽成本。因此，在决策时，需要精细评估找到成本和体验的平衡点。通过 A/B 实验评估体验影响，最终，通过 ROI 评估判断是否将优化项应用或进一步优化。</p><p></p><p></p><h2>视频处理系统精细化演进之路</h2><p></p><p></p><p>由于视频业务规模逐渐庞大，哪怕是很小的优化，放在大规模的系统里收益都非常可观。因此，视频处理系统向数据驱动的精细化演进的方向发展很有必要。视频处理系统的精细化演进可拆解为画质精细化、资源精细化、策略精细化三个方面。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/63/6353aa632309cd3f7130dbd5d13428c1.png\" /></p><p></p><h3>画质精细化</h3><p></p><p></p><p>画质精细化即为每个视频定制处理流程，解决如何处理视频的问题。它是针对云端视频处理流程的一部分，从视频分析到视频前处理再到视频编码的过程。视频分析使用检测算法提取高维特征，为下一步处理决策提供依据。视频前处理采用增强算法对原片进行处理，然后使用编码器和内容自适应算法进行视频编码。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/b1/b127bdc10479d03b31255bea24fbbf69.png\" /></p><p></p><p>尽管云端处理是重要的，但张清源认为，未来视频处理系统将是端到端的统一系统。随着移动端计算性能的提升，一些算法可以在移动端进行补充，既可以节省云端计算资源，又可以结合用户算法策略。因此，需要建立云端和移动端之间的策略来连接它们。通过建设离线画质分析平台，即端到端实验仿真平台，实现端云算法结合，结合全链路仿真，获得最佳算法策略，实现线上收益最大化。</p><p></p><h3>资源精细化</h3><p></p><p></p><p>资源精细化，即在处理视频和资源规划中选择最合适和最优的资源配置，解决使用什么资源的问题。过去，视频处理系统几乎 100% 使用 CPU 资源，但随着时间的推移，除了 CPU 资源外，还可以选择具有弹性的 GPU 资源及其他异构资源进行使用。</p><p></p><p>在评估这些资源时，火山引擎会首先考虑业务特点，因为不同的业务对于压缩性能和任务延迟的要求可能不同。其次，需考虑峰谷时段选择合适的资源。高峰期可借用离线弹性资源以降低成本。第三，需要结合资源的特性，比如 CPU 最大的优点是稳定，通用性好，但是对于算力要求比较高，可能 GPU 更合适。此外，需要考虑预算、交付周期、线上实验、突发流量和容灾需求。资源分布在点播和实时业务中也需考虑。确定最优资源和配比，考虑当前和未来业务情况，进行分析和决策。</p><p></p><p></p><h3>策略精细化</h3><p></p><p></p><p>策略精细化，即结合业务场景的特点，寻找最佳的资源使用方式，用最少的资源实现最佳用户体验。</p><p>现有的策略能力有热度转码和冷启动。热度转码是根据视频热度阶段选择转码档位，而冷启动则通过预测模型预测视频的整体价值。此外，削峰填谷也是策略精细化的常见方式之一，其是基于视频价值函数曲线，考虑带宽收益、转码成本、播放成本和业务价值等因素，当视频价值大于零时选择转码高压缩率档位，以实现更精确地控制。最后是转存联动，指在转码和存储之间进行置换，特别是针对相对冷门的视频。对于这些视频，可以删除其中的一些档位以节省存储成本，但在需要时可以再次转码并恢复这些档位，从而在计算和存储成本之间实现节约，降低整体点播成本。</p><p></p><p>以上三种视频处理系统精细化演进的策略，在火山引擎的很多业务上都有应用，并且取得了非常大的成本和收益。但是，火山引擎希望这些能力不只是定制化的能力，而是能够朝着更加通用化和产品化的方向发展，这对成本优化非常重要，但也是一个具有挑战性的任务。</p><p></p><p></p><h2>软硬一体的视频处理体系架构</h2><p></p><p></p><p>成本体验的极致优化和业务的规模效应，促使视频处理系统向数据驱动的精细化方向演进。在视频处理系统精细化演进的趋势下，视频云解决方案应运而生。视频云解决方案通过整合大数据分析、人工智能、算法优化等技术，将数据驱动、策略优化和资源管理等能力融入视频处理和传输服务。</p><p></p><p>在众多的视频云解决方案中，英特尔视频云解决方案以其先进的硬件技术和开放式的架构脱颖而出。它利用英特尔强大的处理能力和丰富的视频处理经验，提供高效、可靠、高质量的视频处理能力，在资源精细化管理和策略优化方面具有独特优势。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/08/08e65c6bfca20dc8ec1a0b29cd508e61.png\" /></p><p></p><p>首先，通过 CPU 平台，它提供了高质量，编码灵活、通用性强且稳定可靠的视频处理方案。其次在密度成本方面，通过一机多卡高密度 GPU 编解码，实现了更高的计算密度和成本效益。在大部分情况下，视频处理平台也采用了异构平台的方式，即在云计算或视频处理集群中同时使用 CPU 和 GPU 等加速卡。这种异构平台的优势在于可以灵活配置计算资源，根据具体应用需求分配不同的计算算力和计算单元。对于质量、编程灵活性、通用性要求较高的应用，使用以 CPU 为主的集群进行处理。而对于游戏等需要渲染和密集计算的应用，通过 GPU 加速方案实现高效处理。在异构平台中，关键是如何管理和调配 CPU 和 GPU 的计算能力，以实现最佳的时延和吞吐性能。</p><p></p><p>英特尔的软硬件解决方案在视频领域应用广泛，主要集中在视频编解码、视频分析、游戏、远程桌面（VDI）、内容分发网络（CDN）、沉浸式 AR/VR/XR 六大领域。旨在帮助用户在视频领域的不同应用场景中获得最佳性能。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/40/400443a8a375b6cf36de1d7a13793fa0.png\" /></p><p></p><p>在视频编解码平台，基于英特尔的 CPU 和 GPU 平台可以搭建一个高效能的异构计算平台。在软件方面，包括提供了软件编码、硬件编码、软件开发工具库、性能监控工具等。英特尔的一些软件和工具已经开源，可通过相应的链接进行下载。</p><p></p><p>在视频分析领域，英特尔提供了基于其底层硬件，如 CPU、GPU 和 FPJA（例如 Habana®）的解决方案。这些硬件可以与各种与人工智能相关的框架和平台集成，例如英特尔® 发行版 OpenVINO™ 工具套件，它集成了最新的 AMX 指令集，以实现最佳的 AI 推理性能。此外，英特尔还提供了经过优化的 TensorFlow 和 PyTorch 版本以及自己的模型库（ModelZoo），并将优化后的 AI 模型开源，以便用户集成、测试和应用。</p><p></p><p>在游戏领域，英特尔提供了基于安卓和 Windows 的云游戏解决方案，并提供了 GPA 工具，用于监控游戏和 GPU 的性能，并实现最佳的性能调优。</p><p></p><p>对于 VDI、CDN 等领域，英特尔也提供了相应的软硬件配置、库、SDK 和 Library 等工具，用户可以方便地下载和使用。</p><p></p><p>所有这些解决方案都基于以英特尔® 至强®&nbsp;为主的<a href=\"https://www.infoq.cn/article/Z0gYs0LOvG0FesbVTitP\"> CPU 平台</a>\"、以 Xe 为主英特尔 dGPU 平台和 oneAPI 软硬件，并已经得到广泛应用和成熟验证。随着每一代至强处理器架构的升级，视频处理性能持续提升。从 Catholic 8260 到之前的 istake，再到现在的第四代英特尔® 至强® 可扩展处理器（Sapphire Rapids），视频编解码和转码的处理能力呈线性增长。在第四代英特尔® 至强® 可扩展处理器问世之前，所有的 8K 实时编解码赛事都需要使用四个至强®&nbsp;处理器。而今年随着第四代至强®&nbsp;的推出，已经能够在两个至强®&nbsp;处理器或两个 Sapphire Rapids 处理器上实现 8K 的实时转码，性能更优，性价比更高。</p><p></p><p>在基于第四代英特尔® 至强® 可扩展处理器和 GPU 的异构视频处理平台中，CPU 负责处理视频业务的接收和分发，作为整体调度中心。CPU 编解码产生的视频质量可靠且高。GPU 主要处理速度敏感型的在线业务，包括直播、游戏和渲染加速。使用小型且高密度的 GPU 部署，可进一步降低总体成本。根据需求进行扩展和优化，提供更好的性价比和吞吐量。这种异构平台已经在许多应用领域得到了广泛应用，例如直播编解码、赛事转播、游戏 VDI 超分和视频分析等。它为客户带来了更高的性能和性价比，满足了不同领域的视频处理需求。</p><p></p><p>在异构平台中，如何协同调配 CPU、GPU 和其他加速卡之间的任务是非常重要的。为了解决这个问题，英特尔推出了名为 Deeplink 的技术。Deeplink 技术提供了 Dynamic Power Share（动态功耗共享）、Stream Assist（流式访问）等协同处理和加速的方法，以提高异构平台的整体性能和效率。&nbsp; &nbsp;通过 Deeplink 技术，英特尔可以在 Flex140 这款 GPU 卡上稳定实现 8K 的实时 GPU 编解码。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/95/953d80220045369eb4cb5ecf461588d3.png\" /></p><p></p><p>基于至强®&nbsp;CPU 和 GPU，英特尔构建了可扩展的视频处理器平台。该平台涵盖底层硬件和软件基础架构，包括操作系统、硬件加速器、Docker、API、数据库和 SDK 等。虽然英特尔被认为是一家以硬件为主的公司，但也拥有庞大的软件团队。从底层的 Firmware 到驱动、操作系统，再到 Kubernetes、虚拟化和容器化环境的调度和利用，软件团队致力于与合作伙伴合作，充分利用硬件架构的特性，为视频云上的各种应用提供高效的软件解决方案。</p><p></p><p></p><h2>极致的性能，成本与体验“鱼与熊掌”兼得的密码</h2><p></p><p></p><p>谈到这里，回归最初的问题“成本与体验到底是不是零和博弈”想必大家都有了答案。陆扬表示，成本的优化，无外乎是性价比的问题。当性能提高到一定水平，性价比、整体成本自然就有所下降。在英特尔平台的迭代中，不断提升核心计算能力，包括频率、缓存大小和内存容量等，都是希望通过这些升级来降低整体拥有成本，提高性价比。在过去几十年以及未来，英特尔的软硬件架构解决方案将继续与合作伙伴一起致力于提高视频云行业的服务质量、总体性能和应用成本。</p><p></p><p>有关未来视频处理系统的趋势和发展方向，张清源持极其乐观的态度。他表示，整个视频领域未来会朝着更高清、更沉浸、更交互的方向去演进。算力的增长还会继续，并将推动计算资源的创新，从而提高计算效率和降低成本。其次，AI 算法和端到端算法联动将成为重要的发展方向，使视频处理从全链路角度考虑整体效果。此外，精细化也是一个趋势，类似于推荐系统的个性化推荐，视频处理可能会结合人群特点进行定制化处理。这些方向都有很大的潜力。</p><p></p><p>陆扬补充道，视频的发展趋势包括分辨率的提升和适配范围的扩大。视频分辨率已经发展到 8K，然而，这种超高清分辨率对计算中心提出了巨大挑战，因为处理这样的视频需要处理庞大的计算量。另外，AI 应用的迅猛发展也对计算中心提出了挑战。无论是 CPU、加速器还是异构平台，如何高效智能地运行越来越复杂的应用和计算中心，使计算能够无缝衔接，具备全链路的动态感知和自适应能力，都是未来的重要方向。基于此，陆扬希望英特尔的最新硬件架构平台能够适应不断变化的视频云应用，更好地服务大众需求。</p><p></p><p><a href=\"https://www.intel.cn/content/www/cn/zh/cloud-computing/overview.html?cid=soc&amp;source=WeChat&amp;article_id=4836\">点击此处</a>\"，了解更多英特尔云及互联网行业创新实践。</p>",
    "publish_time": "2023-06-30 12:28:16",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]