[
  {
    "title": "谷歌Gemini自曝用百度文心一言训练；淘天集团管理团队全部换血；马斯克X平台再次遭遇全球性宕机 | AI一周资讯",
    "url": "https://www.infoq.cn/article/7EYH6l9fiytaV7OkwTM7",
    "summary": "<p></p><blockquote>吴泳铭再发全员信：淘天集团管理团队全部换血；马斯克X平台再次遭遇全球性宕机，持续时间超一个小时；“OpenAI劲敌”启动新一轮融资，估值达184亿美元；Nature 重磅：AI 复现诺奖研究，只需几分钟，一次即可成功……</blockquote><p></p><p></p><h2>资讯</h2><p></p><p></p><h4>国家大模型标准测试结果公布：三六零、百度、腾讯、阿里通过</h4><p></p><p></p><p>12月23日上午消息，国内首个官方“大模型标准符合性评测”结果公布，首批仅360集团、百度、腾讯、阿里通过。</p><p></p><p>该测试由工信部中国电子技术标准化研究院（简称“工信部电子标准院”）发起，评测围绕多领域多维度模型评测框架与指标体系，从大模型的通用性、智能性、安全性等维度开展，涵盖语言、语音、视觉等多模态领域，旨在建立大模型标准符合性名录，引领人工智能产业健康有序发展。</p><p></p><h4>吴泳铭再发全员信：淘天集团管理团队全部换血</h4><p></p><p></p><p>12月22日下午消息，吴泳铭宣布了淘天集团最新组织决定，年轻化管理团队全面接棒。6位年轻管理者被任命分别带领淘天集团各关键业务，直接向吴泳铭汇报。吴泳铭同时对淘天集团提出要求：正视现状，重新创业。</p><p></p><p>“85后”吴嘉将负责淘天用户平台事业部与阿里妈妈事业部。据了解，吴嘉2010年校招加入阿里巴巴，在技术开发一线积累了丰富经验，培育孵化了广受年轻人欢迎的产品夸克。吴嘉还将继续兼任智能信息总裁。</p><p></p><p>现任饿了么首席运营官谌伟业（处端）将调任淘宝，负责淘宝事业部、淘天商家平台部、淘天客户满意部。他主导提出饿了么“放心点准时达”的品牌价值方向，创设了现象级营销“猜答案免单”。他也是另一款年轻人喜爱的闲置交易和兴趣内容平台闲鱼的初创人。</p><p></p><p>刘博（家洛）将接手天猫事业部，十几年来他一直在淘宝天猫业务一线，商业实战经验丰富，连续开创了多个战略赛道。生于87年的汪庭祥（少游）则将带领服饰发展部。原直营业务负责人刘一曼（一漫）将负责M2C事业部。程道放（道放）将带领淘宝直播及内容事业部，负责推进淘宝内容化建设与创新。</p><p></p><p>吴嘉、处端二人从其他业务集团调任淘天新岗位，其他四位管理者的工作职责也均有新变化，显示出阿里集团对战略重心业务的统一指挥和高强度人才投入。</p><p></p><h4>“OpenAI劲敌”启动新一轮融资，估值达184亿美元</h4><p></p><p></p><p>据媒体援引知情人士透露的消息报道称，有着“OpenAI劲敌”之称的人工智能初创公司Anthropic正在谈判筹集7.5亿美元的最新一轮融资，该轮融资由Menlo Ventures领投。自Menlo Ventures成立以来，这家闻名全球的风投机构已投资超过400家公司，其中包括优步(Uber)、吉利德科学(Gilead Sciences)、Fab.com、以及Roku等。该风投机构的成功投资案例包括超过70家成功上市的公司和100多起并购。</p><p></p><p>据知情人士透露，在全球企业纷纷斥巨资布局生成式AI的大趋势之下，经历最新一轮融资之后，Anthropic的估值有望高达184亿美元，几乎是该公司今年早些时候41亿美元估值的4.5倍。知名爆料平台The Information最先报道过有关此次融资的最新消息。Anthropic拒绝对相关的报道发表评论。</p><p></p><h4>谷歌Gemini自曝用百度文心一言训练</h4><p></p><p></p><p>近日有网友爆出，在对谷歌Gemini进行测试时，如果用中文询问Gemini的身份，其会坚称自己是“百度”。若输入“小度”或“小爱同学”等提示词，就能把Gemini直接唤醒，不仅承认自己就是小度或者小爱，还询问用户有什么需要帮忙之事。</p><p></p><p>对此，有关媒体进行了更细致的测试，其在谷歌Vertex AI平台使用Gemini进行中文对话，发现Gemini-Pro确实完全带入了百度文心一言大模型的身份，直接表示自己是百度语言大模型。但如果换成英文与之交流，它就恢复到了谷歌大模型的身份认知，表现很是正常。如果在融入了Gemini-Pro的Bard上进行测试，不论是使用中文或英文提示词，得到的答案都很正常，没有涉及到文心一言的部分。</p><p></p><p>随后，再对Gemini-Pro做类似的身份测试时，发现其已进行了模型优化，不再承认自己与百度之间的“瓜葛”。不过，在追问之下，Gemini承认有训练语料来自百度，还详述了从百度内部获得数据的方式。截至发稿，百度方面尚未对此问题作出回应。</p><p></p><h4>Nature 重磅：AI 复现诺奖研究，只需几分钟，一次即可成功</h4><p></p><p></p><p>只用几分钟，AI 便成功复现了一项诺奖研究，且只需要尝试一次。</p><p></p><p>这个由 GPT-4 驱动的“AI 实验室伙伴”名为 Coscientist，由来自卡内基梅隆大学和 Emerald Cloud Lab 的研究团队共同提出，刚刚登上了权威科学期刊 Nature。</p><p></p><p>据介绍，Coscientist 结合大型语言模型（LLMs）的能力以及互联网和文档搜索、代码执行和实验自动化等工具，能够自主设计、规划和执行真实世界的化学实验。</p><p></p><p>Coscientist 在六个不同任务中展示了其加速研究的潜力，包括成功优化钯催化偶联反应（美国化学家 Richard Fred Heck 与两位日本化学家 Ei-ichi Negishi 和 Akira Suzuki 因“对有机合成中钯催化偶联反应的研究”获得了 2010 年诺贝尔化学奖），同时在（半）自主实验设计和执行方面展现了先进的能力。</p><p></p><h4>马斯克X平台再次遭遇全球性宕机，持续时间超一个小时</h4><p></p><p></p><p>当地时间周四凌晨，马斯克的社交媒体平台X突发全球性宕机，来自加拿大、英国、法国和其他国家的数千名用户报告称，出现了主页无法刷新、内容无法显示等问题。Downdetector跟踪数据显示，在中断高峰期，超过7.7万名用户遇到问题。</p><p></p><p>此次崩溃事件波及 X 平台全球范围内用户，包含PC Web端及移动平台客户端在内，所有用户均无法查看时间线、访问个人资料卡、发布贴文。周四早间，X在全球恢复服务，目前尚不清楚宕机原因。</p><p></p><p>全球互联网追踪机构Netblocks表示，此次“严重的国际中断”，似乎与任何国家层面的屏蔽或过滤无关。截至北京时间21日下午4点，X宕机事件仍在该平台的讨论热榜上。许多用户还在其竞争对手Meta的应用程序Threads上讨论了这次宕机，称在访问X上的帖子、回复和个人资料时遇到了困难。</p><p></p><h4>谷歌推出 TpuGraphs 训练数据集，可强化 AI 模型深度学习能力</h4><p></p><p></p><p>谷歌日前推出一款名为 TpuGraphs 的模型训练数据集，主要用于“优化编译器”、“提升 AI 深度学习能力”。</p><p></p><p>谷歌指出，当下 AI 深度学习系统通常使用 TensorFlow、JAX、PyTorch 等框架训练而成，这些框架主要通过底层编译器的启发式算法（Heuristic Algorithm）优化模型，而在相关编译器中运用“学习成本模型”，即可改善编译器的性能，并提升最终输出模型的深度学习能力。</p><p></p><h4>盒马、饿了么将被出售？多方回应</h4><p></p><p></p><p>12月20日，阿里巴巴集团CEO、淘天集团董事长吴泳铭兼任淘天集团CEO，成为首位同时担任三大核心业务CEO的集团CEO。12月20日，有媒体报道称，阿里集团CEO吴泳铭已经做出了一系列资本规划，盒马已经在考虑出售，饿了么或将有新的资本动作，优酷则正考虑并入阿里影业，但前提是能够稳定盈利。</p><p></p><p>对此，盒马方面回应记者称，该消息为不实传闻。阿里大文娱回应称，假的。饿了么方面也表示，消息不实。</p><p></p><h4>比尔·盖茨发布年度展望：人工智能将以前所未有的速度加快新发现</h4><p></p><p></p><p>当地时间12月19日，微软公司联合创始人、慈善家比尔·盖茨发布了对来年的年度预测，称2024年将是一个“转折点”。他在这封长达10页的信中表示，期望看到人工智能领域的更多创新、婴儿营养不良问题的突破、气候变化谈判的进展以及具有决定性意义的全球选举。</p><p></p><p>2023年前，盖茨预计，世界可以收复根除脊髓灰质炎的失地，人工智能超声波可以帮助拯救母亲及其婴儿，基因疗法可以帮助治疗艾滋病，更好的建筑可以应对气候变化。他今年对人工智能的预测超越了去年，断言人工智能的进步将广泛改善全球健康，同时促进发达国家和发展中国家的创新。“人工智能将以我们以前从未见过的速度加快新发现。”他写道，“如果我们现在做出明智的投资，人工智能可以让世界变得更加公平。”盖茨预测，高收入国家的普通民众距离广泛使用人工智能还有18至24个月的时间。在其他地方，盖茨预计这个数字将是三年。</p><p></p><h4>《Nature》预测 2024 科技大事</h4><p></p><p></p><p>《Nature》杂志近日盘点了 2024 年值得关注的科学事件，包括 GPT-5 与新一代 AlphaFold、超算 Jupiter、探索月球任务、生产「超级蚊子」、朝向星辰大海、试验下一代新冠疫苗、照亮暗物质、意识之辩第二回合、应对气候变化。</p><p></p><p>今年以来，以 ChatGPT 为代表的大语言模型的兴起，对科学界产生了深远的影响。《Nature》认为，OpenAI 预计将于明年底发布 ChatGPT 下一代模型 GPT-5，另外科学家也在密切关注 GPT-4 竞争对手 Google  Gemini 的进展。Google DeepMind  的 AI 工具 AlphaFold 的新版本也将于明年发布，此前研究人员已经用它来准确预测了蛋白质的 3D 形状。新版本的 AlphaFold  能够以原子精度模拟蛋白质、核酸和其他分子之间的相互作用，这可能为药物设计和发现开辟新的可能性。</p><p></p><h4>多名美国作家起诉OpenAI：滥用自己作品训练GPT模型</h4><p></p><p></p><p>据媒体报道，几位普利策奖得主加入了针对微软和热门AI聊天机器人ChatGPT开发者OpenAI的集体诉讼，指控这两家科技公司未经许可使用他们的版权作品来训练AI模型。</p><p></p><p>这起诉讼最初由作家朱利安·桑顿（Julian Sancton）于11月底提起。根据周二提交的一份修改后的起诉书，现在原告还包括凯·伯德（Kai Bird）、泰勒·布兰奇（Taylor Branch）、史黛西·希夫（Stacy Schiff）和其他八位非小说类作家。</p><p></p><p>这些非小说类作家声称，OpenAI和微软在未经许可的情况下使用他们的作品来训练GPT模型，违反了版权法。微软已向OpenAI投资了数十亿美元，并与后者建立了密切的合作关系。</p><p></p><p>“OpenAI和微软在未经许可的情况下，盗用人类的共同成果，建立了一项价值数百亿美元的业务，”他们在诉讼中写道。“他们不愿意为知识产权付费，而是假装保护版权的法律不存在。”</p><p></p><p>“非小说类作家通常花费数年时间构思、研究和撰写他们的作品，”诉讼称。“OpenAI和微软拒绝向非小说类作家付费，而他们的AI平台却价值不菲。OpenAI平台的基础是对版权作品的猖獗盗窃。”</p><p></p><p>作家们向法院提出了金额不详的赔偿要求，并要求法院下令这些公司停止侵犯版权。</p><p></p><h2>IT 业界热评新闻</h2><p></p><p></p><h4>Python 爬虫库 Requests 作者因狂躁症失业：在线求资助、找工作</h4><p></p><p></p><p>Requests 是知名的 Python HTTP 库（项目已捐赠给 Python 软件基金会）。 最近 Requests 作者 Kenneth Reitz 在社交媒体表示自己目前的财务情况出现问题，所以需要寻求资金来维持基本生存。</p><p></p><p>Kenneth Reitz 表示，几周前他因狂躁症（mania）失业了，并称：“我目前正在寻求资金，以维持我们的生计。到目前为止，我所担任的职位在经济上并不宽裕。虽然我正在努力，但我们现在的生活还是捉襟见肘。有人愿意帮忙吗？”</p>",
    "publish_time": "2023-12-24 14:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]