[
  {
    "title": "南京钢铁：用精准培养方式“填补”人才缺口",
    "url": "https://www.infoq.cn/article/zvcfOe2sHhl6wW094OvV",
    "summary": "<p>数字化人才是传统制造提质升级的关键因素，但是人才需求总量和缺口巨大，这也是摆在面前的实际挑战。</p><p></p><p>在日前举办的<a href=\"https://app.jingsocial.com/microFrontend/leadGeneration/jsf-leads/list/webinar/P8KAMuAA7DmVHnBydPuGL8/C2CviyZ3WNSRYyMpEC98C4\">DTDS 全球数字人才发展线上峰会</a>\"上，南京钢铁人才发展中心主任/高级经济师仲崇波详细介绍了钢铁行业眼下的数字化困境，以及南京钢铁为解决人才问题明确提出的“1+2+7”人力资源战略。</p><p></p><p>据了解，再这一战略基础上，南京钢铁已经构建了分类别、分阶段、分层级、全覆盖、精准培养的数字化人才培养体系，并绘制了名为“育龙计划”的人才发展地图。此外，南京钢铁还首创行业人力资源体系数字化序列，建立了数字化人才活水机制，通过构建职级对照体系，支撑数字化组织迭代进化。</p><p></p><p>以下是演讲实录（经 InfoQ 进行不改变原意的编辑整理）：</p><p></p><p>下面我将从三个方面跟大家分享企业的数字化人才培养。第一，是钢铁行业如何应对数字化发展，如何进行数字化转型。第二，在数字化转型背景下，如何调整人力资源战略，如何培养自己的数字化人才。第三，南京钢铁（以下简称“南钢”）是如何进行数字化人才培养的。</p><p></p><h3>钢铁数字化五大挑战：不会/不能/不敢/不善/不愿</h3><p></p><p></p><p>面对着世界百年未有之大变局，在第四次工业革命背景下，全球加速进入大国间的数字经济竞争时代，我们正在经历一场更大范围、更深层次的科技革命和产业变革。数字技术红利已经从消费领域快速深入到了工业领域，催生了<a href=\"https://xie.infoq.cn/article/4ae31fdf4f448f3ec0a0b293e\">工业互联网</a>\"，作为一个生产制造型企业，我们在其中充满机会，也面临着挑战。</p><p></p><p>首先，我国钢铁行业基础相较薄弱，虽然是钢铁大国但不是钢铁强国，虽然钢铁规模全球第一，但高端制造业的总体水平尚有不足，科技转换水平还不充分。</p><p></p><p>其次，钢铁行业本身也面临着一系列的痛点和难点。</p><p></p><p>比如，钢铁行业是一个长流程制造行业，从铁矿石、煤炭到铁水、钢水，再到线材、棒材和板材制造，最后到客户交付，需要非常长的周期；比如，钢铁行业近些年来工作环境得到极大改善，但相较于IT和金融等行业的还有很大的提升空间；比如，钢铁行业作为长流程制造，上下游不同部门、流程之间的管控对象众多，需要协调的内容也比较多；同时，业务的架构存在瓶颈，如何打通不同业务部门、管控对象、上下游企业之间的部门墙，提高协同性和高度融合性，一直是我们在探索的事情。</p><p></p><p>因此，在钢铁行业进行数字化转型过程中存在能力不够不会转、成本太高不能转、人才不足不敢转、战略不清不善转、组织迟缓不愿意转等种种问题。</p><p></p><p>与此同时，数字化人才是传统制造型企业提质升级的关键因素，而人才的需求总量和缺口非常巨大，中国制造业虽然有着规模庞大、门类齐全、体系完整的优势，但它同时也存在着创新能力不强，工业化和信息化融合度不够，核心技术和对外依存度高，以及数字化复合型人才短缺等问题。</p><p></p><h3>对齐数字化战略，重新梳理组织和人才体系</h3><p></p><p></p><p>那么，针对行业本身以及人才方面的各种挑战，钢铁企业究竟该何去何从？</p><p></p><p>首先，南钢紧紧围绕企业的发展战略，以及“创建国际一流受尊重的企业智慧生命体”的愿景，同时聚焦三大成长曲线，承接战略目标，通过不断完善创新支撑系统，来打造流程机制，完善考核奖励机制，实现人才和文化的高度融合，同时提供一系列的技术支撑，从而实现创新驱动。</p><p></p><p>在数字化实施路径方面，南钢主要通过优化工艺、精益组织加上自动化、<a href=\"https://www.infoq.cn/article/XlyVG0TzW8kZQA0xFiJl\">智能化</a>\"来实现制造过程的智能化；通过组织变革、流程再造、数字化运营，减少事务性工作，做好运营过程的数智化；通过创新机制、激活组织、集中资源，实现辅助过程的市场化、专业化运作。</p><p></p><p>对应地，南钢围绕人力资源发展的三大支柱做好新产业的裂变服务，通过管控转向服务加上赋能，做好四大方向的发展：一是作为战略合作伙伴，二是作为HR的效率专家，三是作为员工的服务支持者，四是作为组织发展的变革推动者。最终，我们确立了人力资源战略发展和数字化转型目标，即“1+2+7战略”，目标是实现钢铁联合企业的全球效能领先。</p><p></p><p>目标的确定之后，就是进行重点事项的推进，包括通过生产、设备、质量、供应链、战略、财务、人事等各方面的高度融合，做好智慧炼铁、智慧轧钢、智能调度以及财务共享、DHR、智慧营销等工作，达到全流程、全领域的数字化融合。</p><p></p><p>在组织方面，我们通过快速敏捷、专业精深、智能创新的平台型组织做好组织设计，通过数字化人才盘点，选才育才、聚才引才做好数字化人才平衡，通过拓宽渠道、广开言路、有效沟通，做好过程管控。最终形成了多元化、全覆盖、一体化的职位体系设计，通过“三纵四横”的职级体系及相对照的“双主业”职位体系，贯彻“双师制”的制度引领，打穿了各序列间的发展通道。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/97/970f1cd5aae99c2423bdfda5d79db2c7.png\" /></p><p></p><p>操作序列方面，南钢围绕工匠人才的培养，划分为操作工、1-4级操作师，到上面的高级操作师以及首席操作师；管理序列包括员工层、基层管理人员、中层管理人员和高级管理人员；双主业指的是派驻到所辖子公司的骨干人员，他们比照的也是公司的员工层、基层、中层和高级管理人员。</p><p></p><p>与此同时，我们设立了专业的数字化人才发展序列，对照管理序列和派驻骨干“双主业”，我们有主办员、高级技术经理&amp;技术经理、首席专家&amp;技术总监，以及首席科学家，这为数字化人才的发展描绘一个通道。</p><p></p><p>“双师制”牵引方面，我们打通了高技能人才和工程技术人才的融合发展贯通，通过引导性打破通道壁垒，激励性享受人才津贴，做好技能等级支撑通道的人才发展。同时这两个通道作为选拔评聘的一个重要指标，鼓励培养更加专业化、多元化的技术技能人才队伍。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/d4/d4fa3af92883836818fd9d2d25fdc5ad.png\" /></p><p></p><p>岗位价值评估方面，我们围绕数字化序列的人才成长特性，进行知识技能提升（专业领域知识、管理性知识、沟通影响技能），加上解决问题的能力（涉及思考的环境、思考的挑战），以及责任性的成果输出（包括行动的自由度、影响范围、影响性质），最后跟钢铁行业特有的工作环境条件（包括温度、声音、劳动强度等）相结合，得出岗位价值排序，然后确定参评对象以及专业代表各层级的管理人员，结合工具解析、过程纠偏，以及研讨修正、确定职级等评估流程，最终确定岗位价值。</p><p></p><h3>数字化人才培养体系：全覆盖、分层级、精准培养</h3><p></p><p></p><p>基于以上战略和目标，南钢的数字化人才培养工作是如何展开的呢？</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/ec/ec1b023fa64304d5a048397bc32e55f9.png\" /></p><p></p><p>南钢人才发展中心实行的是二级培训体系，有些项目由南钢人才发展中心进行组织策划和实施，有些专项项目则由二级单位进行。</p><p></p><p>具体来说，我们会围绕数字化管理、数字化技术、数字化运营、数字化项目管理，采用云课堂录播&amp;直播的方式进行资源的共享。通过对人才进行<a href=\"https://www.infoq.cn/minibook/WvG2KwN4tFfpjtTaxNve\">分类别、分阶段、分层级、全覆盖、精准培养</a>\"构建人才培养体系。</p><p></p><p>比如，围绕国家级数字化研发实验室与省级重点实验室，面向数字化专家团队开展一些数据治理工程师、阿米巴大讲班、组长班讲堂等项目；再比如，提供潜龙训练营、学历提升、创新训练等各式各样的数字化能力提升培训班。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/ed/ed1cb88d7c405d7d00f9b9bd674609bf.png\" /></p><p></p><p>另外，南钢还绘制了一个名为“育龙计划”的数字化人才发展地图，并针对性地提供数字化培训相关的内容。以数字化人员为例，把人才划分为四个层级：第一，入职三年的大学生；第二，E层数字化人才（技术经理/高级技术经理）；第三， C层数字化人员（技术总监/首席专家）；第四，首席科学家。由前往后，每个层级人员都会作为后面层级的后备人才进行储备和培养。</p><p></p><p>当然，我们对于数字化人才也会设置“大浪淘沙”的选拔机制。比如，设置包括数字化岗位的工作经历（如OT+IT）这样的条件；进行测试选拔，围绕数字化、潜能、综合笔试、计算机测试进行综合打分；对通过测试的人员进行面试选拔，面试中采用随机提问、文件筐、无领导小组等形式进行，通过综合评价不断严把选拔关、入门关。</p><p></p><p>选拔完成后，在培训过程中，南钢确立了能力提升和团队管理两大主题，自主管理、竞合机制、动静结合三项机制，完成练内功、看结果、带团队、定方向四个阶段，达成学员体力好、脑力快、心力强、信息力全的复合型数字化人才的培养目标。其中，“动静结合”指的是除了有课题作业、集中培训、针对性的培训测试之外，还有团队活动、数字化项目参与、座谈交流、对标学习等方式，多方位提高人才能力。</p><p></p><p>组织赋能方面，我们主要通过公司数据Owner牵头组织来召开会议，提供一些专业的指导和决策，依托下属子公司开展研发生产业务等领域的项目开展，共同落实数字化项目的推进。</p><p></p><p>通过数字化序列体系的建设，我们在IT+OT人才梯队培训培养这一块也取得了一些成果。</p><p></p><p>举例来说，在数据治理体系培训方面，自2021年来共开展了两期的PMP培训，以及数据治理DAMA培训，面向数据Owner开展了数据治理体系培训，面向数据管家提供数据资产化培训；在项目管理体系培训与认证方面，我们取得了PMP项目国际认证和项目管理师、高级项目管理师的国家认证；在数字化人才序列方面，我们会把数字化相关认证作为数字化序列E层管理人员的基本任职条件之一。</p><p></p><p>南钢的数字化序列是人力资源体系行业首创，我们建立数字化人才活水机制，建立职级对照体系，数字化首席科学家岗位与公司高管相同职级，支撑数字化组织迭代进化。</p><p></p><p>通过人才活水机制，我们对基层技术人员不断进行培养，并输送到各个机关、部室、事业部，通过轮岗的形式参与到公司级的管理部门和管理项目中。采用激励机制、考核机制、技术合伙人机制，让更多的数字化人才、复合型人才选拔和轮岗到数字化序列中。</p><p></p><p>同时，我们打通了企业内部和外部专家智库通道，通过双向的相互交流和带教以及分享，实现了内外数字化的融合和贯通。</p><p></p><p>通过不断地探索，南钢以“智造”赋能产业，数字化转型成果受到来各级政府领导、兄弟单位和产业链上下游企业的高度认可，在数字技术诸多领域荣获国家及省级荣誉60余项，实现了行业示范引领。</p><p></p><p>在这个过程中，所有成果的取得离不开数字化人才的培养以及各个部门的通力合作。当然，数字化人才培养，我们仍然在路上，希望南钢的样本，可以给大家提供更多的启示和启发。</p><p></p><p>延展阅读：</p><p><a href=\"https://mp.weixin.qq.com/s/wuHISAf4Cb7qKxfsAWwXdA\">《传统管理秩序消失，数字化下的组织和人才如何重塑》</a>\"</p><p><a href=\"https://www.infoq.cn/article/6rPg98g1JfvBEfRvsrDh\">《12 维度能力画像、1+3 认证体系，东亚银行如何搭建数字人才体系》</a>\"</p>",
    "publish_time": "2023-06-21 09:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]