[
  {
    "title": "Swift 5.9 Backtracer 实现并发感知，并改进可靠性和 Linux 支持",
    "url": "https://www.infoq.cn/article/l6wqFZCEAAp4G16yoobZ",
    "summary": "<p></p><p>除了通过宏和借用式内存管理扩展语言之外，Swift 5.9 还引入了一些有用的程序调试功能，包括进程外崩溃处理程序、即时调试支持和回溯，旨在简化使用结构化并发时的控制流解释。</p><p></p><p>进程外崩溃处理是一个非常强大的新功能，它通常可以防止程序崩溃，并让你可以检查程序或为其附加调试器。</p><p></p><p>当启用了这个新特性的程序崩溃时，你会看到一个提示，让你可以更改回溯设置，生成新的回溯，列出加载的图像，显示寄存器和内存内容，并获得进程中所有线程的列表。或者，你可以将调试器附加到崩溃的进程并交互式地检查其状态。如果你不选择任何选项，那么程序将在 30 秒或预先配置好的时间后崩溃。</p><p></p><p>进程外崩溃处理程序对 Linux 开发人员来说特别重要，因为他们习惯于在控制台中获得程序崩溃的简明错误消息，而不是借助任何其他额外的工具。为此，在 Linux 上，崩溃处理程序是默认开启的，而在 macOS 上则必须手动启用。这个新功能尚未提供 Windows 支持，但是开发者可以访问操作系统内置的崩溃报告来获取导致崩溃的其他信息。</p><p></p><p>另一项备受欢迎的改进是回溯器现在具备了并发感知能力。也就是说，它能够通过异步帧进行回溯，例如当 async 函数通过 await 语句执行时。在这种情况下，await/async 调用在回溯中和普通调用没什么不一样，并不会显示属于运行时 await/async 机制的过渡帧。不过，这个新功能要求回溯器能够查找程序符号来判断一个帧是否是异步的。</p><p></p><p>最后需要说明的是，为了提高可靠性，Swift 5.9 中的新回溯器允许你配置回溯器将生成的最大帧数以及你想要显示的堆栈顶部的帧数。此外，在默认情况下，它会跳过系统帧和 Swift thunk，应用程序开发人员很少对这些内容感兴趣。</p><p></p><p>原文链接：</p><p><a href=\"https://www.infoq.com/news/2023/11/swift-5-9-backtracer-debugger/\">https://www.infoq.com/news/2023/11/swift-5-9-backtracer-debugger/</a>\"</p>",
    "publish_time": "2023-12-19 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "2023 深圳国际金融科技大赛圆满落幕：培养创新人才，助推金融科技发展",
    "url": "https://www.infoq.cn/article/9uBBmHfLCUGEw2u1KLOl",
    "summary": "<p>12 月 16 日 -18 日，在深圳市地方金融监督管理局、深圳市福田区人民政府、深圳市南山区人民政府的战略指导下，由深圳大学、微众银行、深圳香蜜湖国际金融科技研究院等多方联合举办的“<a href=\"https://www.infoq.cn/video/atB6FuOvpIQGQPWLX0Eo?utm_campaign=geek_search&amp;utm_content=geek_search&amp;utm_medium=geek_search&amp;utm_source=geek_search&amp;utm_term=geek_search\">2023 深圳国际金融科技大赛（FinTechathon）</a>\"——西丽湖金融科技大学生挑战赛”（下文称“大赛”）在深圳大学圆满落幕，并举行大赛颁奖典礼仪式。深圳市地方金融监督管理局党组成员、副局长王新东，微众银行副行长、首席信息官马智涛，<a href=\"https://www.infoq.cn/article/FzhKDk2oUSugP5JLj89l?utm_campaign=geek_search&amp;utm_content=geek_search&amp;utm_medium=geek_search&amp;utm_source=geek_search&amp;utm_term=geek_search\">深圳大学</a>\"微众金融科技学院党委书记刘海山现场出席并致辞。</p><p></p><p>作为深圳市金融科技节的一环，该赛事已成功举办五届，通过发挥资源、人才、技术和协同创新优势，促成产学研合作向纵深迈进，赢得了广泛关注和认可。本届大赛历时三个月，收到超过 1500 名学生组成的逾 300 支赛队报名，其中我国双一流院校报名人数突破 670 人，并有超过 30 所境外高校报名参赛。经过激烈角逐，此次大赛为区块链、人工智能、产品经理三个赛道的获奖赛队授予了总计 69 万元的奖金及区块链数字证书。</p><p></p><p>值得一提的是，该数字证书基于微众区块链技术，采用国产安全可控开源平台 FISCO BCOS 为底层链，上链获奖信息防篡改、可追溯、数据来源可信任。获奖选手可随时查看和下载数字证书，校方、招聘企业等也可以扫码快速验证证书真伪，达到可信验证、高效互通的效果。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/21/21d7085e6835119fed32741ac854ef57.png\" /></p><p></p><p>在颁奖典礼上，深圳市地方金融监督管理局党组成员、副局长王新东表示：“本届大赛坚持学以致用的理念，对探寻金融科技发展前景、加强新兴金融科技人才培养、打造产学研深度融合新格局具有重要意义。”</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/99/99d1960f6d53a0501a0fef95e9f6e452.png\" /></p><p>图：深圳市地方金融监督管理局党组成员、副局长王新东致辞</p><p></p><p>深圳大学微众金融科技学院党委书记刘海山表示：“以赛带学，此次与<a href=\"https://www.infoq.cn/article/NjkLsroBG4rfmaAYdu13?utm_campaign=geek_search&amp;utm_content=geek_search&amp;utm_medium=geek_search&amp;utm_source=geek_search&amp;utm_term=geek_search\">微众银行</a>\"联合举办金融科技大赛，吸引海内外人才积极探索金融科技领域的技术应用创新，有机会为行业提供更多具有应用价值的技术解决方案。”</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/2b/2b0bc5430cd32b48d6014a7774c5d49b.png\" /></p><p>图：深圳大学微众金融科技学院党委书记刘海山致辞</p><p></p><p>微众银行副行长、首席信息官马智涛表示：“本届大赛有利于挖掘和培养金融科技人才，为深圳市打造金融科技发展高地提供人才储备。此外，作为以科技为核心发展引擎的数字银行，微众银行将继续以开放的态度，多措并举助推金融科技的发展和应用。”</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/a8/a8721c7db9cd1e2d25c377e5c1f4bbbd.png\" /></p><p>图：微众银行副行长、首席信息官马智涛致辞</p><p></p><p>据了解，作为大赛的发起者和主办方之一，微众银行是我国首家数字银行，持续深耕金融科技，在区块链、人工智能、云计算和大数据等关键技术领域开展产学研用攻关，并建成了全球首个完全自主可控、支持亿级用户和高并发交易的分布式核心系统，成为国内首家获得国家高新技术企业认证的商业银行。此外，该行始终注重金融科技人才的引进和培养，自成立以来，科技人员占比始终保持在 50% 以上，历年科技研发费用占营业收入比重约达 10%，为其践行普惠金融、服务实体经济发展奠定了坚实的基础。</p>",
    "publish_time": "2023-12-19 08:30:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "北京飞漫软件技术有限公司创始人兼 CEO 魏永明确认出席 QCon 上海，分享 HVML 编程语言及其应用的跨端运行技术",
    "url": "https://www.infoq.cn/article/9IDhlVR1HGWkQhFGMzCt",
    "summary": "<p><a href=\"https://qcon.infoq.cn/2023/shanghai/?utm_source=infoqweb&amp;utm_medium=teacherart&amp;utm_campaign=10&amp;utm_term=1219&amp;utm_content=weiyongming\">QCon 全球软件开发大会</a>\"，将于 12 月在上海召开。北京飞漫软件技术有限公司创始人兼 CEO 魏永明将发表题为《<a href=\"https://qcon.infoq.cn/2023/shanghai/presentation/5639?utm_source=infoqweb&amp;utm_medium=teacherart&amp;utm_campaign=10&amp;utm_term=1219&amp;utm_content=weiyongming\">HVML 编程语言及其应用的跨端运行技术</a>\"》主题分享，探讨 HVML 语言的开源解释器实现， HVML 应用框架的解释器和渲染器分离设计原理及其带来的巨大灵活性。</p><p></p><p><a href=\"https://qcon.infoq.cn/2023/shanghai/presentation/5639?utm_source=infoqweb&amp;utm_medium=teacherart&amp;utm_campaign=10&amp;utm_term=1219&amp;utm_content=weiyongming\">魏永明</a>\"，获清华大学工学学士、硕士学位。飞漫软件创始人，2013 年度“开源软件杰出贡献人物”。1999 年发布了知名开源软件 MiniGUI 并持续研发至今。20 多年来，该软件广泛应用于各类硬件产品。编（译）著有《MiniGUI 剖析》、《Linux 实用教程》、《Linux 设备驱动程序》（二、三版）等技术著作。2018 年 11 月，发起合璧操作系统开源协作项目；2020 年 8 月，提出世界首款描述式编程语言 HVML；2022 年 7 月，开源发布 HVML 解释器及渲染器（源代码规模超百万行）。他在本次会议的演讲内容如下：</p><p></p><p>演讲：HVML 编程语言及其应用的跨端运行技术</p><p></p><p>在万物互联的市场背景下，以智能汽车为代表的行业一直在寻找比远程桌面、CarPlay 等技术更好的应用跨端运行技术方案。HVML 编程语言提出的跨端应用实现方案，不仅仅能够实现多屏同显、多屏异显，还能实现应用跨设备的热迁移。同时，HVML 作为世界首款可编程标记语言，提出了独具特色的具备内存访问安全性且无垃圾回收机制的解释器实现方案。</p><p></p><p>本次演讲将介绍 HVML 语言的开源解释器实现，并介绍 HVML 应用框架的解释器和渲染器分离设计原理及其带来的巨大灵活性。同时，作为通用编程语言，HVML 还可以作为 Web 服务器的网关程序使用，并表现出了 HVML 在性能方面的优势。本演讲给出了 HVML 和 PHP 在性能上的对比数据。</p><p></p><p>演讲提纲：</p><p></p><p>应用的跨端运行及其传统实现方案HVML 应用框架的原理和特点HVML 应用的热迁移HVML 编程语言的特点及其开源解释器HVML 作为网关程序及其和 PHP 的性能对比</p><p></p><p>听众收益点：</p><p></p><p>○ 了解可编程标记语言的特点和与众不同之处</p><p>○ 了解跨端应用的全新技术实现思路</p><p>○ 了解如何通过打破固有思维，用全新思路解决已有问题</p><p></p><p>除上述演讲外，QCon 上海还将围绕&nbsp;<a href=\"https://qcon.infoq.cn/2023/shanghai/track/1595?utm_source=infoqweb&amp;utm_medium=teacherart\">GenAI和通用大模型应用探索</a>\"、<a href=\"https://qcon.infoq.cn/2023/shanghai/track/1596?utm_source=infoqweb&amp;utm_medium=teacherart\">AI&nbsp;Agent&nbsp;与行业融合应用的前景</a>\"、<a href=\"https://qcon.infoq.cn/2023/shanghai/track/1597?utm_source=infoqweb&amp;utm_medium=teacherart\">LLM&nbsp;时代的性能优化</a>\"、<a href=\"https://qcon.infoq.cn/2023/shanghai/track/1598?utm_source=infoqweb&amp;utm_medium=teacherart\">智能化信创软件&nbsp;IDE</a>\"、<a href=\"https://qcon.infoq.cn/2023/shanghai/track/1602?utm_source=infoqweb&amp;utm_medium=teacherart\">面向人工智能时代的架构</a>\"、<a href=\"https://qcon.infoq.cn/2023/shanghai/track/1604?utm_source=infoqweb&amp;utm_medium=teacherart\">性能工程：提升效率和创新的新方法</a>\"等专题进行交流。</p><p></p><p>12 月 28-29 日，QCon 全球软件开发大会即将落地上海，中国科学院外籍院士、国际数据库专家樊文飞院士，英特尔大数据技术全球 CTO 戴金权等大咖会亲临现场分享大数据、芯片、架构等方向的前沿洞见。</p><p></p><p>这次会议主要探讨大模型的全面技术架构的进化，不仅有跟大模型本身相关的推理加速、AI Agent、GenAI，还有架构的演进思路、性能优化，以及以智能代码助手为代表的研发效能提升等方向，感兴趣的朋友可以扫描下方二维码，查看大会详细日程。咨询购票可联系票务经理 18514549229。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/01/0113b3dfb187d5f9988b7eb16d2e0594.png\" /></p><p></p>",
    "publish_time": "2023-12-19 11:30:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "构建开放公平的社区生态，中国服务器操作系统崛起进行时",
    "url": "https://www.infoq.cn/article/PGXW7zc37YS9aUwUYpkI",
    "summary": "<p></p><p></p><h2>引言</h2><p></p><p></p><p>近年来，在国家科学布局与行业各界不懈努力下，中国服务器操作系统迎来了新的发展格局，多个较为成熟的系统生态相继崛起。以阿里云、麒麟软件、统信软件为代表的中国技术力量不断取得核心技术突破，以龙蜥社区、欧拉社区为代表的中国开源社区产业生态初露锋芒，包括统信软件、浪潮信息、中标麒麟、中科方德等商业版服务器操作系统品牌获得了市场认可。在中国服务器操作系统百花齐放的局面中，龙蜥操作系统社区是发展水平较高、品牌市场基础较好的榜样之一。根据中国信通院近期面向用户群体的调研显示，龙蜥操作系统位列用户意愿迁移系统的首位目标，超过一半的受访企业计划在五年时间内将CentOS替换为龙蜥系统，且电信、互联网等更加看重性能和完整生态的行业中龙蜥有着更高的认可度。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/91/91984887c809d3a258c269daf73c43e2.png\" /></p><p></p><p>2023年12月17-18日，首届龙蜥操作系统大会在北京召开，大会以\"云智融合共筑未来\"为主题，宣告龙蜥社区到达了一个新的发展节点。大会期间，InfoQ采访了龙蜥开源社区理事张东，就龙蜥社区的发展规划、前景与浪潮信息在社区中所扮演的角色等话题进行了深入探讨，也让外界对龙蜥操作系统社区开放、共荣的软件生态面貌有了更加清晰的认知。</p><p></p><h2>CentOS停止更新，中国服务器操作系统迎来崛起良机</h2><p></p><p></p><p>2020年底，全球最大Linux商业发行版厂商Redhat宣布将停止CentOS后续更新计划，犹如在服务器操作系统市场投下了一颗重磅炸弹。由于CentOS在服务器操作系统领域长期占据大量份额，其停服给依赖CentOS的各行业厂商造成巨大影响，他们不得不开始寻找能够替代CentOS的其他操作系统选项，甚至彻底重新审视自身的服务器软件基础设施规划。</p><p></p><p>在国内，CentOS停服带来的冲击更加明显。2022年，中国市场上装机的服务器操作系统中有大约80%是Linux，其中CentOS仍然占据主流地位。随着CentOS停服，其用户首先要面对的威胁就是系统安全漏洞更新停止，这将导致大部分企业业务因为缺乏安全保障而难以为继。因此，在2024年6月30日CentOS7最终停止维护的大限到来之际，企业必须及时完成迁移替代。</p><p></p><p>CentOS停服事件恰逢IT产业云计算和AI的革新浪潮汹涌之际，全行业都在探索服务器基础软件设施的创新思路，以适应新的应用需求和业务机遇。在中国，CentOS停服事件推动更多中国企业从CentOS多年营造的舒适区中走出来，重新思考开源与社区生态开放性之间的关系。行业普遍意识到，一个充满创新活力、开放共荣、能够持续发展进步的操作系统生态，将为企业自身未来多年的竞争力奠定坚实基础。</p><p></p><h2>开源不等于开放，公平是社区繁荣的有力保障</h2><p></p><p></p><p>诞生于1992年的Linux操作系统从一开始就是开源软件社区的代表，其崛起和普及历程也伴随着开源文化在IT产业的广泛流行。如今，开源已经成为现代软件产业的标志性属性，几乎每一家具备一定实力的开发企业都会或多或少开源自己的技术成果，开源文化的影响力甚至延伸到了IT行业之外。</p><p></p><p>虽然软件开源浪潮的初衷是营造一个更加公平、开放、互助合作的技术社区，但今天的开源产业却并没有完全实现这些目标，CentOS就是一个典型案例。CentOS自身是Redhat基于开源的Linux操作系统核心开发的免费服务器操作系统，由于系统长期免费公开使用，大量用户甚至默认CentOS生态会一直维持原有的状态，直到Redhat宣布停服计划。CentOS的停服恰恰证明，开源甚至免费都无法与开放、公平划等号，如果一个软件社区被一家企业完全控制或主导，那么真正的开放公平就无从谈起，社区其他成员和广大用户迟早要面对主导者改变初衷、谋求更多利益的局面。</p><p></p><p>作为全球领先的IT基础架构产品、方案及服务提供商，浪潮信息对于软件产业的开源格局是有着清醒认知的。事实上，浪潮信息早在2008年就开启了操作系统研发进程，开发了与大型机配套的Unix操作系统。近年来，随着人工智能、大数据、物联网等技术迅猛发展，浪潮信息意识到服务器操作系统迎来了创新发展的绝佳机遇，也因此开始踏入基于Linux核心的服务器操作系统领域。</p><p></p><p>2022年，浪潮信息以整机厂商身份加入了龙蜥社区，并主导成立了浪潮信息龙蜥联合实验室。为何不自行从头开始开发一个基于Linux的服务器操作系统生态，而是选择加入龙蜥？在浪潮信息看来，自身作为更加专注于硬件产品的厂商，在操作系统研发层面上需要博采众家之长，而加入一个充满活力的软件社区是最佳选择。而在中国操作系统生态中，龙蜥社区从一开始就将开放、开源、共享、共治作为社区发展的核心原则，并通过实际行动证明了自身对这一原则的坚守。</p><p></p><p>龙蜥社区并不存在发起者、创始厂商阿里云一家独大的情况，包括Intel、ARM、统信等企业都担任了龙蜥社区的理事单位，这些理事单位之间都可能是市场竞争的对手，但在社区中他们可以公平发言、合作做事，包括社区合作伙伴在内，每一位社区成员的意见都会得到重视。浪潮信息加入龙蜥社区，可以在这样的开放氛围中充分发挥自身的优势，为社区贡献创新动能的同时获得持续的正面反馈。</p><p></p><p>从厂商所处的行业来看，龙蜥社区成员广泛的行业代表性也是一大优势。阿里云在云计算、人工智能领域成果突出，浪潮信息自身擅长软硬件协同，Intel、ARM等是芯片领域的专家，统信、麒麟、红旗则长期深耕操作系统技术……社区不同成员在各个领域都有自己的专长，不同厂商之间优势互补，就能推动整个社区生态更加繁荣、更具活力。</p><p></p><p>此外，虽然龙蜥社区的目标是发展中国服务器操作系统生态，但社区并没有对国外厂商的参与关上大门。本着吸纳全球前沿技术，加强国内外交流合作的理念，龙蜥社区也吸纳了许多国外一流技术企业加入成员，甚至担任理事单位。这样开放、包容的合作心态，对于社区的健康发展自然大有裨益。</p><p></p><p>加入龙蜥社区一年以来，浪潮信息在社区的帮助下解决了很多挑战，也通过自身的能力积累为社区做出了很多贡献，整体效果已经达到或者超越了当初的预期。</p><p></p><h2>面向云+AI，打造服务器操作系统的新生态</h2><p></p><p></p><p>浪潮信息加入龙蜥社区后，一大动作就是在2022年推出了面向智算时代的服务器操作系统云峦KeyarchOS。KeyarchOS是基于龙蜥操作系统开发的衍生商业版，支持多种芯片架构和计算场景，具备高效软硬协同、稳定可靠、全天候智能化运维、全栈安全可信四大特性。凭借浪潮信息此前在高端主机操作系统领域的经验沉淀，以及龙蜥社区生态优势和遍布全国的软硬件全服务链，浪潮信息KeyarchOS发布不到两年时间，累计装机量已超过25万，广泛服务于政务、金融、通信、互联网等行业用户。</p><p></p><p>对于浪潮信息而言，KeyarchOS是在龙蜥操作系统的基础上，面向终端用户使用场景，通过自身的技术积累进行对应优化和工程落地而输出的成果。例如，KeyarchOS在虚拟化、运维管理、人工智能等领域都加入了浪潮信息自有的技术栈与解决方案，这些方案能够为用户带来显著的效益提升。当然，浪潮信息也会将这些经过验证的创新技术回馈到社区中，使更多社区成员和用户能够从中受益，推动社区的良性生态循环。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/29/294668c6ece4d2e4c210ff427c16e25b.png\" /></p><p></p><p>与此同时，浪潮信息还同龙蜥社区成立联合了实验室，推动服务器领域软硬件上下游的联合创新。浪潮信息邀请了50家合作伙伴加入社区，覆盖了硬件板卡、下游服务器软件的多个领域，并完成了数百项软硬件认证。浪潮信息还主导成立了服务器无感知计算与可信计算两个社区技术组，并参与编写了多份技术白皮书，在云原生和安全等领域成果斐然。此外，浪潮信息还牵头发布了服务器操作系统的硬件兼容性社区标准，很好地规范了操作系统软硬结合的质量评估体系。</p><p></p><p>浪潮信息所做的这些工作非常具有代表性。更进一步，从浪潮信息等成员在龙蜥社区中的成果与互动交流过程中，可以看到面向云和AI时代的新一代服务器操作系统生态是如何逐渐成型的。</p><p></p><p>经过数十年发展，操作系统的基础技术已经非常成熟，曾几何时，人们一度认为服务器操作系统已经没有多大迭代空间了。然而在云计算和AI兴起之后，一方面传统上以x86为主导的上游芯片受到了巨大冲击，大量计算需求转向了GPU、专用加速器和其他指令集架构的CPU上，这就要求操作系统能够为新的软件环境提供良好的适配和优化能力。另一方面，人工智能，尤其是今年兴起的生成式AI技术对操作系统提出了更高的需求，诸如数据处理、集群调度等许多传统上由上层应用软件负担的任务，现在需要集成到操作系统底层来进一步提升效率，从而提高硬件利用率，降低模型的训练推理成本。</p><p></p><p>而从产业角度来看，服务器操作系统在产业链中的存在感反而在下降，云计算的发展让大型云厂商愈加偏向于垂直整合，将应用层、系统层、硬件层尽可能结合在一起并高度定制化，对用户则呈现愈加简单、易用的界面。今天的云计算、AI用户可能只需一部网络终端，就可以在浏览器中开发生成式AI应用，而无需操心应用底层运行在怎样的系统和芯片上。这样的局面意味着像CentOS这样高度专业化的操作系统产品在未来很可能不会再有那么大的生存空间，更多企业会基于开源社区来定制符合细分市场需求的Linux版本。</p><p></p><p>由此以来，开源社区的重要性反而大大增强了，不同厂商都会加入社区的技术交流，群策群力来满足更加细分、更加多样化的定制需求。开源社区将更多扮演沟通纽带的角色，将云计算厂商、芯片厂商、整机厂商、应用软件厂商等等利益相关方链接在一起，形成不同于以往的，全新的服务器操作系统生态环境。</p><p></p><p>浪潮信息自身实际上也将自己定位为这样的纽带角色。作为整机厂商，浪潮信息一边对接各类软硬件组件厂商，一边对接终端整机用户，浪潮信息自己负责将用户的定制化需求转化为可行的解决方案，与硬件组件厂商、软件应用厂商等共同打磨、优化，最终形成产品销售给用户。而KeyarchOS在这一过程中就起到了非常重要的作用，它使得用户可以更加自由地对接五花八门的硬件设备，同时确保设备与上层应用的兼容性、可靠性、稳定性，并尽可能降低用户的运维成本。KeyarchOS吸纳了龙蜥社区的大量创新成果来为用户提供更多价值，而KeyarchOS的成功经验被浪潮信息反馈回社区后，其他厂商也可以在自己的应用场景中按需取用，获得相应的收益。</p><p></p><p>如今，龙蜥社区已经形成了内部交流合作、共同发展的生态循环，这种循环正是龙蜥社区迈向下一代服务器操作系统生态的成功关键。</p><p></p><h2>自由、创新、开放，中国服务器操作系统未来可期</h2><p></p><p></p><p>龙蜥社区成立短短几年时间，就已经成为国内服务器操作系统领域的佼佼者，并获得超过半数企业的迁移意向，这和社区坚持开放、开源、共享、共治的准则是分不开的。浪潮信息在龙蜥社区内取得的成果只是一个缩影，如今，社区数百家成员单位正在携手共进，为建设符合时代需求的新一代服务器操作系统生态而不懈努力。</p><p></p><p>当然，自由、开放的行业不可能只有一个主导者，除龙蜥社区外，欧拉、OpenCloudsOS等社区也已经取得了丰硕的成果，使中国服务器操作系统产业迎来了前所未有的繁荣局面。几大社区互相竞争、学习、友好交流、共同进步，在自由、创新、开放的环境中脚踏实地不断前进。可以预期，CentOS停服给中国企业带来的影响很快就会过去，中国服务器操作系统产业也将迎来起飞时刻，并在未来几年内成长为全球市场不可忽视的重要力量。云计算+生成式AI的创新时代，服务器操作系统将有来自中国企业的光辉闪耀四方。</p>",
    "publish_time": "2023-12-19 14:27:22",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]