[
  {
    "title": "BOSS直聘回应4700万人挤爆服务器；诺奖得主称ChatGPT让自己的智力提升了50%；Unity 员工向公司发出死亡威胁 | AI一周资讯",
    "url": "https://www.infoq.cn/article/ddghjcCpiRhp7H5h8ZPG",
    "summary": "<p></p><blockquote>诺奖得主：使用了ChatGPT之后，我自己的智力提高了50%；张勇卸任阿里云董事长与 CEO；苹果发布首款3nm手机芯片；快手AI文生图功能开启开启内测；阿里云通义千问大模型正式向公众开放；微软推出EvoDiff框架，可简化蛋白质设计过程……</blockquote><p></p><p></p><h2>资讯</h2><p></p><p></p><h4>BOSS直聘回应4700万人挤爆服务器</h4><p></p><p></p><p>9月15日，网传“9月15日10点15分26秒，在线统计4700W+人在刷BOSS直聘，目前服务器超荷载，正在维护。”对此，BOSS直聘回应：关注到一张网传截图。服务器崩了，是真的。技术要改进，是真的。网传的数据，是假的。请大家不信谣，不传谣。据最新数据，每月使用BOSS直聘的用户达4360万人。</p><p></p><h4>腾讯混元大模型宣布已通过备案，将陆续对公众开放</h4><p></p><p></p><p>9月15日消息，腾讯宣布旗下的腾讯混元大模型已首批通过《生成式人工智能服务管理暂行办法》备案，将正式上线，并陆续面向公众开放。截至目前，已有文心一言、通义千问、讯飞星火、百川大模型、智谱清言、紫东太初等十余家大模型宣布通过备案。</p><p></p><h4>快手AI文生图功能开启开启内测</h4><p></p><p></p><p>9月15日消息，快手宣布，AI文生图功能“快手AI玩评”开始在站内短视频评论区内测。快手方面表示，这是继快手AI对话之后，快手在短视频场景内探索并落地的又一AIGC能力，也是业内首次在大型APP核心业务场景评论区下应用的AIGC能力。</p><p></p><p>据了解，基于快手自研大模型的图像生成能力，快手AI玩评旨在解决用户无图可配的难点，进一步降低了互动门槛。目前快手已经打造“全模态大模型AIGC解决方案”，基于自研的基座大模型为用户提供包括文本生成、图像生成、3D素材生成、音频生成、视频生成等在内的多种技术能力。</p><p></p><h4>苹果发布首款3nm手机芯片</h4><p></p><p></p><p>北京时间周三凌晨1点，美股市值最高的苹果公司举行秋季特别活动，并推出了6款新品，分别是两款手表（Apple Watch Series 9、Apple Watch Ultra 2），以及iPhone 15系列的四款手机。</p><p></p><p>作为今天最受关注的产品，iPhone 15 Pro两款机型搭载了 A17 PRO芯片。除了3nm制程，CPU、GPU的性能提升外，A17 PRO还采用了硬件加速光线追踪技术，和MetalFX上采样功能，在实现更流畅、逼真光效的同时，同时兼顾了省电。</p><p></p><h4>阿里云通义千问大模型正式向公众开放</h4><p></p><p></p><p>阿里云于 9 月 13 日宣布，其通义千问大模型已通过备案，并正式对公众开放。企业和个人用户可以登录通义千问官网或通过阿里云提供的API体验和使用这一强大的AI模型。</p><p></p><p>今年4月，阿里云通义千问开始进行邀测，令人惊讶的是，仅仅一个月内就有超过20万家企业和机构申请接入通义千问测试。目前，已有多家知名企业，如OPPO、得物、钉钉、淘宝以及浙江大学等，与阿里云合作，基于通义千问模型训练了专属的大模型或开发了相关应用。</p><p></p><h4>智源发布超3亿对面向中英文语义向量模型训练数据集，BGE模型迭代更新</h4><p></p><p></p><p>9月15日，智源研究院发布面向中英文语义向量模型训练的大规模文本对数据集MTP（massive text pairs），开放通用语义向量模型BGE的训练数据，用以支撑开源社区训练通用语义向量模型。</p><p></p><p>此次发布的数据集MTP由总计3亿条中英文关联文本对构成；其中，中文记录达1亿条，英文数据达2亿条。数据收集自Wudao Corpora、Pile、DuReader、Sentence Transformer等语料，经过必要的采样、抽取、清洗获得。</p><p></p><p>MTP数据集链接：https://data.baai.ac.cn/details/BAAI-MTP</p><p></p><p>与此同时，基于社区反馈，BGE在其1.0的版本之上进行了进一步优化，其表现更加稳健、出色。具体升级如下：</p><p></p><p>模型更新。BGE-*-zh-v1.5缓解了相似度分布问题，通过对训练数据进行过滤，删除低质量数据，提高训练时温度系数temperature至0.02，使得相似度数值更加平稳 。新增模型。开源BGE-reranker 交叉编码器模型，可更加精准找到相关文本，支持中英双语。不同于向量模型需要输出向量，BGE-reranker直接文本对输出相似度，排序准确度更高，可用于对向量召回结果的重新排序，提升最终结果的相关性。新增功能。BGE1.1增加难负样本挖掘脚本，难负样本可有效提升微调后检索的效果；在微调代码中增加在微调中增加指令的功能；模型保存也将自动转成 sentence transformer 格式，更方便模型加载。</p><p></p><h4>天津市人工智能计算中心 200P 正式上线</h4><p></p><p></p><p>天津市人工智能计算中心于日前举行了200P上线仪式，标志着该中心已成为天津市规模最大的人工智能算力平台。此次扩容使其整体服务能力达到100P的5至6倍，将为千亿级参数模型的训练提供强大支持，服务范围还将扩展至京津冀区域。与此同时，论坛上签约了国内首个自主可控的聋人手语理解大模型项目，该项目将支持超过10亿的手语到汉语的翻译与训练，为聋人社区提供更多便利。天津市人工智能计算中心还与多家高校和企事业单位签署了合作协议，旨在推动科研创新和行业解决方案的孵化，提升天津人工智能产业的创新能力。</p><p></p><h4>Stability AI推出使用人工智能生成音乐的产品Stable Audio</h4><p></p><p></p><p>日前，Stability AI宣布推出该公司首款用于音乐和声音生成的人工智能产品Stable Audio。Stable Audio是一款首创产品，利用最新的生成人工智能技术，通过易于使用的网页界面提供更快、更高质量的音乐。Stability AI提供了Stable Audio的基本免费版本，用户可以用它生成和下载长达20秒的音轨，同时还提供了“专业”订阅服务，可以下载商业项目所需的长达90秒的音轨。</p><p></p><h4>微软推出EvoDiff框架，可简化蛋白质设计过程</h4><p></p><p></p><p>微软公司最近推出的EvoDiff框架可在不需要目标蛋白质结构信息的情况下生成新的高质量蛋白质，极大地简化了蛋白质设计过程。这一创新有望加速新药物研发和生物工业的进展。虽然尚未经过同行评审，但微软团队计划进一步测试这些模型生成的蛋白质，以确定其可行性。如果成功，他们将继续改进这一框架。</p><p></p><h4>张勇卸任阿里云董事长与 CEO</h4><p></p><p></p><p>9 月 10 日晚间，阿里巴巴集团董事会主席蔡崇信发布全员信，宣布已在当日按计划完成集团管理职务交接，由他接任阿里巴巴集团董事会主席职务，吴泳铭出任集团 CEO。让外界没有意料到的是，阿里巴巴董事会接受了张勇卸任阿里云董事长与 CEO 职务的请求，阿里云董事长与 CEO 即日起将由吴泳铭兼任。此外，阿里巴巴集团将投资 10 亿美金支持张勇设立面向未来的科技基金。</p><p></p><p>9 月 12 日，阿里巴巴集团新任 CEO 吴泳铭发布全员信，宣布确立两大战略重心：用户为先、AI 驱动。“集团会围绕这两大重心进行业务梳理，重塑业务战略优先级。在此基础上，集团将对三类业务加大战略性投入：1. 技术驱动的互联网平台业务；2. AI 驱动的科技业务；3. 全球化的商业网络。”</p><p></p><h4>谷歌开始新一轮裁员，全球招聘团队将裁员数百人</h4><p></p><p></p><p>据路透社报道，谷歌母公司Alphabet周三表示，该公司将继续放缓招聘速度，在全球招聘团队裁员数百人。报道提到，该公司称，这并不是大规模裁员的一部分，公司将保留团队的大多数员工，以招聘关键职位。公司还将帮助这些员工在公司内部或其他地方寻找工作。</p><p></p><p>今年 1 月，谷歌母公司 Alphabet 宣布裁员 1.2 万人，约占全职员工总数的 6%。裁员涉及公司所有部门，包括谷歌的招聘团队。谷歌自去年以来一直在削减成本，Alphabet 报告第二季度收入增长了 7%，好于分析师的预期。</p><p></p><h4>亚马逊推出AI工具简化卖家产品上架</h4><p></p><p></p><p>亚马逊引入生成式AI工具，旨在协助卖家轻松创建产品列表，包括吸引人的产品描述和标题。该工具还允许卖家在现有产品描述的基础上使用AI进行补充，无需重新开始。尽管有帮助，但使用生成式AI模型在大规模上存在一些担忧，因其有可能“产生幻觉”，即创造虚假信息。同时，如果出现不正确的产品列表和描述，亚马逊可能会承担责任，尤其是如果未披露列表是使用AI创建的情况下。其他零售商，如eBay和Shopify，也采用生成式AI来简化产品上架流程。</p><p></p><h4>Adobe正式推出Firefly生成式AI模型和计费方式</h4><p></p><p></p><p>Adobe宣布，其Firefly生成式AI模型现在正式在Creative Cloud、Adobe Express和Adobe Experience Cloud中商业可用。同时，Adobe还推出了一种新的计费方式，使用“生成式积分”来衡量用户的交互次数。现有付费用户将获得一定数量的积分，用于使用Firefly的生成功能。积分用完后，使用速度将减慢，但不会失去访问权限。这一变化将于11月1日生效。</p><p></p><h4>Salesforce推出Einstein Copilot Studio，定制AI模型更加灵活</h4><p></p><p></p><p>Salesforce发布了Einstein Copilot Studio，这是一款用于定制Einstein GPT和Einstein Copilot的工具。该工具包括提示生成器、技能生成器和模型生成器，让用户能够自定义AI模型的提示和行为。同时，Salesforce也在构建\"Einstein Trust Layer\"，以管理安全性、治理和数据隐私等问题。这一工具将于秋季推出试点版。</p><p></p><h4>腾讯健康发布医疗大模型和多场景AI产品矩阵</h4><p></p><p></p><p>腾讯健康发布医疗大模型和AI产品矩阵，包括智能问答、家庭医生助手、数智医疗影像平台和药物发现平台“云深”（iDrug）。医疗大模型基于腾讯混元大模型，加入了医疗知识图谱和医学文献，经过多任务微调和强化学习。该模型可用于文案生成、智能问答、病历结构化和检索、影像报告和辅助诊断等场景，可提升医疗服务水平和质量。</p><p></p><p>腾讯健康已在上海的医院推出医疗大模型，同时宣称“云深”（iDrug）平台可加速药物发现。此外，腾讯健康觅影全面升级了数智医疗影像平台，搭载AI分析能力，为医疗机构、科研院校、科创企业提供医疗影像解决方案。腾讯健康的小程序已连接超过3000家公立医院和超过5000家体检机构，用户覆盖6亿人。</p><p></p><h2>IT 业界热评新闻</h2><p></p><p></p><h4>Unity 员工向公司发出死亡威胁</h4><p></p><p></p><p>Unity 公司最近宣布的基于安装量的新付费模式是如此不得人心，以至于它的员工对雇主发出了死亡威胁。新付费模式在游戏行业引发了开发者们的强烈抗议：有游戏工作室宣布将在新付费模式生效的同一天下架游戏，有游戏工作室宣布未来不会使用 Unity 引擎，还有众多工作室抵制了 Unity 的广告产品进行抗议。本周四 Unity 以收到可信死亡威胁的理由关闭了德州奥斯丁和加州旧金山的办公室。旧金山警方称，一名员工使用社交网络对雇主发出了威胁。这名员工的工作地点位于加州之外的一个办公室。</p><p></p><h4>网易回应员工“因Bug被HR威胁”轻生</h4><p></p><p></p><p>9月12日晚间，有网传信息显示，杭州网易一服务器端程序员因工作出了差错（代码存在Bug）遭到公司HR威胁，此后该员工自杀。据网传图片，该员工系患抑郁症去世。</p><p></p><p>网传图片显示，有网友转述网易内部通知称：“各位，要和大家同步个非常遗憾的事情，咱们的同学，同事，朋友，队友xx，上周三因为工作压力过大已经提前去人生终点站了，目前定于明天9月12号在临平出殡，各位同学，同事，朋友如果时间方便准备去送他最后一程的话可以在这等后续信息同步，不方便的话也不强求，心意到了就行。”</p><p></p><p>一位自称是死者本科同学的匿名网友表示，死者为网易伏羲团队员工。</p><p></p><p>对此，网易伏羲发布内部信公布事发经过及公司后续关怀方案：事发前两天员工曾向团队透露有抑郁倾向，并申请年假就医。不幸发生后，网易伏羲成立专项工作组，协助家属申请专项帮扶基金、特殊商业保险理赔等，并将支持员工子女的教育费用至 22 岁大学毕业。针对“因 BUG 被 HR 威胁”的传言，网易伏羲回应表示，该 BUG 内部风险评级为轻危，对此团队不会追责，经排查聊天记录等现有资料暂未发现“HR 威胁”相关动机和证据。</p><p></p><h4>腾讯回应QQ 被罚 100 万元</h4><p></p><p></p><p>近日，国家网信办指导广东省网信办对腾讯QQ平台“小世界”版块存在大量色情等违法信息，危害未成年人身心健康的问题进行调查。经调查，依据《未成年人保护法》第一百二十七条，国家网信办依法约谈腾讯公司相关负责人，并对其实施行政处罚，包括暂停“小世界”版块信息更新30日，没收违法所得并处100万元罚款。</p><p></p><p>对此，QQ安全中心9月13日发布公告，回应网信行政处罚决定，表示“诚恳接受、坚决执行”。还称已经对照网信部门的各项要求，全面开展QQ小世界等功能版块的整改工作，通过技术升级、平台举报巡查完善等多重手段，加大力度推进社区生态治理，对查验属实的不良和有害信息予以严厉的打击。</p><p></p><h4>马斯克回忆人生至暗时刻</h4><p></p><p></p><p>9月12日，《埃隆·马斯克传》全球首发。本书由《乔布斯传》执笔人、美国当代知名传记作家沃尔特·艾萨克森撰写，埃隆·马斯克亲自参与并公开推荐。</p><p></p><p>根据《埃隆·马斯克传》所载，这位特斯拉CEO最大的成就之一发生在他所说的生命中最黑暗、最困难的时期。</p><p></p><p>从2017年夏天到2018年秋天，大约一年的时间里，马斯克在个人生活和职业方面都处于困境。艾萨克森描述他“糟糕的情绪导致了紧张性精神恍惚和抑制性瘫痪”，而公司方面亏损了22亿美元。马斯克告诉艾萨克森：“那是我经历过的最痛苦的时刻，18个月的疯狂折磨。那是令人难以置信的痛苦。”</p><p></p><p>在工作中，特斯拉被做空者包围着，他们押注该公司股价会暴跌，因为他们认为他的产量目标是不可能实现的。这些做空者当中包括微软联合创始人比尔·盖茨。马斯克本周发帖，再次对盖茨做空特斯拉的行为进行了猛烈抨击，指责他“在特斯拉最脆弱时押注我们破产”，并说“盖茨的不自知识和虚伪令人难以置信，他居然有胆量让我捐款给他的大多是做做样子的环保事业，同时又打算从特斯拉的倒闭中获利5亿美元。”</p><p></p><p>工作之外，他面临着与女演员艾梅柏·希尔德（Amber Heard）的痛苦分手，他曾在一次采访中表示他“真的很爱她”。还有来自马斯克父亲的令人不安的消息，后者让他之前养大的继女怀孕了，事情蔓延到了公众视野中。</p><p></p><h4>诺奖得主：使用了ChatGPT之后，我自己的智力提高了50%</h4><p></p><p></p><p>9月13日，诺贝尔化学奖得主、美国国家科学院院士迈克尔·莱维特在上海出席2023ESG全球领导者大会时称，使用ChatGPT之后，自己的智力提高了50%。他认为ChatGPT几乎可以做任何事情，可以取代律师、翻译等许多人类工作。</p>",
    "publish_time": "2023-09-17 14:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]