[
  {
    "title": "可信数据库发展大会｜深化数据库产业协作，着力推进我国数据库产业高质量发展",
    "url": "https://www.infoq.cn/article/vC4h2rWRyOylw0I4soj1",
    "summary": "<p>2023 年 7 月 4 日- 5 日，由中国通信标准化协会大数据技术标准推进委员会（ CCSA TC601 ）主办的“ <a href=\"https://www.infoq.cn/article/tQtvumNcUUEZuf4Tglex\">2023 可信数据库发展大会</a>\"” 在北京国际会议中心召开。中国移动信息技术中心政企业务支撑中心副总经理梁恩磊受邀参加了“共话数据库产业自立自强高水平发展”圆桌论坛，论道我国数据库自立自强之路，探索新形势下我国数据库产业的可持续、高质量发展。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/f0/f0b7a5d2f4cdb415e34ccd0d322841a5.jpeg\" /></p><p></p><p>论坛围绕四个议题展开：</p><p></p><p></p><h2>一、把握数据库发展趋势，迎接海量数据处理与存储场景下新挑战</h2><p></p><p></p><p>梁恩磊表示，随着 5G 、物联网等业务的快速发展，数据库技术也面临新的要求和挑战。下一阶段，数据库最亟待解决的问题是如何进一步提升在海量高并发场景下的数据处理能力以及存储能力。</p><p></p><p>高性能数据处理：5G 和物联网技术的快速发展，给数据库在超高并发场景下的数据处理带来了巨大的挑战。下一阶段，数据库仍需要不断降低响应时延、提高并发处理能力，进一步降低 5G 、物联网等技术带来的数据处理压力，以满足在线计费、实时信控等各类实时业务场景的需求。</p><p></p><p>海量数据存储：5G 及物联网将以前所未有的速度生成海量数据。以物联网计费话单为例，每天产生数百亿条话单且仍在高速增长，对数据库的存储能力提出了更高的要求。因此需要数据库拥有快速扩展的能力，以便有效地存储和处理海量数据。</p><p></p><p>在应对方案上，梁恩磊表示，目前分布式是个大趋势，也是解决海量数据处理与存储的金钥匙。从传统的 Shared-Everything 架构，再到当前的 Shared-Nothing 、Shared-Disk 等分布式架构，都是为了更高效、更低成本地解决海量数据处理问题。未来，随着<a href=\"https://xie.infoq.cn/article/d866b6d5a158c9a7f44ad2263\">分布式数据库</a>\"的不断成熟，数据库在各类实时业务场景下对海量数据处理与存储的能力必将跨上一个新台阶。</p><p></p><p></p><h2>二、关注核心技术动向，实现数据库领域新发展</h2><p></p><p></p><p>梁恩磊表示，未来应重点关注数据安全、数据库智能化、分布式与云原生等技术方向。</p><p></p><p>首先是数据安全方向。随着国内大众的数据安全意识提升，以及《数据二十条》等政策标准的陆续出台，可以窥见安全审计、数据加密、身份验证等正在成为数据库领域新的关注热点。未来行业将逐步补齐传统数据库在安全领域的短板。</p><p></p><p>其次是数据库智能化方向。伴随着 ChatGPT 等技术的发展，<a href=\"https://xie.infoq.cn/article/1746e9a1bec2bfa64fd07293f\">向量数据库</a>\"以及数据库与这类 AIGC 技术的结合逐渐火热。前者解决此类技术在训练过程中的数据库存储问题，后者通过与 AIGC 技术的结合可以极大地降低数据库的使用门槛。</p><p></p><p>最后是分布式与云原生方向。万物互联时代，数据库也将从传统的存储“人”的数据转变为存储“物”的数据，给数据库层造成的压力将提升成百上千倍。未来，通过存储和计算分离等分布式技术以及与云原生技术的结合，将实现计算资源、存储的弹性伸缩，极大地降低业务架构的复杂度，为高效低成本地解决海量数据的处理与存储带来更多可能。</p><p></p><p></p><h2>三、围绕“三高一低”的主旋律，助力产业高速发展</h2><p></p><p></p><p>梁恩磊表示，在未来十年里，数据库领域毫无疑问地将发生各种变革和创新，但不变的是数据库的发展始终会围绕着“三高一低”（高性能、高稳定、高安全、低成本）的主旋律。</p><p></p><p>在性能方面，以电信行业为例：在集中式数据库时代，业务场景主要是通话与短信，相对单一且数据量较小，采用传统的集中式数据库即可满足大部分业务对数据库性能和成本的要求。随着通信行业快速发展，对数据库的性能有了更高的要求，逐步过渡到分库、分表时代。同时各类垂直、水平拆分技术也在快速发展，在运营商中最常见的是按省份、地市进行垂直拆分，但分片间数据的不均衡、业务分片架构的高复杂度等因素给这类方案带来了巨大的压力。随着移动互联网、物联网、5G 技术的发展，数据库也通过与分布式、云原生等技术的深度的结合有了更进一步的发展。</p><p></p><p>同理，业务对高性能、高稳定、高安全、低成本的诉求与数据库的发展也是相辅相成、互相促进的。围绕着“三高一低”的主旋律，数据库始终会将不断革新，持续满足业务发展需求。</p><p></p><p></p><h2>四、深化数据库产学研结合，推动我国数据库行业高水平发展</h2><p></p><p></p><p>梁恩磊表示，如果把数据库的自立自强比喻为一场攻坚战，那么学术侧主要提供武器的研究，产业侧负责武器的供应，应用侧则提供一线的实战。只有通过产学研的通力配合，才能实现优势互补，共同为数据库技术的发展奠定坚实的技术基础，实现从“攻出来”到“用起来”的紧密衔接。</p><p></p><p>为了进一步推动数据库产业的高质量快速发展，中国移动信息技术中心充分发挥多应用场景优势，联合深圳大学和香港科技大学（广州分校）成立广东省重点实验室，并作为组长单位参与信通院组织的数据库创新实验室，针对数据库产业、技术、生态发展等问题及对策展开研究，助力数据技术的联合攻关。</p><p></p><p>梁恩磊表示，科技自立自强是国家强盛之基、安全之要。未来，中国移动将进一步加深与政府、高校和研究机构的合作，共同推进数据库技术研究成果的产业化进程，推动国内数据库技术迅速走向世界前列。</p>",
    "publish_time": "2023-07-07 09:35:36",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "6大场景、7步精进，极狐星帮助「蔚来」千人团队，建立「标准研发效能管理体系」",
    "url": "https://www.infoq.cn/article/Im8lhBm1NlZWOHAwOxGI",
    "summary": "<p>极狐GitLab《研发效能管理的双模模型》聚焦效能管理痛点，提供【6大场景、7步精进】详实理论方法和行动指南，更有【蔚来】客户案例分享！</p>\n<p>亮点&amp;收获：</p>\n<ul>\n<li>行动升级：研发效能管理 7 步走，稳扎稳打，步步精进</li>\n<li>方法升级：Get GDAI 经典方法，建立标准研发效能管理体系</li>\n<li>实践升级：明晰 6 大角色场景，有的放矢，构建全局视角</li>\n</ul>\n<p><a href=\"https://mp.weixin.qq.com/s?__biz=Mzg5MTg2MDQ4NQ==&amp;mid=2247496014&amp;idx=1&amp;sn=449cfec844bea56cf6c4a55bd5f66acc&amp;chksm=cfc45224f8b3db32b695d8d6b4c3afb533eabd1c72e8d5b1cd28c71b8d2a14a3774522fc155b#rd\">查看【直播回顾文字稿】，立即试用极狐星！</a></p>",
    "publish_time": "2023-07-07 10:09:02",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "边缘计算之道：如何在数字时代“挖金山”？",
    "url": "https://www.infoq.cn/article/xDd95ddmJubtrFu3zE6c",
    "summary": "<p>随着制造业、石油、天然气、能源以及交通等行业加速数字化转型，数据容量呈现持续增长的趋势。然而，这种边缘数据爆炸需要得到有效的管理。在面对系统复杂性、数据隐私、延迟问题、有限的带宽连接，以及不断上升的存储和处理数据成本等众多挑战时，边缘计算应运而生。</p><p></p><p>边缘计算的核心理念是将计算资源尽可能地靠近数据源，减少设备与远程服务器之间的长距离连接，从而改善数据的处理、处理和传输方式。尤其是在制造业、石油和天然气、能源以及交通等大型行业中，工业边缘计算已经开始广泛应用，以实时分析和管理资产端的所有数据。通过实时分析或将聚合的数据用于进一步的云端处理，工业边缘计算能够提供实时的数据分析和更高效的数据处理。</p><p></p><h2>边缘计算关键要素</h2><p></p><p></p><p>边缘计算相关的的设备，如智能手机、智能手表和电器等，首先通过安全通信与物联网平台进行交互。这些平台收集和分析来自各种设备的数据，并通过应用程序将最有价值的数据发送回设备。</p><p></p><p>一些支持重要通信技术（如Wi-Fi、NarrowBand-IoT（NB-IoT）和Sigfox）以及诸如消息队列遥测传输（MQTT）、约束应用协议（CoAP）和超文本传输安全协议（HTTPS）等协议的物联网边缘设备可以直接连接到物联网平台。然而，并非所有设备都具备这些通信能力，因此需要一个抽象层来进行转换，提供多个协议和通信技术之间的桥梁，以实现数据的流动。</p><p></p><p>这个抽象层的作用是通过提供适应不同协议和通信技术的技术和流程来进行数据的中介转换。它充当了一个桥梁，使得不同类型的设备能够与物联网平台进行通信，无论它们使用的是哪种通信技术或协议。这样一来，物联网平台就能够充分发挥作用，连接和整合各种类型的设备，实现数据的流动和交互。</p><p></p><p>一个典型的物联网平台的架构如下图所示：</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/39/393e1efb17a053bc6362f6f46c51ce84.jpeg\" /></p><p></p><p>下面是对架构的每个层次的详细解析：</p><p></p><p>基础设施层（infrastructure）：该层包含了使整个平台正常运行所需的组件。在这里，你会找到各种计算/存储/网络解决方案、容器管理选项、数据湖、内部平台消息传递以及监控和存储解决方案。集成层（integration）：该层主要负责接收来自连接的边缘设备的数据，进行分析，并将其分发给业务应用程序，同时管理设备。在这一层中，数据会经过预处理、聚合和转换，以满足后续应用的需求。此外，集成层还负责处理设备注册、控制和管理等功能。安全层（security）：该层负责确保数据的有效性、安全性和隐私性，通过实施数据安全和权限原则以及采取补救控制和行动来进行监督。这包括对数据进行加密、身份验证、访问控制、漏洞管理等安全措施，以保护数据免受潜在的威胁。应用层（application）：该层包含使用集成层的基本物联网功能来实现业务目标的应用程序。这是承载复杂数据分析、条件监测、改装/配置和预测性维护等应用程序的地方。应用层的主要任务是根据业务需求开发和部署各种应用程序，以提供特定的功能和洞察力。</p><p></p><h2>物联网与边缘计算的关系</h2><p></p><p></p><p>物联网受益于处理能力更接近于物理设备或数据源。为了能够更快地对物联网传感器和设备收集的数据进行分析并做出反应，必须在边缘进行分析，而不是将数据传输回中央站点。</p><p></p><p>通过为物联网设备的数据和计算需求提供本地的处理和存储资源，边缘计算减少了物联网设备与连接的中央信息技术（IT）网络之间的通信延迟。</p><p></p><p>如果没有边缘计算，物联网将依赖于云端或数据中心的连接和计算服务。在物联网设备与云端之间来回传输数据可能会降低响应时间并降低操作效率。</p><p></p><p>在云计算模型下，计算资源和服务通常集中在大型数据中心。云端经常提供连接物联网设备与互联网所需的网络基础设施。边缘设备需要网络访问，以提供设备与中央数据库之间的双向通信。云端通常用于提供网络连接。例如，边缘设备通过云端将数据传输到数据中心，或边缘设备将其决策记录传输回数据中心进行数据存储、处理或大数据分析，这些都是云端的通信能力的示例。</p><p></p><p>下图是工厂制作车间与边缘云交互架构：</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/0d/0d6460df37ebf08a7536ce60fb158c04.jpeg\" /></p><p></p><h2>边缘计算的关键技术与架构</h2><p></p><p></p><h4>Microk8s：</h4><p></p><p></p><p>MicroK8s是一个功能强大、轻量级和可靠的适用于生产环境的Kubernetes发行版。它专为企业提供，具有较小的内存和磁盘占用，并具有一些关键特点如下：</p><p></p><p>下方是 Google 云 Anthos 与 MicroK3s 架构图：</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/50/50df8d1447c0f2e8476dcaa99ae52146.jpeg\" /></p><p></p><h4>K3s</h4><p></p><p></p><p>K3s是一个轻量级的Kubernetes发行版，专为在资源受限的环境中部署和运行的场景而设计。它是Kubernetes的简化版本，旨在提供更小、更快速和更易于管理的解决方案。</p><p></p><p>下方是其架构图：</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/30/302a7fb8351ff5811a9beca726e5fb63.jpeg\" /></p><p></p><h4>KubeEdge：</h4><p></p><p></p><p>KubeEdge是一个开源的边缘计算平台，旨在扩展Kubernetes的能力到边缘设备和边缘节点。它提供了一个统一的管理平台，用于部署、运行和管理容器化应用程序和服务，使得边缘设备能够高效地进行计算、存储和数据处理。</p><p></p><p>下方是其架构图：</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/26/26bafa06cdbc43cdaba08ea460bcbdfa.jpeg\" /></p><p></p><h4>OpenYurt</h4><p></p><p></p><p>OpenYurt 是业界首个非侵入的边缘计算云原生平台开源项目。主推“Kubernetes零修改”，“云边端一体化”等设计理念，提供诸如边缘自治、 跨网络域的云边流量治理、大规模边缘业务管理、边缘设备的云原生管理，异构资源支持等能力。OpenYurt 旨在帮助用户解决在海量边、 端资源上完成大规模应用交付、运维、管控的问题，同时为用户提供与云上Kubernetes集群一致的使用体验。</p><p></p><p>下方是其架构图：</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/fc/fcfd20b12b7b24c476695e1aa62bca01.png\" /></p><p></p><h2>边缘计算中设备如何受益</h2><p></p><p></p><p>可扩展性：对于许多物联网解决方案来说，可扩展性是主要关注点。边缘计算基础设施需要能够独立水平或垂直扩展，以支持额外的设备和实时处理大量数据。与传统的虚拟机相比，容器生成速度更快，因为它们更轻量化。高可用性：对于物联网解决方案来说，边缘设备必须始终可用和可信。由于每个容器都有自己的IP地址，很容易在它们之间分配负载，并在容器停止运行时重新启动应用程序。资源有效利用：由于其有效的资源管理，Kubernetes降低了托管物联网应用的成本。MicroK8s、K3s等是经过精简优化的Kubernetes版本，它们在托管的虚拟机、裸金属实例或云上提供了一个抽象层。管理员可以专注于将应用服务部署在尽可能多的基础设施上，从而降低运行物联网应用的总体成本。部署到边缘：在不中断服务的情况下将软件更新部署到边缘设备是物联网的重要挑战。通过Kubernetes可以运行逐步推出服务更新的微服务。在Kubernetes安装中，通常使用滚动更新策略来推出Pod版本的更新。通过在更新进行期间保留某些实例运行（例如Pod Disruption Budgets），可以实现零服务停机时间。只有在新部署版本的可用且准备好替换它们的Pod已启用时，旧的Pod才会被删除。因此，可以通过单个命令实现应用的水平或向上扩展。支持IoT的DevOps：为了满足消费者需求，物联网解决方案必须平滑地进行更新，而无需用户停机时间。借助可用于Kubernetes的CI/CD工具，开发团队可以有效验证、推出和部署对IoT服务的更改。</p><p></p><h2>边缘计算架构及场景</h2><p></p><p></p><p>接下来主要是演示使用 K3 作为下一个边缘计算的主要平台的架构图。</p><p></p><h3>1. 边缘集群和公有云</h3><p></p><p></p><h4>架构分析</h4><p></p><p></p><p>云层（Cloud Layer）：这一层位于公有云和云服务提供商中。云服务提供商可以提供基于Intel或ARM处理器的实例。一般来说，这一层为远端和微小边缘层提供存储或数据处理支持。近端边缘（Near Edge）：在这一层中，您可以找到用于在云层和远端层之间传输所有数据的网络设备。通常包括电信设备、5G网络等。远端边缘（Far Edge）：在这一层中，您可以找到K3s集群、类似KubeEdge的轻量级集群以及Docker或containerd等软件。一般来说，这是您的本地处理层。微小边缘（Tiny Edge）：这是远端边缘内的一个层次，在这里您可以找到智能手表、物联网设备等边缘设备，它们将数据发送到远端边缘。</p><p></p><p>简而言之，这种配置方式通过公有云或私有云与边缘层共享和处理数据。云层位于公有云和云服务提供商之间，支持远端和微小边缘层的存储或数据处理。近端边缘层包括用于数据传输的网络设备。远端边缘层包括K3s集群、轻量级集群和容器化软件，用于本地数据处理。微小边缘层是远端边缘内的一个层次，包括智能手表、物联网设备等边缘设备，它们将数据发送到远端边缘进行处理。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/a5/a5671bed195bf9cd397a241a3cd47df5.jpeg\" /></p><p></p><h4>适用场景</h4><p></p><p></p><p>在互联网或私有云中必须共享数据的不同系统之间的情景。在云端和边缘之间分配数据处理的场景，例如机器学习模型的生成或预测。需要扩展物联网应用程序，并且应用程序的响应时间至关重要的场景。希望使用数据分布和加密的聚合策略来保护数据的场景。</p><p></p><h3>2. 区域集群和公有云</h3><p></p><p></p><h4>架构分析</h4><p></p><p></p><p>此配置的重点是在不同区域之间分布处理策略，并在公共云之间共享数据。让我们来解释一下不同的层次:</p><p></p><p>云层（Cloud Layer）：这一层包含了像数据库这样的托管服务，用于在不同地区分布数据。近端边缘（Near Edge）：在这一层中，您可以找到网络设备，用于在云层和远端层之间传输所有数据。通常包括电信设备、5G网络等。远端边缘（Far Edge）：在这一层中，您可以找到跨不同地区的K3s集群。这些集群或节点可以共享或更新存储在公有云中的数据。微小边缘（Tiny Edge）：在这里，您可以找到靠近每个地区的不同边缘设备，远端边缘集群会因为这种分布式配置而处理这些信息。</p><p></p><p>简而言之，这种配置的重点是在不同地区分布处理策略，并在公有云之间共享数据。云层包含托管服务，用于将数据分布到不同的地区。近端边缘层包括网络设备，用于在云层和远端层之间传输数据。远端边缘层包括跨不同地区的K3s集群，它们可以共享和更新存储在公有云中的数据。微小边缘层包括靠近每个地区的边缘设备，远端边缘集群会根据这种分布式配置来处理这些设备传输的信息。这种配置将处理策略分布在不同地区，并实现了公有云之间的数据共享。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/ab/aba6b81267d6a3b5ce6a2b94df27c1c6.jpeg\" /></p><p></p><h4>适用场景</h4><p></p><p></p><p>在不同地区使用不同的集群配置：边缘计算可以支持在不同地区设置具有不同配置的集群，以满足特定地区的需求。例如，根据特定地区的数据处理要求，您可以在某些地区配置更强大的处理节点，而在其他地区配置更轻量级的节点。减少应用程序的响应时间：在物联网应用程序中，应用程序的响应时间至关重要。边缘计算可以通过选择最近的数据或处理节点位置来减少应用程序的响应时间。通过将数据处理放置在靠近数据源的边缘节点上，可以减少数据传输的延迟，并实现更快的响应。在不同地区共享数据：边缘计算可以帮助在不同地区之间共享数据。这对于需要在全球范围内共享数据的组织或应用程序非常有用。通过在不同地区的边缘节点之间共享数据，可以实现数据的快速访问和共享，无需在云端进行大量的数据传输。在不同地区分布处理：边缘计算可以将处理任务分布在不同地区。这对于需要在不同地区进行数据处理的应用程序非常有用。通过将处理任务分配给就近的边缘节点，可以降低数据传输的延迟，并提高处理的效率。</p><p></p><h3>3. 单节点集群和（公有/私有）云</h3><p></p><p></p><h4>架构分析</h4><p></p><p></p><p>在这种基本配置中，一台计算机处理来自微小边缘设备的所有信息。</p><p></p><p>云层（Cloud Layer）：在这一层中，您可以找到系统的数据存储。它可以放置在公有云或私有云中。近端边缘（Near Edge）：在这一层中，您可以找到网络设备，用于在云层和远端层之间传输所有数据。通常包括电信设备、5G网络等。远端边缘（Far Edge）：在这一层中，您可以找到单个节点的K3s集群，它从微小边缘设备中收集数据。微小边缘（Tiny Edge）：这些设备用于捕捉数据，例如智能手表、平板电脑、摄像头、传感器等。这种配置更适合在本地或小规模上进行处理。</p><p></p><p>简而言之，这是一种基本配置，其中一台计算机用于处理来自微小边缘设备的数据。云层用于存储系统的数据，可以位于公有云或私有云中。近端边缘层包括网络设备，用于在云层和远端层之间传输数据。远端边缘层包括单个节点的K3s集群，用于从微小边缘设备中收集数据。微小边缘层包括用于捕捉数据的设备，例如智能手表、平板电脑、摄像头、传感器等。这种配置更适合在本地或小规模上进行处理，而不需要复杂的边缘计算架构。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/8b/8b40bd1b0b554113e4f74c9113d4c4e2.jpeg\" /></p><p></p><h4>适用场景</h4><p></p><p></p><p>低成本和低能耗环境：这种基本配置适用于低成本和低能耗的环境。由于只有一台计算机进行处理，因此所需的硬件和能源成本相对较低。这对于资源有限或经济有限的场景非常有用。绿色边缘应用：这种配置适用于可由太阳能电池板或风力涡轮发电的绿色边缘应用。由于只有一台计算机进行处理，所需的能源消耗相对较低，可以与可再生能源一起使用，实现能源的环保和可持续。小型处理或用例：这种配置适用于处理小规模数据或小型用例的情况。例如，分析健康记录或自动化住宅系统等。这些用例通常不需要复杂的边缘计算架构，而是可以在本地进行处理，因此这种基本配置足够满足需求。</p><p></p><h2>总结</h2><p></p><p></p><p>边缘计算框架和工具在实现边缘计算的灵活性、可扩展性和协同性方面发挥着重要作用。KubeEdge、OpenYurt、K3s、MicroK8s都提供了不同的优点和适用场景，可以根据具体的需求和环境选择合适的框架和工具。它们使得边缘设备能够无缝地与云计算进行协同工作，实现数据的实时处理、资源的弹性利用和应用的高可用性，推动边缘计算的发展和应用。</p><p></p><p>随着企业拥抱数字化转型、行业4.0、工业自动化、智能制造以及这些举措提供的所有先进用例，Kubernetes、 edge 和云协作推动智能商业决策的相关性正变得越来越明显。</p><p></p><h4>作者介绍</h4><p></p><p></p><p>陈章朝，政采云有限公司运维开发工程师，一个热爱生活的编程爱好者，热于参与开源社区共建以及分享知识。</p>",
    "publish_time": "2023-07-07 10:10:45",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]