[
  {
    "title": "AIGC时代下的平台工程实践，数澈软件、小米、滴滴、B站、蚂蚁集团等在2023平台工程技术峰会上精彩演讲",
    "url": "https://www.infoq.cn/article/Q79Uh3SJSmr8xiY6QGD5",
    "summary": "<p>在凉爽的周末，由国内平台工程社区联合数澈软件Seal举办的「AIGC时代下的平台工程」2023 平台工程技术峰会在北京举办，现场聚集了数百位国内软件从业者，来聆听AI技术与平台工程实践，分享嘉宾来自数澈软件Seal、滴滴出行、bilibili、小米、蚂蚁集团等企业专家。</p><p></p><p>什么是平台工程？</p><p></p><p>平台工程是专注于通过减少现代软件交付的复杂性和不确定性来提高开发人员的生产力。它解决了规模化DevOps的一些挑战，包括减少在整个应用生命周期内管理复杂工具和基础设施的负担。</p><p></p><p>正如数澈软件Seal CTO梁胜博士在大会开场演讲中提到的，在AI时代的DevOps，AI工程师应该可以近水楼台先得月，利用AI技术减轻DevOps工作量。梁胜博士在开场介绍了DevOps的发展历程，正是有了云计算才有了DevOps后续的大力发展。梁盛博士还提到，开源行业对AI技术很重视，因为对于做软件开发的公司而言，开源是必须的，开源是跨国界的，要想做引领全球的产品，必须要拥抱开源。</p><p></p><p>在会议上，梁盛博士也介绍了数澈软件Seal新一代应用平台 Walrus，其核心是应用管理，成本管理，环境管理，应用部署管理，应用环境管理。平台团队可以在 Walrus 平台上将基础设施管理自动化，并使开发人员能够从一个统一管理的技术平台上自助获取可靠的工具和工作流程，提升开发效率。</p><p><img src=\"https://static001.infoq.cn/resource/image/3c/a0/3c341fe62931198ee8cf142d742a8ca0.jpg\" /></p><p></p><p>在demo演示环节，数澈软件Seal COO 江鹏老师现场在旗舰产品 Walrus 新一代应用管理平台上，基于数澈自研的大模型平台，通过文本输入的方式，让AI算法帮助工程师进行资源调度、部署和任务检测，很大程度上减少开发对运维底层部署的理解，也减少运维的开发成本。</p><p></p><p>旗舰产品 Walrus 是基于平台工程理念构建的全新一代应用管理平台，为研发人员打造简单美好的开发体验。其一键部署和克隆复杂应用系统、集成 AI 大语言模型简化模板代码生成以及灵活强大的应用和环境动态管理能力等特性备受用户青睐。借助 Walrus 用户可以将云原生的能力和最佳实践扩展到非容器化环境，并支持任意应用形态统一编排部署，降低使用基础设施的复杂度，为研发和运维团队提供易用、一致的应用管理体验，进而构建无缝协作的软件交付流程，加速企业业务创新。</p><p></p><p>爱回收从组织建设和软件开发讲平台工程能力</p><p><img src=\"https://static001.infoq.cn/resource/image/30/9d/304dafdc54056d2b402fa8ce4985eb9d.jpg\" /></p><p></p><p>来自万物新生集团（爱回收）的技术工程部负责人贾胜謇老师介绍了爱回收在平台工程领域的路程。贾老师介绍说，首先从人的角度入手，那就是组织建设，建立技术委员会，让业务研发leader参与进来，定期进行回顾复盘。其次是“在自研VS外包VS采购VS开源”方面的考虑。贾老师说，核心域考虑自研，支持域采用外包，通用域则直接采购。</p><p></p><p>滴滴出行质量效能中台落地实践</p><p></p><p>滴滴出行是比较典型的业务驱动模式，业务复杂，盘根交错，所以在质量维护、效能提升方面有很大的需求的。来自滴滴出行网约车平台质量中台负责人孔帅康老师，在会议上介绍了滴滴DevOps的挑战：DevOps流程割裂、自动化程度层次不齐、工具链呈烟囱式演进、缺失客观数据度量。</p><p><img src=\"https://static001.infoq.cn/resource/image/2e/63/2e2d16bff01549d002e4ab6059a9d963.jpg\" /></p><p></p><p>滴滴团队为了应对这些问题，从多维度入手，例如，在领域能力建设思路上，采取统一前端兼容老前端架构+统一管控平面降本工程成本+抽象三类执行节点支持差异化应用需求。在测试数据建设思路上，采用便捷研测工具数据接入+自动触发数据处理流程+形成领域研测数据宽表+常规数据开箱即用能力的方法。</p><p></p><p>同时在平台分层理念上，在降本和运营孵化层面入手。</p><p>降本：前后端、数据渠道统一工程方案；测试专家经验可传承度，例如工具&amp;策略运营：测试小工具标准化接入；山寨化治理度量展示；不同领域客服系统知识库积累孵化：借助对各业务线关系的厘清，对新问题进行重新定义，促成业务特性工具集完善</p><p></p><p>在代码门禁机制上，建设代码粒度质量管控措施，量化提测标准，提升代码质量；在工具去山寨化治理上，建立了专项治理质量域工具集合，拉齐造轮子基础能力水平线，规范效能工具链演进路线。</p><p></p><p>平台工程在B站的探索与实践</p><p></p><p>B站也是一个对软件工程质量要求很高的平台，尤其是实时性和稳定性方面。来自B站基础架构部资深研发工程师袁帅老师，在此次会议上介绍了B站走过的路程。</p><p><img src=\"https://static001.infoq.cn/resource/image/a0/d3/a08e54d0edc35888996cec5a2e847cd3.jpg\" /></p><p></p><p>首先在袁帅老师看来，从第一性原理而言，平台工程解决的是技术团队如何以更低的成本和更高的效率满足业务需求，支持业务运营发展。所以，可重用性、可扩展性、集中化管理和安全性是平台工程必须要具备的能力。</p><p></p><p>B站快速发展，使得像在离线、工程效能、游戏等团队，在平台化实践过程中，形成了各自相对独立的小平台，例如自愈平台、Redis/MySQL/大数据运维平台、应急响应平台等等，这就带来了平台的各种问题，包括平台数量急剧增多，维护成本增高，精力花在非关键地方，需求交付慢，交付质量差等。</p><p></p><p>B站在解决过程中，采用了统一门户平台：提供了一个具有服务目录功能的UI和OpenAPI；统一元数据：服务树、CMDB等各类PaaS元数据；统一工作流：围绕应用的生命周期平台化；以产品思维为驱动，将开发人员视为平台客户。</p><p><img src=\"https://static001.infoq.cn/resource/image/f8/14/f8d5303ce0044aaa9246ba5349d0d014.jpg\" /></p><p></p><p>除此之外，来自小米研发效能负责人 张志勇老师也在会议上分享了云原生应用观测平台 Hera 在小米的实践话题，从Hera建设背景和痛点，到Hera的性能提升和应用案例展开，介绍了Hera的易用性和实用性。</p><p></p><p>大会上还邀请了Thoughtworks总监架构师钟健鑫、安易科技创始人兼CEO韩春雷、博云科技IDP平台工程解决方案专家周晓宁、享道出行工程研发部高级经理张磊，和蚂蚁集团工程师徐鹏飞带来了精彩的演讲，干货满满，让现场听众收获良多。</p>",
    "publish_time": "2023-09-02 17:46:50",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]