[
  {
    "title": "Canonical发布Sunbeam项目：无缝迁移小型专有IT解决方案至OpenStack",
    "url": "https://www.infoq.cn/article/VLl2YPszwoHf77VCytaa",
    "summary": "<p>Canonical<a href=\"https://ubuntu.com/blog/canonical-extends-commercial-openstack-offering-to-small-scale-cloud-environments-with-project-sunbeam\">宣布</a>\"了一个新的开源项目，使组织能够轻松地将自己的小型专有IT解决方案迁移到OpenStack。Canonical说，<a href=\"https://governance.openstack.org/tc/reference/projects/sunbeam.html\">Sunbeam</a>\"项目是免费的，而且不需要成本高昂的专业服务。</p><p>&nbsp;</p><p>Sunbeam的目标是在Kubernetes和本地节点共存的混合环境中部署OpenStack。由于Sunbeam能够在容器中运行OpenStack，所以可以将它看成是一种加强型的OpenStack on Kubernetes。Sunbeam利用Canonical <a href=\"https://juju.is/\">Juju</a>\"在多云或混合云中编排和管理使用charm操作符的的节点。</p><p>&nbsp;</p><p>Charm是业务逻辑的基本封装单元，其中包含部署、配置和扩展应用程序的所有指令。Sunbeam采用了Kubernetes的原生概念，例如StatefulSets和操作符，因此，部署和操作OpenStack的方式与其他Kubernetes部署类似。</p><p>&nbsp;</p><p>Sunbeam的另一个核心功能是关系处理程序，它是charm和接口之间的中介，目的是创建一个中间抽象，让charm可以用统一的方式与各种各样的接口进行交互。例如，关系处理程序提供了一个ready属性，让charm接口知道是否所有数据都已经接收。另一方面，容器处理程序则负责协调charm和<a href=\"https://github.com/canonical/pebble\">pebble容器</a>\"，以配置容器、重启容器、检查其运行状态等等。</p><p>&nbsp;</p><p>虽然Sunbeam能够支持任意规模的OpenStack运营和管理，从单个节点到边缘的小型部署，再到包含成千上万虚拟化管理程序的大型云，但Canonical的产品经理Tytus Kurek证实，Sunbeam是专门针对OpenStack的初期采用阶段，例如在迁移小型遗留IT解决方案时：</p><p></p><p></p><blockquote>Sunbeam的出现消除了最初采用OpenStack时可能会遇到的许多障碍，这是迈向自治私有云的第一步。</blockquote><p></p><p>&nbsp;</p><p>Canonical声称，基于这一愿景，Sunbeams提供了一个简单的界面，旨在为不熟悉OpenStack的用户提供方便，让他们可以在几分钟内启动OpenStack云。</p><p>&nbsp;</p><p>目前，Sunbeam提供的最新OpenStack版本是2023.1，但只包含核心OpenStack服务，尽管Canonical表示这个项目的发展会非常迅速。</p><p>&nbsp;</p><p>&nbsp;</p><p>原文链接：</p><p><a href=\"https://www.infoq.com/news/2023/06/canonical-sunbeam-openstack/\">https://www.infoq.com/news/2023/06/canonical-sunbeam-openstack/</a>\"</p><p></p><p>相关阅读：</p><p><a href=\"https://www.infoq.cn/article/xb600VAYhlzQcjuvAKeN\">OpenStack 已死？最新报告显示 OpenStack 部署呈爆发式增长，整体规模超 4000 万</a>\"</p><p><a href=\"https://xie.infoq.cn/article/4fbda2565eba3864f38196764\">Kubernetes 与 OpenStack</a>\"</p>",
    "publish_time": "2023-08-19 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "中国46岁程序员拒写赌博程序遭拔14颗牙；小红书被疑“偷”原画师作品喂自家大模型；全面停止服务，俄遇“微软危机”｜Q资讯",
    "url": "https://www.infoq.cn/article/CRSPw8taA39exjff6DgO",
    "summary": "<p></p><h2>科技公司&nbsp;</h2><p></p><p></p><h4>扎克伯格公开怒斥马斯克炒作：我不想陪他玩了</h4><p></p><p>&nbsp;</p><p>美国两大富翁<a href=\"https://www.infoq.cn/article/FaYrWzSqvhhFLYatb6dW\">马斯克</a>\"和扎克伯格“约架”已过去两个多月，但至今仍未实现。扎克伯格8月13日发文指责马斯克不断找理由推脱“笼斗”，称“是时候向前看了”，因为马斯克没有认真对待。</p><p>&nbsp;</p><p>近日，马斯克不断地透露有关于两人比赛的细节，包括说要在自己的社交平台X上直播，又说已经和意大利总理聊过要把比赛场地安排在罗马斗兽场，还强调说UFC不会参与其中。不过扎克伯格表示，这都是纯属扯谈，他认为马斯克一直在找机会炒作，从来没有征求过自己的意见。</p><p>&nbsp;</p><p>扎克伯格公开发帖表示，马斯克压根不是认真的，散了吧。“我说了日期，他却不肯答应，说自己需要手术，然后又说要来我家练。如果他真的想上搏击台，他知道怎么联系我。我不想陪他玩了，还是专注于和那些真正严肃对待这项运动的人竞技。”</p><p></p><h4>中国程序员拒写赌博程序遭拔14颗牙，全身损伤88%</h4><p></p><p>&nbsp;</p><p>据媒体报道，中国一男子因未编写出赌博游戏程序，在越南遭到数月的囚禁、虐待。</p><p>据悉，46岁的受害人房立敬是一名程序员，由于在中国做生意遇到困难，于2020年1月14日来到越南寻找合作伙伴。经过协商，黄某聘请房立敬为他制作在线网络游戏，作为回报，房立敬将获得游戏20%的利润。直到2022年初，房立敬仍没有编写出一款可以运行成功的赌博游戏。为强迫房立敬编写赌博游戏程序，黄某王某和范某多次轮流残忍虐待他。</p><p>&nbsp;</p><p></p><h4>小红书被骂上热搜：被用户质疑偷原画师作品喂自家AI模型</h4><p></p><p>&nbsp;</p><p>近日，小红书被用户质疑偷用户作品炼自家AI模型引发热议，起因是有原画师发现用小红书Trik AI做出来的图片和自己的原作品非常相似。此外，该作者表示，还有很多这种直接剽窃的地方。类似被侵权的作者不在少数，有原画师表示，“当朋友告知我被小红书的AI喂图洗稿了，感觉心血被剽窃了。后来看了下确实有很多图无论是配色元素还是画面风格都和自己的图很像。而利用Trik AI创作的个人主页tag还写着‘插画师’。”</p><p>&nbsp;</p><p>据官方介绍，Trik AI是一款AI图像创作工作，专注于“一眼中国风”方向的无限探索。Trik AI上线的时间并不长。此前有报道显示，今年3月份小红书筹备了独立的大模型团队，且该部门在内部为保密状态，在员工系统里也被直接隐藏。今年4月份，小红书悄然上线了这款名为“Trik”的AI创作应用。随着事件的不断发酵，目前小红书上掀起了AI抵制潮。</p><p></p><h4>OpenAI：被爆财务危机、完成创立来首笔公开收购</h4><p></p><p>&nbsp;</p><p>北京时间周四凌晨，OpenAI在官网发布公告，宣布收购初创企业Global Illumination并将整个团队纳入麾下，新成员们已经开始参与包括ChatGPT在内的核心产品开发。这笔交易也是OpenAI自2015年创立以来，第一次公开收购，具体的交易条款并没有公开。</p><p>&nbsp;</p><p><a href=\"https://www.infoq.cn/article/JAqkPkkgMFvV0JvcFMtj\">Global Illumination </a>\"最近的项目是一个叫Biomes的开源大型多人在线沙盒游戏，依托于网页浏览器运行。从网站上放出的先导片预告来看，风格类似于全球历史销量排名第一的游戏《我的世界》。目前并不清楚收购完成后，这个游戏到底还会不会继续做下去。</p><p>&nbsp;</p><p>本周，OpenAI 还被爆可能正处于潜在的财务危机之中。Analytics India Magazine 的一份报告称，OpenAI 仅运行其人工智能服务 ChatGPT 每天就要花费约 70 万美元，该公司可能在 2024 年底破产。</p><p>&nbsp;</p><p>对此，天风国际分析师郭明錤表示，不用去担心“媒体报导 OpenAI 可能破产”。AI / AIGC 已是明确的趋势，但产业的变化将会创造新赢家与输家。值得注意的是，若 AI / AIGC 无法创造可持续获利的商业模式，产业对 AI / AIGC 的投资可能会放缓。郭明錤认为，其中一个观察指标为微软未来两个季度对 AI / AIGC 的资本支出展望与相关业务的获利状况。</p><p>&nbsp;</p><p></p><h4>谷歌“复仇者联盟”出击：26位研发主管名单流出，对标GPT-4</h4><p></p><p>&nbsp;</p><p>据外媒报道，谷歌于4月新合并的AI SWAT团队正在为秋季大型发布会做准备，将发布代号为Gemini的大模型，反击OpenAI的GPT-4。多位开发人员爆料了Gemini的跨模态文本生成图像能力及图表分析、文字或语音指令等多种功能，并称其有望为聊天机器人Bard等其他业务提供动力，从而与GPT-4的系列应用形成对垒。</p><p><img src=\"https://static001.geekbang.org/infoq/d9/d975c7ce8c4cd77d0003b3e1a32994af.png\" /></p><p></p><p>该团队中的小组分工及各小组主管，如表格所示，来自两个团队的26位主管的信息被搜集梳理了出来。</p><p></p><h4>快手职级体系调整，职级序列由双轨变单轨</h4><p></p><p>&nbsp;</p><p>快手推行4年多的职级制度体系在8月17日宣布调整，并通过全员邮件的方式在公司内部进行了正式通知。对比快手新旧职级体系，最大的变化是职级序列由双轨制变为单轨制。快手的职级体系，自2019年初开始正式推行，根据群体的价值贡献方式，划分为专业类“K”序列和管理类“M”序列。新的职级体系变为单序列后，以英文字母“E”来命名。</p><p>&nbsp;</p><p>此外，快手在总职级数上也进行了调整。快手此前在专业和管理两个职级序列中分出不同档位的大小档。而根据新职级制度，职级数变成E6-E15，共10级，改为连续编号，不再设细分小档。&nbsp;</p><p></p><h4>比亚迪退出百度自动驾驶合作，转向内部开发</h4><p></p><p>&nbsp;</p><p>据消息，两位知情人士透露，比亚迪放弃了为其电动汽车配备百度自动驾驶技术的协议，转向内部开发智能汽车软件。比亚迪最初于2022年3月同意在其电动汽车中使用百度的技术，包括导航和自动泊车。这笔交易当时被视为百度自动驾驶部门Apollo的重大举措，该部门成立于2013年。</p><p>&nbsp;</p><p>百度CEO李彦宏曾关注自动驾驶，然后将注意力转向了类似ChatGPT的聊天机器人。这笔交易的取消对百度的自动驾驶是一个巨大打击。</p><p></p><h4>羊了个羊背后公司又“清仓式分红”，赚 6.76 亿分红 5 亿</h4><p></p><p>&nbsp;</p><p>8 月 15 日，吉比特披露半年度利润分配方案，合计拟派发现金红利达 5.04 亿元，将占上半年净利润 74.6%，实控人卢竑岩将获得近 1.5 亿元。此前吉比特曾因游戏“羊了个羊”股价大涨，其通过控股子公司间接持有游戏研发商 20% 股权。</p><p>&nbsp;</p><p>值得关注的是，吉比特大手笔分红早有先例。去年10月，吉比特披露2022年前三季度利润分配方案，公司拟每10股派发140元现金，合计金额达到10.06亿元，占同期净利润的99.45%。在接下来的2022年度利润分配方案中，吉比特又向全体股东每10股派发现金红利30元，合计派发现金红利2.16亿元。2022年全年，吉比特共计分红超12亿元，占2022年全年净利润的83.63%，也因此被外界称为“清仓式分红”。&nbsp;</p><p></p><h4>国内“大模型数据被盗第一案”当事人和解</h4><p></p><p>&nbsp;</p><p>近日，世纪天鸿投资的 AI 辅助写作产品笔神作文发布声明称，已于 8 月 4 日决定不再对学而思，针对相关数据调取事件发起诉讼。笔神作文表示，经与学而思深入调查并坦诚沟通后，对双方有争议条款已达成一致，双方已消除误会，并将继续深化合作，共同推进AI技术在教育领域的探索。</p><p>&nbsp;</p><p>两个月前，笔神作文在6月13日下午发布声明，指控合作伙伴学而思“盗取”作文库存数据，来训练即将上线的AI大模型产品。笔神作文表示，将通过司法程序解决纠纷，要求学而思支付1元赔偿金，公开道歉，删除已爬取的数据，并称之为国内“AI大模型数据被盗第一案”。当晚，学而思火速回应称，对笔神作文数据的使用属于双方合同约定的正常合作范围，笔神作文“主观揣测”“与事实严重不符”。</p><p></p><h4>“少年天才”稚晖君离职华为创业首秀，智元机器人新品发布</h4><p></p><p>&nbsp;</p><p>以“天才少年”身份加入华为的稚晖君于去年底宣布离职，创业智元机器人，引发大量关注。经过半年多的准备， 8 月 18 日，稚晖君发布了一款智能新人——智元具身智能机器人远征 A1。</p><p>&nbsp;</p><p><img src=\"https://static001.geekbang.org/infoq/9a/9a39a558b16dfa99d2d9e16271b5a1c1.png\" /></p><p></p><p>&nbsp;从外观上看，远征 A1 身高 175cm，体重 55kg。它人形机器人的设定，不仅是指它的外观像人，走路、动作都像人，最高步速可以达到 7km/h。内置 RGBD 相机、激光雷达、IMU 和麦克风阵列，全身拥有 49 个自由度。整机承重高达 80kg，相当于可以抱起一个成年男性。不过，它单臂最大负载只有 5kg。</p><p>&nbsp;</p><p>稚晖君表示，这款机器人未来将可以在各种复杂场景下自主完成移动和操作任务。</p><p></p><h4>小米首款大模型曝光，手机侧大模型已经初步跑通</h4><p></p><p>&nbsp;</p><p>8月14日晚间<a href=\"https://www.infoq.cn/article/5HCUK1NzsLI4wtfQ3YAO\">，小米</a>\"董事长雷军表示，大模型是非常重大的技术革命，小米全面拥抱大模型。雷军透露，小米从2016年7月起就开始布局AI，在今年4月组建了大模型团队，AI相关团队超过3千人。小米在大模型方面主力突破方向是轻量化。目前，小米手机侧大模型已经初步跑通，部分场景效果媲美云端。雷军宣布，已正式为小爱同学接入大模型，并于8月14日开放小爱升级大模型的邀请测试。</p><p>&nbsp;</p><p>小米公司此前并未“官宣”直接加入 AI 大模型赛道中，不过小米的 AI 大模型 MiLM-6B 目前已经悄然现身 C-Eval、CMMLU 大模型评测榜单。</p><p>&nbsp;</p><p>截至当前，小米大模型在 C-Eval 总榜单排名第 10、同参数量级排名第 1。根据 GitHub 项目页给出的信息得知，MiLM-6B 是由小米公司开发的一个大规模预训练语言模型，参数规模达 64 亿。根据 C-Eval 给出的信息，MiLM-6B 模型在具体各科目成绩上，在 STEM（科学、技术、工程和数学教育）全部 20 个科目中，计量师、物理、化学、生物等多个项目获得了较高的准确率。</p><p></p><h4>钉钉独立发展、秒鸭相机并入阿里大文娱全资控股公司</h4><p></p><p>&nbsp;</p><p>随着阿里巴巴“1+6+N”组织变革的持续推进，阿里集团已明确钉钉继续作为阿里巴巴集团内独立业务，独立发展，加速孵化。阿里内部人士称，钉钉一直是阿里旗下的一个独立业务，在“1+6+N”组织变革前，钉钉由阿里云智能事业群分管。</p><p>&nbsp;</p><p>不久前，阿里云宣布将从阿里集团分拆上市，而钉钉则明确将独立发展。该内部人士强调，阿里云和钉钉会继续保持紧密的业务合作，这一点没有变化。多个可靠信源表示，目前已有投资机构希望投资钉钉。</p><p>&nbsp;</p><p>另外，阿里大文娱CTO郑勇近日也透露，为便于管理，阿里近期爆火的妙鸭相机将并入神力视界。据了解，阿里大文娱于6月成立了神力视界（深圳）文化科技有限公司，注资1亿元，由阿里巴巴文化娱乐有限公司全资控股，法定代表人为阿里大文娱集团CTO郑勇。妙鸭相机就是依托神力视界的技术能力孵化出来的。</p><p>&nbsp;</p><p></p><h2>IT 业界</h2><p></p><p>&nbsp;</p><p></p><h4>𝕏平台再出争议操作引不满，对部分外链延迟5秒再加载</h4><p></p><p>&nbsp;</p><p>马斯克在执掌𝕏（前推特）后，进行了大刀阔斧的改革，也制定了很多颇受争议的政策。根据国外多家媒体报道，马斯克调整了短链接t.co的外链服务，引发了其它平台的强烈不满。</p><p>&nbsp;</p><p>根据外媒报道，包括 Instagram、Facebook、Threads、Substack、纽约时报和Bluesky等网站的短链接都被限流，𝕏（推特）的推文虽然支持这些外链，但用户点击之后会延迟 5 秒时间，然后再开始加载网站。</p><p></p><h4>微软停止向俄罗斯提供服务、印度启用本土操作系统“玛雅”取代Windows</h4><p></p><p>&nbsp;</p><p>据塔斯社报道，微软将在9月30日停止向俄罗斯提供服务，这意味着俄罗斯将会完全失去微软产品的支持。这一举措可能会导致俄罗斯在全球舞台上与其他国家隔离，对其国内外各个领域产生深远影响，从技术发展到国际交流，都将受到严重挑战。</p><p>&nbsp;</p><p>多年来，俄罗斯一直依赖微软的软件和服务，这些产品包括操作系统、办公软件等，在政府、企业和个人的日常活动中发挥着关键作用。然而，微软的决定将使得这些领域面临重大的变革。俄罗斯将不得不寻找替代品或者自行开发，而这无疑需要耗费大量的时间和资源。</p><p>&nbsp;</p><p>另外，据印媒报道，印度将放弃微软系统，选择新的操作系统和端点检测与保护系统。备受期待的“玛雅操作系统”将很快用于印度国防部的数字领域，而新的端点检测和保护系统 “Chakravyuh”也将一起面世。”玛雅“ 操作系统是一个基于 Linux 的发行版，从流行的 Ubuntu 操作系统中汲取灵感。</p><p>&nbsp;</p><p>预计这一过渡将是无缝的，因为与其他 GUI（图形用户界面）操作系统一样，“玛雅” 操作系统将提供与 Windows 相似的用户界面和功能。据报道，”玛雅“ 操作系统将在印度独立日（即 8 月 15 日）之前在南区实施。不过，印度国防部尚未证实此事，也未发布官方消息。&nbsp;</p><p></p><h4>Kubernetes 1.28 发布</h4><p></p><p>&nbsp;</p><p>该版本包含了 45 项增强功能。其中，19 项进入 Alpha 阶段，14 项升级到 Beta 阶段，12 项升级到稳定版。该版本进行了许多重要功能和用户体验优化，如“从非正常节点关闭中恢复”正式 GA、对控制平面和节点版本之间受支持的偏差 (skew) 进行了调整、在 Linux 上启用 swap space 进入 Beta 阶段等。</p><p>&nbsp;</p><p>具体可查看：<a href=\"https://kubernetes.io/blog/2023/08/15/kubernetes-v1-28-release/\">https://kubernetes.io/blog/2023/08/15/kubernetes-v1-28-release/</a>\"</p><p>&nbsp;</p><p></p><h4>Debian 诞生 30 周年</h4><p></p><p>&nbsp;</p><p>8 月 16 日，Debian 官方博客发文庆祝 Debian 诞生 30 周年。30 年前，Debian 创始人 Ian Murdock（已故）向 comp.os.linux.development 新闻组发送邮件，称自己完成了一个全新的 Linux 发行版，他将其命名为 \"The Debian Linux Release\"。</p><p>&nbsp;</p><p>可以说，这个版本是他从零开始手工创建的。lan 为这个新版本的运行制定了指导原则，规定了该版本在大小、升级方式、安装程序等方面将采取的方法，并非常细心地考虑到了没有互联网连接的用户。lan 没有意识到他已经在新生的 F/OSS 社区中引发了一场运动，而是继续致力于 Debian 的开发工作。在来自新闻组和世界各地的志愿者的帮助下，Debian 不断发展壮大，成为当今最大、最古老的免费操作系统之一。</p>",
    "publish_time": "2023-08-19 10:30:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "联想戴炜：以三种交付方式全面支持三类算力场景的混合计算需求",
    "url": "https://www.infoq.cn/article/uMKuIefPyd0b8oQsl44r",
    "summary": "<p>8月18-19日，以“算领新产业潮流 力赋高质量发展”为主题的2023中国算力（基础设施）大会在银川召开。作为我国算力领域、数字经济方面的标志性大会，会议聚焦算力前沿技术领域，展示算力融合应用成果，推动算力产业加速发展。大会首日，联想作为领先的智能化全栈解决方案与服务提供商，成功举办了“联想AI算力战略暨AI服务器新品发布会”。</p><p></p><p>中国信息通信研究院云计算和大数据研究所副所长栗蔚，联想集团副总裁、联想中国区方案服务业务群总经理戴炜，联想集团副总裁、联想中国区基础设施业务群服务器事业部总经理陈振宽，联想集团副总裁、联想中国区大客户业务群总经理王立平共同出席了本次发布会，并发布了两款新品服务器。</p><p></p><p>针对本次大会核心的混合计算问题，联想集团副总裁、联想中国区方案服务业务群总经理戴炜在发布会上表示：“联想方案服务将以三种交付方式（混合云、臻算服务2.0订阅式和一站式）支持三类算力场景（普算、智算、超算）的混合计算需求。”并推出了联想智算中心解决方案和服务核心产品。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/57/576ad3f3397880b1d7f665092ad228fd.png\" /></p><p></p><p>联想集团副总裁、中国区方案服务业务群总经理戴炜</p><p></p><p></p><h2>联想三种交付方式，应对混合计算需求爆发的强力支柱</h2><p></p><p></p><p>OpenAI带火了人工智能，GPT大模型让算力争夺战进入白热化，算力对经济的促进作用已经超乎想象。今年7月，工信部明确要求“面向人工智能、大数据等新兴领域需求强化算力支撑，持续赋能科技创新。”作为中国企业、“双实企业”的联想，肩负着陪伴中国企业完成智能化转型每一步的重任。</p><p>戴炜表示，在智算中心建设过程中，混合架构模式已成行业趋势，智能算力场景将持续推动算力需求升级，领先的技术框架和全程的陪伴服务成为智算中心建设的关键。</p><p></p><p>本次发布会上，联想方案服务基于公有云与私有云、国产芯片与通用芯片、普算与智算和超算在内的三类混合算力在智算中心建设上的广泛需求，依托“端-边-云-网-智”新IT架构和智能IT引擎“擎天”，打造了端到端智算中心解决方案与全栈全周期服务。通过联想混合云服务搭建多云纳管和一云多芯的管理平台；通过订阅式臻算服务2.0实现算力的精细化交付；通过一站式建设和服务提供智算中心的“交钥匙工程”，从而实现对千行百业智能化转型的助力。</p><p></p><p>在智算中心的建设上，联想推出集咨询、设计、集成和运维的一站式服务解决方案。联想智算中心解决方案涵盖行业解决方案、PaaS、IaaS以及绿色低碳的智算中心基础设施等领先技术架构，同时具备咨询设计、集成建设、运维服务、持续优化服务的全周期陪伴式服务能力，全程陪伴客户智能化转型。通过“一切皆可订阅”的联想臻算服务2.0，客户可按需订阅、灵活付费，全面助力解决客户痛点，触达多行业、覆盖全场景。</p><p></p><p>作为联想实现全栈全周期服务的技术核心，“擎天”是联想凭借39年的最佳实践和基于“端-边-云-网-智”全要素覆盖的新IT技术，通过内生外化打磨出的具有云原生&amp;中台化、AI智能、ESG三大特征的智能IT引擎。“擎天”包括了IaaS层（混合云），以及技术中台和通用业务中台的GPaaS，和面向不同行业领域的VPaaS。正是基于“擎天”引擎的“模块化”横向支持和“中台化”纵向打通的双重能力，联想从而实现对千行百业智能化转型的赋能。</p><p></p><p></p><h2>Lenovo xCloud 联想混合云解决方案，三类混合计算架构的全面技术支持</h2><p></p><p></p><p>作为联想智算中心解决方案的核心组成，Lenovo xCloud × 联想臻算服务2.0具备多样云资源的平台服务能力与精细化运营能力，助力企业打造解决混合架构难题的新模式，解决企业的全面上云问题。</p><p>联想混合云是联想沉淀了近 40 年 IT 智慧，基于端到端最佳实践，融合敏捷的云原生技术、统一的多云管理平台、卓越的智能运维、高可用的私有云、高效的数据库管理和自动化的灾备管理，打造出业界领先的“建-上-用-管”云上全生命周期解决方案，覆盖了企业各个阶段的需求，确保企业软硬件系统的高效运行和数据的无缝传输。</p><p></p><p>目前，联想混合云已实现覆盖企业“建云、上云、用云和管云”的全栈全周期，满足绝大多数企业的混合云需求。涵盖私有云、云原生、智能运维、多云管理等4大产品为核心的产品家族和包括SAP解决方案、私有云解决方案、云原生解决方案、智能运维解决方案、MSP&amp;多云管理解决方案、数据库管理解决方案等9款通用解决方案。通过完整、完善的解决方案序列，帮助用户找到真正适合自己的产品、服务和解决方案，快速完成混合云部署，为用户提供一致性的用云体验。</p><p></p><p>作为联想的内生外化产品，在内生应用层面，以混合云为代表的全面智能化应用给联想在营销领域、客户服务领域、供应链领域都带来了一系列价值提升。在外化场景中，联想混合云不仅在专业技术层面得到行业专家的一致认可，还在行业实践上收获市场高度评价。前不久，Lenovo xCloud联想混合云入选信通院评选的《混合云产业全景图（2023）》混合云IaaS、混合云PaaS、混合多云云管和混合云场景四大方向，同时，位于甘肃电投紫金云云平台项目获评《2023年度混合云、专有云、云网优秀案例》。</p><p></p><p>坐落中国西北甘肃的紫金云，是国家级战略工程“东数西算”启动后在甘肃率先落地的项目，当前其正以算力为支点，致力于建设成为立足于甘肃、服务于西北，辐射全国的大型智算中心，为西部地区培育和发展新业态和新产业。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/c7/c7ca987898d83b107c496d3b51f2b80c.png\" /></p><p></p><p>联想方案服务结合甘肃电投紫金云的需求特点，联想设计了以Lenovo xCloud联想混合云为核心的整体云平台解决方案。云平台采用“一云多芯”的架构设计实现了混合算力 需求的保障，为北斗核心业务提供ARM架构的计算服务器资源池，为集团私有云和公共服务区提供x86计算资源池，并通过多租户模型，实现子公司可以作为租户申请使用云平台资源，实现资源相互隔离。</p><p></p><p>云平台建设后，满足等保2.0三级的严格要求，并可以为租户提供等保2.0三级的安全服务能力，帮助企业规避数据安全风险，保障企业业务连续性、数据资产不丢失，同时具备未来升级能力，提供包括云原生、云市场能力、多租户计费收费等服务。</p><p></p><p>在充分满足企业上云规划的同时，实现云平台的统一管理、统一运营运维，引入云市场、营销模块、智能运维，为省内国资企业数据化转型赋能。</p><p></p><p></p><h2>联想臻算服务2.0，让智算中心变为“交钥匙工程”</h2><p></p><p></p><p>除了Lenovo xCloud联想混合云解决方案在多云平台建立和管理上的智慧化赋能，联想臻算服务2.0针对云业务管理的精细化运营、以及智算中心一站式建设和服务提供了技术支持。</p><p></p><p>在中国智算中心建设上，仍存在建设成本过高、应用场景尚不丰富、运营模式尚不成熟等问题，在国产化趋势下，一些企业还面临更严峻的软硬件部署问题，以及项目交付部署及后期运营技术与人力问题。</p><p></p><p>联想臻算服务2.0采用订阅式、一站全包服务模式与一站式交付服务，赋能企业智能化全栈全周期，不仅能够解决企业在智能化转型过程中所面临的业务变化、软硬件部署和资源不足等难题，还能为企业节省百万到亿级的初始固定资产投资，同时可按需灵活组合软硬件产品，满足企业对于安全、国有化或者通用化软件硬件的个性化产品组合需求，确保数据的本地安全性，提升企业的抗冲击能力。相比于臻算服务1.0，2.0新增了国产化算力和平台化服务能力（涵盖AI服务、中间件服务、数据库服务和元宇宙服务）。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/cc/cc40cddfaef662915b7e782fababc4e3.png\" /></p><p></p><p></p><p>2021年，联想在东数西算的八大节点之一的宁夏中卫建立了联想智算中心，为并行科技提供大规模高性能计算服务器，输出全生命周期算力服务，这是在“东数西算”工程全面启动的“发令枪”响起之时，就响应成立的复杂数据中心。基于臻算服务2.0按需计费、灵活弹性扩展的特点，并行科技将IT架构的成本和复杂性降至最低。一方面，可以根据并行科技的实际需求轻松扩展容量和资源，避免了自建数据中心和定量购买模式带来的大量前期投入，最大限度地降低经营风险。同时，臻算服务2.0的端到端服务能力，让并行科技从硬件采购到系统运维的所有环节全程由联想助力，进一步减轻并行科技的管理负担。真正做到把智算中心建设变为“交钥匙工程”。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/66/66982d76a3b899a70bfdfb9bd6a8e1b0.png\" /></p><p></p><p></p><p>当前，算力的重要性已被提升到新的高度。算力作为数字经济时代新的生产力，对推动科技进步、行业数字化转型以及人类经济社会发展发挥重要作用。全球算力发展正面临应用多元化、供需不平衡等挑战，人工智能、数字孪生、元宇宙等新兴领域的崛起，推动算力规模快速增长、计算技术多元创新、产业格局重构重塑。</p><p></p><p>作为企业智能化转型的实践者与赋能者，联想方案服务将以三种交付方式（混合云、臻算服务2.0订阅式和一站式）支持三类算力场景（普算、智算、超算）的混合计算需求。凭借全栈智能的核心能力，未来联想将以AI导向的算力基础设施，助力算力向普慧、绿色方向发展；以AI原生的全栈全周期服务，覆盖AI全域应用，实现算力普及与智慧赋能，与千行百业的客户共推动数字中国建设加速前行。</p><p>&nbsp;</p>",
    "publish_time": "2023-08-19 16:19:47",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]