[
  {
    "title": "解决制造业效率、质量和成本的取舍问题，技术可行但并非万能",
    "url": "https://www.infoq.cn/article/XlyVG0TzW8kZQA0xFiJl",
    "summary": "<p>我国制造业正处于迈向全球价值链中高端、提升核心竞争力的关键阶段。加快制造业数字化转型，利用数字化手段为制造赋能，将完善产品研发、生产、供应链、销售、服务等各个环节，促进制造业质量与效率提升。</p><p>&nbsp;</p><p>但是，技术与行业的融合并非与生俱来，在其落地过程中存在一系列可预知或不可预知的问题。在日前由InfoQ与TGO鲲鹏会联合组织的高端制造数字化闭门会上，来自不同制造企业的专家围绕各自在数字化转型中面对的挑战进行了交流，并聚焦其中的几个核心问题展开了脑暴。</p><p>&nbsp;</p><p>比如，在追求效率和质量的同时，制造业面临的成本压力可能比其它行业还要大得多。因为传统制造是一个低利润行业，非常讲求资金利用率，对于数字化这样一个投入不小但见效周期又比较长的领域，很难做到“挥金如土”。</p><p>&nbsp;</p><p>那么，制造企业具体如何在转型制造过程中让技术的价值最大化，又如何平衡好效率、质量和成本的关系呢？各位专家认为，在合适的时间、选择合适的技术、识别合适的场景非常重要。</p><p>&nbsp;</p><p>以下内容根据闭门会现场研讨整理，经&nbsp;InfoQ&nbsp;编辑、提炼和总结，希望为大家提供参考。</p><p></p><h2>制造业发展面临重重挑战</h2><p></p><p>&nbsp;</p><p>回顾数百年来工业进化历程，背后的驱动力，离不开对效率、质量和成本的极致追求。而这个过程，注定不是一路坦途。在眼下的工业阶段，制造企业面临的挑战具体表现在以下几个方面：</p><p>&nbsp;</p><p>效率挑战</p><p>&nbsp;</p><p>不同团队间存在部门墙，协同效率差。比如，软件研发与业务生产“两张皮”的现象严重，前端业务提交的需求很难得到准确且高效的响应，并且在具体协作过程中，由于话语体系不同，不仅沟通成本比较大，效果也不尽如人意；</p><p>&nbsp;</p><p>效率提升与数据安全存在矛盾。在传统制造业，效率固然重要，但是数据安全（尤其是涉及核心业务的数据，如核心机密、产能、生产计划等等）仍是一条不可跨越的底线，因此，就拿上云这件事为例，即便可以帮助企业提升内外部的协作效率，促进研发运营效率提升，但是制造企业对此仍然非常谨慎；</p><p>&nbsp;</p><p>节能减排与生产效率之间的平衡。<a href=\"https://www.infoq.cn/article/wK91ohatBuULkxsliMaa\">绿色化</a>\"发展的优先级越来越高，保障生产有序的同时还要保持低碳运营，难度系数加倍。</p><p>&nbsp;</p><p>质量挑战</p><p>&nbsp;</p><p>质量和效率很多情况下是相互对立的两面，想实现“既要又要”并不容易。虽然每个企业都有自己的质量保障体系，但是在具体落实过程中，一些环节可能会让渡给订单进度或者客户需求。</p><p>&nbsp;</p><p>成本挑战</p><p>&nbsp;</p><p>经济放缓，整体成本控制压力大。传统制造非常看重投入产出比，但数字化的投入产出问题很难讲清楚。尤其是在经济放缓的大环境下，很多企业都更注重把钱花在刀刃上，只做“雪中送炭”的事，不做或少做“锦上添花”的事；</p><p>&nbsp;</p><p>劳动成本快速上升，高端人才引进难。传统制造是劳动密集型产业，不仅面临人力成本上升的巨大挑战，同时，随着产业变革，劳动力结构也在发生变化，但传统制造对高端人才的吸引力却非常有限；</p><p>&nbsp;</p><p>冗余采购，材料复用难，供应链成本大。为了应对突发状况，确保生产不被中断，制造企业的原材料往往都是冗余采购，这会带来额外的采购成本、库存成本，造成成本浪费。</p><p>&nbsp;</p><p>创新挑战</p><p>&nbsp;</p><p>业务创新与风险管控存在矛盾。制造业对业务稳定性和连续性的要求极高，这也是其对新技术的引入往往有所保留的原因之一。但很多机会的失与得往往就在一瞬之间，对于时机的把握如果过于乐观很容易带来不可控的风险，如果过于保守又容易错失良机，如何评估和降低业务创新过程中的不确定性，这也是个让企业头疼的问题。</p><p></p><h2>技术是解决问题的“高手”</h2><p></p><p>&nbsp;</p><p>技术本身可以解决以上的很多问题。</p><p>&nbsp;</p><p>举例来说，钉钉、飞书、企业微信等协作办公系统解决的是员工日常沟通的问题，<a href=\"https://xie.infoq.cn/article/19d69284a8b0229b910ebeba9\">DevOps</a>\"解决的是研发协同的问题。而引入<a href=\"https://xie.infoq.cn/article/b21b9fa94a82b2c1192682889\">RPA</a>\"等技术，还可以帮助企业做流程衔接，通过流程挖掘实现快速响应，提高全流程效率。</p><p>&nbsp;</p><p>除此之外，通过<a href=\"https://www.infoq.cn/theme/150\">IoT、AI</a>\"、大数据等技术的结合，还可以赋能生产、供应链等各个工业场景，帮助企业降本增效，提高生产质量，同时实现全周期的能源管理。</p><p>&nbsp;</p><p>以质量管理为例，整个过程涉及产品设计研发、制造、采购、服务等环节，过去数据分散在各个业务系统，质量分析追溯非常困难，如果产品良率出现问题，很难确定问题环节。而通过设备联网和智能化改造，可以把业务上下游连接起来，实现数据打通，这时候就可以让整个质量管控的过程实时化，追溯过程也更高效。在确保产品质量基础上，追求效率才有意义。</p><p>&nbsp;</p><p>能源管理同理，通过传感器的部署，广泛采集生产线上的水、电、气等与能源相关的数据，再借助大数据的监测和分析手段，可以实现对各项能耗指标的可视化管理，然后根据能耗高峰和低谷进行调优，避免资源浪费，把各个环节的碳排放降到最低。在这一前提下，企业可以专注于生产效率，而不用因为节能减排的要求分心去做减产甚至停产。</p><p>&nbsp;</p><p>针对成本的问题，技术同样有的放矢。比如，劳动力成本升高，那么，通过机器自动化、智能化（如AI质检）手段，既能提效还能减少一些人为失误，同时还可以把人力释放出来，去做更多高附加值的工作；再比如，供应链成本投入大，归根结底是因为没有做好精细化管理，而借助数字化技术，企业可以更精准地根据订单、排产预测原料需求量，既不造成不必要的浪费，同时也避免因为原料供应不足导致生产停滞等风险。</p><p>&nbsp;</p><p>数字孪生技术也是其中非常重要的一项技术。在全面和深度数字化基础上，通过仿真在数字空间中完成对物理空间的映射，可以帮助企业在产品设计、生产制造和远程售后服务等方面，实现提前反馈和结果优化，减少成本浪费。比如，在某产品的实物制造之前，就能先对其性能做模拟，如果发现问题及时反馈和调整；甚至，在产品研发阶段，就可以提前模拟产品投放市场之后的情况，对产品创新的风险进行识别和管控。</p><p></p><h2>但技术也不是万能的</h2><p></p><p>&nbsp;</p><p>当然，技术解决不了所有问题，甚至还会带来一些衍生问题。</p><p>&nbsp;</p><p>战略共识的统一，是决定企业数字化转型成功与否的关键因素。因为数字化转型是一次彻底变革，覆盖范围广、涉及角色多、见效周期长，这是它必须由“一把手”亲自操刀的主要原因。但是，未必所有一把手都能在第一时间洞察到数字化的机会，通常来说，这需要由技术团队或外部力量（如行业头部企业）进行由下而上或由外而内的影响。</p><p>&nbsp;</p><p>“因为看见，所以相信”。在这个过程中，需要让管理层体验到技术的价值。比如，优先从企业经营管理的场景切入，为管理者提供可视化的运营和分析工具，让老板坐在办公室也能实时且直观地掌握生产现场的状况。与此同时，还要让一线业务人员体验到技术的价值。比如，从让业务最“痛”的点切入，先解决最迫切的问题，拉更多的人“上船”。</p><p>&nbsp;</p><p>从意识和阵线上达成共识，是避免内部冲突，提高团队协作的前提。在此基础上，还要有组织流程和制度做承接。</p><p>&nbsp;</p><p>比如，针对业务和技术“两张皮”的问题，需要从组织架构层面，把双方拉齐到统一战线，在软件研发过程中就把业务方也纳入进去，充分沟通、统一目标，并且共同为结果负责。如今，很多企业都会构建由业务、技术、数据等相关人员共同组成的数字化项目虚拟团队，核心也是为了解决这个问题。</p><p>&nbsp;</p><p>此外，<a href=\"https://www.infoq.cn/article/FHLt7r5zU7lvYP8U5ODm\">敏捷组织</a>\"也是解决跨部门协作问题的主流思路。基于协调一致的价值观，通过灵活的团队合作，快速的反馈和迭代可以大大提高团队效率和效果。在市场环境变化越来越快的当下，这种思路和方法将越来越重要。</p><p>&nbsp;</p><p>同样地，包括数据安全在内的诸多挑战，也可以通过组织流程和制度做保障。比如，在数据采集、数据应用的过程中，要反复确定边界，通过一些权限设置兼顾效率和安全需求。</p><p></p><h2>技术选型要避免“拿大炮轰蚊子”</h2><p></p><p>&nbsp;</p><p>那么，回到最开始我们提出的那个问题——企业如何平衡好效率、质量和成本的关系呢？</p><p>&nbsp;</p><p>在不同的经济环境和发展阶段下，这三者的优先级会出现变化。当经济形势乐观、企业资金充足，质量和效率是第一位，这时候，技术是“锦上添花”，企业可能会选择最先进的技术不断提高产品质量；当经济形势放缓、企业资金不足，成本是第一位，这时候，企业更倾向于那些能够“雪中送炭”的技术，并且对投入产出比更为敏感。</p><p>&nbsp;</p><p>所以，在三个要素之间做取舍，必须综合考虑时机、外部形势、企业状况、技术和场景适用性等因素。</p><p>&nbsp;</p><p>拿“<a href=\"https://xie.infoq.cn/article/f67b052bb91f2290632df8da6\">黑灯工厂</a>\"”这个被认为未来的典型范式来说，企业投入的成本非常大，但是行业里的成功案例寥寥无几。为什么呢？因为如果企业前端订单规模不够大，即便最终产能提高了，但东西如果卖不出去，就会变成库存积压。也就是说，如果企业对自身情况把握不准，那么再好的概念和模式也无法产生价值。一切从实际出发，说的就是这个道理。</p><p>&nbsp;</p><p>从技术视角来看，当然也不是技术越先进越好。</p><p>&nbsp;</p><p>以<a href=\"https://xie.infoq.cn/article/769741cfc7091dd2a7bd95355\">MR设备</a>\"为例，理论上，它可以辅助员工完成很多工作。比如，在员工培训场景，不用到现场就可以享受沉浸式的学习体验，大大提升培训的效果；比如，在设备维修场景，维修人员可以利用MR设备实现远程维修指导，减少维修时间，为生产提供保障；再比如，在一些危险性比较高的工业场景，MR可以和机器人进行配合，替代人工完成高危作业。</p><p>&nbsp;</p><p>但问题在于，MR设备的成本高昂，如果不能带来与之匹敌的收益，对企业来说得不偿失。比如，无论是培训还是维修，很多远程协作的工作也可以用移动端搞定，不仅成本更低，操作的灵活性也更高。如果带来的效益提升与MR设备不相上下，那么移动端无疑是个更好的选择。这意味着，在技术选型过程中要避免“拿大炮轰蚊子”，“合适”很重要。</p><p>&nbsp;</p><p>当然，我们也可以看到，随着如今数字化转型进入深水区，越来越多的企业已经走出浮躁期，不再盲目跟风；加上经济环境的影响，企业对技术的选择也更趋于理性、更注重“性价比”，场景的选择则聚焦那些更为迫切或者能在更短时间内看到效益的业务。当数字化成为一个确定性方向，那么“会算账”将成为下阶段考验企业的关键课题。</p>",
    "publish_time": "2023-06-12 11:01:30",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "2023开放原子全球开源峰会在北京成功举办",
    "url": "https://www.infoq.cn/article/hl9FPtSPFuyMS4LNgKbU",
    "summary": "<p>6月11日，以“开源赋能，普惠未来”为主题的2023开放原子全球开源峰会开幕式暨高峰论坛在北京成功举办。工业和信息化部党组成员、副部长张云明，北京市人民政府副秘书长许心超出席并致辞，工业和信息化部相关司局、中国科学技术协会、北京市相关部门负责同志参会。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/b7/b78062bd4af067125fb2a339c22ba85a.jpeg\" /></p><p></p><p>张云明指出，中国已成为开源参与者数量全球排名第二、速度增长最快的国家，为技术创新和经济社会发展注入了生机活力。下一步，要立足新发展阶段，加快推进开源体系建设，释放开源发展潜能，推动高质量发展。一是完善体系化布局。坚持全国“一盘棋”，加强开源体系顶层设计，营造更加良好的政策环境。二是打造开源应用示范标杆。支持国内外优质开源社区加快孵化和应用推广，助力提升关键软件源头创新和供给能力。三是深化开源文化理念。汇聚产学研用各方力量，共同探索新时期开源理论体系和实践路径。四是发挥开放合作优势。大力发展以开源为代表的产业协作方式，让发展成果更好更多惠及百姓。</p><p></p><p>许心超指出，当前开源已成为全球协同创新的新模式和推动新技术发展的强大动力，是数字经济发展的主流方向和必然趋势。近年来，北京积极打造全球数字经济发展的“北京标杆”和“开源高地”为我国开源生态繁荣和国际开源发展做出了北京贡献。未来将进一步加大对开源的投入，大力支持开源技术创新，加快推进开源开放模式，积极开展开源商业化探索，持续优化开源发展环境，助力开源赋能行业的高质量发展。</p><p><img src=\"https://static001.geekbang.org/infoq/d4/d40c05453940b4823c48c1710c7e9151.jpeg\" /></p><p>中国科学院院士梅宏</p><p></p><p>中国科学院院士梅宏作《当前热点话题下对开源发展的三点认识》主旨报告。梅宏认为，IT生态必然是开源和闭源的交织，软件供应链全球化至少在基础软件领域开源不可逆，大模型和生成式AI的发展将大幅度提升开源开发质量与效率。未来，应大力弘扬开源精神，把握开放、共享、协同、生态的开源本质；鼓励奉献，尊重市场，探索开源商业模式；推进构建面向全球的开源生态治理体系，从人类命运共同体的视角来促进全球化开源生态；探索LLM/AIGC在开源软件开发中的应用，构建面向开源软件开发的ACI系统，在维护开发者群体多样性和持续创造性前提下，有效提升开发效率和质量。</p><p><img src=\"https://static001.geekbang.org/infoq/0b/0bae3e9f894e1bfdf2f3147068dfb4f5.jpeg\" /></p><p>中国科学院院士王怀民</p><p></p><p>中国科学院院士王怀民作《群智范式：软件开发范式的新变革》主旨报告。他认为，开源已成为科技领域创新的重要模式，通过自组织的社区群体，鼓励人们以兴趣为导向进行软件创作，以群智激发的多样性推动创新，适应网络计算时代的不确定。应探索融合工程范式与开源范式的群智软件开发新范式，形成有为政府、有效市场和有机社会的强大合力，共同打造我国新型开源基础设施底座，探索学术共同体开源发展新模式，共同构建充满活力的开源创新生态。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/82/82bcafaa81076f68242e17c3f2f55440.jpeg\" /></p><p>开放原子开源基金会理事长孙文龙</p><p></p><p>开放原子开源基金会理事长孙文龙在开幕式上作了题为《开放原子 聚善为源》的主旨报告。他表示，基金会作为我国首家开源基金会，始终秉承“科技、公益、普惠”理念，不忘服务开源初心，牢记贡献开源使命，推动开源生态快速发展。成立三年来，32个开源项目通过技术监督委员会（TOC）的技术准入，覆盖操作系统、存储、安全、中间件、云原生、超算、人工智能、区块链、开源硬件、工业软件、浏览器内核、字库标准等12个重点领域，为“存、防、云、算”和“芯、软、硬、端”的共生打下基础。连续推出“校源行”“源译识”“源规律”“心寄源”等公益项目，以“双一流”院校及33所特色化示范性软件学院为起点，与100所院校签约，在50所以上高校成立开源社团，开展开源助学金、开源课程等资助，编制开源课程数量超100学时，培育开源大使200多名。发起成立开源安全委员会，推动制度、技术、产品、标准、人才协同促进，赋能开源生态创新发展。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/6e/6edc05791d7e0ba9f6a01764bb5e8bb9.jpeg\" /></p><p></p><p>开幕式暨高峰论坛上，Atomgit代码协作平台测试上线，该平台由开放原子开源基金会联合阿里云计算有限公司、北京创新乐知网络技术有限公司等共同建设。AtomGit在已有安全能力的基础上，接入中科院软件所“源图开源软件供应链”等外部能力支持，为开发者提供了一系列开箱即用的插件和业界先进的代码评审模式，可实现并提供高可用、高性能、安全的代码托管存储服务。同时，开放原子开源基金会联合CCF、华为、腾讯、阿里、CSDN等各方力量，共同发起群智范式开源项目，支撑AtomGit代码协作平台迭代发展。</p><p></p><p>CNCF基金会、开放发明网络（OIN）、FOSSASIA、IEEE开源委员会、开源商业联盟、Linux 基金会、自由标准组织 (FSG)、LF AI&amp;Data基金会、CNCF治理委员会等国际开源组织负责人，东软集团、软通动力、阿里云、华为、腾讯云、深开鸿、超聚变、蚂蚁技术研究院等开源企业相关负责人发表主题演讲。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/36/36e17a3cbefd3dc3ee5c797b7a22ff5d.jpeg\" /></p><p></p><p>开幕式暨高峰论坛上，北京国际开源社区正式启航；发起倡议成立开源教育委员会、云原生工作委员会，发布了《2023北京软件和信息服务业发展报告》《开源漏洞信息共享项目》；进行了开源圆桌论道。</p><p>峰会期间，将组织openEuler、OpenHarmony、开源大模型、云原生、CARSMOS开源智能出行等20余场分论坛；开设大型开源展，展区面积9300平方米、参展企业62家，参展开源项目30余个；进行OpenCloudOS和openKylin项目路演，举办“开发者之夜”晚会。</p><p></p><p>本次峰会由开放原子开源基金会、北京市经济和信息化局、北京经济技术开发区管理委员会共同承办。</p><p>科研院所、高等院校相关专家学者，国内外开源骨干企业、社会组织负责人及众多开源开发者、爱好者参加峰会。</p><p></p><p>中央电视台、央视网、国际在线、人民网、中国日报网、中国经济网、中国新闻网、中国科技网、中国财经时报网、经济参考报、中国财经时报、新浪科技、凤凰网财经、今日头条、电子发烧友、CSDN、InfoQ、开源中国等40多家媒体作专题报道。</p>",
    "publish_time": "2023-06-12 12:53:25",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]