[
  {
    "title": "台积电员工分红人均42万元；苹果面临被禁危机；马斯克否认修改算法优先推荐自己帐号；百度汽车CEO炮轰特斯拉 | AI一周资讯",
    "url": "https://www.infoq.cn/article/IjwB22xQoCb4x3WVaxHq",
    "summary": "<p></p><blockquote>马斯克否认修改算法优先推荐自己帐号；台积电员工分红出炉，人均42万元；字节改节奏，双月OKR改为季度OKR......</blockquote><p></p><p></p><h2>资讯</h2><p></p><p></p><h4>马斯克否认修改算法优先推荐自己帐号</h4><p></p><p></p><p>科技新闻网站Platform周三曾援引推特一名工程师的话报道，在拜登关于“超级碗”的推文所获点击量超过马斯克后，马斯克立即要求80名推特工程师寻找方法以加强推广他的推文。</p><p></p><p>周五，一名推特用户问马斯克，上述报道是否属实。马斯克回答说：“这篇虚假文章的内容来源于一名心怀不满的推特员工，他已经休了几个月的带薪假，并已经接受了谷歌的工作邀约。他可能觉得在离职前有必要给我下绊子，推特将对他采取法律行动。”但马斯克并未透露该员工的名字。</p><p></p><p>Platform记者凯西·牛顿（Casey Newton）驳斥称：“马斯克的推文完全是假的，我们坚持认为我们的报道是真实的。”</p><p></p><h4>台积电员工分红出炉，人均42万元</h4><p></p><p></p><p>据中国台湾《工商时报》报道，台积电14日召开季度例行董事会，除了决议去年第四季盈余配发每股现金股利2.75元，去年员工业绩奖金与酬劳（分红）约1214.04亿新台币，较前年大增七成，若以台积电员工人数6.5万人概算，平均每人可分到约186.77万台币（约为42万人民币），较前年增加近五成。</p><p></p><p>百度汽车CEO炮轰特斯拉近日，百度旗下集度汽车“ROBOVERSE三里屯体验中心启动会”在北京举办，集度CEO夏一平在接受媒体群访时谈到特斯拉降价表示：“特斯拉降价很大核心问题是产品力出现了非常严重的下滑，三五年前我也是Model S的车主，到现在特斯拉的语音是最差的，自动驾驶、智能化体验是非常差的，网络连不上各种状况，现在在中国已经不是很有竞争力的产品了，降价是价格回归价值。”“集度汽车也一定会超越它，如果把智能车看成完整的产品，无论是空间还是智能化体验，都不担心特斯拉降价对集度的影响。</p><p></p><h4>字节改节奏，双月OKR改为季度OKR</h4><p></p><p></p><p>2月17日上午，字节CEO梁汝波在内部发全员信，称会将业绩目标制定的和回顾的周期，从双月调整为默认季度。具体来说，会把双月OKR改为季度OKR，把公司级的双月会改为季度会。</p><p></p><p>梁汝波在全员信中称，做出这个尝试的原因，主要是因为，字节现在大部分业务相对成熟复杂，双月变化不明显，因此回顾周期可以更长。</p><p></p><p>此外，具体的业务也可以有更加灵活的节奏。比如业务快速变化，或者处于关键时期，可以选择在季度中增加一次回顾和对齐会议；业务变化较慢，可以选择两个季度开一次会议。总体减少会议频次后，也可以增加一些主题会议，让讨论更加深入。</p><p></p><p>根据这一调整，字节内部最近一次双月会，也会从3月初调整到4月初，之后将整体进入季度节奏。与此同时，公司也鼓励各业务根据自身情况，按照实际需要，在季度节奏基础上灵活调整。</p><p></p><h4>数千员工绩效考核“欠佳” ，Meta酝酿新一轮大规模裁员</h4><p></p><p></p><p>知情人士称，在最近结束的一轮绩效考核中，Facebook母公司Meta给数千名员工打出了“欠佳”的评分，这表明新一轮裁员可能即将到来。此前，Meta CEO马克·扎克伯格已宣布2023年将是“效率之年”，暗示公司将采取精简措施来追求效率。为此，Meta高管们也开始采取措施。</p><p></p><p>知情人士透露，Meta经理给大约10%的员工打出了 “基本达标”（Meets most）的评分。Meta的绩效考核有五种评分，“基本达标”是第二低的。“部分达标”（Meets some）是最低评分，也是很罕见的评分。连续两次获得“基本达标”评分的员工将被纳入绩效提高计划，评分低于该标准的员工将自动被纳入提高计划。在Meta内部，一些员工将这样的评分视为寻找新工作机会的信号。</p><p></p><p>与此同时，Meta还削减了一项奖金指标。Meta告知员工，员工奖金的一个组成部分——公司业绩——将按目标的85%发放。这一数字是决定每位员工年终奖的三个数字之一。据熟悉过去奖金数据的人士透露，这一比例为85%，比上年至少下降了15个百分点，也是自2018年上半年以来首次低于100%。上述知情人士说，此前这一发放比例在全公司降至如此低的水平只有一次，是在2012年上半年。</p><p></p><h4>腾讯回应微信进军外卖传闻：不是要下场做外卖，只是内测一种接口能力</h4><p></p><p></p><p>有消息称，微信小程序内正在内测外卖类服务。从腾讯获悉，微信正在广深地区内测小程序“门店快送”服务，旨在帮助消费者发现附近提供快送服务的优质小程序。广深地区的用户可在“发现-小程序”内进行体验。对此，腾讯内部人士解释称，微信不是要下场做外卖，只是内测一种接口能力，让已经具备了外送服务能力的商家接进来，并非自己做。</p><p></p><h4>谷歌、Meta 和推特欧盟用户数量均“超标”：面临严格的内容审查</h4><p></p><p></p><p>北京时间 2 月 17 日下午消息，据报道，根据谷歌母公司 Alphabet、Facebook 母公司 Meta 和推特（Twitter）公布的月度用户数据，其在欧盟的用户数量均已超过监管门槛。这意味着，这些公司将面临更严格的在线内容审查。</p><p></p><p>欧盟的新法规被称为“数字服务法案”（DSA），它将迫使科技巨头采取更多措施来处理非法内容，否则将面临最高相当于全球营业额 6% 的罚款。</p><p></p><p>根据该法案，用户数量超过 4500 万的平台被视为“超大型在线平台”，将受到风险管理，以及外部和独立审计等义务的约束。此外，他们还被要求与监管机构和研究人员共享数据。</p><p></p><p>欧盟委员会要求在线平台和搜索引擎在 2 月 17 日之前公布其月度活跃用户数量。超大型在线平台有四个月的缓缓冲期来遵守“数字服务法案”的规定，否则将面临罚款的风险。推特已经表示，基于过去 45 天的数据，其在欧盟的平均月度用户为 1.009 亿。</p><p></p><p>Alphabet 数据显示，谷歌地图（Google Maps）每月平均拥有 2.786 亿登录用户，谷歌商店（Google Play）拥有 2.746 亿登录用户，谷歌搜索（Google Search）拥有 3.32 亿登录用户，谷歌购物（Google Shopping）拥有 7490 万登录用户，而 YouTube 每月平均拥有 4.017 亿登录用户。</p><p></p><p>本周早些时候，Meta 表示，2022 年下半年，其 Facebook 应用在欧盟的平均月活跃用户为 2.55 亿，而 Instagram 应用的平均月活跃用户约为 2.50 亿。</p><p></p><h4>OpenAI 买下极品域名 AI.com，链接跳转到 ChatGPT</h4><p></p><p></p><p>2 月 16 日，据IT之家报道，人工智能聊天机器人 ChatGPT 近日火爆全球，该技术的开发商 OpenAI 豪掷千金，将超优质域名 AI.com 链接跳转到了 ChatGPT。</p><p></p><p>域名经纪巨头 Saw.com 于 2 月 15 日表示：</p><p></p><p></p><blockquote>猫不在袋子里了！我们很自豪地说我们参与了 Ai.com 域名的销售。非常期待看到他们会用该域名做什么！</blockquote><p></p><p></p><p>至于买下该域名的价格，目前 OpenAI 官方尚未透露。不过根据 2021 年卖出时的挂牌价，该域名的售价高达 1100 万美元（当前约 7535 万元人民币），可能成交价有新的变动。</p><p></p><h4>苹果面临被禁危机，美国下周一将决定 Apple Watch 能否继续在美国市场销售</h4><p></p><p></p><p>据IT之家2月18 日消息，美国国际贸易委员会（ITC）于去年 12 月裁定，苹果公司旗下带有心电图（ECG）功能的 Apple Watch 侵犯了医疗设备制造商 AliveCor Inc 的专利。</p><p></p><p>该禁令最快将于下周生效，意味着苹果的 Apple Watch Series 8 智能手表将无法在美国市场发售。目前苹果唯一的解决方案，就是游说拜登政府来阻止该禁令生效。</p><p></p><p>苹果公司已经聘请了 Covington &amp; Burling 的游说者 Shara Aranoff（她曾担任过 ITC 主席），以确保可以继续销售 Apple Watch。拜登政府将于下周一作出决定，选择维持 ITC 的侵权裁决，还是支持苹果取消相关禁令。</p><p></p><h2>IT业界热评新闻</h2><p></p><p></p><h4>“交个朋友”被曝欠薪、恶意裁员？当事人：已被公司约谈，罗永浩正积极推动解决</h4><p></p><p></p><p>据九派财经报道，2月15日下午，疑似“交个朋友直播间”关联公司员工在社交平台爆料称，其在2023年2月1日向人社局提交了一条14薪欠薪未发的投诉后，次日被公司以莫须有的理由裁员。</p><p></p><p>据该员工介绍，他于2021年6月入职罗永浩的“交个朋友”直播间，在2023年2月1日向人社局提交了一条14薪欠薪未发的投诉后，2023年2月2日被公司以莫须有的“违法”理由非法裁员。</p><p></p><p>该员工补充到，公司认定他恶意诋毁公司的“违法内容”，是一条滨江人社局于2022年末发送的普法短信，内容为“如您或您的同事、朋友在滨江有被欠薪的，请到江南大道87号现场投诉或关注‘杭州人力社保’微信公众号，通过‘无欠薪杭州’专栏向我们反映。”该员工曾将上述内容作为飞书个性签名。</p><p></p><p>2月16日晚间，“罗永浩的辟谣号”微博对此事进行回应，罗永浩表示，看到消息后，我第一时间就协调杭州尽微和交个朋友妥善解决了，很快会有结论，请大家放心，交个朋友的“首席监督官”会一直监督到这件事得到圆满解决为止。</p>",
    "publish_time": "2023-02-19 13:35:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]