[
  {
    "title": "谷歌AI发布新的文本至图像Transformer模型Muse",
    "url": "https://www.infoq.cn/article/Qm3cdLptAtho0RjMXHkW",
    "summary": "<p><a href=\"https://arxiv.org/abs/2301.00704\">谷歌AI发布</a>\"了一篇关于<a href=\"https://muse-model.github.io/\">Muse</a>\"的研究论文，这是一种新的文本至图像生成技术，它基于掩码生成（Masked Generative）Transformer，可以生成与<a href=\"https://openai.com/dall-e-2/\">DALL-E 2</a>\"和<a href=\"https://imagen.research.google/\">Imagen</a>\"等竞争对手相媲美的高质量图片，但是速度要快得多。</p><p></p><p>Muse被训练为预测随机掩码图像的token，它会使用业已训练过的大型语言模型所生成的嵌入式文本。这项工作涉及在离散的token空间中进行掩码建模。Muse使用一个9亿个参数的模型，称为<a href=\"https://masked-generative-image-transformer.github.io/\">掩码生产transformer（masked generative transformer）</a>\"，以创造视觉效果，而不是采用<a href=\"https://en.wikipedia.org/wiki/Stable_Diffusion\">像素空间扩散</a>\"或<a href=\"https://en.wikipedia.org/wiki/Autoregressive_model\">自回归</a>\"模型。</p><p></p><p>谷歌声称，借助TPUv4芯片，可以在0.5秒内创建一个256*256的图像，而使用Imagen则需要9.1秒，根据谷歌的说法，Imagen使用的扩散模型提供了“前所未有的逼真程度”和“深度的语言理解”。<a href=\"https://en.wikipedia.org/wiki/Tensor_Processing_Unit\">TPU</a>\"，即张量处理单元（Tensor Processing Unit），是谷歌开发的定制芯片，专门用作AI的加速器。</p><p></p><p>根据研究，谷歌AI已经训练了一系列不同规模的Muse模型，参数从6.32亿到30亿不等，研究发现，预先训练好的大型语言模型，对于生成逼真的高质量图像至关重要。</p><p></p><p>Muse的性能也超过了最先进的自回归模型<a href=\"https://parti.research.google/\">Parti</a>\"，因为它使用了并行解码，在推理时间上比Imagen-3B或Parti-3B模型快10倍以上，根据使用同等硬件的测试，比&nbsp;<a href=\"https://stablediffusionweb.com/\">Stable Diffusion</a>\"&nbsp;v1.4快3倍。</p><p></p><p>Muse创建的视觉效果与输入中的各种语义成分相对应，如名词、动词和形容词。此外，它还展示了视觉风格和多对象特性的知识，如合成性（compositionality）和基数（cardinality）。</p><p></p><p>近年来，由于新的训练方法和改进的深度学习架构，<a href=\"https://en.wikipedia.org/wiki/Generative_model\">图像生成模型</a>\"有了长足的进步。这些模型有能力生成非常详尽和逼真的图像，在广泛的行业和应用中，它们正在成为越来越强大的工具。</p><p></p><p>原文链接：</p><p><a href=\"https://www.infoq.com/news/2023/01/google-muse-text-to-image/\">Google AI Unveils Muse, a New Text-To-Image Transformer Model</a>\"</p><p></p><p>相关阅读：</p><p><a href=\"https://www.infoq.cn/article/fQLOmK09dZIErQOQrDwD\">OpenAI 宣布 DALL·E 开放测试版：面向 100 万用户，有文字就能生成图片</a>\"</p><p><a href=\"https://www.infoq.cn/article/QhKzahCQ9bdTgAUobYUg\">谷歌最新 Imagen AI 在文本至图像生成方面优于&nbsp;DALL-E</a>\"</p>",
    "publish_time": "2023-02-13 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "三位行业专家主题演讲精华整理：共谋金融科技人才培养之路 | 第二届湾区金融科技高校分论坛",
    "url": "https://www.infoq.cn/article/lk8j300YC47WfAc9H497",
    "summary": "<p><a href=\"https://www.infoq.cn/video/JiD6qU8GNwgKA4lhg98e\">第二届湾区金融科技高校分论坛暨“2022 深圳国际金融科技大赛——西丽湖金融科技大学生挑战赛”颁奖典礼</a>\"于2月4日圆满闭幕，在<a href=\"https://www.infoq.cn/news/R8AtRHy0oZzzJ5I0muSV\">金融科技</a>\"主题演讲环节，微众银行首席人工智能官杨强教授、浙江财经大学盈阳金融科技学院张文宇院长、深大微众金融科技学院张凯院长分别进行了《可信联邦学习》、《跨学科金融科技人才培养之路：从智慧金融到群智金融》、《金融科技人才培养就业报告》主题演讲，从人工智能技术演进趋势到金融科技人才培养，内容丰富、实用，由浅入深地介绍了金融科技人才培养对于金融科技守正创新、高质量发展的重要意义，同时向社会清晰传达了产学研各侧对于加强金融科技专业化人才队伍建设的全面规划及决心。</p><p>&nbsp;</p><p>以下为杨强教授、张文宇院长、张凯院长的主题演讲精华内容整理：</p><p></p><p></p><h2>杨强书记：“可信联邦学习”是促进金融科技发展的利器</h2><p></p><p>&nbsp;</p><p>在人工智能的发展中，人们慢慢总结出一个道理：让计算机变聪明的方式并不是直接教育计算机，而是使用数据来影响计算机，将人类的思想和知识赋予在数据里，再让机器从数据里发现知识。这也带来了一些新问题：</p><p>数据不足是当前遇到的一个瓶颈；异构数据的处理，使用异构数据训练人工智能模型是当下的一个重要研究方向并且也是一个非常难的研究方向；人工智能和金融领域相结合时，用户隐私、法律、监管、审计等方面的要求带来了许多新的挑战。如：银行贷款反欺诈，多家医院联合建模等。</p><p>&nbsp;</p><p>数据可用不可见要求数据既要可用又要保证各个数据源之间、各个模型的服务器和数据源之间不可见，它在计算机行业已有四十多年的发展历史；在国家法律的领域，从 1995 年开始，在国内和国外都有了长足发展，尤其是在去年，国家发布了包括《数据安全法》、《个人隐私保护法》、《网络安全法》等几大法规。</p><p>&nbsp;</p><p>联邦学习的目的就是让数据可用不可见，这个“用”指的是在用人工智能建模的时候，需要使用不同数据源让模型增长，同时要保证数据不被泄露。多领域的结合是当今学科发展的重要标志，而往往多个学科的结合才是未来发展的一个趋势。联邦学习是一个综合的领域，除了有人工智能，还有包括差分隐私、安全计算、硬件可信执行环境等等在内的隐私计算。近两年，随着联邦学习被纳入 Gartner 技术成熟度曲线，处于技术创新萌芽期的联邦学习正受到越来越多地关注，成为下一代隐私计算发展关键。</p><p>&nbsp;</p><p>谷歌在最近几年发布了一个针对谷歌手机的联邦学习，其思想是通过结合多个终端和一个服务器，实现数据的可用不可见。然而，企业间分享的样本往往都有不同的特征，我们以微众银行为领先，发展了解决企业间数据合作问题的“纵向联邦学习”；又在去年率先提出“可信联邦学习”的概念，它要求：安全可证明、性能可使用、效率可控、决策可解释、模型可监管、普惠。</p><p>&nbsp;</p><p>解决“可信联邦学习”中的平衡问题，既需要建立一个共享的模型，又需要实现对恶意拜占庭共谋攻击的检测及防御。在算法层面，可以通过图计算早期发现攻击的可能性；同时还可以利用生成对抗网络和分割学习代替本地特征提取器, 在服务器端进行聚合，既保护隐私又保障性能。此外，还可以在深度学习中引入水印机制实现对模型的“版权保护”。</p><p>&nbsp;</p><p>达到可信联邦学习普惠的一种方式是开源，然而想要实现开源，一是要进行标准化；二是要进行隐私分级，这样也就形成了一个有效的社区。FATE 开源社区覆盖金融、医疗、科研、人工智能等多个领域与场景，是可信数据流通领域最具影响力的社区之一。</p><p>&nbsp;</p><p>可信联邦学习是一个非常有用的工具，这里有一些案例：</p><p>在客服界，利用联邦学习技术不断更新机器人助手的数据源，面对各业务销售和客服领域提供高效便捷的情景对练式培训，有效降低人力成本；多中心智慧医疗发现，保护数据隐私和安全，通过多中心科研挖掘医学发现；联邦学习-语音模型终生自学习；负责任的人工智能。具有情商的人工智能可以把自己的逻辑解释给工程师、审计人员和终端用户等。</p><p>&nbsp;</p><p>联邦学习的发展并没有停滞，随着越来越多学术界人士的参与，当下一个研究热点是如何使用图像、音频、文字等异构数据共同建模，同时还可以将联邦学习和 ChatGPT 等预训练模型相结合，并应用于很多金融场景包括数据要素的流通。</p><p>&nbsp;</p><p><img src=\"https://static001.infoq.cn/resource/image/b4/94/b47db4445e654d2207d1577ef35b2c94.jpg\" /></p><p></p><p></p><h2>张文宇院长：金融与科技需要深度融合</h2><p></p><p>&nbsp;</p><p>为赋能数字经济的高质量发展，如今数字金融正迈向智慧金融。作为金融科技产业的 CPU，人工智能一直在深深震撼我们：比如，2016 年，横空出世的 AlphaGo 接连打败了 100 多位围棋界典型高手，在当时引起了巨大轰动；再如，花旗银行等众多银行都在对管理和技术人员进行大量裁员；又如，2000 年的时候量化交易大厅人满为患，到了 2016 年，量化交易大厅只有星星点点的人。这同时也造成了金融类专业同学的焦虑：“学金融很危险，很容易被人工智能取代，学计算机很好”……</p><p>&nbsp;</p><p>其实并非如此，虽说程序员是人工智能的“衣食父母”，但显然人工智能是一个“不肖子孙”，比如最近势头正猛的低代码开发平台，可以通过降低企业人力成本，成倍缩短开发时间来帮助企业实现降本增效，还有随着最近 ChatGPT 的爆火，相信很多开发者都会有些紧张。</p><p>&nbsp;</p><p>比如 2021 年万科总部新人奖花落虚拟美女崔筱盼，它负责的催办预付应收逾期单据工作的核销率高达 91.44%，虽然人工智能能够取代基础的财务和金融工作，但由于虚拟数字人不具备人性光辉思维，无法做具有人性光辉的内容创新，因此在艺术类工作方面的取代可能性不会很强。</p><p>&nbsp;</p><p>再举一个金融行业的例子，虽然现在量化交易已经越来越多地交给机器来做，但假如有一天机器的水平高到可以完全取代人类，那时人类一定会改变规则。事实上，我们这个时代的人工智能还没有办法取代人类，它相当于弱人工智能，只擅长单个方面。</p><p>&nbsp;</p><p>如今，智慧金融也迈向了既要互相协同又要实现可信的互操作的群智金融。在人机物融合群智金融模式中，智慧组织、金融云、智慧物联网三者之间可以群智协同、群智决策和群智感知。因此，为了在智能时代不被淘汰，人类就需要充分运用人机物融合智能，同时还要具备懂得机器语言、分析能力、推理能力、跨学科复合知识能力以及学习能力等五种必备能力。</p><p>&nbsp;</p><p>金融科技不是简单的金融+科技，而是金融和科技的深度融合、互相协同、互相反哺。培养金融科技人才，不单单要发展金融科技，还需要融通教育链、人才链、产业链和创新链这四大链条。</p><p>&nbsp;</p><p>聚焦金融学科数字化改革未来，弱人工智能正迈向强人工智能，从传统金融到智慧金融再到群智金融，这一过程必然会倒逼流程再造、制度重塑和价值共创，它并不能完全交给经济，因此还需金融专家提供应用场景。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/e4/d2/e420c9cef56e82f1c8784055cb1326d2.jpg\" /></p><p></p><p></p><h2>张凯院长：金融科技人才缺口大，高校人才培养工作需提效</h2><p></p><p>&nbsp;</p><p>从 2017 年金融科技元年开始，随着产业高速发展，在政策层面，各层级政府制定了非常多的支持政策，《金融科技发展规划( 2022-2025 年）》金融科技人才培养发展规划指出：一是制定金融科技人才相关标准；二是优化金融科技人才需求目录和引进模式；三是加快金融科技人才梯队建设，建立健全在职人才培养体系；四是完善鼓励创新、包容试错的激励机制。此外，金标委制定的《金融科技人才能力规范》也对金融科技人才能力要素和能力要求给出了一系列规范和标准。</p><p>&nbsp;</p><p>在<a href=\"https://www.infoq.cn/article/amRrNh9XruvaPjY90RWO\">金融科技的企业</a>\"和机构的人才需求方面，从《2020 消费金融数字化转型主题调研报告》和一些其他报告可以看出三个趋势：金融科技市场规模非常大，无论是消费金融市场还是投资规模都是快速增长的，市场容量的增加必然带来对人才的需求大幅度增加；金融科技的就业前景整体乐观，金融科技人才可通过多渠道晋升，晋升的时间、频率、薪酬提速也非常高；随着数字化转型的提出，金融科技人才队伍的软实力建设，已成为传统金融机构及金融科技企业关注的重点。</p><p>&nbsp;</p><p>金融科技人才缺乏是一个事实，主要存在人才缺口、人才来源、人才技能等三个问题，主要表现在：</p><p>金融科技人才培训体系尚未形成：很多高校的金融科技课程将金融知识和计算机知识简单相加，没有深度融合，缺乏统一的标准；政策支持和保障力度不足：金融科技产业的支持政策和金融科技人才的保障机制都有所欠缺；金融科技人才结构失衡：当下金融科技人才主要覆盖零售银行的营销和风控等岗位，而数字运营、对公业务等方面的人才数量较少；运用金融科技解决实际问题的能力不够：从机构或院校培养出来的金融科技师，没有金融从业经历，缺乏解决实际问题的经验。</p><p>&nbsp;</p><p>在高校的培养成效方面，从四五年前开始，到现在为止，许多高校对金融科技的理解都还是“金融+科技”，要么在计算机专业加一些金融知识，要么在金融专业加一些计算机知识，不考虑金融科技本身的特殊性，这造成了最后人才形成的能力和产业需求不匹配的问题。</p><p>&nbsp;</p><p>基于这个现实矛盾，深大微众金融科技学院的培养措施已经探索了四年半，形成了一条特色之路，总结起来，共有四点：</p><p>以证促学，通过与深圳金融科技师协会高度合作，结合专业认证和专业培养，大范围扩充金融科技人才供给；以赛代学，通过比赛的形式检验人才培养成果；以师领学，采用师徒制教学，请企业老总和科学家认领学生到项目组进行模拟场景或近现实场景的应用；以研驱学，企业提供资金，软硬件设备或平台，支持高校建设实验室，实践基地、实践教学资源等，提高实践教学质量。企业提出产学研题目，教师招募学生，组建攻关团队，培养和选拔人才。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/81/46/813ca41e3bee90b2d4f763dc91138546.jpg\" /></p><p></p>",
    "publish_time": "2023-02-13 11:57:08",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "企业如何真正实现「数字化转型」？",
    "url": "https://www.infoq.cn/article/xhjiAWIXFJkClbRrpRYX",
    "summary": "<p>随着信息技术的发展，数字化转型是企业持续成功的关键已经成为了企业领导者的共识。然而调研数据显示，只有五分之一的人认为自己的转型策略是有效果的，其失败原因往往是人员和流程没有像技术一样得到重视。</p>\n<p>虽然技术是数字化转型的重要部分，但是我们也应该关注到组织的架构、流程和文化的开放方法。企业数字化转型改变的不仅仅是技术，而是整个组织的运作方式。</p>\n<p>企业怎样能深刻、透彻地完成数字化转型？在《数字化转型，开源之路》白皮书中，红帽总结了数字化转型的5大要素和不能忽视的方式方法。如果你想了解更多企业数字化转型方式的内容，这本白皮书一定对你有启发和帮助。</p>",
    "publish_time": "2023-02-13 12:12:57",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "微软大刀阔斧裁员：推进万人裁员计划，HoloLens头显、元宇宙成“重灾区”",
    "url": "https://www.infoq.cn/article/StdqZ0POBN92APIKMstO",
    "summary": "<p></p><blockquote><a href=\"https://www.infoq.cn/article/FRcz5vjOvl3bM2d57opX\">ChatGPT</a>\" 的爆火让微软一时风头无两，但在整个市场都发生变化的当下，微软的裁员脚步并没有停止。</blockquote><p></p><p></p><h2>微软裁员涉及HoloLens、Surface和Xbox部门</h2><p></p><p></p><p>今年 1 月 18 日，微软宣布，由于经济形势不佳且客户需求变化，将于3月底前在全球裁员1万人，约占员工总数的5%。</p><p></p><p>据彭博社 2 月 10 日报道，微软当前正在执行上个月宣布的裁员1万人计划，并已开始在Surface设备、混合现实硬件（MR）<a href=\"https://www.infoq.cn/article/6N4KFpapM9zp1_3FqJk7\">HoloLens</a>\"和Xbox等部门裁员。</p><p></p><p>据了解，HoloLens 是微软在 2015 年推出的一款增强现实头显。2015 年 1 月，微软 CEO&nbsp; Satya Nadella 在首次介绍 HoloLens 头显时对其寄予厚望，称它将是“下一个大事件”。但评论认为，HoloLens是一款引发了外界骚动之后，迅速没有下文的硬件产品。</p><p></p><p>自高调发布以来，HoloLens 在随后的发展过程中阻力重重。</p><p></p><p>去年曾有报道显示，HoloLens团队在技术、管理和资金方面都面临较大的阻碍。根据 Business Insider 的一份报告，微软已经取消了发布 HoloLens 3 的计划。该报告引用了微软内部的消息来源，其中一位特别指出，这可能是 HoloLens 硬件之路的尽头。</p><p></p><p>本次裁员再次引发外界的担忧，据彭博社报道，该知情人士表示，HoloLens硬件团队的大量裁员，让人怀疑该公司是否还会生产第三代智能眼镜。</p><p></p><p>对此，微软不予置评，但称仍致力于混合现实领域和当前的HoloLens2版本。微软表示：“虽然我们不评论具体的人员配置细节，但我们可以分享的是，HoloLens 2和我们对混合现实的承诺没有变化。”</p><p></p><p>此外，知情人士透露，Xbox游戏部门，市场营销和Xbox游戏生态系统团队都在裁员。2 月 9 日，Xbox首席执行官Phil Spencer给员工发了一封电子邮件，宣布了部门裁员消息，但并没有详细说明业务受到了哪些影响。“我鼓励每个人都花必要的时间和空间来处理这些变化，并支持你的同事。”Spencer的电子邮件中写道。</p><p></p><p>据了解，Xbox 部门早在1月下旬就已开始裁员，彼时，Spencer曾发出内部信，表示裁员是“非常痛苦”的决定，当前公司游戏业务存在“巨大挑战”：</p><p></p><p></p><blockquote>“本周对于微软来说是非常艰难的一周，对我们的团队成员来说同样如此。我们展开了大量的一对一对话、团队对话，我想花点时间重申一下你们从领导那里听到的信息。这是我们业务中的一个充满挑战的时刻，在本周我们做出了痛苦的裁员选择。游戏领导团队必须做出有利于产品和业务长期发展的决定，但这个过程中我们需要付出一定的代价。我知道这很痛苦。感谢您支持我们的同事处理这些变化。在接下来的几周内，我们将有很多机会联系并回答您的问题，包括下周为参加该会议的团队提供的每月游戏更新，我正在与 ZeniMax 的团队保持密切联系以提供支持。GLT 和我正在致力于尽可能透明。在模棱两可的情况下前进是一项挑战，但我相信，我们将一起度过这个艰难的时刻。Xbox拥有悠久的成功历史，这要归功于你们为玩家、创造者和彼此所做的工作。在这个变革的时代，你的工作受到了深切的赞赏和重视，是我们业务发展势头不可或缺的一部分。我对我们的未来充满信心，为成为这个团队的一员而自豪，但我也意识到这是一个充满挑战的时刻，我想感谢你们在这里所做的一切。”</blockquote><p></p><p></p><h2>解散工业元宇宙团队后，微软表示仍致力于工业元宇宙</h2><p></p><p></p><p>为推进裁员 1 万人计划，微软近日动作不断。</p><p></p><p>其中，混合现实硬件（MR）HoloLens 团队的裁员印证了微软此前在MR、元宇宙等方向上接连遇挫的传闻。</p><p></p><p>另据The Information近日报道，知情人士透露，微软还解散了刚刚成立四个月的工业元宇宙团队，该团队约 100 名员工已全部被解雇。</p><p></p><p>据悉，微软在去年10月创建了工业元宇宙核心团队，旨在帮助客户在工业环境中使用元宇宙，如帮助构建操作发电厂、工业机器人和交通网络背后控制系统的软件接口。</p><p></p><p>该团队的内部代号为“盆景项目(Project Bonsai)”，前身是微软在2018年收购的初创公司Bonsai，与公司一起收编到微软旗下的还包括该公司的两位联合创始人Mark Hammond和Keen Browne。消息显示，Mark Hammond和Keen Browne也在本次的裁员名单中。</p><p></p><p>在ChatGPT 引领的 AIGC 技术火爆全球以前，<a href=\"https://www.infoq.cn/article/j4AToos49jT09GQ5TCkr\">元宇宙</a>\"也曾风头无两，并吸引了包括微软、Meta等多个科技巨头入局。</p><p></p><p>行业分析师认为，元宇宙是一个新兴且前景广阔的市场，但动荡的全球经济和收入增长放缓给科技巨头们带来了沉重压力，因此，这些巨头们不得不向元宇宙业务“开刀”。</p><p></p><p>有分析人士称，此次微软将工业元宇宙团队直接解散，不仅表明公司遇到了瓶颈，也反映出整个科技行业已转向“保守发展阶段”，即优先考虑短期盈利能力强的项目，而非需要长期投入的业务。</p><p></p><p>据市场情报公司 IDG 旗下 IT 杂志《Computerworld》报道，分析公司 IDC 研究副总裁 Sharath Srinivasamurthy 表示：“许多大型科技公司一直在进行调整，例如裁员以平衡其员工数量**，在这种情况下，实验性或未来技术将退居二线。**这些公司宁愿将他们的投资引导到已经证明或成熟的计划上，而不是投资于过于未来主义的东西。”</p><p></p><p>在回应置评请求时，微软发言人通过电子邮件发送了一份声明：“虽然我们不对具体的人员配置细节发表评论，但微软仍然致力于工业元宇宙。我们将重点放在对我们的客户最重要的工业元宇宙领域，他们将看到他们的支持方式没有变化。我们期待在未来分享更多信息。”</p><p></p><p>参考链接：</p><p><a href=\"https://www.bloomberg.com/news/articles/2023-02-10/microsoft-cuts-jobs-in-hololens-surface-xbox-as-layoffs-continue\">https://www.bloomberg.com/news/articles/2023-02-10/microsoft-cuts-jobs-in-hololens-surface-xbox-as-layoffs-continue</a>\"</p><p><a href=\"https://www.theinformation.com/articles/microsoft-kills-its-industrial-metaverse-team-after-4-months\">https://www.theinformation.com/articles/microsoft-kills-its-industrial-metaverse-team-after-4-months</a>\"</p><p><a href=\"https://kotaku.com/phil-spencer-xbox-layoffs-microsoft-zenimax-1850013315\">https://kotaku.com/phil-spencer-xbox-layoffs-microsoft-zenimax-1850013315</a>\"</p>",
    "publish_time": "2023-02-13 14:23:37",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "挖掘金融场景下的数据要素价值，有哪些问题必须解决？｜InfoQ闭门会精选",
    "url": "https://www.infoq.cn/article/qZm63L9zkiD57cpFMsv7",
    "summary": "<p>在数字经济时代，数据被视为最重要的生产要素。其中的原因，或许不在于数据本身有多“了不起”，而在于数据是物理世界映射在数字世界的表现形式。从企业的视角来看，通过这种映射，可以实现资源优化、降本增效、科学决策，从而在一定程度上化解经营过程中的很多“不确定性”。</p><p></p><p>而由于金融机构天然具有数据原生的属性，这使其在数字化的探索过程中，往往先于其它行业。但即便如此，数据的应用和价值挖掘，在金融行业也仍然是一个棘手的问题。拥有数据和用好数据是两码事，数据驱动和科学决策也是两码事，“数据垃圾”在如今这个时代下比比皆是，能真正玩好数据，并为自己的业务创造价值的企业依旧历历可数。</p><p></p><p>那么，<a href=\"https://www.infoq.cn/article/XPWgwkcbRf1sZ1yrRi9u\">数据要素</a>\"在金融行业究竟能创造哪些具体价值？数据应用的“症结”在哪？又如何“解开”？在 2023 年 <a href=\"https://qcon.infoq.cn/2023/beijing?utm_source=infoq&amp;utm_medium=conference\">QCon</a>\" 全球软件开发大会·北京站的“金融数字化闭门会”上，来自银行、证券、保险等金融机构的技术负责人，围绕以上问题，从多个维度展开了深度的探讨和交流。</p><p></p><p>以下内容经 InfoQ 编辑精选、提炼和总结，希望为大家提供具有实战意义的参考。</p><p></p><h1>脱离了场景，就无从谈数据价值</h1><p></p><p></p><p>数据的价值不在于数据本身，而在于背后的对象。比如在“1 个苹果”这个短语中，如果没有了“苹果”，“1”就只是一个纯粹的数字。同样地，在企业中，只有与业务结合，数据及其算法、模型才是“活”的。</p><p><a href=\"https://www.infoq.cn/theme/149\">金融</a>\"行业的数字化转型主要聚焦以下几个场景：</p><p></p><h3>第一，数字化风控。</h3><p></p><p></p><p>对于金融行业来说，其业务本质就是通过经营“风险”实现盈利和发展。因此，风险管理能力是金融业的核心竞争力。当然，风险管控的方式，会随着时代的发展不断迭代。</p><p></p><p>以<a href=\"https://xie.infoq.cn/article/a3c14fef1bdacd0cfd06c2213\">银行</a>\"信贷业务为例：过去，客户贷款信息的采集、还贷能力的判断、风险等级的评估等工作，主要依赖于信贷人员的经验和专业能力。这不仅耗时耗力，而且风控水平对人的依赖性强，根据经验差异波动较大；同时，也容易出现人为的失误和疏漏。</p><p></p><p>尤其是进入数字化时代之后，银行大量业务向线上发展，平台化、场景化、批量化的获客模式也逐步出现，业务运行的机制日益复杂，响应速度加快，大量隐蔽甚至未知的风险无处不在，这使得风险管控难度的量级进一步提升。仅靠人工，显然已经无法满足进阶的风控要求。</p><p></p><p>技术带来的新问题，就用技术去解决。如今，越来越多的金融机构正在积极引入人工智能、大数据等技术手段，通过整合内外部的资源，在零售金融、小微金融等领域实现数字化、甚至智能化的风险控制。</p><p></p><p>比如，客户贷前的尽职调查和复杂信息收集，都可以通过智能化手段实现，不但效率更高，信息全面性、真实性、精准度也更好。以银行面向农户的贷款业务为例，不少银行正在尝试利用<a href=\"https://xie.infoq.cn/article/9fef3355806d576e39fd371d6\">遥感技术</a>\" +AI 模型算法的方式获取动态数据，通过了解农户的种植情况，制定相应的授信方案。并且，对应方案还可以根据不同的季节特点进行调整。这在很大程度上就能够降低银行和农户间的信息不对称。对农户而言，可以解决贷款难的问题；对银行而言，也能避免过度授信，规避不必要的信贷风险。</p><p></p><h3>第二，数字化投研。</h3><p></p><p></p><p>一个好的金融产品，依赖于优秀的产品设计和投研洞察。过去，这种洞察主要自于“人”，需要研究人员自己从各种渠道找数据、看信息，再基于个人的资产管理知识和经验对数据做加工、分析，最终形成投资决策。和风险管控一样，这种模式容易受个人研究水平的影响，并且效率比较低。</p><p></p><p>而随着外部市场环境变化加快，加上信息技术的驱动，数据出现爆炸式增长，仅靠人脑显然很难高效地处理这些复杂的海量信息。因此，以证券、<a href=\"https://www.infoq.cn/article/1zd5MLr5iQOBzgAaGpOm\">基金</a>\"为代表的很多金融机构都在通过数字化转型，实现投资研究流程的数字化管理，让研究成果变得可沉淀、可追踪、可量化；同时，利用大数据、人工智能、机器学习等技术，节省人工处理数据的时间，提高投研人员的工作效率，辅助投研决策。</p><p></p><p>举例来说，在量化交易场景，极端情况下可能存在数十、乃至于数百个因子在实时变化，人不可能在变化的一瞬间做出及时应对，而 AI 则可以通过机器学习的方式，知道哪些因子是有效的，哪些因子是无效的，何时应该删除无效因子，何时应该加入新的有效因子。</p><p></p><p>当然，数据和技术的赋能并不局限于投资前期，在全流程的投资服务过程中，基于数字化投研体系，资管机构还可以实时进行投中的组合优化管理和投后的动态跟踪服务，提供更全面、完善且智能的投研服务。</p><p></p><h3>第三，数字化营销。</h3><p></p><p></p><p>随着越来越多的金融业务线上化、场景化、碎片化，无论是银行、证券还是保险机构，数字化营销都在成为必备手段——通过手机 APP、小程序、私域社群等入口，运用数字技术进行数据获取、用户分析、关系管理、产品推荐，从而提升营销效果、满足用户需求。</p><p></p><p><a href=\"https://www.infoq.cn/theme/171\">数字化营销</a>\"区别于传统营销的关键在于，前者是以客户需求为中心，后者则是以产品为中心。以保险行业为例，传统方式下，保险产品的设计并不考虑客户的偏好和需求，而售卖主要通过渠道完成，常用的是“人海战术”。这种模式之所以可行，主要是因为过去保险产品种类有限，交易频率也比较低。</p><p></p><p>但是，近几年来，国内<a href=\"https://www.infoq.cn/article/29uvshLBl6ZIeuxTdNOx\">保险</a>\"行业通过把保险产品与消费场景、行业生态结合起来，实现了与客户的连接和服务。在这个过程中，保险的业务模式从过去单纯直接的买和卖变得更加碎片化，消费者对保险产品的购买从被动变为主动。这就要求保险公司必须打“精准战”，能够借助数字技术多维度挖掘和分析用户行为、准确预测他们的潜在需求，进而提供更多满足不同场景需求、能够吸引更多客户的精细化保险产品，在不断优化和迭代产品设计的同时，降低销售投入。</p><p></p><h1>数据应用的挑战来自方方面面</h1><p></p><p></p><p>虽然数据在上述的各个场景数字化过程中的重要性已经是一种共识，但是，在实际的<a href=\"https://www.infoq.cn/article/mfcsP6wws312tLTcrPCl\">数据应用</a>\"过程中，企业还是遇到了各种各样的问题。</p><p></p><h3>挑战一：数据源与需求源不可控</h3><p></p><p></p><p>在数据生产阶段，由于过去企业的信息化系统建设都是割裂的，内部没有统一的数据标准，导致很多情况下，来自两个不同系统的同一数据出现信息不一致的情况。应该以谁为准？这背后就会涉及大量的追溯和处理工作。</p><p></p><p>需求源的不可控是另一个大问题。多数企业中数据开发和应用的需求主要来自于业务人员，但由于对技术原理并不了解，这造成他们经常提出伪需求或者重复需求，导致无效开发或者重复开发。对于技术人员来说，数据应用开发的价值就很难被呈现。</p><p></p><h3>挑战二：数据质量难保证</h3><p></p><p></p><p>数据要素的价值和数据质量息息相关，数量太少、口径不一或者质量太低不但很难给企业带来价值，甚至还有可能出现“误导”。</p><p></p><p>但过去企业的数据积累和存储并没有经过统一规划，数据从属于业务应用存在，大多都是孤岛。在数据加工处理过程中，又由于各业务部门之间不能很好地协作沟通，常常给数据的打通和共享带来人为的阻力，使得数据质量难以保证。</p><p></p><h3>挑战三：数据使用体验差</h3><p></p><p></p><p>部门间的隔阂，不但会造成数据质量的问题，也会带来数据使用体验的问题。比如，业务部门之间的系统没有打通，数据不透明，使用者在访问数据的过程中，就不得不来回切换。归根结底，这是组织架构和流程的问题。</p><p></p><h3>挑战四：IT 架构亟需升级</h3><p></p><p></p><p>数据的需求越来越多样化、碎片化、多频化，但传统集中式的 IT 架构难以满足数据共享的需求，海量数据的处理效率低、难度大，数据生产能力有限。构建一个分布式、平台化、云原生化的 IT 架构，成了企业迫在眉睫的工作。</p><p></p><h3>挑战五：对人才的要求变高</h3><p></p><p></p><p>对于业务人员而言，要具备数据思维，对数据有敏锐的感知，能够把数据的价值融入到业务拓展过程中。同时，还要对技术有基础的了解，能够具备数据工具的使用技能和数据分析能力。</p><p></p><p>对于技术人员而言，也要储备一定的业务知识，能更准确地识别业务部门的真实需求，通过提供更优质的数据“原材料”和数据工具，帮助他们解决核心的业务问题。</p><p></p><p>只有双方在这个过程中达成一致的目标和共识，才能把数据、技术和业务真正地有机融合起来，为企业创造价值。</p><p></p><h1>数字化转型不只是个技术课题</h1><p></p><p></p><p>总的来说，虽然企业数字化转型依赖于技术的强效赋能，数据价值的挖掘也少不了技术的加持。但是，最终影响数字化转型成果的，并不仅仅是技术本身。企业文化的重塑，组织架构的挑战，组织流程的调整，以及<a href=\"https://www.infoq.cn/article/lk8j300YC47WfAc9H497\">人才</a>\"的培养，都是其中不可或缺的部分。</p><p></p><p>比如，以上描述的几大数据应用挑战，除了源于传统 IT 架构的遗留问题，绝大多数实际上都是沟通协作的问题。而要推翻人与人之间的“篱笆”，一个前提就是企业自上而下要建立共识，从战略和组织层面出发，对数据的生产、处理和使用机制进行标准化制定和统筹规划。</p><p></p><p>举例来说，有的企业会设立专门的企业级架构团队，对传统遗留的冗杂系统应用进行统一的整合，重新优化“地基”，再面向业务部门以组件的方式提供服务；也有的企业会成立独立的的数据部门，去负责企业级的数据治理、数据能力建设等工作，然后通过数据化服务平台，为业务部门提供数据服务。</p><p></p><p>当然，组织和机制只是外在的“辅助”，企业内部各个角色在意识层面的对齐是更核心也更艰难的转变，这种共识需要各个部门在长期的工作和磨合中慢慢建立。</p><p></p><p>比如，对于技术人员来说，要让业务看到技术的好处。无论是用 AI 辅助业务人员实现数字化风控、数字化投研，还是用大数据实现精准营销，其关键就是把技术和数据的能力融入到主业务价值链中，从点到面让技术的价值变得显性化和可量化。过去的技术部门在企业运营中扮演的是后台的角色，因此一直被视为是成本中心；而在企业数字化转型过程中，技术部门开始慢慢走向中台甚至前台，成为驱动业务发展的关键角色。</p><p></p><p>如业界所言，数据是数字时代的石油。数据于金融行业发展而言拥有很多的可能性，<a href=\"https://xie.infoq.cn/article/0fc3323eb0f04766f69a0eab2\">数据资产</a>\"化管理成为必然的趋势，但由于企业发展阶段和业务情况的差异，所面临的挑战和落地的路径也不尽相同。可以肯定的是，数据作为“石油”，还有很多价值藏于“井底”，需要企业慢慢挖掘——一切不过刚刚开始。</p><p></p><h4>粉丝福利</h4><p></p><p><img src=\"https://static001.infoq.cn/resource/image/d3/da/d31d4e0e474feb853493fb404102b3da.png\" /></p><p></p><p>即日起至 2023 年 3 月 1 日，关注「InfoQ 数字化经纬」公众号，回复对应关键字，得惊喜礼包：</p><p>回复“往期报道”，即可获得 InfoQ 往期精选数字化案例和专题报道合集回复“大会福袋”，即可获得 InfoQ 技术大会数字化演讲 PPT</p><p></p><p>变局之下，数字化关乎生存，企业何去何从？希望「InfoQ 数字化经纬」能为各位指明方向！</p>",
    "publish_time": "2023-02-13 14:56:01",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "原美团联合创始人王慧文宣布进军AI，出资5000万美元再创业，要打造“中国OpenAI”",
    "url": "https://www.infoq.cn/article/7T0i680uu5Elrk3VKbNu",
    "summary": "<p></p><p><a href=\"https://www.infoq.cn/theme/173\">ChatGPT</a>\"太热了，把已经退休的美团联合创始人王慧文都“炸”出来了。</p><p>&nbsp;</p><p>2 月 13 日，原美团联合创始人王慧文在社交平台发文宣布进军人工智能领域，称将打造“中国的 OpenAI”。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/00/00e4b2a634b1ff313274518765d0e3d0.jpeg\" /></p><p></p><p>&nbsp;</p><p>其发文中透露，将成立北京光年之外科技有限公司，王慧文出资 5000 万美元，估值 2 亿美元（约 13.62 亿元人民币），并表示，他个人不占股份，资金占股 25%，75% 的股份用于邀请顶级研发人才，下轮融资已有顶级 VC 认购 2.3 亿美元（约 15.66 亿元人民币）。</p><p>&nbsp;</p><p>两天前，王慧文在其微信朋友圈发文称，“自己将入局人工智能赛道，同时表示个人还将拿出 5000 万美元（约合人民币 3.4 亿元）‘带资入组’，不介意薪资和岗位”。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/37/37a9d36388355743a038dd9a760d058b.jpeg\" /></p><p></p><p>&nbsp;</p><p>在评论中，水滴公司创始人兼CEO沈鹏回复道，“大佬做投资，就是这么朴实无华，且枯燥”。</p><p></p><p>天眼查App显示，北京光年之外科技有限公司成立于2018年7月，法定代表人为王慧文，注册资本100万人民币，经营范围包括销售自行开发的产品；计算机系统服务等，由王慧文全资持股。</p><p></p><p>天眼查信息显示，王慧文关联的10家企业或社会组织中存续状态的有7家，除北京光年之外科技有限公司外，还包括北京健康之家科技有限公司、北京纵情向前科技有限公司、北京美团公益基金会等。其中，王慧文在4家企业担任高管，并在2家企业持有股份，此外其还在北京美团公益基金会理事会任职。曾任职信息显示，王慧文曾在北京摩拜科技有限公司、上海三快科技有限公司等17家企业担任法定代表人。</p><p>&nbsp;</p><p>资料显示，王慧文，毕业于清华大学，获电子工程学士学位，系校内网（人人网）联合创始人、来电网创始人、淘房网创始人和美团联合创始人、执行董事。2011年，王慧文加入美团网，担任副总裁。2020年12月18日，王慧文正式退休。 王慧文曾在退休时发表邮件感慨道：“中国作为全球最大的单一市场，对创业者来说更是得天独厚。 我运气实在太好，不宜继续贪天之功，知止不殆。”</p><p>&nbsp;</p><p>当下，ChatGPT的热度居高不下，已经吸引了许多企业和创业者纷纷入局。不少互联网大佬也在公开评价ChatGPT。</p><p>&nbsp;</p><p>2 月 9 日，360 创始人周鸿祎最近在与搜狐创始人张朝阳对话时，首次谈到 ChatGPT。周鸿祎表示，虽然 ChatGPT 现在还不完美，但要看到它无限的潜力，未来会有非常多的场景，不仅仅是辅助搜索引擎搜索答案，如果企业搭不上 ChatGPT 这班车，很可能会被淘汰。</p><p>&nbsp;</p><p>周鸿祎认为，ChatGPT 的本质并非工具。他举例说，以前我们跟网络机器人聊天，总感觉比较奇怪，因为它的背后逻辑是获取我们文化的关键词，然后去搜索相关内容，僵硬地推送回来。而 ChatGPT 则是通过很多大语言模型，进行模拟和训练，模拟了人类大脑的存储和处理能力，最终做到了很多问题虽然言之无物，但是滴水不漏。“这应该是一场革命的开始。”周鸿祎强调。</p><p>&nbsp;</p><p>搜狐创始人<a href=\"https://www.chinaz.com/tags/zhangchaoyang.shtml\">张朝阳</a>\"对此表示仍需要谨慎。他认为ChatGPT积累了许多年，涉及到算力要有多少服务器，知识库、标注等等很多问题，若没有这些能力的公司跟风入局，会消耗掉许多资源。但人工智能<a href=\"https://www.chinaz.com/tags/AI.shtml\">AI</a>\"以及有搜索能力的公司，还是需要有这样一个准备。</p>",
    "publish_time": "2023-02-13 15:04:25",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "当ERP遇到ChatGPT，新世界的大门被打开",
    "url": "https://www.infoq.cn/article/KerrPwjsC7hihGoMME5c",
    "summary": "<p>关键发现</p><p>ChatGPT可以导入私有数据进行训练，从而指导业务优化ChatGPT能够记住每一个回话的内容，从而给出思考和推论ChatGPT真的是在思考，它实时地在训练并且生成答案</p><p>关键结论</p><p>ChatGPT可以用于企业私域数据的训练（例如ERP/MES等）并助力企业进行经营优化</p><p></p><p></p><h1>一、问了几个 ChatGPT 关于 ERP 的问题</h1><p></p><p></p><p>早上，我问了 <a href=\"https://www.infoq.cn/theme/173\">ChatGPT</a>\" 几个问题：</p><p></p><p>第一个问题：</p><p></p><p>我问他你会如何使用 ERP 数据，它的回答如下：</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/c4/c43ca17762ce8e6ab0ab2723c6f7cd17.png\" /></p><p></p><p>第二个问题：</p><p></p><p>我继续深入询问，“ChatGPT 是否能够训练 ERP 数据，帮助企业进行经营生产的决策”，它用英文给了</p><p>我回答：</p><p><img src=\"https://static001.geekbang.org/infoq/bf/bfe6ff51084a598cd715279fc7b2a343.png\" /></p><p></p><p>第三个问题：</p><p></p><p>然后我又继续深入提问，“ChatGPT 能否为某一个企业训练私有模型，导入 ERP 和 <a href=\"https://xie.infoq.cn/article/e7296d772cc01752c32b8ee19\">MES</a>\" 数据，从而帮助企业优化经营生产”？</p><p></p><p>它的回答是肯定的，告诉我：</p><p></p><p>ChatGPT 可以帮助企业训练私有模型，利用企业的 ERP/MES 数据来优化经营它还能够提醒我，这个过程很复杂， 需要多方面的专家，包括机器学习，数据科学和软件开发人员ChatGPT 制定的决策的准确度依赖于数据的质量，模型训练的准确性和正确的业务场景（它快速指出了人工智能技术应用于业务价值的三个要素）最后它还不忘记再次强调，这是一个非常重要的，有价值的趋势</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/e3/e3cde504005f2f5ea57dafbb03d0112d.png\" /></p><p></p><p>第四个问题：</p><p></p><p>“如果我把企业数据给 ChatGPT 训练，会不会被泄露？”，这也是很多企业关心的问题。它的回答如下：</p><p></p><p>将企业数据用于训练是有数据泄露的风险的所以在训练过程中，要准确的进行数据脱敏，加密等技术要注意数据隐私和网络安全</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/8c/8c1c50b242b702ccadca2cd96d67e296.png\" /></p><p></p><p>第五个问题：</p><p></p><p>有趣的问题来了，我问它，根据我前面的问题，你觉得我是做什么的？</p><p></p><p>它告诉我，基于我的问题，它猜我是在相关领域做 ERP 或者制造业的，我正在寻找利用 ChatGPT 来优化业务的方案。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/65/65be9f98b6627b0ca75118d230100270.png\" /></p><p></p><p>第六个问题：</p><p></p><p>最重要的问题，我只问了很简单的一句话，“你认为凯捷能做到么？“，在这个问题里，我没有指出来要做到什么，请注意。</p><p></p><p>ChatGPT 的回答近乎完美：</p><p></p><p>他说凯捷作为一家全球的专业服务公司，有能力与像 ChatGPT 一样的模型一起工作助力客户的业务运营如果一个企业希望利用 ChatGPT 这样的模型来优化业务，它需要和凯捷这样的专业服务公司合作，因为他拥有既专业又有行业经验的专家它强调即使和凯捷这样的伙伴合作，但是人工智能项目的成功依赖于数据质量，专家资源和正确的业务用例。（请注意，这里的三个要素和前面第三个问题不一样了）</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/05/05e0549173e01d6c570db94b514d985e.png\" /></p><p></p><p>第七个问题：</p><p></p><p>我就让它写一篇 3000 字的文章，标题是，”当 ERP 遇到 ChatGPT“，它给了我这个答案：</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/c8/c8cfa2ab887b542df841ef5b36dfafe4.png\" /></p><p></p><p>我把它翻译成中文：</p><p></p><p></p><blockquote>当 ERP 遇上 ChatGPT：业务自动化的未来”几十年来，企业资源规划 (ERP) 系统一直是许多企业的支柱。这些系统通过自动化各种流程并提供对其数据的实时洞察来帮助组织管理其运营。然而，随着<a href=\"https://www.infoq.cn/article/7T0i680uu5Elrk3VKbNu\">人工智能</a>\" (AI) 和自然语言处理 (NLP) 的兴起，对更先进和用户友好的解决方案的需求不断增长，这些解决方案可以帮助组织进一步简化其运营。这就是 ChatGPT 的用武之地。ChatGPT 是 OpenAI 开发的一种尖端语言模型，能够生成类似人类的文本并高度准确地回答问题。这项技术有可能彻底改变企业与其 ERP 系统交互的方式，使员工更容易、更高效地访问他们完成工作所需的信息。当今企业面临的最大挑战之一是难以从 <a href=\"https://xie.infoq.cn/article/394129641f5b64a4a31d23c7d\">ERP 系统</a>\"中提取有价值的信息。有了如此多的可用数据，员工可能难以浏览各种报告和仪表板以找到他们正在寻找的内容。ChatGPT 可以帮助员工使用自然语言简单地询问他们需要的信息。例如，员工无需搜索多个报告来查找特定产品的销售数据，只需询问 ChatGPT，“产品 X 上个月的销售数据是多少？” 然后，ChatGPT 将从 ERP 系统访问相关数据，并为员工提供清晰简洁的答案。该技术还可用于自动化 ERP 系统中的某些任务。例如，员工可以要求 ChatGPT 为特定产品创建采购订单，然后 ChatGPT 会生成采购订单并将其发送给相关部门进行审批。这将节省时间并降低出错风险，因为员工将不再需要手动将数据输入 ERP 系统。将 ChatGPT 与 ERP 系统结合使用的另一个好处是它可以帮助弥合技术和非技术员工之间的差距。对于不熟悉该技术的员工来说，ERP 系统可能很复杂且难以使用。ChatGPT 可以提供更直观和用户友好的界面，供各级员工使用，从而提供帮助。总之，ChatGPT 与 ERP 系统的集成有可能彻底改变企业的运营方式。通过为员工提供一种更加用户友好的方式来访问信息和自动执行某些任务，企业可以提高效率并节省时间。随着 AI 和 NLP 的不断发展，我们很可能会看到更先进的解决方案，这些解决方案可以帮助企业以更精简、更高效的方式实现其目标。业务自动化的未来就在这里，ERP 和 ChatGPT 的结合正在引领潮流。ChatGPT 真的会”思考“，它一边思考一边回答，而不是搜索，简单的组合等等。</blockquote><p></p><p></p><h1>二、历史已然创造</h1><p></p><p></p><p>这两天 ChatGPT 登上了朋友圈顶流，连续霸榜，在中文搜索 baidu 的搜索指数上，呈现了从未有过的极速攀升，如下图所示：</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/69/693377004103b5a019b6a8372c3bf727.png\" /></p><p></p><p>而当我回顾过去十年，才发现，历史已经创造，短短 2 天，ChatGPT 已经超过了所有历史上人工智能相关的搜索热度，而且是指数级的超越，如下图所示，从 2011 年以来，所有的人工智能和 AI 的搜索最高的都不到 5 万，而短短两天 ChatGPT 已经攀升到 50 万以上。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/f8/f8e0352d9cea55424cfc7e0f23c9aa8c.png\" /></p><p></p><p>几年前，当我在设计第一版精益数据工作坊卡牌的时候，我一直很困惑如何跟用户解释数据分析的五大阶段中的最后一个”认知分析“，如下图所示：</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/02/021168d998506d6390826176838e8540.png\" /></p><p></p><p>所以，当我为众多企业设计<a href=\"https://www.infoq.cn/article/mfcsP6wws312tLTcrPCl\">精益数据</a>\"工作坊的技术卡牌的时候，我会跳过“认知分析”这个工具，因为我认为还没有一个很好的例子来说明什么是认知分析。</p><p></p><p>但是，当我遇到 ChatGPT，我觉得，我可以在卡牌里加上，“认知分析”这个工具了，因为，这个类型的数据分析，只需要提出问题，ChatGPT 会帮你进行回答。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/d7/d72be31c8adb94d6aa5db4c8a75fa7a4.jpeg\" /></p><p></p><p>如何应对这个新的时代？</p><p></p><h1>三、找到正确的问题是释放 ChatGPT 之力的钥匙</h1><p></p><p></p><p>最近很多人都很焦虑认为 ChatGPT 即将替代很多工作。</p><p></p><p>但是，凯哥认为，找到正确的问题，提出正确的问题是释放 ChatGPT 之力的钥匙，而如何找到正确的问题，如何把一个复杂商业愿景分解成一系列的系统化的问题，是正确使用 ChatGPT 的关键。</p><p></p><p></p><blockquote>作者介绍史凯，《精益数据方法论》作者和创始人。近 20 年企业信息化、数字化转型和咨询实施经验。2019 年被评选为全球 DataIQ100 的数据赋能者。从业 20 年来，为众多行业头部企业提供数字化转型服务。曾在 IBM、埃森哲、EMC 负责企业应用咨询服务，曾任 ThoughtWorks 数据和智能事业部总经理，深度思考者和作者，是数据中台、数据驱动的数字化转型的倡导者和实践者。</blockquote><p></p>",
    "publish_time": "2023-02-13 15:07:13",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "被批不够安全， C++ 创建者压力下提出解决方案",
    "url": "https://www.infoq.cn/article/JLCeu0ao1z749t8SECYO",
    "summary": "<p>近期，这条由 C++ 创建者 Bjarne Stroustrup 与其它开发者联合发布<a href=\"https://www.open-std.org/jtc1/sc22/wg21/docs/papers/2023/p2759r0.pdf\">声明表示</a>\"，需要改变编程语言自身来解决解决安全问题。</p><p>&nbsp;</p><p>“作为⼀种⾼性能的通⽤语⾔是C++成功的原因。可能有⼀天 C++ 会将其⽕炬传递给另⼀种更强⼤的语⾔，但⽬前还不是这样。 我们永远不应该放弃数百万⾏现有代码，其中⼀些代码并不需要安全。我们应该认识到⽀持 C++ 安全的紧迫性是我们这个时代的问题之⼀。”Stroustrup等人在文档里提到。他们总结了 C++ 的安全原则：</p><p>&nbsp;</p><p>不要从根本上破坏向后兼容性——与更现代、更流行的语言相比，兼容性是 C++的一个关键特性和优势。不要以无法表达抽象为代价来提供安全性，抽象是 C++力量的支柱。不要留下一个“安全”的C子集，它会消除C++的生产力优势。</p><p>&nbsp;</p><p>具体来说，他们建议“将几个特性打包到配置文件中（Profiles ）”（“配置文件”的解释是：定义要强制执行属性的限制和需求的集合，用来强制执⾏语义⼀致的规则集，⽽不是让单个开发⼈员在对单个语⾔、库设施和编码规则的⼤量限制中进⾏选择）。通过这种方式，安全方面的新更改“应该是可见的，这样安全代码部分就可以被命名(可能使用配置文件)，并且可以与普通代码混合使用。</p><p>&nbsp;</p><p>他们表示，配置文件专门用于支持嵌入式计算、性能敏感的应用程序，或高度特定的问题领域，如汽车、航空航天、航空电子设备、核或医疗应用程序。</p><p>&nbsp;</p><p>“我们认为 Profiles 不会分裂⽣态系统，反⽽增加了多样性。”Stroustrup等人表示。他们认为安全不应该强加于每个⼈，尤其是那些不需要或不想要的⼈。安全不应该是静态的，⽽是随着了解的增多、外部安全专家更好了解自己的真正需要后不断发展。</p><p>&nbsp;</p><p>Stroustrup这一举动的背后是近期美国国家安全局(NSA)等对C++ 安全性的<a href=\"https://media.defense.gov/2022/Nov/10/2003112742/-1/-1/0/CSI_SOFTWARE_MEMORY_SAFETY.PDF\">点名批评</a>\"。但当时他<a href=\"file:///Users/mac/Desktop/p2739r0%20(1).pdf\">对此表示否认</a>\"：NSA 报告中提到的 “安全” 编程语言(如 C#、Rust、Go、Java、Ruby 或 Swift)&nbsp;在重要应用程序中实际上并不优于 C++。</p><p>&nbsp;</p><p>Stroustrup当时批评 NSA 的报告只关注内存处理问题，而忽略了许多其他影响项目安全性和可靠性的编程语言问题。他建议使用代码注释和编译器选项来控制规则的包含，以确保类型和资源得到安全处理。考虑到可能对项目造成的破坏，他保证 C++ 社区不会忽视安全问题，但只关注安全问题也不行。</p><p></p><p>参考链接：</p><p>https://www.open-std.org/jtc1/sc22/wg21/docs/papers/2023/p2759r0.pdf</p><p></p><p></p>",
    "publish_time": "2023-02-13 15:40:07",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]