[
  {
    "title": "程序员利用漏洞篡改ETC余额，一年私吞260余万元；小马智行获沙特1亿美元投资；AMD回应“中国区大幅裁员” | AI一周资讯",
    "url": "https://www.infoq.cn/article/kVVkXrWbX7CVWPR7Y6Fe",
    "summary": "<p></p><blockquote>传谷歌同意向OpenAI竞争对手Anthropic至多投资20亿美元；AMD回应裁员传闻：系公司组织架构小幅度优化和重组；小米正式发布澎湃OS，雷军确认小米汽车明年上半年上市；腾讯混元大模型正式开放“文生图”功能，代码能力大幅提升 20%……</blockquote><p></p><p></p><h2>资讯</h2><p></p><p></p><h4>传谷歌同意向OpenAI竞争对手Anthropic至多投资20亿美元</h4><p></p><p></p><p>10月28日消息，据知情人士透露，谷歌已经同意在此前投资的基础上，再向OpenAI竞争对手Anthropic至多投资20亿美元。此举可能促使人工智能领域的初创公司加剧竞争，以争取首先取得下一个重大突破。</p><p></p><p>知情人士说，谷歌同意先期向Anthropic投资5亿美元，并同意随着时间的推移再增加15亿美元。在这笔投资之前，亚马逊也曾于上个月承诺向Anthropic投资40亿美元。Anthropic由前OpenAI工程师于2021年创立，目标是开发能与GPT-4竞争的生成式人工智能模型。</p><p></p><h4>花旗计划为其4万多名程序员部署生成式AI</h4><p></p><p></p><p>据报道，随着华尔街继续拥抱人工智能这项新兴的技术，花旗集团（Citigroup）计划为其4万多名程序员中的绝大部分使用生成性人工智能（GAI）。作为小型试点项目的一部分，花旗集团开始允许大约250名开发人员率先体验生成式人工智能。明年，花旗集团计划将该计划扩展到绝大多数程序员。</p><p></p><h4>马斯克：X要与YouTube和LinkedIn竞争</h4><p></p><p></p><p>据知情人士称，X平台所有者埃隆·马斯克和该公司CEO琳达·亚卡里诺周四表示，他们将YouTube和LinkedIn视为未来的竞争对手，同时在视频和招聘领域寻求新的业务线。</p><p></p><p>消息人士称，X周四举行了一次全体会议，以纪念马斯克收购推特一周年。在会上，马斯克和亚卡里诺提到了这两个网站。该知情人士说，两人还提到了创建名为XWire的新闻服务的雄心，该服务将与Cision的美通社（PR Newswire）竞争。该知情人士要求不具名，因为讨论是私人的。</p><p></p><p>这位知情人士说，这次会议是马斯克和亚卡里诺首次共同向整个公司发表讲话。亚卡里诺于今年5月被聘为X的CEO，此前她在NBC环球负责广告和合作。</p><p></p><h4>OpenAI组建新团队以评估AI的“灾难性风险”</h4><p></p><p></p><p>美国当地时间周四，人工智能研究公司OpenAI宣布组建新团队，以评估和减轻与人工智能相关的“灾难性风险”。OpenAI在周四的声明中表示，这个新团队名为Preparedness，其主要任务是“跟踪、评估、预测和保护”人工智能造成的潜在重大问题，包括核威胁。此外，该团队将致力于减轻“化学、生物和放射性威胁”，以及人工智能的“自主复制”行为。Preparedness团队将解决的其他风险包括人工智能欺骗人类的行为，以及网络安全威胁。</p><p></p><p>OpenAI在更新中写道：“我们相信，前沿人工智能模型的能力将超越目前最先进的模型，有可能造福全人类。不过，它们也构成了越来越严重的风险。”</p><p></p><h4>小米正式发布澎湃OS，雷军确认小米汽车明年上半年上市</h4><p></p><p></p><p>10月26日晚，小米集团创始人、董事长兼CEO雷军宣布集团战略正式升级为“人车家全生态”，并发布了小米澎湃OS操作系统、数字高端旗舰小米14系列，以及Xiaomi Watch S3、小米电视S Pro 85等6款AIoT新品。</p><p></p><p>雷军表示，过去几年小米一直在突破认知，改变成长，今天将迎来“跨越时刻”。小米发布的新战略“人车家全生态”，是以人为中心、对“人车家全生态”进行整合，而承接新战略的关键是小米澎湃OS。</p><p></p><p>雷军还透露了小米汽车的最新情况，称“进展顺利”，将于2024年上半年正式上市。他表示，“人车家全生态”战略很快将完成全面落地的最后拼图。</p><p></p><h4>AMD回应“中国区大幅裁员”：系公司组织架构小幅度优化和重组</h4><p></p><p></p><p>近期，有消息称超威半导体公司（AMD）即将在中国区进行大规模裁员，本轮裁员比例可能为10％-15％，或涉及数百名员工。</p><p></p><p>对此，10月26日，AMD方面回应：“网络传闻失实。基于公司战略的调整，公司近期对组织架构进行了小幅度的优化和重组。”</p><p></p><h4>亚马逊高管解读Q3财报：生成式AI未来几年将为AWS带来数百亿美元营收</h4><p></p><p></p><p>10 月 27 日，亚马逊发布了2023财年第三季度财报。报告显示，亚马逊第三季度净销售额为1430.83亿美元，同比增长13%，不计入汇率变动的影响为同比增长11%；净利润为98.79亿美元，同比增长244%；每股摊薄收益为0.94美元，相比之下去年同期的每股摊薄收益为0.28美元。</p><p></p><p>财报发布后，亚马逊CEO Andy Jassy和CFO Brian Olsavsky回答了投资者提问。Andy Jassy表示：“公司运业务目前的预计年销售额已经达到920亿美元，而90%的全球IT业务处理仍然基于本地设备，我们相信这一比例将有机会反转，所以我们的增长空间非常大。再加上刚刚涌现出来的，生成式人工智能市场方面的巨大机会，也将在未来几年内为AWS带来数百亿美元的营收。”</p><p></p><h4>腾讯混元大模型正式开放“文生图”功能，代码能力大幅提升 20%</h4><p></p><p></p><p>10 月 26 日，腾讯宣布，腾讯混元大模型迎来全新升级，升级后的腾讯混元中文能力整体超过 GPT3.5，代能力大幅提升 20%，达到业界领先水平。同时，腾讯混元大模型正式对外开放“文生图”功能。</p><p></p><p>腾讯机器学习平台算法负责人康战辉重点介绍了混元大模型代码方面的能力。代码技术主要是两个方向进行了优化：一是代码预训练，二是 SFT 指令微调。腾讯表示，经过对 32 种主流语言代码文件、各类计算机书籍和博客的学习增训，腾讯混元代码处理水平提升超过 20%，代码处理效果胜出 ChatGPT 6.34%，在 HumanEval 公开测试集指标上全面超过 Starcoder、Codellama 等业界头部开源代码大模型。</p><p></p><h4>小马智行获沙特1亿美元投资</h4><p></p><p></p><p>日前，小马智行微信公众号发文称，获得沙特阿拉伯王国新未来城（NEOM）及旗下投资基金NIF（NEOM Investment Fund）1亿美元投资。本轮融资资金将用于自动驾驶技术全球化研发和运营投入等方向。</p><p></p><p>据了解，双方计划在新未来城建立自动驾驶生产制造及研发中心，面向沙特新未来城乃至中东及北非地区开展自动驾驶研发与制造，并部署自动驾驶服务车队以及智能汽车相关的基础设施。沙特新未来城将成为小马智行推行技术全球化布局的战略要地。</p><p></p><h4>历时 7 个月，国家数据局正式揭牌</h4><p></p><p></p><p>10 月 25 日，国家数据局正式揭牌。</p><p></p><p>2023 年 3 月，国务院机构改革方案提出组建国家数据局，负责协调推进数据基础制度建设，统筹数据资源整合共享和开发利用，统筹推进数字中国、数字经济、数字社会规划和建设等，由国家发展和改革委员会管理。</p><p></p><p>据悉，目前国家数据局已有两名领导亮相。7 月 28 日，人社部发布国务院任免国家工作人员信息，刘烈宏获任命为国家数据局局长；10 月 11 日，国务院任命沈竹林为国家数据局副局长，另有媒体报道，同月国家数据局启动招聘，发布多个职位。</p><p></p><h4>亚马逊推出人工智能图像生成功能</h4><p></p><p></p><p>10月25日，亚马逊宣布推出测试版图像生成功能。亚马逊称，在亚马逊广告控制台中，广告商只需选择产品并点击“生成”，该工具就能利用人工智能生成功能，根据产品细节在几秒钟内提供一组以生活方式和品牌为主题的图片。</p><p></p><h2>IT 业界热评新闻</h2><p></p><p></p><h4>程序员利用漏洞篡改ETC余额，一年私吞260余万元</h4><p></p><p></p><p>据警民直通车上海报道，2023年9月，上海市公安局浦东分局北蔡派出所接到某科技公司员工张女士报案称，其公司发现计算机系统被他人篡改数据，导致公司账户钱款损失。民警对公司后台电子数据出现的异常账户进行提取搜证中发现，要想通过漏洞篡改网站后台信息，执行起来难度很大。操作者很有可能是管理网站后台系统的员工，监守自盗的可能性较大。</p><p></p><p>民警随即展开工作，最终嫌疑人曹某迫于压力，主动投案自首。</p><p></p><p>2022年8月，曹某发现所在公司的网站后台有漏洞，身为软件工程师的他，决定铤而走险，用其母亲的身份证自行注册了一个ETC账户，并绑定了其母亲的银行卡。随后曹某以每周4至5次、每次1万元的频率，陆续从该账户内提取了230余万元。之后，曹某又利用朋友的身份证再次办理账号，以同样的方式再次从公司提现36万元。</p><p></p><p>目前，犯罪嫌疑人曹某因涉嫌盗窃罪，已被浦东警方依法刑事拘留，该起案件正在进一步审理中。</p><p></p><p>网友热评：太“刑”了。</p>",
    "publish_time": "2023-10-29 14:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]