[
  {
    "title": "DevEx：来自SPACE作者的一种全新的度量框架",
    "url": "https://www.infoq.cn/article/sF2is0yZ7B5yWcG8T8U9",
    "summary": "<p></p><h3>关键要点</h3><p></p><p>研究人员 Abi Noda、Nicole Forsgren 博士、Margaret-Anne Storey 博士和 Michaela Greiler 博士发表了一篇论文，为提高生产力提供了一种切实可行的途径，其重点聚焦在开发者体验 (DevEx)。开发者体验聚焦于开发者的真实体验及其在日常工作中遇到的摩擦点。作者断言，关注开发者体验是最大化工程效率的关键，并介绍了一个用于衡量和改进的 DevEx 框架。组织可以通过识别开发人员遇到的最大摩擦点来改善开发者体验，然后在可提高开发人员能力或满意度的可改进领域进行大力投入。DevEx 框架将影响开发者体验的因素提炼为三个维度：反馈回路、认知负荷和心流状态。领导者可以在这三个维度中选择指标，以衡量和确定需要关注的领域，最终推动生产力的提高。调查为获得一套全面的衡量标准提供了一个实践性的起点，以便充分了解开发者体验。有效的调查计划需要注重调查设计，以及按角色和团队分解结果并将结果与​​内部和外部基准进行比较的能力。</p><p>&nbsp;</p><p>&nbsp;</p><p>近期发布的一篇研究论文揭示了度量和提升开发者生产力的一种全新框架。</p><p>&nbsp;</p><p>该框架称作&nbsp;<a href=\"https://getdx.com/blog/news/measuring-developer-productivity\">DevEx框架</a>\" ，作者为 Abi Noda、Margaret-Anne Storey 博士、Nicole Forsgren 博士、和 Michaela Greiler 博士。</p><p>&nbsp;</p><p>领导者长期以来一直在寻求提升其工程团队的生产力，以便帮助业务更快发展、开发新产品及利用新兴趋势。</p><p>&nbsp;</p><p>然而，尽管近来也涌现出了 DORA 和 SPACE 这类方法，但要重点关注什么才能实现这一目标，想知道这一点仍然难以捉摸；而新的框架旨在解决这一差距。</p><p>&nbsp;</p><p>作者凭借广泛的研究和经验，断言关注开发者体验是最大限度提高工程效率的关键。</p><p>他们的论文提出了框架，将开发者体验提炼为三个核心维度，并提供了衡量它的方法。</p><p>本文包含论文要点摘要以及主要作者 Abi Noda 的评论。这里还有<a href=\"https://queue.acm.org/detail.cfm?id=3595878\">全文的链接</a>\"。</p><p>&nbsp;</p><p></p><h2>度量生产力有难度</h2><p></p><p>&nbsp;</p><p>谷歌研究员 Ciera Jaspan 和 Collin Green 在最近的一篇文章中提出了衡量开发人员生产力很有挑战性的两大原因：软件工程的不可重复性，以及开发人员的生产力受到外部力量的严重影响。</p><p>&nbsp;</p><p>对于后者，外部力量可能是工作的复杂性（以及是否一定有那么复杂）、完成工作时与他人的互动或组织设计。还有一些具体影响开发人员的因素，包括不稳定的测试、构建速度和技术债务。</p><p>衡量生产力困难的另一个原因是，软件开发是一项创造性的工作：它并不是在生产统一通用的产出物。\"试图通过借用操作机器的方法来量化生产力，并不适合软件工程\"。</p><p>&nbsp;</p><p></p><blockquote>我们必须记住，我们正在与一个本质上是人类的系统合作。为了了解如何改进该系统，我们需要从人类那里了解他们当前的体验如何。</blockquote><p></p><p>&nbsp;</p><p></p><h2>开发者体验提供了新视角</h2><p></p><p>&nbsp;</p><p>开发者体验提供了一种了解开发人员生产力的新方式：从开发人员本身的角度。开发者体验包括开发人员如何“感受、思考和重视他们的工作”，并关注开发人员在执行工作时面临的日常现实和摩擦。</p><p>&nbsp;</p><p>先前的研究已经确定了许多影响开发者体验的因素：例如，中断、不切实际的截止日期以及开发工具的摩擦，都会对开发人员对其工作的感受产生负面影响。明确的任务、组织良好的代码和轻松的发布可以改善开发者体验。</p><p>&nbsp;</p><p>组织可以通过确定开发人员遇到的最大摩擦点来改善开发者体验，然后投资于可提高开发人员能力或满意度的可改进领域。例如，组织可以专注于减少开发工具中的摩擦，以便让开发人员更无缝地完成任务。即使是减少了浪费的一小部分时间，如果在整个工程组织中是倍增的，那么对生产力的影响也会比雇用更多工程师更大。</p><p>&nbsp;</p><p></p><h2>越来越多的企业开始关注开发者体验</h2><p></p><p>&nbsp;</p><p>Gartner 最近的一项研究显示，78% 的受访组织已经制定或计划了正式的开发者体验倡议，而 Forrester 的一项类似研究表明，75% 的企业领导者认为开发者体验对于执行业务战略至关重要。这些发现表明，人们越来越认识到投资开发者体验计划可以带来的实质性好处。</p><p>&nbsp;</p><p><a href=\"https://www.mckinsey.com/industries/technology-media-and-telecommunications/our-insights/developer-velocity-how-software-excellence-fuels-business-performance\">麦肯锡</a>\"和 <a href=\"https://stripe.com/files/reports/the-developer-coefficient.pdf\">Stripe</a>\"的相关研究进一步验证了优化开发人员工作环境的业务影响，因此越来越多的组织围绕开发者体验制定了 C 级倡议举措。</p><p>&nbsp;</p><p></p><h2>开发者体验的三大维度</h2><p></p><p>&nbsp;</p><p>在论文中，作者将之前确定的影响开发者体验的因素提炼为三个核心维度：反馈回路、认知负荷和心流状态。</p><p></p><p></p><blockquote>此框架是根据我们之前的研究和经验得出的，并了解了组织在提高开发人员生产力和体验方面的差距。我们的目标是创建一个实用的框架，易于人们理解和应用，并获得开发者体验最重要的方面。</blockquote><p></p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/55/55674d390009463bc4035c85f19ec857.jpeg\" /></p><p></p><p>&nbsp;</p><p>总结一下每个维度。</p><p>&nbsp;</p><p>反馈回路是指相对于所执行的操作的响应速度和质量。快速的反馈回路是高效开发流程的关键组成部分，因为它们使开发人员能够以最小的摩擦快速完成工作。另一方面，缓慢的反馈回路可能会导致开发周期中断，导致开发人员感到沮丧并发生延迟。因此，组织必须努力缩短反馈回路，找出可以加速的开发工具和可以优化的人工交接流程的领域（例如构建和测试流程或开发环境设置）。</p><p>&nbsp;</p><p>认知负荷包括开发人员执行任务所需的心智处理量。高认知负荷可能是由于代码或系统文档记录不完善等挑战造成的，迫使开发人员投入额外的时间和精力来完成工作并避免错误。为了改善开发者体验，团队和组织应致力于通过消除开发过程中任何不必要的障碍来减轻认知负荷。</p><p>&nbsp;</p><p>心流状态是指在从事某项活动时全神贯注、精力充沛的精神状态，其特点是高度专注和享受。这通常被称为“如入无人之境”。在工作中经常体验心流状态可以带来更高生产力、创新和员工发展。同样，研究表明，从工作中获得满足感的开发人员往往会生产出更高质量的产品。因此，团队和组织应致力于创造促进心流状态的最佳条件，以促进员工的福祉和绩效。</p><p>&nbsp;</p><p>总的来说，这三个维度概括了开发人员遇到的所有摩擦类型。尽管开发者体验复杂且微妙，但团队和组织可以通过关注这三个关键领域来采取措施进行改进。领导者可以通过选择三个维度内的指标来发现提高生产力的机会。</p><p>&nbsp;</p><p></p><blockquote>DevEx 框架提供了一种以系统化和以开发者为中心的方式来提高开发人员生产力的方法。我们鼓励读者抓住三个维度中每个维度的指标，以阐明存在摩擦的领域，并有效地优先考虑对组织的预期结果影响最大的领域。</blockquote><p></p><p>&nbsp;</p><p></p><h2>度量什么</h2><p></p><p>&nbsp;</p><p>对于希望改善开发者体验的组织来说，首要任务是度量前文描述的三个维度中存在哪些摩擦。作者建议在每个维度中选择要度量的主题，针对每个主题抓住感知和工作流程指标，同时抓住关键的 KPI ，以便与预期的更高层次的结果保持一致。</p><p>&nbsp;</p><p>从三个维度度量主题。例如，组织可以选择度量测试效率（反馈回路）、代码库复杂性（认知负荷）、技术债务平衡（认知负荷）和深度工作时间（心流状态）。一些主题可能映射到多个维度。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/07/07696ebac08dd5a90518740a98809fad.jpeg\" /></p><p></p><p>&nbsp;</p><p></p><blockquote>我们主张领导者选择的指标可以全面覆盖三个维度，以全面了解开发者体验。例如，可以在反馈回路维度中评估的主题是测试效率，而代码库复杂性可以在认知负荷维度。</blockquote><p></p><p>&nbsp;</p><p>抓住每个主题的感知和工作流度量。除了有关工程系统和流程的客观数据之外，衡量开发者体验还需要抓住开发人员的看法（他们的态度、感受和意见）。这是因为单独的感知和工作流度量都无法讲述完整的故事。</p><p>&nbsp;</p><p>例如，看似快速的构建过程如果经常打断开发人员的工作进度，可能会给开发人员带来干扰。相反，即使开发人员对他们的构建过程感到满意，使用构建时间等客观衡量标准也可能会发现反馈回路比应有的速度要慢，并且开发工作流程的简化程度也比应有的要低。因此，分析感知和工作流度量对于全面了解开发人员在日常工作中遇到的摩擦点是必要的。</p><p>&nbsp;</p><p>度量 KPI，以聚焦推动重要的业务成果。 KPI 充当 DevEx 计划的北极星指标。精心设计的 KPI 应度量企业寻求推动的成果，包括生产力、满意度、参与度和保留率的提高。</p><p>&nbsp;</p><p></p><h2>如何度量</h2><p></p><p>&nbsp;</p><p>作者建议从调查开始来捕获上述指标。调查的优点是能够捕获开发者体验的各个方面，包括 KPI、感知度量和工作流度量。</p><p>&nbsp;</p><p></p><blockquote>谷歌、微软和 Spotify 等公司多年来一直依赖基于调查的开发者生产力指标。然而，设计和管理调查可能很困难，因此我们希望我们的框架为领导者提供一个不错的起点。</blockquote><p></p><p>&nbsp;</p><p>鉴于调查的重要性，作者概述了调查计划成功的几个重要考虑因素。</p><p>精心设计调查。设计不当的调查问题会导致结果不准确且不可靠。作者表示，至少，调查问题应基于明确定义的结构，并在访谈中经过严格测试，以获得一致的解释。按团队和角色细分结果。组织领导者常犯的一个错误是关注公司范围内的结果，而不是按团队和角色（例如角色、任期、资历）细分的数据。仅关注总体结果可能会导致忽视影响公司内少数但重要群体的问题。将结果与基准进行比较。比较分析有助于将数据置于情境中并帮助推动行动。例如，开发商对科技债务的情绪通常是负面的，这使得识别问题或衡量其规模变得困难。基准使领导者能够了解团队的情绪得分何时低于同行，以及组织的得分何时低于行业竞争对手。这些信号标志着显着的改进机会。混入事务调查。除了定期调查之外，组织还可以使用事务调查来收集基于特定接触点的反馈。例如，当 CLI 工具安装过程中发生特定错误时，平台团队可以使用事务调查来提示开发人员提供反馈。事务调查提供持续的反馈流，并且由于提出问题的及时性，可以产生更高质量的答复。注意调查疲劳。随着时间的推移，许多组织都在努力维持调查的高参与率。缺乏后续行动通常会导致开发人员觉得重复回应调查不值得。因此，领导者和团队跟进调查至关重要。</p><p>&nbsp;</p><p></p><h2>结论</h2><p></p><p>&nbsp;</p><p>DevEx 框架提供了一个用于了解开发者体验的实用框架，其配套的度量方法能系统地帮助指导改进。组织应该立即开始度量开发者体验，即使他们尚未建立或计划正式的 DevEx 投入。</p><p>&nbsp;</p><p></p><h2>作者简介</h2><p></p><p>Abi Noda 是 <a href=\"https://getdx.com/\">DX</a>\"的创始人兼首席执行官，负责领导公司的战略方向和研发工作。他的工作重点是开发衡量方法，以帮助组织提高开发者体验和生产力。在 DX 之前，Abi 在多家公司担任工程领导职务，并创立了 Pull Panda，该公司于 2019 年被 GitHub 收购。有关更多信息，请访问他的<a href=\"https://abinoda.com/\">网站</a>\"。</p><p>&nbsp;</p><p>原文链接：</p><p><a href=\"https://www.infoq.com/articles/devex-metrics-framework/\">https://www.infoq.com/articles/devex-metrics-framework/</a>\"</p><p>&nbsp;</p><p>相关阅读：</p><p><a href=\"https://www.infoq.cn/article/zxBarfLg4T9T1wivz0zx\">AI 时代背景下的平台工程之路 | 极客有约</a>\"</p><p><a href=\"https://www.infoq.cn/article/QEPvmRLAWsw735WWUNmB\">通用电气在平台工程上浪费70亿美元的教训</a>\"</p><p><a href=\"https://www.infoq.cn/article/kfKwKQiGwv0Zbht0fkLW\">一个价值70亿美元的教训！如何避免平台工程变成“大灾难”？</a>\"</p>",
    "publish_time": "2023-08-18 10:29:34",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "百度开放国内首个商用全场景智能编程助手Comate X，已有超100家企业合作伙伴",
    "url": "https://www.infoq.cn/article/Hgq3ssWvOACj7sLdagZl",
    "summary": "<p>8月16日，由深度学习技术及应用国家工程研究中心主办、百度飞桨和文心大模型承办的WAVE SUMMIT深度学习开发者大会2023举办。会上，百度对外发布文心大模型、飞桨平台、AI原生应用如流等一系列技术、产品最新进展及生态成果。百度集团副总裁、百度集团首席信息官李莹发表主题演讲，她认为，当前以AI大模型为核心技术的第四次科技革命，从根本上推动生产力变革，将赋能千行百业，也为企业办公领域带来前所未有的发展机遇。</p><p>&nbsp;</p><p>基于AI原生思维，李莹宣布，百度智能工作知识管理理念“创新流水线= AIx知识管理”升级到2.0，正式发布百度如流“超级助理”，并带来百度Comate系列产品的重磅升级。李莹提到，大模型压缩了人类对世界的认知，智能涌现，最重要的体现就是在知识方面的擅长。大模型是企业办公领域的重大机遇，而且能够率先发生更深刻的变革。</p><p>&nbsp;</p><p>李莹指出，以文心一言为代表的大语言模型已具备理解、生成、逻辑、记忆的能力，同时带动了更多能力的涌现，为智能工作带来重大变革，有三个主要的特点：一是交互方式会变成以自然语言交互为主；二是需求满足方式能做到端到端的极致满足；三是重塑工作模式和流程，最终带来基于AI原生构建的全新工作范</p><p></p><h3>如流“超级助理”正式发布，现场演示四大场景AI原生能力</h3><p></p><p>&nbsp;</p><p>会上，李莹重磅发布如流“超级助理”产品，基于文心一言能力，在原有的如流超级助手基础上全面升级。不同于助手概念的工具属性，“助理”意味着更多的人性化，更多的主动性。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/fe/c0/fe5255408bfed8e4b47704ac4b4a4dc0.png\" /></p><p></p><p>如流超级助理旨在打造人人可拥有的懂你、专业、实时陪伴的工作助理。现场李莹重点围绕移动端任务执行、智能文档处理、会话式商业智能CBI、智能沟通四大场景，对“超级助理”进行了10余个演示。</p><p>&nbsp;</p><p>如流将“超级助理”作为AI能力的入口，随时随地可以被唤起并响应，时刻陪伴用户左右。在移动端任务执行场景，现场展示了超级助理移动端的语音一键约会、一键休假、一键差旅能力。例如，“语音一键差旅”，现场在超级助理界面语音输入“我后天上午去上海研发中心开会，当天返回北京，请帮我规划行程”，超级助理可快速调用不同模块或平台的功能，自动提交差旅申请、预定往返机票和酒店，并能避让相关日程，根据用户习惯提供理想住宿地点，且为用户智能完成对公结算，无需个人再走报销流程，就像真正的助理一样。效率从小时级操作，压缩为分钟级甚至秒级完成。</p><p>&nbsp;</p><p>在智能文档处理场景，超级助理“查文档、学知识、看文献”的能力也非常抢眼。“找文档”，只需输入文档的出现场景，即可准确找到目标文档。“看文献”，面对英文论文，超级助理跨端至浏览器，一键点击可快速生成中文摘要，还有翻译、解释等能力。超级助理不仅大幅提升了知识获取效率，也极大拓展了员工增长能力的边界。</p><p>&nbsp;</p><p>超级助理还打造了基于大模型技术构建的会话式商业智能，Baidu Conversational BI，即CBI。在“Baidu CBI”场景，李莹演示了查询销售数据、分析团队数据、查询商机等能力。基于文心一言，不同于传统BI，只需要通过超级助理，输入自然语言，即可实现商业分析的快速计算和结构化输出，CBI甚至会给出建议。</p><p>&nbsp;</p><p>沟通是工作中最高频的场景之一，超级助理可以实现降噪减负，面对海量信息，抽取关键，聚焦核心。超级助理在沟通场景具有“IM智能总结、AI洞察、AI会议纪要”等多项能力。例如“超级助理IM智能总结”功能，划选多条对话之后会生成一段智能总结，一键转发，接收人便能看到这条精简准确的总结，快速决策和响应，据统计，该功能使消息阅读效率提升3倍；会议方面，AI洞察和 AI会议纪要将会议内容的阅读和应用量提升了3.5倍。</p><p></p><h3>Comate系列产品重磅升级，Comate X首次面向企业开发者开放</h3><p></p><p>&nbsp;</p><p>在研发智能化场景，百度Comate系列产品全新升级，重磅发布智能编程助手Comate X和Comate Stack工具套件。</p><p></p><p>Comate X智能编程助手，不仅可以提供基础的代码智能推荐，更能在研发全生命周期、全场景，做到帮助工程师『想』、『写』、『改』。除了代码解释、代码生成等，还有行间注释生成、单元测试生成、文档生成、命令行生成、接口生成代码等能力，目前已经支持30多种编程语言、十多种IDE。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/86/70/866da5eb7bce154c069a6f2657c2e770.png\" /></p><p></p><p>现场，李莹与百度工程师配合，以自然语言向Comate X输入了“写一个激活码程序”的任务后，几分钟内即实现了代码生成、代码解释、代码注释、单元测试等全流程操作。重要的是，工程师在整个过程中没有写一行代码，全部通过编程助手完成。</p><p>&nbsp;</p><p>作为国内首个商用全场景智能编程助手，李莹正式宣布Comate X面向企业开发者开放。Comate系列产品已经在百度内部全面使用，目前已服务和对接超过100家企业合作伙伴，处于成熟的商业化阶段。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/34/f7/34e168c79a24c1914ba882e9d05df2f7.png\" /></p><p></p><p>Comate X是用AI原生重构的研发工具链，另一方面，研发工具链服务于AI原生应用开发，研发流程也在发生重构，需要一整套适配AI应用的新架构，新工具套件。基于此，李莹还发布了Comate Stack 工具套件，可支持AI原生研发全过程。使用Baidu Comate Stack，2步即可开发上线一个超级助理插件。通过Comate Stack 工具套件，能显著降低AI原生应用的建设门槛，提高AI原生变革的效率。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/57/9f/576b6edd53a91562046d6ba86663349f.png\" /></p><p></p><p>目前，百度智能工作平台如流、研发智能化产品Comate系列已赋能包括金融、能源、AI、制造、通信等在内的数十大产业和领域。</p><p>&nbsp;</p><p>企业办公领域的重大变革，是以大语言模型为代表的人工智能加速各行各业转型升级的一个缩影。在这个进程中，技术创新和应用落地形成良性循环，理解、生成、逻辑、记忆等能力持续提升，产业应用的广度和深度持续拓展，大语言模型为通用人工智能带来曙光。</p>",
    "publish_time": "2023-08-18 10:58:22",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]