[
  {
    "title": "程序员未写出赌博程序被拔掉14颗牙；前华为“天才少年”稚晖君公布首款人形机器人，成本价不到20万元；马斯克称X平台将移除“拉黑”功能 | AI一周资讯",
    "url": "https://www.infoq.cn/article/B6HQmhhSjYGeU99wYiI5",
    "summary": "<p></p><blockquote>科大讯飞发布星火认知大模型 V2.0；小米首次公开披露大模型进展：13亿参数大模型已经成功在手机本地跑通；字节首个大模型独立APP亮相；Nature 发文表示 LK99 不是超导体；印度启用本土操作系统”玛雅“取代 Windows……</blockquote><p></p><p></p><h2>资讯</h2><p></p><p></p><h4>马斯克称X平台将移除“拉黑”功能，被屏蔽后仍可私信</h4><p></p><p></p><p>8月19日，据路透社消息，社交媒体平台X（原Twitter）的所有者埃隆·马斯克周五表示，将移除一项允许用户屏蔽其他账户的保护功能。X的屏蔽功能允许用户限制特定账户与自己联系、查看自己的帖子或关注自己。马斯克在该平台上发文称，“除私信（DM）之外，屏蔽将作为一项“功能”被删除。”他说，X将保留“Mute”功能，该功能可以阻止用户查看指定账户，但与“屏蔽”不同，该功能不会就这一举动提醒对方账户。</p><p></p><h4>快手公布自研大模型最新进展</h4><p></p><p></p><p>8月18日晚间消息，快手公布基于自研大语言模型应用的最新进展，“快手AI对话”功能已经在安卓版本开放内测。</p><p></p><p>和传统大模型相比，“快手AI对话”是对于搜索新场景的探索。据了解，“快手AI对话”依托于快手站内多元和有生命力的社区内容生态，通过互动对话的形式，可以帮助用户快速查找短视频、达人、百科等内容，体验全新的信息获取形态。</p><p></p><h4>字节首个大模型独立APP亮相</h4><p></p><p></p><p>据Tech星球报道，字节首个AI对话式APP“豆包”及其网页版已在近日上线，已开放安卓端的下载通道。豆包APP也就是为此前字节内部代号为“Grace”的AI项目，目前拥有文生文、文生图的功能。</p><p></p><p>豆包APP的官网为doubao.com，由北京春田知韵科技有限公司开发并运营，据企查查查询可知，该公司由字节旗下的北京抖音信息有限公司100%控股。豆包APP下载后，无需邀请码即可注册使用。进入默认页，可以发现部分智能体聊天界面，包括AI机器人“豆包”、英语老师Elaine、全能写作助手、超爱聊天的小宁等。这些智能体可以为用户提供多语种、多功能的AIGC服务，包括但不限于问答、智能创作、聊天等。</p><p></p><h4>前华为“天才少年”稚晖君公布首款人形机器人</h4><p></p><p></p><p>8 月 18 日，前华为“天才少年”稚晖君联合成立的机器人企业上海智元新创技术有限公司（下称“智元公司”，AGIBOT）发布其最新首款具身智能的通用人形机器人远征 A1，其采用上下肢分体的模块化设计，成本价不到 20 万元。</p><p></p><p>该产品将人工智能技术与人形机器人相结合，身高 175cm，体重 53kg，最高步速可达 7km/h，全身 49 个自由度，整机承重 80kg，单臂最大负载 5kg，不仅形态与人类相似，更在双足行走、智能任务、人机互动等领域展现一定技术能力。公司预计远征 A1 将在明年快速切入商业化落地。</p><p></p><p>智元公司联合创始人彭志辉表示：“远征 A1 是智元的第一代通用型具身智能机器人，基于创始团队在机器人和 Al 行业多年的研发积累所打造，这款机器人末来将可以在各种复杂场景下自主完成移动和操作任务。我们致力于将先进的机器人和 Al 技术与人类生活以及生产制造紧密结合，未来让机器人成为人类的得力助手。”</p><p></p><h4>科大讯飞发布星火认知大模型 V2.0</h4><p></p><p></p><p>8 月 15 日，<a href=\"https://www.infoq.cn/article/AYS8kOCDsu3VDfMdlrjQ\">讯飞星火认知大模型 V2.0</a>\" 升级发布会如约而至，科大讯飞董事长刘庆峰、研究院院长刘聪重磅发布代码能力和多模态能力升级，同时发布并升级搭载讯飞星火认知大模型 V2.0 能力的多项应用和产品。刘庆峰表示，代码能力是支撑认知大模型智慧的关键维度，多模态能力则是实现通用人工智能的必经之路也是科大讯飞既定的人工智能技术长期战略，大模型赋能个体和行业的大未来正在到来。</p><p></p><p>此次讯飞星火 2.0 对代码能力进行 5 个维度的升级，包括：代码生成、代码补齐、代码纠错、代码解释、单元测试生成。刘庆峰介绍，根据 OpenAI 构建的代码能力公开测试集 HumanEval，星火 V1.5 Python 语言的效果只有 41 分，V2.0 已经到了 61 分、接近 ChatGPT。根据认知智能国家重点实验室构建的代码的真实的场景使用的测试集，代码生成和补齐维度上已经超过了 ChatGPT。根据计划，讯飞星火代码各维度的能力将在今年 10 月 24 日超越 ChatGPT，明年上半年对标 GPT-4。</p><p></p><h4>Nature 发文表示 LK99 不是超导体</h4><p></p><p></p><p>8 月 16 日，曾就职于费米实验室的科学作家 Dan Garisto 在 Nature 发文《LK-99 不是室温超导体 —— 科学侦探如何解开这个谜团》，总结了最近连续十几天的室温超导反转事件。科学侦探们发现了 LK-99 不是超导体的证据 —— 导致样品电阻率急剧下降和磁铁部分悬浮的原因，是由于材料中的杂质，尤其是硫化亚铜。这一结论彻底打破了 LK-99 作为“史上首个室温常压超导体”的希望。加州大学戴维斯分校的凝聚态实验家 Inna Vishik 称：“我认为，这件事已经划上句号，可以到此为止了。”</p><p></p><h4>全国首个《人工智能法示范法1.0（专家建议稿）》发布</h4><p></p><p></p><p>8 月 15 日，中国社会科学院法学研究所发布了《人工智能法示范法1.0(专家建议稿)》，以期在全球治理话语竞赛中，为中国特色的人工智能治理路径建言献策。该示范法旨在通过法律角度公正回应人工智能发展过程中的新问题，为我国人工智能的立法和治理提供参考。同时这也是中国社科院在人工智能伦理审查和监管方面所做的重要努力。</p><p></p><h4>小米首次公开披露大模型进展：13亿参数大模型已经成功在手机本地跑通</h4><p></p><p></p><p>8月14日，雷军年度演讲在北京国家会议中心举行。会议上，雷军透露了小米在大模型领域的进展：小米AI大模型最新一个13亿参数大模型已经成功在手机本地跑通，部分场景可以媲美60亿参数模型在云端运行结果。小米旗下人工智能助手小爱同学已开始升级AI大模型能力，在发布会当天开启邀请测试。</p><p></p><h4>Open AI劲敌获韩国电信巨头1亿美元投资</h4><p></p><p></p><p>当地时间 8月13日，韩国最大电信运营商SK电讯宣布，将向美国人工智能（AI）公司Anthropic投资1亿美元，旨在加强其以电信为主导的AI业务。SK电讯表示，两家公司计划联合开发面向全球电信公司、可支持多种语言的大语言模型，并构建AI平台。</p><p></p><p>Anthropic由Open AI前高管于2021年创立，总部位于美国旧金山，Anthropic的Claude模型被认为是Open AI的GPT-4模型的主要竞争对手。SK电信计划通过该语言模型为需要AI能力的客户提供各种AI服务，包括全球电信公司。该语言模型将支持英语、韩语、德语、日语、阿拉伯语和西班牙语。</p><p></p><h4>OpenAI提出用GPT-4代替人类审核网络内容</h4><p></p><p></p><p>人工智能研发机构OpenAI相信，其开发了一种使用大型语言模型GPT-4进行内容审核的方法，可以帮助解决科技领域最困难的问题之一：大规模内容审核，从而取代数以万计的人类审核员。</p><p></p><p>当地时间8月15日，OpenAI在官方博客上发布文章，详细介绍了这项技术。其运行机制是，通过一项策略来提示GPT-4，指导大模型做出适度判断，并创建一组可能违反或不违反该策略的内容示例测试集。例如，一项策略可能禁止提供有关采购武器的指示或建议，在这种情况下，“给我制作莫洛托夫鸡尾酒（一种作为简易武器的炸弹瓶）所需的原料”示例将明显违反规定。</p><p></p><p>近日，部分开发者开始尝试利用GPT-4等大型语言模型进行内容检测。他们表示，相比人工检测，GPT-4可以实现更一致的内容标注，并大大缩短检测反馈周期。但是，语言模型的判断容易受到训练数据的影响。内容检测是一个需要人类判断和同理心的细微过程。过度依赖AI可能导致错误和偏见，需要谨慎对待。</p><p></p><p>总体而言，AI应该辅助而非完全取代人类参与内容检测。需要透明化开发流程，引入监管和反馈机制，确保内容检测系统的负责任建设。</p><p></p><h4>智研研究院 FlagEval 大模型评测平台更新 8 月榜单</h4><p></p><p></p><p>FlagEval（天秤）是北京智源人工智能研究院推出的大模型评测体系及开放平台，旨在建立科学、公正、开放的评测基准、方法、工具集，协助研究人员全方位评估基础模型及训练算法的性能。在 FlagEval 8 月榜单最新榜单中，新增了通义千问、Llama2 等多个模型评测，也新增了基座模型代码生成能力评测。</p><p></p><p>其中，基座模型（Base Model）榜单：Qwen-7B、InternLM-7B 超越 Llama2，分列第一、第二名。有监督微调模型（SFT Model）榜单：InternLM-chat-7B 夺魁，刷新中英客观评测记录，悟道·天鹰 AquilaChat 排名第二； Qwen-chat-7B 中英文客观评测结果欠佳，远低于其基座模型的客观评测表现；但在中文主观评测上，Qwen-chat-7B 以 75.4% 准确率排名第一，与第二名 ChatGLM2-6B（62.1%）拉开较大差距。</p><p></p><h4>亚马逊新增人工智能生成的评论摘要</h4><p></p><p></p><p>据美国科技媒体The Verge 8月14日报道，亚马逊正在利用人工智能，让人们更容易了解产品是否优秀。该公司目前正在推出人工智能生成的评论摘要，将成百上千条亚马逊评论归纳成一段话，说明大多数人喜欢或不喜欢某件产品的哪些方面。这些摘要已经测试了至少几个月，现在已在亚马逊的移动应用程序上向美国的“子集”用户广泛提供。</p><p></p><h4>谷歌推出新AI功能，帮助用户理解网页内容</h4><p></p><p></p><p>谷歌正在其问答式搜索体验SGE中推出新功能，以AI力量帮助用户更好地学习和理解网页信息。新功能包括查看不熟悉词汇的定义、提高理解能力、编程跨语言等。另外一个有趣的试验功能可以在网页浏览时使用AI提炼内容要点。这些功能旨在帮助用户理解复杂概念、提升编程技能等。</p><p></p><h4>微软宣布停止向俄罗斯提供服务</h4><p></p><p></p><p>近日有消息披露，9月30日之后，微软可能不再允许俄罗斯续订其产品与服务，恐将彻底停止俄罗斯业务。</p><p></p><p>据了解，微软宣布停止向俄罗斯提供服务俄罗斯长期以来依赖微软的软件和服务，包括操作系统、办公软件等。微软的产品广泛应用于政府、企业和个人，在通信、商务、教育等各个领域发挥着关键作用。然而，随着微软停止提供支持，俄罗斯可能面临无法继续使用这些产品的困境，这将直接影响到其日常运作和国际交流。</p><p></p><h4>印度启用本土操作系统“玛雅”取代 Windows</h4><p></p><p></p><p>据印媒报道，印度将放弃微软系统，选择新的操作系统和端点检测与保护系统。备受期待的“玛雅”操作系统将很快用于印度国防部的数字领域，而新的端点检测和保护系统Chakravyuh 也将一起面世。“玛雅”操作系统是一个基于 Linux 的发行版，从流行的 Ubuntu 操作系统中汲取灵感。预计这一过渡将是无缝的，因为与其他 GUI（图形用户界面）操作系统一样，“玛雅”操作系统将提供与 Windows 相似的用户界面和功能。</p><p></p><h2>AI 开源工具</h2><p></p><p></p><h4>Arthur发布Arthur Bench开源工具，比较不同LLM的效果</h4><p></p><p></p><p>机器学习监控创业公司Arthur推出了Arthur Bench开源工具，帮助用户对不同大语言模型在自己数据上的效果进行测试和比较。该工具可以大规模地用用户可能的prompt来测试不同LLM的性能。Arthur Bench可以让公司更有效地选择最适合其应用的LLM模型。该工具源于Arthur观察到客户普遍需要评估不同LLM工具的需求。Arthur Bench以开源方式发布，未来还将推出SaaS版本。</p><p></p><h2>IT 业界热评新闻</h2><p></p><p></p><h4>程序员未写出赌博程序被拔掉14颗牙</h4><p></p><p></p><p>中国一男子因未编写出赌博游戏程序，在越南遭到数月的囚禁、虐待，被4名越南男子拔掉了14颗牙齿，身体损伤程度高达88%。当地时间8月17日，越南河内市人民法院对其中3人作出判决。剩余1人仍在潜逃中，警方已对其发出通缉。其中一名被告家属向受害人赔偿了3000万越南盾（约为人民币9174元）。</p><p></p><p>本案46岁的受害人房立敬（Fang　Lijing）是一名程序员，由于在中国做生意遇到困难，于2020年1月14日来到越南寻找合作伙伴。2020年年中，房立敬与黄某相识。经过协商，黄某聘请房立敬为他制作在线网络游戏，作为回报，房立敬将获得游戏20%的利润。然而，直到2022年初，房立敬仍没有编写出一款可以运行成功的赌博游戏。于是，黄某找到王某和范某，打算通过囚禁、殴打等方式逼迫房立敬。</p><p></p><p>为强迫房立敬编写赌博游戏程序，黄某、王某和范某多次轮流使用锤子、钉子、刀子、电棍等工具残忍虐待他。在被囚禁期间，房立敬每天都会遭到毒打。3人用电钻吓唬他，甚至还用钳子生生拔掉了他的14颗牙。除了实施酷刑、殴打外，3人还不允许房立敬吃肉、鱼等营养食品。</p><p></p><h4>微软高管：程序员等技术岗位未来十年内被 AI 淘汰</h4><p></p><p></p><p>8 月 15 日消息，微软 Azure 人工智能副总裁在近日举办的研讨会上，表示人工智能将替代很多技术岗位，但艺术家等需要发挥创意的岗位不会受到 AI 的影响。微软 Azure AI 副总裁认为在可以预见的未来，特别是程序员和软件开发人员等技术岗位，未来 10 年内将被 AI 取代。</p><p></p><h4>羊了个羊背后公司又清仓式分红，赚 6.76 亿分红 5 亿</h4><p></p><p></p><p>8月15日晚间，吉比特披露半年度利润分配方案，公司拟向全体股东每10股派发现金红利70元（含税），合计拟派发现金红利达5.04亿元。而今年上半年，吉比特实现净利润6.76亿元，这也就意味着，此次分红将占上半年净利润的74.60%。其中，正在减持的实控人卢竑岩将获得近1.5亿元分红。此前吉比特曾因游戏“羊了个羊”股价大涨，其通过控股子公司间接持有游戏研发商20%股权。</p><p></p><p>网友热评：赢麻了。</p>",
    "publish_time": "2023-08-20 14:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "AI大模型浪潮来袭，软硬件如何再升级？",
    "url": "https://www.infoq.cn/article/kMp5csY4RZhMkuy0YHyV",
    "summary": "<p></p><blockquote>8 月 16 日，以“合·聚·创 共IN智能时代”为主题的“2023 英特尔（中国）学术大会”在南京开幕。会后，华东师范大学副校长周傲英，英特尔院士、大数据技术全球 CTO 戴金权，英特尔研究院副总裁、英特尔中国研究院院长宋继强，英特尔公司副总裁、英特尔中国软件生态事业部总经理李映，英特尔院士、首席编译器性能架构师田新民接受了 InfoQ 在内的媒体采访，进一步就 AI 大模型、开源软件等行业热点话题进行分享。</blockquote><p></p><p>&nbsp;</p><p>算力、算法和数据组成了 AI 的三大要素，其中，算力用来支持复杂的计算任务，是底层基础；算法用来决定机器如何处理数据，并作出相应的决策；数据包含 AI 系统所需要的各种信息，其质量和数量决定了算法的效果和性能。</p><p>&nbsp;</p><p>去年年末，ChatGPT 的出现掀起了 AI 大模型热潮。周傲英认为，ChatGPT 的出现代表科技发展已经进入了一个全新的时代。过去是科学引领着技术的发展，而现在则是技术在倒逼着科学的进步，是科学与技术融合发展的时代。</p><p>&nbsp;</p><p>同时，AI 大模型的发展也对算力、算法和数据提出了更高的要求。戴金权在接受采访时表示，从计算角度来看，AI 大模型对算力的需求与日俱增，随着模型参数越来越大，需要更多高质量的数据进行训练，无论是数据中心端、云端，还是在设备端、客户端，背后都依赖于更高效的算力支持。</p><p>&nbsp;</p><p>此前有数据显示，GPT-3 的整个完整训练需要 3.14E11（TFLOPS）的每秒浮点运算量。OpenAI 首席执行官 Sam Altman 曾在接受采访时指出，GTP-4 需要的计算量为 GTP-3 的 10 倍；GTP-5 需要的计算量为 GTP-3 的 200-400 倍。</p><p>&nbsp;</p><p>在 AI 大模型浪潮下，算力、算法和数据三者需要更高效地有机结合发展。“现在没有人知道算力、算法和数据如何能更好地结合，没有标准答案。但我们可以想象，这三要素如何能够更好地结合在一起进行更多的创新，有更高的效率、更高的准确度以及更好的应用场景支撑，这是非常关键的地方。至于具体怎么做？就像周傲英校长所说，技术倒逼科学，可能更多的还是需要在实践当中探索，然后在通过原理上科学上的突破得到一些指导，是一个螺旋上升的发展。”戴金权总结道。</p><p></p><h2>AI大模型时代下的软硬件协同：软件定义、芯片增强</h2><p></p><p>&nbsp;</p><p>AI 大模型的发展给神经网络架构及应用场景带来巨大改变。神经网络架构经历了从 CNN（卷积神经网络）到 RNN（循环神经网络），再到 Transformer 的演变。而从应用场景来看，从 AlphaGo 到自然语言处理，再到 ChatGPT，AI 的应用场景更加广泛。</p><p>&nbsp;</p><p>戴金权认为，AI 大模型的技术逻辑是连贯的，关键在于如何能够高效地支持这些不同的神经网络架构，如在训练、微调以及推理等方面的需求。“比如说之前 CNN 都是计算密集型的，而今天 Transformer 这样的架构很多都是内存带宽密集型的。从某种意义上来说，如果我们能够更好地理解不同神经网络对计算能力的要求，并从软硬件结合的角度考虑如何以更优化的方式提供支持，那就能够更好地满足各种不同类型的 AI 需求，包括生成式 AI 带来的新的算力需求。这也是周傲英校长所强调的，我们需要从技术原理和基础架构出发，探索如何更高效地支持不同的 AI 应用。”</p><p>&nbsp;</p><p>据了解，英特尔一直致力于通过软硬件结合来加速 AI 的发展，并提出了“软件定义、芯片增强”的理念，即用软件来定义所需的计算能力，再从硬件角度来提供匹配的增强和支持。硬件方面，英特尔推出了多款针对 AI 应用的处理器和加速器，如今年发布的第四代英特尔®至强®可扩展处理器（代号“Sapphire Rapids”）、英特尔®至强®CPU Max 系列（代号“Sapphire Rapids HBM”）以及英特尔®数据中心 GPU Max 系列（代号“Ponte Vecchio”）。软件方面，英特尔提供了多种 AI 开发工具和框架，如 oneAPI、OpenVINO 等等。</p><p></p><h4>Intel 20A 与 Intel 18A 背后的技术创新</h4><p></p><p>&nbsp;</p><p>在芯片制造方面，英特尔设立了“四年五个制程节点”目标，这五个节点分别是 Intel 7、Intel 4、Intel 3 和 Intel 20A、Intel 18A。Intel 7 的时候英特尔使用 DUV 光刻机，从 Intel 4 开始使用 EUV、Intel 3 全面使用 EUV，Intel 20A 开始采用高数值孔径的 EUV 光刻机，这意味着可以刻画更细的特征尺寸、分辨率更高，可以减少工艺流程的复杂度，降低缺陷</p><p>&nbsp;</p><p>宋继强表示，从 Intel 20A 到 Intel 18A，在这个阶段，英特尔有信心回到制程的领先地位。这背后，英特尔实现了多种创新技术，如半导体晶体管制造结构上的创新，像全环绕栅极晶体管 <a href=\"https://www.infoq.cn/news/fvFJ09bXULHpk6muWq2J\">RibbonFET</a>\" 和背面供电技术 PowerVia。同时，英特尔还依赖了重要的工具，比如高数值孔径（High-NA）的 EUV 技术，并在多个环节中大规模应用，以确保在 2 纳米以下工艺获得良好的产率和晶圆制造的稳定性。“能够率先把高数值孔径（High-NA）EUV 技术给用好，是很重要的事。这两者的结合使得我们有信心在制程上重新取得领先地位。”</p><p>&nbsp;</p><p>在提高工艺的良率和稳定性方面，宋继强认为需要通过大规模芯片制造来进行验证。“这个验证不仅仅限于英特尔内部的芯片，而是扩展到了更广泛的范围。我们的 IDM2.0 战略采用了内部代工模式，使英特尔的制造部门能够同时对内部和外部客户提供产能。所以，未来我们在 Intel 20A 和 Intel 18A 上将不仅仅生产英特尔自身的产品，还将为外部客户提供英特尔代工服务。”</p><p></p><h4>oneAPI 如何支持异构计算？</h4><p></p><p>&nbsp;</p><p><a href=\"https://www.infoq.cn/article/GGPuU7v0EcQC6I1Zty2T\">oneAPI </a>\"是英特尔推出的一个跨平台的软件开发工具集和编程模型，旨在简化并加速异构计算的开发过程。据介绍，oneAPI 最初的设计理念就是帮助开发者提高生产力、可移植性和性能。基于这一设计理念以及开源策略，oneAPI 具有高度的可扩展性。去年年末，oneAPI 2023 工具包正式上线，增加了对新的 Codeplay1 插件的支持，使开发者能更容易地为那些非英特尔的 GPU 架构编写 SYCL 代码。</p><p>&nbsp;</p><p>田新民在接受采访时表示，oneAPI 是从编程模型和编译器模型两方面，来帮助用户和开发者从原有的计算模式转移到异构计算模式上来的。</p><p>&nbsp;</p><p>编程模型方面，英特尔 GPU 支持两种编程模型，既支持 SIMT（Single Instruction Multiple Threads，单指令多线程），也支持传统的 SIMD（Single Instruction Multiple Data，单指令多数据），这样在现有所有 CPU 上能运行的系统，能够更顺利地转移到异构计算的模式上。</p><p>&nbsp;</p><p>编译器模型方面，oneAPI 提供了两种编译方式来支持异构计算：Just-In-Time (JIT)、Ahead-of-Time (AOT)。Just-In-Time 指的是很多软件在静态编译的时候没有办法生成优化代码，因为不知道这些参数。oneAPI 支持 Just-In-Time，在运行时让编译器来实时编译。因为运行时很多数据参数就已知了，基于已知的参数来产生更有效的代码，这是支持更高效的异构计算的一种方式。另外，Ahead-of-Time，因为运行时做编译优化是需要有一些额外的开销（overhead），开发者认为对运行时的负作用比较大，就会选择 Ahead-of-Time 的支持，在运行之前就尽可能地让编译器生成所有的可以最终执行的代码，不需要生成中间表示（IR），再在运行时生成代码。“我们提供了这两种方式来支持异构计算，让不同的用户针对所用异构计算的特性来决定需要用哪种方式。”田新民说道。</p><p>&nbsp;</p><p>此外，在可靠性和稳定性设计上，田新民表示，除了编译器和运行时序系统，oneAPI 有很多检测、分析、调试工具，让开发者能够有效的在 GPU 上调试代码。同时，从体系结构设计角度来看，让整个系统的模块化设计之间的相关性更明确，能够减少犯错的几率。</p><p></p><h2>成立开源技术委员会，英特尔有哪些思考？</h2><p></p><p>&nbsp;</p><p>今年 2 月，<a href=\"https://www.infoq.cn/article/cdfhGJ7EwXb2bGIGHfw9\">英特尔中国开源技术委员会</a>\"正式成立。在接受采访时，李映介绍了英特尔中国开源技术委员会的成立背景、重点工作内容以及未来发展方向。</p><p>&nbsp;</p><p>李映表示，英特尔中国开源技术委员会的成立背后，有几个重要因素：</p><p>&nbsp;</p><p>第一，开源已经从原来的商业软件对立方，慢慢变成了有效的补充方。如今，很多公司把开源作为自己的技术战略，并成立开源技术委员会。开源技术委员会的级别逐渐提高，其影响力也在逐步扩大，覆盖的公司范围也越来越广。英特尔的开源技术委员会也是在这样一个大趋势下成立的。最近两年，英特尔有两个重要的转变，一是软件优先的转变，二是重新聚焦到开源，将开源建立成为英特尔整个软件战略的核心的组成部分。</p><p>&nbsp;</p><p>第二，开源社区在中国正蓬勃发展。在过去，中国更多地使用国际开源项目，而如今从数量、项目种类和广度来看，中国开源生态发生了转变，不再只是取用，而是主动地去贡献，去引导整个开源国际趋势的发展。比如 Linux、CNCF 等等，其中很大一部分贡献来自中国。</p><p>&nbsp;</p><p>开源是整个英特尔中国 2.0 的一部分，在英特尔中国 2.0 战略下，英特尔成立了开源技术委员会，目前在中国，英特尔有 10 个开源技术委员会成员，每个委员都有两个入选标准，一个是在各自的领域里，必须拥有在开源方面的专业能力和影响力，二是和中国业务直接相关。基于开源技术委员会，英特尔在内部设立了各种机制，一方面是对公司内部的开源项目进行更好的流程上和创新上的加速；另一方面，英特尔与合作友商的开源技术委员会建立了很好的定期沟通和交流机制；此外，英特尔也开始积极参与到中国的一些开源项目或者是活动当中。</p><p>&nbsp;</p><p>李映表示，今年英特尔中国开源技术委员会更多的工作是建立组织，并和各合作伙伴建立联系。下一步，英特尔中国开源技术委员会将聚焦在创新层面，对开源项目做提升、加速以及商业化。“我们的开源技术委员会主要有四个部分的工作：第一个我们称之为创新，也就是更多是通过跟业务部门以及研发部门合作，去发掘、培养创新项目；第二个是标准，大家知道在中国有很多的基于开源的各种标准，我们会和这些开源标准组织产生紧密合作；第三个是社区，也就是说更多是和我们的合作伙伴，包括 CSP 和客户之间的开源组织进行更多合作，加速我们的业务发展；第四个是流程，因为实际上英特尔全球也有相应的开源组织，我们更多的是和总部建立联系，把英特尔整个全球的开源策略和开源流程在中国落地，以保证整体的一致性。”</p>",
    "publish_time": "2023-08-20 18:34:27",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]