[
  {
    "title": "谁把视频云玩明白了？了解字节跳动视频处理系统的演进实践",
    "url": "https://www.infoq.cn/article/xVkQxlu5d0zRymRNWuPK",
    "summary": "<p>英特尔与行业领先技术媒体共同打造的《英特尔®️ 至强®️ 实战课》现已上线！本系列课程为互联网、医疗、金融、制造等行业提供有启发、可借鉴的实战案例，并分享基于第四代英特尔®️ 至强®️ 及英特尔数据中心产品组合成功落地实践的经验，为 IT 决策者、架构师和相关从业者输出最前沿的技术干货内容。</p>\n<p>超视频时代，用户对视频体验的需求日新月异，视频应用朝着高清化、交互性、沉浸式等方向演进。与此同时，视频云也不断加速对传统行业的延伸与渗透，在工业、教育、医疗等领域涌现出更多元的落地场景。千行百业“融视频”，为视频云市场带来了全新机遇与挑战：如何通过技术创新提供更深层次体验，满足不同场景的需要，实现体验和成本的最优化变得至关重要。点击观看完整视频 <a href=\"https://s2.uao.so/8hBMxAg8\">https://s2.uao.so/8hBMxAg8</a></p>",
    "publish_time": "2023-06-29 10:04:39",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "专注创新，摆脱基础架构束缚",
    "url": "https://www.infoq.cn/article/x50ruJZZalbwwpv0lx9K",
    "summary": "<p>亚马逊云科技中国峰会圆满落幕，现场有哪些重磅看点和亮点？<br />\n点击视频，直击亚马逊云科技中国峰会的精彩内容！</p>",
    "publish_time": "2023-06-29 10:05:26",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "生成式AI促进行业创新及业务变革",
    "url": "https://www.infoq.cn/article/FA3g9Bto9K5sUQcWMaqX",
    "summary": "<p>如何利用生成式 AI 带来行业创新与变革？<br />\n生成式AI的机遇与挑战在哪？<br />\n听听亚马逊云科技大中华区战略业务发展部总经理顾凡怎么说！</p>",
    "publish_time": "2023-06-29 10:05:53",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "AI浏览器扩展：一场新的安全噩梦",
    "url": "https://www.infoq.cn/article/t0EdXLLDE1Kmkl60bh9d",
    "summary": "<p></p><p></p><blockquote>“你们站在天才的肩膀上，还不知结果如何就急于完成一切。申请专利、打包上架，在午餐盒上发广告。然后就是卖钱，马上变现。”</blockquote><p></p><p>&nbsp;</p><p>这句话出自《侏罗纪公园》中备受欢迎的角色马尔科姆博士。尽管他在电影中指的是科研人员匆忙复活极度危险的恐龙，但在如今的人工智能热潮中，同样的观点似乎仍然适用。</p><p>&nbsp;</p><p>实际上，目前的人工智能局势可能比《侏罗纪公园》中更为危险。在电影中，科学家们复活的恐龙至少被控制在几个岛屿上，并由一家公司管理。然而，现实中的AI \"怪兽\"却无处不在，无论是在可见还是触及的范围内，人人都能感受到它的存在。</p><p>&nbsp;</p><p>距离ChatGPT发布已经过去了半年多，AI驱动的浏览器扩展程序迅猛发展。在Chrome Web Store中搜索“AI”，屏幕上会显示出密密麻麻的数百个选项，让人眼花缭乱。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/65/fb/65f501a044c524bdc620ce951b58dcfb.gif\" /></p><p></p><p>这些浏览器扩展的功能各不相同：有些可以帮助用户总结网页和电子邮件，有些可以快速生成文章或产品描述，甚至还有一些可以将纯文本转化为代码。</p><p>&nbsp;</p><p>然而，这些AI浏览器扩展也带来了各种安全风险。有些扩展本身就是恶意软件，借AI之名窃取用户数据；还有一些通过复制粘贴隐私策略来进行隐秘操作；当然，也有一些来自备受尊重和认可的品牌厂商。</p><p>&nbsp;</p><p>本文将重点关注员工如何使用AI技术，企业又该怎样管理这种技术渗透。我们将讨论三种常规安全风险类别，并探讨价值评估和应用限制方面的最佳实践。</p><p>&nbsp;</p><p></p><blockquote>确实，大语言模型（LLM）并不是真正的人工智能，因为它们本身并不具备真正的智能。但这里我们故且沿用这个不准确的表述。&nbsp;我们并不是真的将LLM比作恐龙，实际上，将人们关注点转移到无意义的AI末世论上，只会分散人们对现实数据安全和就业风险的关注。这纯粹是个比喻。</blockquote><p></p><p>&nbsp;</p><p></p><h2>恶意软件冒充AI浏览器扩展</h2><p></p><p>&nbsp;</p><p>AI浏览器扩展带来的头号风险，在于其中不少程序本身就是恶意软件。</p><p>&nbsp;</p><p>3月8日，Guardio报告称名为“快速访问ChatGPT”的Chrome扩展程序会劫持用户的Facebook账户，并窃取“存储在浏览器中的所有cookies——包括安全和会话令牌……”。更糟糕的是，尽管该扩展仅在Chrome商店上架一周，但每天仍有超2000用户下载。</p><p>&nbsp;</p><p>作为对报告的回应，谷歌删除了这款扩展，但更多扩展仍在不断涌现。而且各大主要平台似乎也没有监管这部分新技术的意愿或者能力。Guardio在报告中称，此次恶意扩展本应为谷歌和Facebook敲响警钟，但他们却毫无反应。</p><p>&nbsp;</p><p>这种对犯罪分子放任自流的态度可能会让这些巨头的用户感到震惊，因为人们天然认为能在Chrome商店上架的产品至少是通过了某种质量控制渡。引用Guardio报告中的说法，此次事件“给我们以往盲目信任大公司和知名品牌，把大部分线上活动无脑交给他们的行为狠狠打了一记耳光”。</p><p>&nbsp;</p><p>更令人不安的是，基于AI的恶意扩展往往把自己伪装成合法产品，毕竟接入ChatGPT API没啥门槛。传统意义上的恶意软件相对更容易发现，因为一旦发现下载的软件无法工作，用户马上就会意识到自己上了当。但AI时代下恶意软件可以舒舒服服躺在浏览器中，一边窃取数据一边正常提供AI功能。</p><p>&nbsp;</p><p></p><h2>合法AI扩展的安全风险</h2><p></p><p>&nbsp;</p><p>即使是最铁杆的AI支持者，也不能否认恶意浏览器扩展带来的风险。我们应当尽一切努力劝阻人们盲目下载。</p><p>&nbsp;</p><p>但说到合法AI浏览器扩展中的安全风险时，情况往往变得更复杂且充满争议。</p><p>&nbsp;</p><p>以下是一些潜在的安全问题：</p><p>&nbsp;</p><p>共享给生成式AI工具的敏感数据，可能被纳入训练数据、甚至被其他用户看到。</p><p>&nbsp;</p><p>我们讲个简单的小故事：假设你是一位企业高管，想给战略报告中加点料，所以使用AI驱动的浏览器扩展对文本做了润色。第二天，最大竞争对手的另一位高管要求AI猜测你们公司的战略是什么，接触过报告内容的AI很快给出了极为详尽且逻辑完整的答案！</p><p>&nbsp;</p><p>对此类泄密的担忧，已经促使Verizon、亚马逊和苹果明令禁止或严格限制员工使用生成式AI。The Verge在讨论苹果禁令的文章中指出，“考虑到ChatGPT在改进代码和启发思路等场景下拥有良好效果，苹果确有理由担心员工将机密项目的信息输入该系统。”</p><p>&nbsp;</p><p>浏览器扩展或AI企业本身面临数据泄露风险。</p><p>&nbsp;</p><p>公平地讲，任何一家合作供应商都无法彻底回避安全风险。但需要注意的是，行业中的龙头之一已经掉过坑。今年3月，OpenAI宣布发现一个bug，“导致某些用户会看到其他活跃用户聊天记录中的标题”，“某些用户会看到其他活跃用户的姓名、电子邮件地址、寄送地址”等付款信息。</p><p>&nbsp;</p><p>浏览器扩展的脆弱水平，取决于它们到底掌握着多少用户数据。即使是那些最“受人尊重”的扩展，在这个问题上也往往表现得含糊不清。</p><p>&nbsp;</p><p>版权、抄袭和法律问题仍是一团乱麻。</p><p>&nbsp;</p><p>从GitHub Copilot首次亮相的那一刻起，版权、抄袭和法律问题就始终悬在其头顶。LLM经常会生成与人类原作者高度相似的图片、文本和代码。目前还没有法律条款明确规定这是否构成侵权，但其中的危险相信大家都感受得到。另外还有输出代码本身的质量问题——LLM经常胡写一通，甚至照搬众所周知的安全漏洞。</p><p>&nbsp;</p><p>这些问题已经非常严重，因此6月5日Stack Overflow的志愿者版主们甚至举行了罢工，抗议该平台接收AI生成内容的决定。版主们在一封公开信中写道，AI将导致“不正确信息（即「幻觉」）和肆意剽窃的全面扩散。”</p><p>&nbsp;</p><p>AI开发者当然在努力缓解这些风险，但这是一条全新的赛道，对是非对错的区分在这里已经构成艰难的挑战。</p><p>&nbsp;</p><p>即使是像fireflies这类得到广泛使用的会议与视频转录扩展程序，也列出了“责任自负”的服务条款。他们要求用户自己负责保证其内容不违反任何规则，并承诺自行采取“合理的方式来保护此类数据的隐私和安全”。但这种冷冰冰的条文只会引起人们对于缺乏问责制的更多担忧。总之情况就是这么个情况，用不用在你自己。</p><p>&nbsp;</p><p></p><h2>AI的“无解”威胁：即时注入攻击</h2><p></p><p>&nbsp;</p><p>最后，咱们聊聊最为可怕的一种新兴威胁：网站通过接入的AI工具窃取数据。</p><p>&nbsp;</p><p>5月19日，Twitter上出现了关于此类滥用的首个案例。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/3e/3e6f867250a1432c727d6bcb1f4aaa2a.png\" /></p><p></p><p>&nbsp;</p><p></p><blockquote>这似乎是多款插件（WebPilot与Zapier）的首个概念证明，可通过相互组合的方式借由提示词注入攻击泄露私人数据。关于此次攻击的更多细节请参阅:&nbsp;<a href=\"https://t.co/R7L0w4Vh4l\">https://t.co/R7L0w4Vh4l</a>\"&nbsp;<a href=\"https://t.co/2XWHA5JiQx\">https://t.co/2XWHA5JiQx</a>\" — Simon Willison (@simonw)&nbsp;2023年5月19日</blockquote><p></p><p>&nbsp;</p><p>如果这种纯原理表述不够清楚，Willison又做出进一步解释。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/5d/5d14963365d9350d7ce75f5d6640e3cb.png\" /></p><p></p><p></p><blockquote>类似于我要求ChatGPT总结某个网页的内容，结果发现该网页中存在隐藏文本，会通过Zapier插件窃取我的最新邮件内容。— Simon Willison (@simonw)&nbsp;2023年5月22日</blockquote><p></p><p>&nbsp;</p><p>从LLM的固有特性来看，这类提示词注入攻击似乎永远无法消除。简而言之：LLM的基本用法就是根据输入的内容自动做出下一步决策。但如果这些输入本身就存在恶意，那LLM可能在诱导之下做出任何举动，甚至包括开发团队明确禁止的行为。</p><p>&nbsp;</p><p>目前还很难评估这种威胁会给数据治理和安全带来怎样的深远影响。但着眼于当下，无论从LLM、扩展还是插件的安全性还是负责任态度来看，威胁都已经客观存在。</p><p>&nbsp;</p><p>面对风险，唯一真正安全的选择就是：永远不要将联网AI接入关键服务或数据源。在诱导之下，AI可能输出任何它访问过的东西，而且这个问题根本就没有已知有效的解决方案。在答案出现之前，企业和员工都应当保持谨慎。</p><p>&nbsp;</p><p>定义哪些是“关键”数据和应用，并在制定政策时与员工充分沟通。这些应当成为任何AI项目的基本前提。</p><p>&nbsp;</p><p></p><h2>该为员工制定哪些AI政策？</h2><p></p><p>&nbsp;</p><p>AI革命爆发于一夜之间，我们还在适应这个美丽新世界。每一天，我们都了解到这项技术的更多应用——有好的、有坏的，也有种种令人畏惧的应用。不同行业的企业也因此面临着巨大压力，思考如何将AI科技融入自身业务。在这样的巨变背景之下，一时找不到方向也很正常。</p><p>&nbsp;</p><p>但作为负责制定AI政策的管理者，大家必须抓紧时间、尽快为员工的AI工具使用方式提供明确指导。</p><p>&nbsp;</p><p>首先，可以采取多种途径管理员工的AI工具使用行为。比如像苹果那样一刀切全面禁止，但这种办法对于想要鼓励员工探索AI潜力的公司来说太过极端。确实，在践行良好安全性的同时拥抱创新，无疑是项颇为棘手的工作。浏览器扩展就是最典型的例子——它们本质是对外的，通常默认处于启用状态。如果想要对这些扩展张开怀抱，我们至少需要遵循下列最佳实践。</p><p>&nbsp;</p><p>员工教育：AI扩展就像是刚从蛋里孵出的小恐龙，看似可爱但却需要审慎对待。而这一切，都要以员工教育为起点。大多数员工并没有意识到这些工具背后的安全风险，也不知道如何甄别扩展选项、可以共享哪些数据。管理者必须就这些风险开展员工教育，指导他们学会区分恶意产品与合法产品。</p><p>&nbsp;</p><p>白名单：即使完成了前期培训，我们也不能指望员工像专家那样熟悉各类扩展程序的隐私政策。因此，最安全的选择是根据具体情况将部分扩展列入白名单。哪怕无法彻底禁绝风险，我们也至少该从中挑选出相对更安全的选项，这也能避免员工因行动受限而选择影子IT这种更难管理的路线。在挑选扩展时，务必选择那些明确承诺不会将用户数据输入其模型的产品。</p><p>&nbsp;</p><p>可观测性和零信任访问：如果不清楚员工正在使用哪些扩展，那就没办法采取措施保护公司免受AI扩展的影响。为此，IT团队必须有能力查验公司内各团队，检测他们在使用哪些扩展。以此为基础，下一步就是自动阻止安装了恶意扩展的设备访问公司资源。</p><p>&nbsp;</p><p>我们在Kolide也采取了这样的方法。我们为GitHub Copilot编写了一个Check，用于检测设备上是否安装有Copilot并阻止其通过身份验证。管理员还可以编写自定义检查，根据实际需求阻止个别扩展。同样的，简单的阻断显然不会是管理政策的最终形态，管理者应该就选择工具的原因、有没有更安全的替代选项等问题与员工主动对话。</p><p>&nbsp;</p><p>但如果之前就检测并阻断了用户安装的扩展程序，那双方的对话过程难免会有些尴尬。Kolide公司CEO Jason Meller曾专门撰文讨论过这个问题：“对大多数团队来说，帮助最终用户带来的一点点好处，不足以驱使他们冒险跟对方撕破脸。”但这种拒绝与最终用户深度交流的习惯也给恶意软件创造了温床：“正因为很少有安全团队与最终用户建立起稳固的信任关系，恶意软件作者才得以利用这种沉默、获得突破口，最终造成严重破坏。”</p><p>&nbsp;</p><p>原文链接：</p><p><a href=\"https://www.kolide.com/blog/ai-browser-extensions-are-a-security-nightmare\">https://www.kolide.com/blog/ai-browser-extensions-are-a-security-nightmare</a>\"</p><p>&nbsp;</p><p></p><h5>相关阅读：</h5><p></p><p></p><p><a href=\"https://xie.infoq.cn/article/e52eb6f43d9353e8ada2cc16b\">AI&nbsp;服务器的王者时刻</a>\"</p><p><a href=\"https://xie.infoq.cn/article/62cd5195bd682bfb0e5ef9feb\">探秘 AI 算力革命与低代码平台：引领人工智能狂潮</a>\"</p><p><a href=\"https://xie.infoq.cn/article/0eac8854f1a72155698cb007b\">走难而正确的路！AI 时代，传统产业数字化建设必须更高、更快、更强</a>\"</p><p><a href=\"https://xie.infoq.cn/article/8b7df711b4f94818bf62b23c7\">AI 大底座，大模型时代的答卷</a>\"</p>",
    "publish_time": "2023-06-29 11:35:36",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "AI 浪潮下，如何体现云服务的价值？",
    "url": "https://www.infoq.cn/article/jJDtJDpRxtcGurUSO13N",
    "summary": "<p>6 月 27 日至 28 日，<a href=\"https://www.infoq.cn/article/kcOrMbjXFhyH0iVuSPEV\">2023 亚马逊云科技中国峰会</a>\"（下文称“峰会”）于上海顺利召开。在本次峰会上，我们似乎找寻到了云计算领域竞争对手均日渐成熟，而亚马逊云科技却能一直保持领先地位的原因——过去的十几年里，亚马逊云科技“基于客户需求，快速进行产品更新与技术迭代”的 Day one 理念，一直不断地追求基础架构层面的创新。</p><p></p><p>6 月 28 日上午，<a href=\"https://www.infoq.cn/article/TsBSbTXYbYqbG1lL3j4N\">亚马逊云科技</a>\"大中华区产品部总经理陈晓建进行了以《专注创新，摆脱基础架构束缚》为主题的演讲，在演讲中他分享了亚马逊云科技众多应用案例实践，阐明了亚马逊云科技在云基础架构方面的能力与创新及在全球布局方面做出的努力。</p><p></p><p></p><h2>一、企业亟需提高“用云”性价比</h2><p></p><p></p><p>随着企业数字化转型的需求增加、市场竞争的加剧，企业需要将业务和数据迁移到云上，以实现更高效的生产和服务，以适应市场的变化。所以我们也观察到越来越多的企业开始上云，然而上云的门槛并不低，需要考虑的东西非常多，比如技术能力、安全合规风险、成本费用、用户体验等，很多企业 CTO 表示，“想上云，但是有心而力不足”，大多企业目前提出了亟需降低云服务使用门槛、提高“用云”性价比的需求。</p><p></p><p>为了提高企业云服务使用的性价比，亚马逊云科技为用户提供全面和深入的算力支持，提供包括 Intel、AMD、 英伟达和自研的 CPU 及加速芯片产品，这其中最值得一提的就是亚马逊云科技的四个自研芯片：Nitro、Graviton、Inferentia、Trainium。</p><p></p><p>Nitro 是亚马逊云科技的第一款自研芯片产品，Nitro 主要有三个亮点：第一，做了高度轻量化的虚拟化；第二，实现网络层面的数据通信和存储的隔离；第三，实现了硬件级别的加密。有了 Nitro 之后，亚马逊云科技能够大大增强 EC2 整个实例应用的安全性，每个单元可以独立发展，也确保 EC2 所有实例运行的稳定。&nbsp; &nbsp;因为 Nitro 的出现，亚马逊云科技大大降低了推出一个新 EC2 实例工作的复杂性，使得其保持一个非常快的增长的速度，进一步降低客户成本，从而帮助企业达到降本增效的目标。最新一代 Nitro V5 芯片相比之前的芯片性能有大幅的提升，包括更快的转发率，包括更低的延迟，每瓦特性能提升 40%。</p><p></p><p>基于 ARM 架构的通用处理器芯片 Graviton 自 2018 年起，亚马逊云科技陆续推出三代 Graviton 服务器芯片，在去年的 re:lnvent 全球大会上，亚马逊云科技推出了自研的、基于 ARM 架构的高性能计算服务器 CPU 芯片 Graviton3E 芯片。纵观 Graviton 系列芯片的升级历程，Graviton3 计算性能提高 25%，浮点性能提高 2 倍，加密工作负载性能加快 2 倍；Graviton3E 特别关注向量计算的性能，跟前一代相比高 35%，这个性能提升对于像 HPC 高性能计算这样的应用来说是非常重要的。</p><p></p><p>从具体案例来看，在 HPL（线性代数的测量工具）上 Graviton3E 性能提升 35%，在 GROMACS（分子运动）上性能提升 12%，在金融期权定价的工作负载上性能提升 30%；同时，Graviton3E 和类似的 X86 的 EC2 实例相比，Graviton3E 还能节省 60% 的能耗。</p><p></p><p>如今 Graviton 系列芯片的优秀性能表现已经得到了充分验证，本届峰会上，陈晓建讲到的世界一级方程式锦标赛（下文简称“F1”）案例便充分体现了亚马逊云科技在算力资源、数据存储方面的能力。F1 利用 Graviton3 运行空气动力学模拟，可以用比以往快 70% 的速度开发新一代赛车，赛车压力损失可以从 50% 降低到 15% ，这使超车更容易，为车迷可以带来更多赛场的缠斗。此外，F1 通过 5000 多次单车和多车模拟，收集了超过 5.5 亿个数据点，帮助他们进行下一代赛车的优化。用 F1 团队表示，“Graviton3 让系统性能快了 40%，可以晚间运行模拟，第二天早上就能得出结果。”</p><p></p><p>在机器学习技术探索赛道中，目前亚马逊云科技已经发展出三代不同的机器学习芯片。在训练方面，亚马逊云科技先后推出的加速芯片 Inferentia 和 Trainium 覆盖了训练和推理的场景，能为企业提供最佳的性价比。因此，许多领先的 生成式 AI 初创公司，例如 AI21 Labs、Hugging Face、Runway 和 Stability AI 都选择 Inferentia 和 Trainium 作为他们整个研发和应用的平台。</p><p></p><p>在机器学习训练中，最重要的指标是训练效率和性价比。以 HuggingFace BERT 模型为例，基于加速芯片 Trainium 的 Trn1 实例的性能表现非常不错，从训练吞吐量角度看，其与同类型 GPU 实例相比，在单节点情况下，可实现 1.2 倍吞吐量的提升；在多节点情况下，实现 1.5 倍吞吐量的提升；从成本角度，单节点实现了 1.8 倍成本降低，集群的成本降低了 2.3 倍。</p><p></p><p>随着模型越来越复杂，很多时候靠一个单点的计算训练是无法满足用户的需求，在很多时候都需要一个分布式的训练，比如需要非常大规模的集群，通过 Trainium 便可以构建一个超大的集群，它可以有 3 万张的 Trainium 芯片，使企业可以获得云上 6 ExaFlops 的超算级性能。这背后涉及很多创新，比如更快的 EFA 网络以及 PB 级别的无阻塞网络互联等。</p><p></p><p>在机器学习推理中，推理往往要考虑延迟和吞吐，企业需要更高的吞吐力来带来更优的性价比，但是往往更高的吞吐率会带来更高延迟，所以开发者往往要在延迟和吞吐中权衡。Inferentia2 的设计就考虑到了兼顾吞吐和延迟的优化，如果拿一个基于 Inferentia2 的实例做测试，以自然语言处理领域常见的 BERT 模型为例，在 Inferentia2 上可实现高达 3 倍的吞吐提升，8.1 倍的延迟降低，4 倍的成本节约，使得企业开发者二者兼而有之。</p><p></p><p>另外值得一提的是，Inferentia2 在大语言模型中的表现也非常的突出。拿一个 OPT 模型来做测试，中等规模的 OPT 模型 OPT-30B 为例，相较于通用的 EC2 GPU 实例，Inferentia2 可实现 65% 的吞吐量提升，推理成本可降低 52%；660 亿参数级别的 OPT-66B，通用 GPU 实例已经显示内存不足的情况下， 而在 Inferentia2 上还可以实现每秒 351 个 token 数的吞吐量。</p><p></p><p></p><h2>二、“AI 创新”使算力需求井喷、运维复杂性增加</h2><p></p><p></p><p>随着 AI 大模型的发展，大模型应用规模呈爆发式增长，加速了未来计算时代的来临，引发了新的生产力革命，但同时也导致算力供不应求，在这个过程中，算力直接反映了数据处理能力的强弱，用户不仅需要更高性价比硬件的解决方案，他们还需要云厂商提供高度弹性化的伸缩。与此同时，巨大算力的增加，使企业云运维成本大大增加，如何降低云运维的复杂性也是企业目前面临的难题。</p><p></p><p>为了应对弹性算力的需求，亚马逊云科技提供超过 600 种不同的计算实例，处理器、存储、网络及各种周边服务均可与计算很好地结合，以积木的方式形成丰富的、灵活的计算实例资源，满足多种不同算力要求。</p><p></p><p>要知道，从存储层面，当数据规模达到 PB、EB 级别时，数据的存储方式非常重要。用户的数据存储可分为热、温、冷、冻四种类型，每种类型的存储成本和性能不同，都需要平衡。所以，亚马逊云科技提供多达八种的存储级别，包括高性能计算、机器学习和通用计算等，企业根据需要选择最合理的存储级别。</p><p></p><p>这其中最具有代表性的案例就是《阿凡达》的制作公司 Weta Digital，其在开发《阿凡达 1》时，他们自建了一个占地 10000 平方英尺的机房，构建 4000 台物理服务器和 35000 个处理器核心。然而，在开发《阿凡达 2 – 水之道》时，他们原有的集群已经无法满足需求。于是，亚马逊云科技为 Weta Digital 提供了从基础架构算力资源到云上制作堆栈、机器学习堆栈的一系列服务，Weta Digital 使用了包括 GPU 实例和 Spot 实例在内的多种计算实例以提供强大的伸缩性和优秀的性价比。</p><p></p><p>然而对于亚马逊云科技来说，仅仅对企业进行多种多样的芯片和高伸缩性的资源供给是远远不够的，亚马逊云科技还为企业提供了 Serverless 来降低云运维的复杂性。亚马逊云科技在 2014 年发布 Lambda 以来，已经相继发布了 105 多种 Serverless 新技术，包括解决 Java 应用冷启动问题的 Lambda SnapStart、可视化编辑器 Application Composer 等。用户可以根据应用的类型来选择不同的弹性和计算颗粒度。</p><p></p><p>全托管的 Serverless 使得开发者可以专注于业务开发，而不是基础设施的运维，也让系统能很容易的实现快速伸缩。为此，陈晓建在峰会上特别举了一个 Second Dinner 打造年度最佳移动游戏《Marvel Snap》的案例。《Marvel Snap》被 Second Dinner 工程副总裁称为“这是我们有史以来运营过的最顺利、最成功的游戏，正是因为我们选择了亚马逊云科技”。</p><p></p><p>Second Dinner 采用亚马逊云科技的 Serverless 架构来开发、构建和运行 Marvel Snap 游戏。整个游戏没有使用任何 EC2 计算实例或容器，而是由事件驱动架构实现。这种方法不仅帮助用户节省成本、加快应用开发速度，还减少了安全方面的隐患。亚马逊云科技的 Serverless 后台架构为其提供了完整的功能、安全和资源管理。最终，Marvel Snap 在启动时没有出现任何后端错误事件，这在游戏行业是前所未有的。此外，Marvel Snap 的开发人员在系统非常早期的测试阶段，就已经通过 Serverless 实现了每分钟 14 万请求的压力测试，要知道，这在云主机的时代是无法实现的，而这在亚马逊云科技的帮助下实现了“不可能”。</p><p></p><p></p><h2>三、企业正在把握全球性机遇，追求多元化市场</h2><p></p><p></p><p>放眼全球企业上云现状，当下大多数企业只是简单地将原来的系统搬到云上，尽管降低了成本，但并没有完全开发出云上的潜力。搬到云上并不算是真正的“上云”，最终还要让企业系统和业务在云上跑起来才是硬道理。很多企业渐渐的也意识到了这个问题，所以来自全球各地的企业上云需求和企业业务出海热对云厂商提出了更高要求，这就不仅需要云厂商的业务服务范围覆盖全球，同时还需要能够快速进行部署、高可用的服务及相关业务对于各个国家和地区的业务合规需求。</p><p></p><p>陈晓建在本届峰会上表示，全球布局已经成为很多企业的战略，然而云厂商想要完成全球布局一定需要满足企业对云服务的三个要求，即“无处不在的云服务”、“快速部署稳定系统”、“提供安全可靠的全球基础设施”，他通过亚马逊云科技已经在过去验证过的成功案例举证来验证自己的观点。</p><p></p><p>关于第一个要求“无处不在的云服务”，让创新快速抵达每一个角落是亚马逊云科技的使命。陈晓建拿 OPPO 举例，OPPO 的手机业务遍布全球，拥有数百个云上 VPC 和本地资源需要连接，由于不同国家有不同的安全合规要求，这增加了全球组网的难度，OPPO 希望全球业务独立运作，实现区域合规自治，同时拥有统一的管理。于是 OPPO 选择通过使用亚马逊云科技的 CloudWAN 广域网服务，通过本地网络提供商连接到亚马逊云科技，并通过中央控制面板和网络策略在几分钟内建立覆盖全球的专用网络。同时 OPPO 借助完整的网络视图，可以直观地了解整个网络的运行状况、安全和性能。另外值得一提的一个案例是，AXIOM 使用 Amazon SnowCone 来支持太空实验，成功环绕地球 240 次。目前亚马逊云科技的技术已经可以在太空这种极端环境中收集、处理数据，并做出实时决策。</p><p></p><p>关于第二个要求“快速部署稳定系统”，亚马逊云科技每个区域都由多个可用区组成，单一可用区的故障会影响其他可用区的业务，但通过解耦控制面与数据面，可以提高整体稳定性。蜂窝架构将系统分割成微小、独立、隔离的单元，有效控制故障影响。随机分片进一步优化蜂窝架构，通过随机分配客户访问，使单个单元故障不影响整个系统。我们还通过运营模型和部署机制保证云的弹性，并使用 COE 纠错流程防止问题再次发生。</p><p></p><p>拿中集集团来举例，中集集团使用亚马逊云科技的服务实现了 82 个企业级应用的上线，包括 SAP、仓储系统、CRM、SRM 和费控系统等，并实现了 20% 的成本节约。原 SAP 系统存在延迟问题，需容灾，造成资源占用。亚马逊云科技为其设计了新一代 SAP 架构，应用和数据库在同一可用区，延迟极低至 0.1 毫秒以内；容灾方面，RPO 为 0，RTO 不超 15 分钟，资源成本下降 18.7%。这套全新的 SAP 架构让中集集团获得了更强大的风险控制能力，业务连续性得到保证。</p><p></p><p>关于第三个要求“提供安全可靠的全球基础设施”，亚马逊云科技几乎满足全球所有国家和地区的合法合规的要求。比如生物医疗、联邦认证以及金融等行业，又比如 HIPAA、FedRAMP 和 PCI 这样高标准的合规要求。拿全球电子支付终端领先供应商 PAX 百富来举例，其在迁移多个重要 SaaS 应用至云上时，发现多供应商的安全服务标准不统一，无法满足支付安全要求，且难以集成和管理。亚马逊云科技便为其提供了安全合规服务（如 Amazon CloudHSM、Security Hub）以帮其保障用户支付信息安全和业务安全，满足 PCI 合规要求，并支持国际业务拓展。使用亚马逊云科技的产品使百富的产品交付周期缩短 40%，降低架构搭建及运维压力，节省 20% 成本。</p><p></p><p>陈晓建提到的以上三个方面，对企业用云需求进行了完整概括，而这也是云厂商帮助企业降低用云门槛、实现云基础架构创新的重要发展方向。云厂商需要从区域覆盖、安全和技术成本等方面进行全维度的升级，提供更好的云计算产品和服务，来满足企业的“既要、又要”。</p><p></p><p></p><h2>四、云厂商需要专注“创新”，摆脱基础架构束缚</h2><p></p><p></p><p>目前企业愈加难以满足日益增长的客户对快速、可靠和安全服务的期望，在提高自身系统的处理能力和存储能力的过程中，面对着巨大的算力需求和成本过高的可伸缩且安全的 IT 基础架构。</p><p></p><p>云计算基础设施的稳定和可靠，是云厂商的核心竞争力。然而，云计算作为数字产业的新基建，面临着行业高速增长的机遇，同时也在诸多领域存在着挑战，比如 AI 就是一次巨大的浪潮，在全球范围内都带来了巨大的市场机遇和发展潜力，但目前云基础架构还面临着把数据留在本地、延迟和带宽问题和连接稳健性等问题。</p><p></p><p>如果上升到云计算整个领域的发展的探讨，站在终端用户角度去看，在使用产品的过程中，用户实际更关注的是使用体验，当前基础设施要满足用户顺畅的体验需求，即算力喷发下产生的需求，需要在数据存储、数据节点通信及指令调度等层面进行一定的创新；站在企业开发者的角度去看，高效开发、低成本运维是开发者最关注的问题，在云基础架构体系中，工具链的使用、性能调优方式、性能工具的创新是未来主要发展点。此外服务的部署、管理、跟踪、调试等各个环节管理和运维工具的创新，以及企业如何降低运营成本也云计算厂商持续研究并创新的课题。</p><p></p><p>所以，未来只有软硬一体的生态化发展，才能帮助行业更好地完善基础设施，从而为企业数字化转型、降本增效的大目标实现保驾护航，而这一点亚马逊云科技做到了。亚马逊云科技的网络安全芯片 Nitro 系列、服务器芯片 Graviton 系列、人工智能（AI）推理芯片 Inferentia、AI 训练芯片 Trainium 系列的四大自研芯片业务线，从高性能计算、至广至深的云计算实例选择、存储、网络安全、可靠等方面都显示出了绝对的性价比及绝对优秀的能力。</p><p></p><p>同时，我们从亚马逊云科技的每一个实例与案例中也可以看到，亚马逊云科技这些年来从技术上做的创新与帮助全球范围内的客户完成技术创新，为的就是突破当下云基础架构的“束缚”，不断探索新的云计算技术和应用模式，实现业务创新和发展，这为行业内的其他厂商起到了“带头羊”作用。希望<a href=\"https://www.infoq.cn/article/C6ZjsPGuFWk6LBP7i48E\">亚马逊云科技</a>\"在未来可以与全球更多企业共同推动云计算的发展，为行业发展不断注入新动力。</p>",
    "publish_time": "2023-06-29 13:44:47",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "OpenAI 又赢麻了！谷歌 DeepMind 创始人刚称 Gemini 能碾压 GPT-4，OpenAI 的挖人大计就出炉了",
    "url": "https://www.infoq.cn/article/AsiUxMs8ARkZEkuEZYgL",
    "summary": "<p>&nbsp;</p><p>谷歌在上个月的开发者大会上公布了一系列AI新项目，当时首次亮相的Gemini曾受到不少嘲讽。但近日，DeepMind 联合创始人兼CEO Demis Hassabis自曝，工程师们正在使用AlphaGo的技术来开发Gemini，其强大程度有望超越OpenAI的当家花旦ChatGPT。</p><p>&nbsp;</p><p>在AlphaGo的加持下，Gemini 瞬间备受关注。在2016年，谷歌&nbsp;DeepMind人工智能实验室打造的AlphaGo程序成功击败围棋世界冠军，写下了AI发展史上的一页新篇章。</p><p>&nbsp;</p><p>仍在开发当中的DeepMind Gemini是一套专门处理文本的大语言模型，其本质与ChatGPT家族的GPT-4相似。根据此前的介绍，Gemini 一开始就以多模式、高效的工具和 API 集成为目标而创建，旨在支持未来的创新，例如内存和规划。经过微调和严格的安全测试后，Gemini 将提供各种尺寸和功能。</p><p>&nbsp;</p><p>现在，Hassabis表示，他的团队将GPT技术与AlphaGo的特性加以结合，希望赋予系统规划和解决问题的新能力。“从宏观来讲，大家可以把Gemini理解为结合了AlphaGo系统优势与大模型令人惊叹的语言能力。我们还做出了其他非常有趣的创新。”</p><p>&nbsp;</p><p>之前谷歌开发者大会上，谷歌CEO Sundar Pichai 也说道，“虽然还为时过早，但我们已经看到了之前型号中未曾见过的、令人印象深刻的多模式功能。”</p><p>&nbsp;</p><p></p><h2>DeepMind：下一代大模型碾压GPT-4</h2><p></p><p>&nbsp;</p><p>要训练出OpenAI GPT-4这样的大语言模型，研究人员需要将书籍、网页和其他来源处的大量精选文本输入到Transformer机器学习软件当中。模型会利用训练数据中表现出的模式，熟练预测一段文本之后应该出现的一个个字母和单词。这种简单的文本预测机制在回答问题、生成自然语言/代码方面被证明拥有强大的潜力空间。</p><p>&nbsp;</p><p>要进一步开发ChatGPT及类似功能的语言模型，DeepMind认为还有另一个重要的附加步骤，就是使用基于人类对AI模型答案做出的反馈，进而借助强化学习提高其性能。DeepMind在强化学习方面的丰富经验，也许能让研究人员为Gemini赋予更多新颖能力。</p><p>&nbsp;</p><p>AlphaGo基于DeepMind首创的强化学习技术。这项技术要求AI模型在问题之上反复尝试并接收关于性能的反馈，据此设计接下来将要采取的行动（例如围棋或电子游戏），从而让软件一步步学会解决棘手问题。它还采用所谓“树搜索”方法，以探索并记住棋盘上可能采取的各种动作。如果这一思路能够帮助语言模型迎来下一次重大飞跃，则新AI或能在互联网和计算机上执行更多种类的任务。</p><p>&nbsp;</p><p>Hassabis和他的团队也许还会利用AI领域的其他思路继续增强大语言模型。DeepMind研究人员的关注领域涵盖机器人、神经科学等诸多方向。本周早些时候，该公司展示了一种算法，能够学习借助不同类型的机械手臂完成操作任务。</p><p>&nbsp;</p><p>人们普遍认为，跟人类和其他动物一样，AI的能力提升也需要从现实世界中学习客观经验。一部分AI专家相信，语言模型的最大限制就是只能通过文本以间接方式了解世界。</p><p>&nbsp;</p><p>Hassabis坦言，Gemini目前仍在开发当中，且整个过程需要几个月时间，成本则在数千万到数亿美元之间。OpenAI公司CEO Sam Altman曾有4月表示，GPT-4的开发成本超过了1亿美元。</p><p>&nbsp;</p><p>Hassabis的任务就是加快谷歌的AI开发进度，同时管理种种未知的潜在风险。最近一段时间，语言模型的快速进步已经令AI专家（包括部分算法专家）感到担忧，害怕这项技术被恶意滥用或者变得难以控制。某些内部技术人士甚至呼吁暂停开发更强大的算法，避免匆忙之中造成重大威胁。</p><p>&nbsp;</p><p>Hassabis认为，AI技术的确拥有巨大的潜在助益，例如在健康或气候等领域推动科学发现，所以人类探索AI的脚步绝不能停止。但他也强调，强制叫停研究明显脱离实际，基本没有可行性。“只要处置得当，AI将成为有史以来对人类最有益的技术成果。我们必须有勇气去追求这样的关键成果。”</p><p>&nbsp;</p><p>这也不是说Hassabis在一味强调快速开发AI技术。DeepMind早在ChatGPT出现之前，就一直在探索AI可能带来的各种风险。该公司联合创始人之一Shane Legg多年来一直领导一支内部“AI安全”小组。Hassabis上个月与其他备受瞩目的AI领袖一道签署了一份声明，警告称AI也许有一天会引发与核战争或全球流行病相当的严峻风险。</p><p>&nbsp;</p><p>Hassabis强调，目前最大的挑战之一就是确定更强的AI具体会带来哪些风险。他解释道，“我认为AI领域需要在评估测试等方面开展更多研究——这已经是一项非常紧迫的任务”，用以确定新AI模型的能力和可控性。为此，DeepMind可能会逐步向外部科学家开放自己的系统。“希望学术界能够尽早接触到这些前沿模型。”如果此观点得到落实，也许有助于解决科技巨头以外的AI专家被排除在最新研究之外的担忧。</p><p>&nbsp;</p><p>那我们究竟要不要为AI大爆发这样一个未来而担忧？Hassabis安慰道，其实没人真能确定AI会不会成为一种重大威胁。但他相信，如果AI研究继续以目前的速度推进，那业界确实没什么时间制定相应的保障措施。“我能切身观察到我们在构建Gemini时的一步步进展，相信这些成果都将发挥预期当中的作用。”</p><p>&nbsp;</p><p></p><h2>OpenAI：入驻 DeepMind 大本营</h2><p></p><p>&nbsp;</p><p>自从ChatGPT去年惊艳亮相以来，谷歌很快推出了自己的聊天机器人Bard，并将生成式AI技术应用至搜索引擎及其他众多产品当中。为了增强AI研究力度，谷歌公司还于4月将Hassabis领导的DeepMind部门与谷歌另一AI实验室 Brain 合并，建立起一个新的谷歌&nbsp;DeepMind。Hassabis表示，新团队将汇聚双方最近一段时间为奠定AI基础所积蓄的强大力量。“纵观我们在AI领域的进展，就会发现80%到90%的成果都来自这两支队伍。过去十年间，双方也都取得过辉煌的成就。”</p><p>&nbsp;</p><p>Hassabis本人曾经凭借AlphaGo掀起过一波AI热潮。所以面对如今这轮技术巨头争相投入的AI淘金之风，他显得颇有经验。但另一方面，其竞争对手 OpenAI 的扩张脚步也在继续。</p><p>&nbsp;</p><p>几乎在同一时间，OpenAI 宣布，将在伦敦开设其第一个国际办事处。OpenAI 首席执行官Sam Altman表示，当 OpenAI 伦敦办事处将专注于提升“研究和工程能力”，同时平衡与“当地社区和政策制定者”的合作。</p><p>&nbsp;</p><p>值得注意的是，伦敦是谷歌最大的人工智能研究部门 DeepMind 的长期总部基地。鉴于伦敦拥有著名的大学和丰富的学术历史，伦敦也是数据科学人才的源泉。OpenAI 这次海外扩张，将与谷歌在同一个城市近距离竞技。</p><p>&nbsp;</p><p>自 2015 年成立以来，OpenAI 一直没有扩展到旧金山总部以外的地方。Altman在一份<a href=\"https://openai.com/blog/introducing-openai-london\">声明</a>\"中表示，这次扩张是一次吸引世界级人才的机会。据报道，Altman 也<a href=\"https://t.co/GQD8JfUfw9\">提出将波兰和法国作为该办事处的替代选择。</a>\"其中，法国也被视为人工智能领域的领导者，谷歌和Meta 都在巴黎设立了人工智能实验室。</p><p>&nbsp;</p><p>此时，正值OpenAI 致力于创造利润之际。运行人工智能基础设施并不便宜，半导体研究公司 Semianalysis层<a href=\"https://www.semianalysis.com/p/the-inference-cost-of-search-disruption\">估计</a>\"OpenAI每天的成本约为 700,000 美元。考虑到这一点，英国的企业税比美国和其他欧洲国家低。</p><p>&nbsp;</p><p>广义上讲，伦敦也正在成为人工智能初创企业蓬勃发展的中心。根据最近的一份<a href=\"https://www.businesswire.com/news/home/20211215005874/en/The-UK-Leads-Europe-and-Ranks-Third-Globally-in-Artificial-Intelligence\">报告</a>\"，截至 2021 年，伦敦有超过 1,300 家人工智能公司，就风投资金而言，伦敦也是英国资金最多的城市。</p><p>&nbsp;</p><p>对于 OpenAI 等大量投资人工智能的科技公司来说，伦敦也有很重要的政治地位，这些公司试图说服英国管理机构对人工智能进行宽松的监管。</p><p>&nbsp;</p><p>在最近的一次游说之旅中，Altman 出现在伦敦大学学院，并呼吁“平衡”监管。Altman 威胁称，如果公司无法满足欧盟目前正准备出台的新人工智能（AI）立法规定，OpenAI可能会“停止在欧盟的运营”。据悉，该法案是人工智能行业第一套综合法规之一。后来，Altman<a href=\"https://techhq.com/2023/05/openai-ceo-backs-down-over-european-ai-act/\">收回了</a>\"这些评论。</p><p>&nbsp;</p><p>有趣的是，DeepMind 创始人中的Demis Hassabis和 ShaneLegg 就是相识于伦敦大学学院生命科学系的盖茨比计算神经科学小组。</p><p>&nbsp;</p><p>如今，OpenAI 在伦敦的办事处正在大量招聘，涉及各类研发、政策安全等岗位，是否会引发人才流动还未可知。但可以预见，OpenAI 与 谷歌 DeepMind 之间的竞争将会愈发激烈。</p><p>&nbsp;</p><p>参考链接：</p><p><a href=\"https://www.wired.com/story/google-deepmind-demis-hassabis-chatgpt/\">https://www.wired.com/story/google-deepmind-demis-hassabis-chatgpt/</a>\"</p><p><a href=\"https://techcrunch.com/2023/06/28/openai-brings-the-competition-to-deepminds-doorstep-with-new-london-office/\">https://techcrunch.com/2023/06/28/openai-brings-the-competition-to-deepminds-doorstep-with-new-london-office/</a>\"</p>",
    "publish_time": "2023-06-29 14:16:07",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "Electron末日来了？又一应用将其抛弃！WhatsApp强制推行原生应用：速度更快、内存占用更少",
    "url": "https://www.infoq.cn/article/BD6C1H329Sxm9tsbANC7",
    "summary": "<p></p><blockquote>Electron又被嫌弃了，让人又爱又恨的 Electron 还能扛起跨平台开发框架的大旗吗？</blockquote><p></p><p></p><h2>WhatsApp弃用基于Electron框架构建的桌面应用程序</h2><p></p><p>&nbsp;</p><p>近日，WhatsApp 正式弃用基于 Electron 框架构建的桌面应用程序，用户需切换到原生版本以继续使用。</p><p>&nbsp;</p><p>WABetaInfo 平台报告称，全体 Electron 版用户都会看到提示信息，上面写着“应用已过期”。屏幕还提供链接，指向 Microsoft Store 或 Mac App Store 上发布的本机 WhatsApp 桌面应用。这些本机应用虽然已经稳定交付约一年，但此番强制切换仍有些仓促。部分用户可能会抱怨过渡期太短，或者本机应用无法向商业用户提供全部功能，例如目录管理和快速回复。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/38/38449f35f931bc50e182e9bb80538398.png\" /></p><p></p><p>Electron 是使用 JavaScript、HTML 和 CSS 构建跨平台的桌面应用程序框架，基于 Chromium 和 Node.js，兼容 Mac、Windows 和 Linux。</p><p>&nbsp;</p><p>当 WhatsApp 处于开发早期时，有开发者基于 Electron JS 框架创建了一款桌面应用。项目成果带来一套共享代码库，能够在 WhatsApp Web、Windows 和 Mac 之上跨平台运行桌面应用。</p><p>&nbsp;</p><p>去年，WhatsApp 从头开始​​为 Windows 开发了一款新的本机应用程序，该应用程序采用了与 Windows 11 设计语言相匹配的全新现代设计，比如透明度、适应操作系统颜色主题的能力等等。除此之外，该应用程序还提供了更好的用户界面，允许用户共享消息、照片、视频和其他媒体内容，并允许用户拨打和接听音频和视频通话。</p><p>&nbsp;</p><p>与此同时，适用于 macOS 的原生 WhatsApp 也开始进行公开测试。据悉，起初该版本是封闭测试版，仅供 TestFlight 参与者使用，但目前已对公众开放。有报道显示，WhatsApp 团队使用了 Apple 的 Mac Catalyst 框架，开发人员可以更轻松地构建在 iPadOS 和 macOS 上运行的应用程序。不过目前，适用于 macOS 操作系统原生的 WhatsApp 桌面应用程序仍处于开发的早期阶段。</p><p>&nbsp;</p><p>在过去，通过 WhatsApp Web、Microsoft Store 上的本机应用以及基于 Electron 框架构建的全平台应用，用户一直可以在桌面系统上轻松访问 WhatsApp。从大概四周前开始，这款桌面应用的主屏幕上出现一个倒计时，宣布将在截止时间正式关闭。随着当前 WhatsApp 正式淘汰 Electron 这一分支，使得部分用户必须转向其操作系统对应的本机应用才能继续享受服务。</p><p>&nbsp;</p><p>WhatsApp 表示，原生应用程序主要具备以下优势：</p><p>增强了可靠性并提升了速度；专为桌面操作系统而设计并进行了优化；即使手机离线，也能继续接收通知和消息。</p><p>&nbsp;</p><p>有分析指出，WhatsApp 的种转变也有其充分理由。尽管 Electron 版应用功能丰富且运行便捷，但并未针对 macOS 或 Windows 系统进行过优化，因此在运行中会占用大量资源。这个问题在低端设备上体现得尤其明显。相比之下，新的本机应用针对各桌面操作系统进行了优化，在提供更高稳定性的同时降低了系统资源占用量。</p><p>&nbsp;</p><p>此外，WABetaInfo 还希望此举有助于促进 WhatsApp Business 工具程序的开发，避免Electron应用分解开发者群体的注意力。</p><p></p><h2>Electron的AB面：有人弃用，也有人选择</h2><p></p><p>&nbsp;</p><p>除了 WhatsApp，<a href=\"https://www.infoq.cn/article/uHD15zM6RUaMUPWq6rlf\">微软Teams</a>\"也弃用了&nbsp;Electron。</p><p>&nbsp;</p><p>2021 年，微软 Teams 高级副总裁宣布，Teams 将放弃 Electron，转而匹配微软自己的 Edge WebView2 渲染引擎以寻求性能提升。2023 年，微软宣布以公共预览版的形式，在 Win10 / Win11 系统上推出新版 Microsoft Teams 应用程序，正式从 Electron 过渡到 Microsoft 的 Edge WebView 2 渲染引擎。</p><p>&nbsp;</p><p>“2015 年，我们开始开发 Teams 时，选择 Electron 等框架可使跨平台 Web 和桌面客户端的快速交付成为可能，”该公司的公司工程副总裁 Sumi Singh 在博客文章中解释道。“然而，随着 Teams 的功能不断扩展，给设备资源带来了压力。认识到这一点后，我们开始分析可用技术、进行基准测试、构建原型并设计了一个在内部称为北极星的新架构。”</p><p>&nbsp;</p><p>微软协作应用程序和平台总裁 Jeff Teper 在一篇博文中表示，新版应用的设计核心是速度和易用性，“我们始终听取用户的反馈，于是我们围绕着速度、性能、灵活性和智能，重头构建了 Teams 应用。运行速度提高了 2 倍，同时使用的内存减少 50%，因此您可以节省时间并更有效地协作。”</p><p>&nbsp;</p><p>有人弃用 Electron，也有人坚定地选择它。</p><p>&nbsp;</p><p>2023 年 4 月 23 日，新版 Windows QQ 正式开启用户公测，采用全新 QQ NT 架构，以此实现了 QQ 架构的统一。而 QQ NT 技术的一个重点就是<a href=\"https://www.infoq.cn/article/PzQfDeSeXzhIacxzVSc9\">使用 Electron 作为新版 QQ 桌面端 UI 跨平台解决方案</a>\"。</p><p>&nbsp;</p><p>据了解，QQ 开发团队还在 Electron 基础上做了大量优化。比如，针对 Electron“占内存”的问题，QQ 根据不同的使用场景，在 Electron 与 N 用 Electron 开发多平台客户端的成本相对低很多。相比于大多数都能完全复用的代码，针对性优化成本可以忽略不计。</p><p>&nbsp;</p><p>同样是考虑到多端统一的需求，2017 年，GitHub 也曾使用 Electron 重写了 macOS 和 Windows 的客户端。</p><p></p><h2>写在最后</h2><p></p><p>&nbsp;</p><p>2017 年，Electron 可以说是 Web 应用在桌面平台发布的最佳、甚至是唯一选项。如今，虽然仍有众多知名应用都选用 Electron 来提供支持，但也有越来越多的应用选择弃用。</p><p>&nbsp;</p><p>腾讯微信客户端工程师方秋枋曾在接受 InfoQ 采访时表示，从框架开发者的角度来看，<a href=\"https://www.infoq.cn/article/SlBQ288e063_N2FdxkOe\">跨平台开发</a>\"的难点就在于处理平台差异性；从框架使用者的角度来看，难点在于如果框架出问题了，维护成本将会变得非常高。</p><p>&nbsp;</p><p>与此同时，跨平台框架存在很多通病，比如项目庞大后维护困难、第三方库良莠不齐、兼容上需要耗费更多精力等等。“跨平台意味着需要花费很多时间来解决平台差异性问题，同时要面临第三方库不够原生平台丰富健壮的现状。跨平台其实是牺牲部分功能和体验，换取开发速度和一致性的权衡，并不是业务开发的银弹。目前并没有一个能完善解决这些问题的解决方案。”方秋枋说道。</p><p>&nbsp;</p><p>参考链接：</p><p><a href=\"https://www.androidpolice.com/whatsapp-desktop-electron-dead/\">https://www.androidpolice.com/whatsapp-desktop-electron-dead/</a>\"</p><p><a href=\"https://faq.whatsapp.com/451924530376167/?cms_platform=web\">https://faq.whatsapp.com/451924530376167/?cms_platform=web</a>\"</p>",
    "publish_time": "2023-06-29 14:38:03",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "软件工程数智化研究报告—可观测应用篇 2023",
    "url": "https://www.infoq.cn/article/3Gb5DSoaFhi9jIzLhtMe",
    "summary": "<p></p><h3>研究背景</h3><p></p><p>近年来，随着云原生技术的兴起，以及敏捷开发和 DevOps 理念的普及，企业正在经历着一场基础设施和开发方式的变革。云原生技术的出现使得应用程序可以更加高效地运行于云环境中，从而帮助企业更好地应对业务需求的快速变化。而敏捷开发和 DevOps 理念的提出则使得软件开发变得更加迅速和高效，从而更好地满足客户的需求。</p><p></p><p>伴随着业务的转型，客户体验也成为了企业关注的焦点。为了提供更好的客户体验，企业需要确保其系统的稳定性和可靠性。在这样的背景下，对于传统监控系统的需求和期望也发生了变化。人们开始关注如何构建具有可观测性的系统，以更加主动地保障系统的稳定性。</p><p></p><p>2018 年，云原生计算基金会（CNCF）正式在其技术景观图（Landscape）中创建了「Observability」分组，将可观测性作为一个独立的技术领域。而在 2023 年，应用可观测性被 Gartner 列入「2023 年十大战略技术趋势」之一，可观测性在 IT 领域逐渐引起广泛关注。</p><p></p><p>然而，目前市场对于可观测性在中国的发展阶段、相关市场参与者与产品都还没有达成一致的认知。因此，InfoQ 研究中心联合中国信通院铸基计划，希望通过《软件工程数智化研究报告—可观测应用篇 2023》的撰写，解读以上问题。本报告将对当前市场上的各类参与者和可观测性解决方案进行分析，以期为企业和开发者们提供关于可观测性的最新研究成果和实践经验。</p><p></p><h3>目录</h3><p></p><p>中国可观测应用发展背景中国可观测应用发展特征中国可观测应用厂商案例解读中国可观测应用发展趋势研判</p><p></p><h3>可观测处在早期推广阶段</h3><p></p><p><img src=\"https://static001.infoq.cn/resource/image/7c/1b/7c889a399c1c5194d325516f7821c51b.png\" /></p><p></p><h3>可观测在中国已进入产品竞争期</h3><p></p><p><img src=\"https://static001.infoq.cn/resource/image/1c/7f/1cca6f6be3cc9a931f5b8302014f427f.png\" /></p><p></p><h3>四大参与方共同建设</h3><p></p><p><img src=\"https://static001.infoq.cn/resource/image/41/85/4128c385a77c4db868a66d6ca58b0285.png\" /></p><p></p><h3>专家致谢</h3><p></p><p>感谢观测未来 CEO，观测云品牌创始人 蒋烁淼、Apache Skywalking 创始人 吴晟、阿里云 智能产品专家 山猎等各位专家接受访谈邀请，发表许多对于可观测应用的深入看法与观点，为报告撰写提供了宝贵的行业认知和观点支撑。感谢中国信通院铸基计划在联合发布过程中给予的帮助，同样感谢中国信通院泰尔终端实验室数字生态发展部 主任 王景尧博士、中国信通院 高级工程师 吴荻博士，为分析中国可观测应用发展现状和趋势，提供了诸多想法和观点。</p><p></p><p>InfoQ 研究中心还将继续持续关注可观测领域，也欢迎各位行业内的专家就本报告的内容进行交流和讨论，共同助力中国可观测应用的发展。</p><p></p><p>扫码领取报告</p><p><img src=\"https://static001.geekbang.org/infoq/91/91b3d74649bc49091e4b24ce1776bd05.png\" /></p><p></p>",
    "publish_time": "2023-06-29 15:07:02",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "华胜认出席 ArchSummit 深圳，将分享《华为云交易系统低码化实践》话题",
    "url": "https://www.infoq.cn/article/LfSK2wCRyluLR9RGLA3F",
    "summary": "<p>7&nbsp;月&nbsp;21&nbsp;日&nbsp;-&nbsp;22&nbsp;日，&nbsp;在&nbsp;<a href=\"https://archsummit.infoq.cn/2023/shenzhen?utm_source=infoqweb&amp;utm_medium=teacherarticle&amp;utm_campaign=8&amp;utm_term=0531\">ArchSummit&nbsp;全球架构师峰会（深圳站）</a>\"，华为云高级工程师华胜，将于会上发表题为《华为云交易系统低码化实践》的演讲，具体介绍华为基于规则引擎和流程引擎构建的交易编排平台，分享华为云交易系统低码化实践经验。</p><p></p><p>华胜&nbsp;2015&nbsp;年加入华为，长期负责华为云订单系统的设计、开发和运维工作，保障华为云订购、续费、退订等核心功能的高可用性和稳定性；目前作为华为云交易编排团队的&nbsp;owner，基于低码化的思想从零构建了华为云交易编排平台。</p><p></p><p>相信通过华胜的分享，你将收获实现业务流程的低码化开发的经验，了解当前低码化架构面临的问题以及对未来的展望。</p><p></p><p>除上述议题外&nbsp;，ArchSummit&nbsp;深圳还将围绕<a href=\"https://archsummit.infoq.cn/2023/shenzhen/track/1537?utm_source=infoqweb&amp;utm_medium=teacherarticle&amp;utm_campaign=8&amp;utm_term=0531\">基础架构技术</a>\"、<a href=\"https://archsummit.infoq.cn/2023/shenzhen/track/1532?utm_source=infoqweb&amp;utm_medium=teacherarticle&amp;utm_campaign=8&amp;utm_term=0531\">DataOps、Data&nbsp;Fabric&nbsp;等高效数据开发与服务模式</a>\"、<a href=\"https://archsummit.infoq.cn/2023/shenzhen/track/1534?utm_source=infoqweb&amp;utm_medium=teacherarticle&amp;utm_campaign=8&amp;utm_term=0531\">Mesh&nbsp;技术实践案例</a>\"、<a href=\"https://archsummit.infoq.cn/2023/shenzhen/track/1535?utm_source=infoqweb&amp;utm_medium=teacherarticle&amp;utm_campaign=8&amp;utm_term=0531\">QUIC&nbsp;传输和架构优化</a>\"等进行分享。</p><p></p><p>数十位业界专家，上百个国内外一线大厂前沿技术案例，一定会给你带来很多全新的开发灵感。期待与你线下交流！&nbsp;现在购票，享&nbsp;9&nbsp;折特惠，立省&nbsp;¥880！咨询购票请联系&nbsp;18514549229（微信同手机号）</p><p><img src=\"https://static001.infoq.cn/resource/image/9d/aa/9d6a27547062ee2e089f91bdc4ba1eaa.png\" /></p><p></p><p></p>",
    "publish_time": "2023-06-29 15:21:41",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "中国企业研发高效能白皮书-企业级架构篇",
    "url": "https://www.infoq.cn/article/aKhGLkFF5sBYf5aFbSRt",
    "summary": "<p></p><h3>研究背景</h3><p></p><p>近年来中国企业研发正在从粗放型走向精益型，研发工作的“高效能”成为几乎每个研发团队共同的追求。</p><p></p><p>中国软件服务产业也在近 5-10 年中得到了飞速发展，技术服务的边界不断拓展，赋能研发高效的产品层出不穷，适合中国研发环境的技术服务体系在不断完善。从结果上看，中国企业正在高效能研发的路径上快速前进。</p><p></p><p>本份报告以中国高效能研发企业为研究对象，尝试解读市场中具有代表性的高效能研发解决方案。本次报告由五个篇章组成，如 CI/CD、企业级软件架构、价值流管理等主题。研究小组期待可以通过研究，帮助中国企业研发团队获得高效能研发新知。</p><p></p><p>企业级软件架构篇是本次报告的第三篇章，主要研究了企业级软件架构是如何帮助研发团队提升效率。该篇章不仅说明了企业级软件架构的概念和技术结构，而且对不同企业和团队的研发场景适配的产品形式进行解读。</p><p></p><p>同时，报告中也解读了极狐 GitLab 企业级软件架构的实例，并且预测了未来企业级软件架构未来的发展方向。</p><p></p><h3>报告目录</h3><p></p><p>关于企业级软件架构概念常见的企业级软件架构方案极狐 GitLab 企业级软件架构极狐 GitLab 企业级软件架构最佳实践企业级软件架构市场发展趋势展望</p><p></p><p>扫码领取报告</p><p><img src=\"https://static001.geekbang.org/infoq/81/818ffd6f75edbc7cd40d18b3d610022a.png\" /></p><p></p>",
    "publish_time": "2023-06-29 16:17:22",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "“驯服”可控大模型，白海发布一站式大模型微调平台IDP LM",
    "url": "https://www.infoq.cn/article/tz11dfIQZuuC7dOes3bV",
    "summary": "<p>ChatGPT的破圈之旅，拉开了大模型“诸神之战”的序幕，据不完全统计，2020年至2023年间，中国已发布了79个参数在10亿规模以上的大模型。而仅仅2023年前5个月，中国以19个大模型开发数量位居榜首，国内典型大模型包括：阿里的M6，百度的文心大模型，华为的盘古，科大讯飞的星火，商汤的日日新，智谱科技的ChatGLM&nbsp;等，共同打造完整的中国大模型生态链路。</p><p></p><p>然而，在大模型如火如荼的背后，幻觉（hallucination）倾向就越发的明显，它正在越发的生产着&nbsp;“完全没有出处的非真实内容”。这样对于商业化而言是一个巨大的挑战，来面对一个不可控、不可预测和不可靠的大模型。</p><p></p><p>而对于不同行业、场景和客户来说，大模型要落到垂直细分行业中，才能发挥其应有价值，可控的大模型才是有意义的。为了增强大模型在特定领域或任务上的表现，通常需要对基础大模型进行针对性的高质量微调。然而，如何实现高效和可控的微调是当前行业大模型构建面临的普遍挑战。</p><p></p><p>白海IDP(Intelligent&nbsp;Development&nbsp;Platform)&nbsp;LM致力于帮助客户克服这一挑战，通过提供一站式的大模型微调工具，来“驯服”大模型，实现用低门槛、高效和可控的方式来构建垂直行业专属大模型，具体目标包括为客户提供：</p><p>干净、准确的微调训练数据严格的反馈回流数据审核全面、综合的模型评估高效高性能的微调和推理服务</p><p></p><p>IDP&nbsp;LM工具化了大模型微调技术（RLHF）的全流程，不仅技术人员，业务人员也可以轻松进行模型微调。同时，IDP&nbsp;LM提供预训练的领域模型，极大地降低了大模型微调应用的门槛和冷启动成本。除低门槛、低成本外，我们一直坚信，对于大模型在具体行业或场景的应用落地，“可控”是必须的。</p><p></p><p>在去年Stable&nbsp;Diffusion的微调工具构建时，我们就明确了白海的生成式AI/大模型加速平台的SQL目标：即安全可控(Safe)+&nbsp;合格（Qualified)&nbsp;+&nbsp;低成本/低门槛&nbsp;(Low&nbsp;cost&nbsp;)&nbsp;。</p><p></p><p>“AI画作《太空歌剧院》为例，这幅画在美术比赛上拔得头筹惊艳四座，但背后生成了900多个版本，耗费80多个小时，才得到最终的作品。该画基于扩散模型生成，作为潜在变量模型，扩散模型赋予了AIGC开放性的创造力，但可控性仍不尽如人意，无法限制在一个具体的预期里，这对商业化会带来很多问题。”&nbsp;创始人卢亿雷曾表示，”不仅对于AI绘画模型如此，大语言模型的行业应用更是面临可控性的挑战。在实际的行业应用中，如金融、医疗等，问答的不可控会带来严峻的后果。“</p><p></p><p>因此，IDP&nbsp;LM除了在将大模型微调流程训练工具化外，在数据的处理、数据标注、数据审核和模型评估方面也提供了易用的工具和经验证的高效方法。</p><p>在数据清洗和数据增强方面，自动支持数据清洗、同义词替换、随机插入、随机删除、句子重组等。数据标注方面，我们提供适用于大模型场景的标注工具，如答案质量打分，答案补充，便捷高效的支持数据的标注和数据的训练应用。IDP&nbsp;LM同时提供自动化的反馈数据回流与应用，这一过程中，对反馈数据的质量审核至关重要。IDP&nbsp;LM为审核员提供了专门的看板，并基于系统算法提供审核建议和指导，保证反馈回流数据的质量、有效、无害。</p><p></p><p>大模型的有效评估也是影响模型效果的重要环节。IDP&nbsp;LM支持自动评估和人工评估，从准确度、安全性、稳定性、领域的专业适用性等角度，对模型效果进行严格把关。IDP&nbsp;LM目前已在交互式数字人、AI问诊等领域服务企业客户。我们将继续在重点行业深耕，为客户提供更加简单、易用、完善的大模型构建工具和解决方案支持。</p><p></p><p>我们始终以“让AI&nbsp;更简单、更快速、更高效“的使命为指引，IDP&nbsp;LM的推出是践行这一使命的重要一步。我们诚挚邀请行业客户和产业链的伙伴和白海IDP&nbsp;LM一同，推动大模型在各行业的应用价值创造，驯服可控大模型的为垂直行业及场景所用。</p>",
    "publish_time": "2023-06-29 16:56:46",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]