[
  {
    "title": "谷歌AI发布新的文本至图像Transformer模型Muse",
    "url": "https://www.infoq.cn/article/Qm3cdLptAtho0RjMXHkW",
    "summary": "<p><a href=\"https://arxiv.org/abs/2301.00704\">谷歌AI发布</a>\"了一篇关于<a href=\"https://muse-model.github.io/\">Muse</a>\"的研究论文，这是一种新的文本至图像生成技术，它基于掩码生成（Masked Generative）Transformer，可以生成与<a href=\"https://openai.com/dall-e-2/\">DALL-E 2</a>\"和<a href=\"https://imagen.research.google/\">Imagen</a>\"等竞争对手相媲美的高质量图片，但是速度要快得多。</p><p></p><p>Muse被训练为预测随机掩码图像的token，它会使用业已训练过的大型语言模型所生成的嵌入式文本。这项工作涉及在离散的token空间中进行掩码建模。Muse使用一个9亿个参数的模型，称为<a href=\"https://masked-generative-image-transformer.github.io/\">掩码生产transformer（masked generative transformer）</a>\"，以创造视觉效果，而不是采用<a href=\"https://en.wikipedia.org/wiki/Stable_Diffusion\">像素空间扩散</a>\"或<a href=\"https://en.wikipedia.org/wiki/Autoregressive_model\">自回归</a>\"模型。</p><p></p><p>谷歌声称，借助TPUv4芯片，可以在0.5秒内创建一个256*256的图像，而使用Imagen则需要9.1秒，根据谷歌的说法，Imagen使用的扩散模型提供了“前所未有的逼真程度”和“深度的语言理解”。<a href=\"https://en.wikipedia.org/wiki/Tensor_Processing_Unit\">TPU</a>\"，即张量处理单元（Tensor Processing Unit），是谷歌开发的定制芯片，专门用作AI的加速器。</p><p></p><p>根据研究，谷歌AI已经训练了一系列不同规模的Muse模型，参数从6.32亿到30亿不等，研究发现，预先训练好的大型语言模型，对于生成逼真的高质量图像至关重要。</p><p></p><p>Muse的性能也超过了最先进的自回归模型<a href=\"https://parti.research.google/\">Parti</a>\"，因为它使用了并行解码，在推理时间上比Imagen-3B或Parti-3B模型快10倍以上，根据使用同等硬件的测试，比&nbsp;<a href=\"https://stablediffusionweb.com/\">Stable Diffusion</a>\"&nbsp;v1.4快3倍。</p><p></p><p>Muse创建的视觉效果与输入中的各种语义成分相对应，如名词、动词和形容词。此外，它还展示了视觉风格和多对象特性的知识，如合成性（compositionality）和基数（cardinality）。</p><p></p><p>近年来，由于新的训练方法和改进的深度学习架构，<a href=\"https://en.wikipedia.org/wiki/Generative_model\">图像生成模型</a>\"有了长足的进步。这些模型有能力生成非常详尽和逼真的图像，在广泛的行业和应用中，它们正在成为越来越强大的工具。</p><p></p><p>原文链接：</p><p><a href=\"https://www.infoq.com/news/2023/01/google-muse-text-to-image/\">Google AI Unveils Muse, a New Text-To-Image Transformer Model</a>\"</p><p></p><p>相关阅读：</p><p><a href=\"https://www.infoq.cn/article/fQLOmK09dZIErQOQrDwD\">OpenAI 宣布 DALL·E 开放测试版：面向 100 万用户，有文字就能生成图片</a>\"</p><p><a href=\"https://www.infoq.cn/article/QhKzahCQ9bdTgAUobYUg\">谷歌最新 Imagen AI 在文本至图像生成方面优于&nbsp;DALL-E</a>\"</p>",
    "publish_time": "2023-02-13 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "三位行业专家主题演讲精华整理：共谋金融科技人才培养之路 | 第二届湾区金融科技高校分论坛",
    "url": "https://www.infoq.cn/article/lk8j300YC47WfAc9H497",
    "summary": "<p><a href=\"https://www.infoq.cn/video/JiD6qU8GNwgKA4lhg98e\">第二届湾区金融科技高校分论坛暨“2022 深圳国际金融科技大赛——西丽湖金融科技大学生挑战赛”颁奖典礼</a>\"于2月4日圆满闭幕，在<a href=\"https://www.infoq.cn/news/R8AtRHy0oZzzJ5I0muSV\">金融科技</a>\"主题演讲环节，微众银行首席人工智能官杨强教授、浙江财经大学盈阳金融科技学院张文宇院长、深大微众金融科技学院张凯院长分别进行了《可信联邦学习》、《跨学科金融科技人才培养之路：从智慧金融到群智金融》、《金融科技人才培养就业报告》主题演讲，从人工智能技术演进趋势到金融科技人才培养，内容丰富、实用，由浅入深地介绍了金融科技人才培养对于金融科技守正创新、高质量发展的重要意义，同时向社会清晰传达了产学研各侧对于加强金融科技专业化人才队伍建设的全面规划及决心。</p><p>&nbsp;</p><p>以下为杨强教授、张文宇院长、张凯院长的主题演讲精华内容整理：</p><p></p><p></p><h2>杨强书记：“可信联邦学习”是促进金融科技发展的利器</h2><p></p><p>&nbsp;</p><p>在人工智能的发展中，人们慢慢总结出一个道理：让计算机变聪明的方式并不是直接教育计算机，而是使用数据来影响计算机，将人类的思想和知识赋予在数据里，再让机器从数据里发现知识。这也带来了一些新问题：</p><p>数据不足是当前遇到的一个瓶颈；异构数据的处理，使用异构数据训练人工智能模型是当下的一个重要研究方向并且也是一个非常难的研究方向；人工智能和金融领域相结合时，用户隐私、法律、监管、审计等方面的要求带来了许多新的挑战。如：银行贷款反欺诈，多家医院联合建模等。</p><p>&nbsp;</p><p>数据可用不可见要求数据既要可用又要保证各个数据源之间、各个模型的服务器和数据源之间不可见，它在计算机行业已有四十多年的发展历史；在国家法律的领域，从 1995 年开始，在国内和国外都有了长足发展，尤其是在去年，国家发布了包括《数据安全法》、《个人隐私保护法》、《网络安全法》等几大法规。</p><p>&nbsp;</p><p>联邦学习的目的就是让数据可用不可见，这个“用”指的是在用人工智能建模的时候，需要使用不同数据源让模型增长，同时要保证数据不被泄露。多领域的结合是当今学科发展的重要标志，而往往多个学科的结合才是未来发展的一个趋势。联邦学习是一个综合的领域，除了有人工智能，还有包括差分隐私、安全计算、硬件可信执行环境等等在内的隐私计算。近两年，随着联邦学习被纳入 Gartner 技术成熟度曲线，处于技术创新萌芽期的联邦学习正受到越来越多地关注，成为下一代隐私计算发展关键。</p><p>&nbsp;</p><p>谷歌在最近几年发布了一个针对谷歌手机的联邦学习，其思想是通过结合多个终端和一个服务器，实现数据的可用不可见。然而，企业间分享的样本往往都有不同的特征，我们以微众银行为领先，发展了解决企业间数据合作问题的“纵向联邦学习”；又在去年率先提出“可信联邦学习”的概念，它要求：安全可证明、性能可使用、效率可控、决策可解释、模型可监管、普惠。</p><p>&nbsp;</p><p>解决“可信联邦学习”中的平衡问题，既需要建立一个共享的模型，又需要实现对恶意拜占庭共谋攻击的检测及防御。在算法层面，可以通过图计算早期发现攻击的可能性；同时还可以利用生成对抗网络和分割学习代替本地特征提取器, 在服务器端进行聚合，既保护隐私又保障性能。此外，还可以在深度学习中引入水印机制实现对模型的“版权保护”。</p><p>&nbsp;</p><p>达到可信联邦学习普惠的一种方式是开源，然而想要实现开源，一是要进行标准化；二是要进行隐私分级，这样也就形成了一个有效的社区。FATE 开源社区覆盖金融、医疗、科研、人工智能等多个领域与场景，是可信数据流通领域最具影响力的社区之一。</p><p>&nbsp;</p><p>可信联邦学习是一个非常有用的工具，这里有一些案例：</p><p>在客服界，利用联邦学习技术不断更新机器人助手的数据源，面对各业务销售和客服领域提供高效便捷的情景对练式培训，有效降低人力成本；多中心智慧医疗发现，保护数据隐私和安全，通过多中心科研挖掘医学发现；联邦学习-语音模型终生自学习；负责任的人工智能。具有情商的人工智能可以把自己的逻辑解释给工程师、审计人员和终端用户等。</p><p>&nbsp;</p><p>联邦学习的发展并没有停滞，随着越来越多学术界人士的参与，当下一个研究热点是如何使用图像、音频、文字等异构数据共同建模，同时还可以将联邦学习和 ChatGPT 等预训练模型相结合，并应用于很多金融场景包括数据要素的流通。</p><p>&nbsp;</p><p><img src=\"https://static001.infoq.cn/resource/image/b4/94/b47db4445e654d2207d1577ef35b2c94.jpg\" /></p><p></p><p></p><h2>张文宇院长：金融与科技需要深度融合</h2><p></p><p>&nbsp;</p><p>为赋能数字经济的高质量发展，如今数字金融正迈向智慧金融。作为金融科技产业的 CPU，人工智能一直在深深震撼我们：比如，2016 年，横空出世的 AlphaGo 接连打败了 100 多位围棋界典型高手，在当时引起了巨大轰动；再如，花旗银行等众多银行都在对管理和技术人员进行大量裁员；又如，2000 年的时候量化交易大厅人满为患，到了 2016 年，量化交易大厅只有星星点点的人。这同时也造成了金融类专业同学的焦虑：“学金融很危险，很容易被人工智能取代，学计算机很好”……</p><p>&nbsp;</p><p>其实并非如此，虽说程序员是人工智能的“衣食父母”，但显然人工智能是一个“不肖子孙”，比如最近势头正猛的低代码开发平台，可以通过降低企业人力成本，成倍缩短开发时间来帮助企业实现降本增效，还有随着最近 ChatGPT 的爆火，相信很多开发者都会有些紧张。</p><p>&nbsp;</p><p>比如 2021 年万科总部新人奖花落虚拟美女崔筱盼，它负责的催办预付应收逾期单据工作的核销率高达 91.44%，虽然人工智能能够取代基础的财务和金融工作，但由于虚拟数字人不具备人性光辉思维，无法做具有人性光辉的内容创新，因此在艺术类工作方面的取代可能性不会很强。</p><p>&nbsp;</p><p>再举一个金融行业的例子，虽然现在量化交易已经越来越多地交给机器来做，但假如有一天机器的水平高到可以完全取代人类，那时人类一定会改变规则。事实上，我们这个时代的人工智能还没有办法取代人类，它相当于弱人工智能，只擅长单个方面。</p><p>&nbsp;</p><p>如今，智慧金融也迈向了既要互相协同又要实现可信的互操作的群智金融。在人机物融合群智金融模式中，智慧组织、金融云、智慧物联网三者之间可以群智协同、群智决策和群智感知。因此，为了在智能时代不被淘汰，人类就需要充分运用人机物融合智能，同时还要具备懂得机器语言、分析能力、推理能力、跨学科复合知识能力以及学习能力等五种必备能力。</p><p>&nbsp;</p><p>金融科技不是简单的金融+科技，而是金融和科技的深度融合、互相协同、互相反哺。培养金融科技人才，不单单要发展金融科技，还需要融通教育链、人才链、产业链和创新链这四大链条。</p><p>&nbsp;</p><p>聚焦金融学科数字化改革未来，弱人工智能正迈向强人工智能，从传统金融到智慧金融再到群智金融，这一过程必然会倒逼流程再造、制度重塑和价值共创，它并不能完全交给经济，因此还需金融专家提供应用场景。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/e4/d2/e420c9cef56e82f1c8784055cb1326d2.jpg\" /></p><p></p><p></p><h2>张凯院长：金融科技人才缺口大，高校人才培养工作需提效</h2><p></p><p>&nbsp;</p><p>从 2017 年金融科技元年开始，随着产业高速发展，在政策层面，各层级政府制定了非常多的支持政策，《金融科技发展规划( 2022-2025 年）》金融科技人才培养发展规划指出：一是制定金融科技人才相关标准；二是优化金融科技人才需求目录和引进模式；三是加快金融科技人才梯队建设，建立健全在职人才培养体系；四是完善鼓励创新、包容试错的激励机制。此外，金标委制定的《金融科技人才能力规范》也对金融科技人才能力要素和能力要求给出了一系列规范和标准。</p><p>&nbsp;</p><p>在<a href=\"https://www.infoq.cn/article/amRrNh9XruvaPjY90RWO\">金融科技的企业</a>\"和机构的人才需求方面，从《2020 消费金融数字化转型主题调研报告》和一些其他报告可以看出三个趋势：金融科技市场规模非常大，无论是消费金融市场还是投资规模都是快速增长的，市场容量的增加必然带来对人才的需求大幅度增加；金融科技的就业前景整体乐观，金融科技人才可通过多渠道晋升，晋升的时间、频率、薪酬提速也非常高；随着数字化转型的提出，金融科技人才队伍的软实力建设，已成为传统金融机构及金融科技企业关注的重点。</p><p>&nbsp;</p><p>金融科技人才缺乏是一个事实，主要存在人才缺口、人才来源、人才技能等三个问题，主要表现在：</p><p>金融科技人才培训体系尚未形成：很多高校的金融科技课程将金融知识和计算机知识简单相加，没有深度融合，缺乏统一的标准；政策支持和保障力度不足：金融科技产业的支持政策和金融科技人才的保障机制都有所欠缺；金融科技人才结构失衡：当下金融科技人才主要覆盖零售银行的营销和风控等岗位，而数字运营、对公业务等方面的人才数量较少；运用金融科技解决实际问题的能力不够：从机构或院校培养出来的金融科技师，没有金融从业经历，缺乏解决实际问题的经验。</p><p>&nbsp;</p><p>在高校的培养成效方面，从四五年前开始，到现在为止，许多高校对金融科技的理解都还是“金融+科技”，要么在计算机专业加一些金融知识，要么在金融专业加一些计算机知识，不考虑金融科技本身的特殊性，这造成了最后人才形成的能力和产业需求不匹配的问题。</p><p>&nbsp;</p><p>基于这个现实矛盾，深大微众金融科技学院的培养措施已经探索了四年半，形成了一条特色之路，总结起来，共有四点：</p><p>以证促学，通过与深圳金融科技师协会高度合作，结合专业认证和专业培养，大范围扩充金融科技人才供给；以赛代学，通过比赛的形式检验人才培养成果；以师领学，采用师徒制教学，请企业老总和科学家认领学生到项目组进行模拟场景或近现实场景的应用；以研驱学，企业提供资金，软硬件设备或平台，支持高校建设实验室，实践基地、实践教学资源等，提高实践教学质量。企业提出产学研题目，教师招募学生，组建攻关团队，培养和选拔人才。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/81/46/813ca41e3bee90b2d4f763dc91138546.jpg\" /></p><p></p>",
    "publish_time": "2023-02-13 11:57:08",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "企业如何真正实现「数字化转型」？",
    "url": "https://www.infoq.cn/article/xhjiAWIXFJkClbRrpRYX",
    "summary": "<p>随着信息技术的发展，数字化转型是企业持续成功的关键已经成为了企业领导者的共识。然而调研数据显示，只有五分之一的人认为自己的转型策略是有效果的，其失败原因往往是人员和流程没有像技术一样得到重视。</p>\n<p>虽然技术是数字化转型的重要部分，但是我们也应该关注到组织的架构、流程和文化的开放方法。企业数字化转型改变的不仅仅是技术，而是整个组织的运作方式。</p>\n<p>企业怎样能深刻、透彻地完成数字化转型？在《数字化转型，开源之路》白皮书中，红帽总结了数字化转型的5大要素和不能忽视的方式方法。如果你想了解更多企业数字化转型方式的内容，这本白皮书一定对你有启发和帮助。</p>",
    "publish_time": "2023-02-13 12:12:57",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]