[
  {
    "title": "1月9日举办2023 ICT深度观察政企数字化转型分论坛",
    "url": "https://www.infoq.cn/article/6d18bb25abba45707c1fd5724",
    "summary": "<p></p><blockquote>ICT深度观察报告会是中国信通院每年举办的成果汇报会，自2009第一次举办到2023年已举办了13届，本次为第14届。“政企数字化转型分论坛”作为平行论坛之一，将于1月9日上午9:00在线上举办。</blockquote><p></p><p></p><p>自2020年9月开始，中国信息通信研究院（以下简称“中国信通院”），云计算与大数据研究所就在积极探索以标准的形式来指导和引领政企数字化转型，彼时发布了作为整体数字化转型方法论的《企业数字化成熟度模型IOMM标准》。经过2年发展，当下数字经济与实体经济正在加速融合，新技术与新挑战不断涌现，数字化转型也逐渐进入深水区，需要更深入、更全面、更精细的方向指引。</p><p>&nbsp;</p><p>基于此背景，本次“政企数字化转型分论坛”将以体系化的形式，发布并解读多项企业数字化成熟度模型IOMM标准最新内容，同时邀请多位行业深度参与者对当下数字化转型的热议领域展开讨论，3大亮点集中呈现：</p><p></p><p>亮点1：多项数字化转型成果重磅发布</p><p>数字化转型经过多年发展，已踏入深水区，企业需要更全面、更体系化的方法论来规划和引导数字化转型发展，不同规模的企业对于数字化转型的需求也大为不同，大企业更加关心顶层设计与全局落地方案，而中小企业则更多关注落地抓手，如很多中小企业以数字化营销作为转型切入点；同时在转型过程中越来越多的企业希望与标杆企业对标。为此在本论坛中将重磅发布如下成果：</p><p><img src=\"https://static001.geekbang.org/infoq/c2/c24831c654c6ebdc211caf189bde7c06.png\" /></p><p>发布企业整体视角的《企业数字化成熟度模型IOMM标准》来提供更加全面的方法指引；针对中小企业转型的特色和痛点，发布中小企业版《企业数字化成熟度模型IOMM标准》；发布《“鼎新杯”数字化转型应用案例汇编》为企业数字化转型提供更多对标参考案例。</p><p></p><p>亮点2：多项数字化标准权威解读及实践分享</p><p>在本论坛中，不仅仅发布转型成果，还将对以上发布的成果进行权威细致的解读，包括在企业整体视角层面以及中小企业层面的数字化转型6大能力建设，6大价值评估体系及5级成熟度模型，以便不同规模企业对转型方法论核心要义进行整体把握。同时，针对政企数字化转型密切相关的各领域，如业务数字化转型，数字化平台建设，云边端一体化标准以及数字政府等领域分享最新趋势及相关实践。</p><p><img src=\"https://static001.geekbang.org/infoq/63/631f2322c8e3ebb4200e64e08bed88aa.png\" /></p><p></p><p>亮点3：多轮圆桌对话探讨时下转型热点方向</p><p>在本次论坛中，不单以标准视角阐述数字化转型的方法论和实践，同时也邀请了行业中极具代表性的企业从产业视角对政企数字化转型涉及的相关热点领域展开深入探讨，讨论的议题包括《数字时代下的流程变革创新》、《数字化平台，数字化赋能》以及《云数共生，助力数字政府创新发展》等，参与讨论的企业代表既有来自联通、移动、电信等的运营商企业，也有来自阿里云、金蝶、浪潮云、中国电子云、神州泰岳等技术平台型企业，同时也有来自德勤、IBM等外资企业，期待能为大家带来精彩的观点碰撞。</p><p><img src=\"https://static001.geekbang.org/infoq/6d/6d6c27167ac973ca9d6d79e403344496.jpeg\" /></p><p></p><p><img src=\"https://static001.geekbang.org/infoq/8c/8c817d3d641b3fa6902a995faab85ba1.jpeg\" /></p><p></p><p><img src=\"https://static001.geekbang.org/infoq/3a/3ac44ebd5825c0a6aa3f2adccc520bd5.jpeg\" /></p><p></p><p>数启新征程，转型更当时，让我们共同期待1月9日上午9:00“政企数字化转型分论坛”的精彩内容。</p><p>&nbsp;</p><p>会议议程如下，期待您的参与！</p><p><img src=\"https://static001.geekbang.org/infoq/5e/5ebb64fbf62c6f7ac4d4415fd768e546.jpeg\" /></p><p></p><p><img src=\"https://static001.geekbang.org/infoq/5f/5f8503c3b1f32f2c02a0e8fe1b372df5.jpeg\" /></p><p></p><p></p>",
    "publish_time": "2023-01-06 06:41:44",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "1月11日举办数字化业务安全生产沙龙第2期",
    "url": "https://www.infoq.cn/article/add2bcea669d98025d85830d2",
    "summary": "<p>并不乐观的数字化业务安全生产现状</p><p>数字化时代，信息系统正在逐渐成为企业乃至整个社会的基础设施，任何类型的设备宕机、系统瘫痪、网络故障等安全生产事件都有可能导致业务停摆，轻则影响业务使用和用户体验，重则给企业和用户带来巨大损失，甚至危及民生。</p><p>2021年6月，美国云计算公司Fastly出现长达1小时的服务故障，导致全球数千家政府、网站受到影响；2021年7月，国外多家银行、航空、政府、新闻机构的系统受DNS故障影响无法正常服务；2021年10月，Facebook发生全球性宕机，宕机时间超过6个小时，同周周五，再次出现约2个小时的宕机；2021年12月，西安健康码在全市全员核酸检测的需求下崩溃了，导致公众生活受到极大影响；2022年5月，某证据交易系统宕机，影响股民正常交易；2022年12月，某云服务商的服务中断事件，导致多个关键机构的网站、平台无法访问使用；</p><p></p><p>为此，企业及社会各方，在采用多种新型技术实现效率与效益提升的同时，如将业务部署在云上，引入大数据，人工智能等新兴技术；也要将如何保障数字化业务安全生产息息相关的连续性、安全性、稳定性等作为头等大事。而不断与行业交流并汲取行业最佳实践，是有效提升自身安全生产能力的重要途径。</p><p></p><p>群策群力，推进数字化业务安全生产</p><p>为进一步响应国家关于安全生产工作的号召，中国信息通信研究院（以下简称“中国信通院”）与合作伙伴达成共识，联合各方在企业数字化发展共建共享平台（EDCC）下成立“数字化业务安全生产推进中心”，旨在凝聚各方力量，整合优质资源，开展技术攻关，完善标准体系，提升企业数字化业务连续性，增强企业数字化安全生产能力。数字化业务安全生产推进中心自成立以来已聚集20家行业龙头企业和25名行业资深专家，围绕数字化业务安全生产输出多项标准，陆续发布《基于云计算的数字化业务通用安全工程要求》（行标报批）、《数字化业务应用运维平台》（团标已发布）等多项成果，同时支撑了工信部信管局联合中国信通院组织开展的“云服务稳定安全运行应急演练专项活动”。</p><p></p><p>第2期数字化业务安全生产沙龙聚焦“业务连续性”</p><p>1月11日14:00，将线上举办 “数字化业务安全生产，创新业务连续性管理”第2期主题沙龙并全程直播。本次沙龙将公布第三批数字化业务安全生产推进中心成员单位和技术专家、发布2022年度数字化业务安全生产推进中心突出贡献技术专家，并邀请业内权威专家分享数字化业务安全生产的最新实践经验，共同探寻保障数字化业务连续性的新路径，亮点如下：</p><p></p><p>亮点一：发布及解读数字化安全生产系列最新标准</p><p>2022年数字化业务安全生产推进中心对各行业企业数字化安全生产工作展开研究，深入调研企业数字化业务安全生产现状和短板，形成数字化安全生产治理相关最新标准，本次沙龙将进行发布并解读：</p><p>《可信数字化服务能力要求：数字化安全生产平台》《可信数字化服务能力要求：基于CMDB的数字化全链路端到端监控平台》《云服务稳定运行故障分类分级》《云服务稳定运行要求：应急响应规范》《云服务稳定运行要求：应急管理平台</p><p></p><p>亮点二：行业资深专家分享数字化业务安全生产最佳实践</p><p>本次沙龙邀请到来自浦发银行、中国联通软件研究院、中电信数智科技有限公司、广州嘉为科技有限公司、北京同创永益科技发展有限公司的资深专家，围绕“数字化业务安全生产，创新业务连续性管理”主题，带来数字化业务安全生产在各自领域内的最佳实践。</p><p></p><p>亮点三：公布第三批数字化安全生产推进中心成员单位及专家</p><p>“数字化业务安全生产推进中心”已汇聚了20家行业龙头企业和25名行业资深专家，并输出了多项数字化业务安全生产标准，为推动我国数字化业务安全健康发展做出了贡献。本次沙龙中，将公布新加入的6家成员单位和技术专家名单。</p><p></p><p>亮点四：公布2022年数字化业务安全生产推进中心突出贡献专家</p><p>“数字化业务安全生产推进中心”自成立以来，相关单位和专家围绕数字化业务安全生产在标准制定、评估测试、技术研究等方面输出宝贵经验与成果。为感谢专家在2022年度对数字化业务安全生产推进中心的突出贡献，本次沙龙中将公布2022年度数字业务安全生产推进中心突出贡献专家名单。</p><p></p><p>沙龙议程及直播链接如下，期待您的参与！</p><p><img src=\"https://static001.geekbang.org/infoq/fc/fc9a0526c986634245672e03886dde1f.jpeg\" /></p><p></p><p>活动联系人：吴佳琦 18352634685 wujiaqi@caict.ac.cn</p>",
    "publish_time": "2023-01-06 06:56:39",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]