[
  {
    "title": "科技巨头是如何迷失方向的？探讨大型科技企业的问责制度",
    "url": "https://www.infoq.cn/article/0J1G2olqx7fF4N8ayoVG",
    "summary": "<p>大型科技公司似乎缺乏问责制；身居要职的人很少被追究责任。工程师应该意识到他们想要工作的公司文化，并关注他们的福祉，而公司应该投资于他们的领导者，以支持人们的最佳工作。Andy Walker在<a href=\"https://qconlondon.com/\">伦敦QCon 2023（QCon London 2023）</a>\"上发表了一篇关于科技巨头是如何迷失方向的演讲。</p><p>&nbsp;</p><p>Walker说到，随着公司的成熟，高层的问责制似乎消失了，而基层的问责制却在加强。完全可以想象，科技行业的裁员是为了摆脱那些公司领导人不想要的人。然而，与此同时，我们看到高管薪酬飙升，而且在大型科技公司担任资深职位（我们说的是董事及以上级别）的人因不良行为而被追究责任的情况非常罕见，Walker解释道：</p><p>&nbsp;</p><p></p><blockquote>例如，Sundar Pichai在解雇1.2万人的同时获得了超过2亿美元的薪酬，并表示自己别无选择，因为他雇佣了过多的人，这似乎是在奖励高层的失败。与此同时，12000名因非自身过错而失业的人不得不进入现在已经非常拥挤的就业市场。</blockquote><p></p><p>&nbsp;</p><p>沃克认为，作为工程师，我们需要真正意识到我们想要工作的公司文化：</p><p>&nbsp;</p><p></p><blockquote>我告诉很多最近受裁员影响的人的一件事是，你不是你为之工作的公司。如果你在科技行业工作，你在其他地方也会有机会。</blockquote><p></p><p>&nbsp;</p><p>Walker提到，呆在一个你觉得无法产生积极影响的地方，对你以后的心理健康是没有帮助的。不仅是对你，对你的工作也一样，而且你的首要任务是照顾好自己的健康。</p><p>&nbsp;</p><p>Walker说：“可悲的是，当你的公司文化消亡时，就需要有人进入最高层来重新启动它——你可能无能为力”。他提到，你可以看到类似的事情正在微软的Satya Nadella（萨蒂亚·纳德拉）的身上发生，尽管他们也盲目地效仿了推特的大规模解雇策略。在这种情况发生之前，你能做的就是向每一个走进公司大门的人强化你的企业文化。他说到，你不太可能阻止工作场所的公司化，但你可以减缓它。文化投资是一项持续的活动。如果你不这样做，那么你的文化就会变成发生在你身上的事情，而不是你有意识的选择。</p><p>&nbsp;</p><p>Walker建议公司应该投资于他们的领导者。领导者要么是支持人们把工作做到最好的地板，要么是限制人们把工作做到最好的天花板。他总结道，当你成为董事或副总裁时，你的工作就已经发生了变化。领导力不是要找到答案，而是要提出值得解决的问题，并提供一个可以解决这些问题的环境。当领导者提供解决方案而不是确定结果时，以及当他们开始谈论“追究人们的责任”时，这些都是需要警惕的预警信号。这两者都与合规而非创新有关。</p><p>&nbsp;</p><p>InfoQ采访了<a href=\"https://www.infoq.com/profile/Andy-Walker/\">Andy Walker</a>\"，讨论了科技巨头是如何衡量成功以及如何扭转行业趋势的。</p><p>&nbsp;</p><p>InfoQ：科技巨头是如何衡量成功的？这会产生什么影响？</p><p>&nbsp;</p><p></p><blockquote>Andy Walker：当你用增长来衡量成功时，你就会以一种糟糕的方式违背古德哈特定律（Goodhart’s Law）。古德哈特定律可以概括为“当一项措施成为目标时，它就不再是一项好的措施”。如果你看看大型科技公司报告的增长方式，就会发现它是活跃用户（在某些情况下是用户粘性）。如果你看看无问责制的言论自由问题，那么你应该能够立即发现问题所在。科技公司屏蔽的每一个用户都是他们没有货币化的用户，因为这会损害他们的增长故事。&nbsp;这对于持极端观点的人来说尤其如此。对用户安全的投资变成了一种胁迫行为。实现零滥用是不可能的，但大型科技公司将这方面的投资视为成本中心，认为会损害其增长。因此，与能带来增长的事项相比，它的优先级经常被降低。</blockquote><p></p><p>&nbsp;</p><p>InfoQ：公司可以做些什么来扭转这个行业的负面趋势？</p><p>&nbsp;</p><p></p><blockquote>Walker：公司在支持员工应对这些变化方面需要非常具体，并为他们的领导者设定明确的期望。他们需要建立制衡机制，以便在高层人员造成真正伤害之前追究其责任。&nbsp;他们需要停止将奖励“货物装箱”和“帝国建设”作为职业发展和奖励影响力的手段，这是负责任的。他们需要奖励那些站在用户那边的人，而不是那些站在股东这边的人。采纳两者中任何一种观点都会对公司不利，而真正有效的领导者能够平衡这两种相互冲突的需求。</blockquote><p></p><p>&nbsp;</p><p>&nbsp;</p><p>原文链接：</p><p><a href=\"https://www.infoq.com/news/2023/08/big-tech-accountability/\">https://www.infoq.com/news/2023/08/big-tech-accountability/</a>\"</p>",
    "publish_time": "2023-09-15 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]