[
  {
    "title": "实时分析全面赋能金融业务，马上消费基于 Apache Doris 构建实时数仓的技术实践",
    "url": "https://www.infoq.cn/article/d0m00wIHNWVkoFjJ8cVi",
    "summary": "<p></p><blockquote>作者：马上消费 陈政编辑整理：SelectDB</blockquote><p></p><p></p><p>导读： 近年来，马上消费的业务体量呈飞跃式增长，每天产生数据可达上千亿条，如何更高效挖掘这些数据的价值，成为了其必须要面临的挑战。随着各业务对实时数据分析的需求越来越强烈，马上消费于 2021 年引入 <a href=\"https://github.com/apache/doris\">Apache Doris</a>\" 构建实时数仓，目前已服务 10+业务团队的数据应用，99% 以上的查询响应耗时在 5 秒内，数据时效延迟均不超过 1 分钟，解决了其对于实时数据分析的强烈诉求，最终效果得到各业务部门的认可与肯定。</p><p></p><p>马上消费金融股份有限公司（简称“马上消费”）是一家经中国银保监会批准，持有消费金融牌照的科技驱动型金融机构。秉承“科技让生活更轻松”的使命，马上消费以用户为中心，聚焦普惠金融，通过科技赋能创新，致力于打造成为全球最被信赖的金融服务商，为有金融服务需求的社会各阶层和群体提供小额分散的消费金融服务。</p><p></p><p>自2015年6月正式开业至今，马上消费的业务体量呈飞跃式增长，截止目前品注册用户数达到一亿多。作为一家面向 C 端用户的互联网金融企业，我们不断在探索数据提升客户体验、数据驱动业务增长的方式，关注数据要素升级对生产关系所带来的深远影响。</p><p></p><h1>业务需求</h1><p></p><p></p><p>基于业务需要，马上消费内部自主研发了 400 多套与零售信贷相关的系统，同时与外部合作方多套系统进行对接，来服务整个业务链路的流转。这些系统源源不断的产生数据，每天可达上千亿条。如何更高效挖掘这些数据的价值，成为了我们必须要面临的挑战。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/8f/8f837a3f4c46c0660fc53ef1beef1fea.png\" /></p><p></p><p>在正式建设<a href=\"https://www.infoq.cn/article/26ICMg30p0LS8UY8rbrw\">实时数仓</a>\"之前，业务上的数据应用以离线为主，用户使用 T+1 的数据来做数据建模和分析，依托数据进行业务决策，并回流到业务系统中。但随着业务体量的飞跃式增长、以及业务模式的不断优化升级，我们对数据分析的实时性提出了更高诉求，主要包括两类：</p><p></p><p>数据时效的实时。相比过去 T+1 的模式，希望在分析时的数据包含近 10 分钟以前的新增内容。查询响应的实时。 数据的查询响应要足够快，最好能在几秒钟甚至毫米级返回结果。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/26/26b9f9b33f696d787bde89e4536c35e6.png\" /></p><p></p><h1>早期架构</h1><p></p><p></p><p>早期公司内统一的大数据平台，构建在传统的 <a href=\"https://www.infoq.cn/article/8kwSM0CaUVYW1EzeO7GT\">Hadoop 体系</a>\"之上，以服务离线数据分析为主，缺乏统一的实时数据平台。每天晚上集中抽取业务数据到 Hive 表中，通过离线调度任务完成数据加工后，提供给用户做数据查询和分析。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/9a/9aa39943e5fffbc8f324b460774c41b4.png\" /></p><p></p><h2>Hadoop 离线架构的不足</h2><p></p><p></p><p>这套技术架构对离线数据业务有较好的支撑，但在应对更广泛的实时分析场景时，痛点也很明显：</p><p></p><p>数据的时效性不足。平台中的 Hive 表，都是 T+1 的数据，没有当日最新数据。用户若想在平台上分析当日最新业务情况，简直是无米之炊，业务决策的准确性和及时性很难得到提升。数据查询效率不足。用户查询 Hive 表的数据时，通常需要等待数十秒甚至数分钟才能返回结果，工作效率受限。虽然也引入了 Presto、Spark 等计算引擎来提升查询效率，但查询效率的提升始终不理想，并且资源消耗也比较大。数据维护成本高。离线数据从采集到加工，链路复杂耗时长，任何一个环节出问题都将影响数据的及时产出。另外，当需要修复历史数据、或者是调整数据计算逻辑时牵涉面广，更是费时费力。除此之外，常规的离线数仓分层模型也带来一些问题，所有数据都是单独一份物理表，导致衍生出来的表数量庞大、存储消耗不低。技术成本较高。围绕 Hadoop 体系构建的平台，组件依赖较高，动辄需要数十种基础组件组合起来，才能满足不同功能需要。每一种组件复杂度都很高，各自难免存在一些缺陷，需投入大量的人力物力去维护。</p><p></p><h1>探索之路</h1><p></p><p></p><p>在公司没有统一建设实时数仓之前，部分业务团队为了满足实时数据分析的需要，也曾各自做过一些努力，但受限于实施的复杂度，基本都只局限在极少数特殊业务。</p><p></p><p>有的团队采用过相对粗暴的解决方式，直接在业务系统 MySQL 上面查询最新的数据，虽然查询速度慢但可以保证是实时数据，但对于跨数据库实例的关联分析，使用这种方式很难解决；有的团队采用过相对进阶的方式，将数据实时同步到 Elasticsearch、HBase 中，在其中完成简单的数据分析；有的团队也采用过较前沿的方式，使用 Flink 之类的流式计算框架，对流式数据进行预计算之后写入 HBase、ES 等存储，供用户和系统访问。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/d6/d6c922a47bf7a59547c32dc9dd49cff4.png\" /></p><p></p><p>以上各业务团队对实时数据分析的分散式初步探索中，也发现了一些问题：</p><p></p><p>对分析的支持很不灵活。MySQL、ES、HBase 等存储组件，各自擅长的领域不同，对大规模数据的 OLAP 查询并不友好。用户要么只能用于简单的单表数据分析场景，要么需要设计很复杂的数据模型和数据处理逻辑来实现复杂的分析需求，这使得研发和维护成本非常高，需求交付时间很长。重复建设带来资源浪费。各业务团队采用零散的方案去解决需求，各自搭建 ES、HBase 小规模集群，资源利用率低，并投入技术学习成本，最终却很难共享复用。另外，不同团队的业务分析中都会用到账务、审批等核心数据，最终造成数据的重复拉取和存储。数据服务质量难以保障。数据通过不同的链路、不同的写入方式到达目标端供查询，服务链路的稳定性难以保障，导致数据的准确性、完整性、一致性等质量问题频发，各团队花费了大量精力也难以很好地保障整体数据服务质量。</p><p></p><h2>架构选型</h2><p></p><p></p><p>从我们当前大数据整体架构来看，实质上只需对原有架构做一些扩充和改造即可实现当前的需求。我们已有的平台产品，比如流式计算平台、数据交换平台等，已经足够支撑实时数据的采集和处理，这也为我们构建实时数仓奠定了良好基础。因此，我们当前较为迫切的是需要补充一款综合能力强劲的分析型数据库来解决问题。</p><p></p><p>对于这类分析型数据库，我们有一些基本诉求：</p><p></p><p>支持分钟级别延迟的数据近实时写入（insert）、更新（update）、删除（delete）；支持标准 SQL 语法来查询和分析数据，以及常用的函数；千万级别数据量的多表关联查询，能够在秒级别返回结果；存储容量和并发支持能够横向扩展；既能较好支持 OLAP 查询，也能根据主键查询数据毫秒级响应；具备一定的数据聚合模型或物化视图的能力，加速查询；</p><p></p><p>围绕以上基本诉求以及业务需求，我们对业界主流的商业和开源组件进行了调研，包括 Clickhouse、Doris、TiDB、Druid、Kudu、Kylin、Hologres 等产品。我们做调研的时间截止在 2020 年底，在这个时期内主流 OLAP 引擎或数据库都有其各自的优势与短板。我们对调研产品的功能特性和原理方面进行了分析对比，也对部分组件做了性能等方面的 POC 测试，最终决定引入 Apache Doris 作为我们实时数仓的基座。</p><p></p><p>我们对新技术的引入一直比较审慎，<a href=\"https://www.infoq.cn/article/XribUAr1cpdDALrNVN59\">Apache Doris</a>\" 以其全面的功能和极速的性能表现吸引了我们。自 2017年开源之后被小米、美团、链家、搜狐等数十家互联网知名企业引入使用。在 2018 年捐献到 Apache 基金会之后更是一路高歌猛进，各项核心能力大幅增强，并在 2022 年 6 月升级为 Apache 顶级项目，截止 2022 年底，Apache Doris 已被全球 1000 多家企业生产系统使用。它的几大重点能力对我们而言非常适用：</p><p></p><p>简单易用：其架构简洁只有两个进程服务，不依赖其他系统，部署和运维管理简单；使用标准 SQL 做数据查询，兼容 MySQL 协议;极致性能：依托现代化的 MPP 架构、列式存储、预聚合视图、数据索引等实现，在低延迟和高吞吐查询上达到了极速性能；统一数仓服务：一套平台系统，可同时支持实时数据服务、交互式数据分析等场景；支持联邦查询：支持对 Hive、MySQL、Elasticsearch 等数据库的联邦查询分析能力；</p><p></p><h1>新架构演进</h1><p></p><p></p><h2>技术架构升级</h2><p></p><p></p><p>各业务对实时数据分析的需求越来越强烈，但原有技术架构并不能很好的支撑当前的需求。在分析各业务的需求和痛点之后，我们决定对架构进行升级演进，构建公司级统一的实时数仓平台。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/3d/3dc761f536b901397d9dc174a5054594.png\" /></p><p></p><p>在选定 Apache doris 作为我们的实时数仓底座之后，我们规划并构建了统一的实时数据服务链路。一方面我们以 Apache Doris 为核心，将实时增量数据、历史存量数据整合到 Doris 内提供极速查询服务；另外我们对数据交换平台、流式计算平台、消息服务总线、元数据中心、数据服务平台等都做了适配改造；最终达到实时数据统一采集、统一分析、统一服务的目标。</p><p></p><p>同时对于整个大数据平台而言，我们也在离线数据平台之外扩充了实时数据服务能力，进一步增强了大数据平台对不同业务场景的支撑能力，完善了大数据技术架构蓝图：</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/b3/b3e018301e9c8506f0b352bb46ca38b3.png\" /></p><p></p><h2>架构升级的落地</h2><p></p><p></p><p>我们对实时数仓的建设目标绝不仅仅是部署一套 Doris 数据库，当然也不是一朝一夕可建设成熟，只有诸多与之配套的能力逐步完善后，才能真正高效保质的运转起来。只不过，Doris 在我们实时数仓的建设中至关重要。</p><p></p><p>围绕新的实时数据架构，我们做了大量的配套工作：</p><p></p><p>实时数据的采集交换。 将实时数据采集到 Doris 中去。我们在现有数据交换平台上扩展功能，支持 MySQL Binlog 实时数据的采集和分发，并能在源头上对分库分表数据进行合并，以便下游处理。同时新增 Hive 到 Doris 的数据批量导入功能，解决大量历史数据需要加载到 Doris 库表的问题。实时消息服务总线。 不管是采集自 MySQL 的 Binlog 数据，还是应用埋点上报的数据等，均制定统一的数据格式，同时提供标准 SDK 来保障数据的规范性。另外对于消息数据，我们增加了消息元数据中心服务，来方便上下游对数据 Schema 的解析与演变。源端的实时数据，由专人负责接入到统一的 Kafka 中，共享给下游各类业务使用，避免数据被重复接入。扩展流式数据的处 理。我们的流式计算平台底层基于 Flink，为方便用户解析统一的消息数据，我们扩展了Flink SQL 函数以及 Kafka Connector。由于当时社区并未提供 Flink 跟 Doris 的读写连接器，我们自研了 Flink Doris Connector，并保障数据写入的 Exactly Once语义，性能上也压测到单表最大 20 万 QPS 的吞吐。增强 Doris 的服务能力。我们部署多个 FE 节点提供服务，面向访问端我们基于 Nginx 反向代理来实现不同 FE 节点之间的负载均衡、故障转移。扩展 Bitmap、字符串解析等函数，方便用户分析数据。Doris 各节点上的日志，统一集成到 ELK 供查询，以及将性能指标集成到 Grafana 实现监控告警。期间偶尔触发到 Doris 的缺陷也对其进行修复（或通过升级 Doris 版本的方式解决），比如数据写入过于频繁时，个别表 Tablet 与 Partition 中的版本元信息不一致导致查询异常，以及 FE 节点 HTTP 接口的兼容性 Bug 导致启动时拉取元数据失败等等。完善实时数据研发规范。 在 Doris 之上的数据模型设计、数据开发方式，相比常规的离线数仓都有较大区别。我们对于数据采集、数据表模型选择、数据域划分、分区分桶策略、数据生命周期、数据权限分配、各数据团队分工等方面都制定了规范，一方面期望实时数仓的数据从一开始就能够有序组织和管理，同时也罗列一些技术规范让开发者有据可循，达到性能最优，少走弯路。</p><p></p><h1>业务实践</h1><p></p><p></p><p>自 2021 年引入 Apache doris 之后，我们小步快跑，快速在一些业务场景中得到实践，初具效果。目前我们线上 Doris 集群有 50 个 BE 节点，已接入将近 800 个数据表，支撑每天约 5 万余次的查询分析；服务于 10 多个业务团队的数据应用，在其之上产出的数据报表、数据接口大约在 300 个左右；99% 以上的查询响应耗时在 5 秒内，数据时效延迟均不超过 1 分钟。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/8a/8a4fb2ffa002d6c8d0fd985f7cff95ac.png\" /></p><p></p><p>一些重点业务在对接实时数仓之后，均取得了不错的效果，比如几个典型的业务场景：</p><p></p><p>广告投放：营销团队观察不同广告投放渠道、素材等维度的曝光、花费及用户转化情况，及时调整资金投放策略；风控策略评估：风控团队基于实时提现通过率等审批指标，判断审批策略效果，及时优化策略保障审批质量；消保降诉：运营团队基于话务、客户关系相关实时数据指标，分析电销运营质量及关键事件，保障客户服务质量；资管业务：资管团队基于现场过程实时数据、实时质检合规敏感词、实时催收投诉提供资管质检实时业务监控分析服务；科技大屏：各大部门基于大屏实时展示和监控业务及技术指标，例如风控大屏、资管大屏、人工智能大屏等；</p><p></p><p>虽然各个业务场景关注的数据指标不同，数据处理逻辑不同，但围绕 Doris 的数据开发模式基本一致。我们通过自研的工具将不同来源的数据实时投递到 Kafka，用户使用 Flink SQL 消费 Kafka 数据后写入 Doris，在 Doris 中按照经典的数仓分层模型来组织数据。Doris 作为我们数据链路的末端，被报表工具、业务系统直接访问，快速查询数据。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/1b/1b9c46c8f170cb18243831b386964a2d.png\" /></p><p></p><p>在我们围绕 Doris 的实时业务实践过程中，也探索了一些不一样的实时数据开发模式：</p><p></p><p>数据不直接同步到 Doris。我们并没有选择将源头实时数据直接同步到 Doris，而是先把所有数据都集中发送到了 Kafka，启动一些 Flink 任务消费数据写入 Doris。这样做主要有两方面的考虑，一是 Kafka 中的数据可被重复利用，除了消费数据写入 Doris，其他特殊业务也可消费后流转到其他流程中，避免实时数据重复采集；二是数据在写入 Doris 之前，我们的 Flink 任务可预先做一些数据清洗或者聚合，尽量减少在 Doris 中再次处理。上层尽量使用视图表。 我们对公司的核心数据做了主题分类，遵循维度建模的思想把数据也分为了ODS、DWD、DWS、ADS 等层次，每一层的数据的聚合维度不同。区别于离线数仓的数据加工模式，我们围绕 Doris 的实时加工方式有较大不同：我们基本只有 ODS、DWD 层的数据是物理表，DWS、ADS 层中的数据主要为视图表。这样做的初衷也很简单，就是想减少传统方式的层层数据预处理，最大化利用 Doris 的极速分析能力直接从明细表中分析数据。这样做有几个大的收益，一是物理表数量少了，降低了存储开销；二是减少了大量的数据预处理计算任务，资源消耗低、维护成本低、业务交付速度快；三是上层数据基于视图表，当业务规则变化时，快速重建视图逻辑即可，无需把层层数据再重新处理一遍，简单高效。计算逻辑尽量交给 Doris。在没有 Doris 之前，比如 Flink 结合 HBase 的架构，我们通常会在 Flink 任务端做大量的数据预处理（包括复杂的流表关联、维度聚合、窗口计算）。而在引入 Doris 之后，我们将数据计算逻辑尽可能的转移到 Doris 内，Flink 只承担简单的数据读写与转换。这对数据开发者来说无疑会更友好，毕竟对于普通开发者来说 Flink 的门槛较高，比如对延迟数据的处理、历史数据回溯等方面很难控制。当然，我们会对数据的体量和分析复杂度做综合考虑，在必要时仍会在 Flink 端对数据先做聚合，灵活调整。合理利用 Doris 特性。我们期望基于 Doris 自身的极致查询性能，来降低数据加工链路的复杂度，提高需求交付效率。但任何数据库或计算引擎的性能，都受其自身设计、集群规模、数据规模、计算复杂度的综合影响，Doris 性能虽然很优越但也不是万能。我们尽量合理使用 Doris，来让他的性能表现更好，比如合理设计表的分区分桶、设定数据清理周期、主键字段的类型等；ODS 和 DWD 层的数据优先使用 Unique 模型，部分大表配套建立 Rollup 表；查询语句的 Join 关联注意大表在左小表在右，合理使用 Runtime Filter 等。</p><p></p><h1>总结与展望</h1><p></p><p><img src=\"https://static001.geekbang.org/infoq/d1/d1818df9ea89032fae0757ddbf89ff8a.png\" /></p><p></p><p>自 2021 年引入 Doris 构建实时数仓以来，很多以前只能使用头一天数据做离线分析的业务，纷纷尝试以新的方式来完成实时数据分析、制作实时数据报表。在新的实时数据架构下，数据分析的时效性有了极大的提升，不同类型用户均从中获得收益：</p><p></p><p>对于业务人员、数据分析师、决策者，他们能够基于最新的数据，更快速的洞察业务状态，及时调整业务策略；对于数据开发者，实时数据的开发变得更简单，以前需要花费好几天才能完成的工作，现在只需一天甚至半天时间即可完成；对于实时平台管理方，数据的存储成本、系统的运维成本、业务的运营成本均得到一定程度的降低。</p><p></p><p>技术和数据服务业务的脚步永不停歇，当业务与数据规模持续变化后，新的技术挑战必然又会产生。在当前环境下，不管是解决现有问题、还是为将来做准备，我们还有很多工作需不断深入：</p><p></p><p>Doris 能力的增强。由于引入 Doris 较早，我们升级几次之后停留在 0.15.3 版本，对比社区 1.1.4 版本和即将发版的 1.2  版本差距太大。新版本在性能和稳定性上都有了巨大的提升，比如向量化引擎等、Hudi 数据查询等，版本升级是我们近期首要的计划。另外 Doris 即将发布的版本将支持跨集群数据复制、存算分离的能力，我们的核心业务对这些需求也非常强烈，后续我们将联合社区一同完善，推进落地应用。生态系统的完善。Doris 成为了我们实时数仓的主力数据库，但同属于我们大数据生态的一部分，数据安全、数据质量等要素也是需要被共同关注的内容。原有元数据管理、数据质量、数据安全、运维监控等平台侧重对离线 Hadoop 体系数据的管理，需进一步扩展，支持将 Doris 链路的实时数仓纳入统管。另外尤其是面向数据开发者、数据分析用户，优化数据开发流程和工具，让大家获得更好的体验。更多业务的覆盖。一方面源自于业务侧旺盛的需求量，另一方面我们也期待基于 Doris 的实时数仓体系能够发挥更大的作用，在数据的接入数量和数据模型上，能够支撑到更多的业务域。在服务的应用类型上，除了传统的报表应用，也能支撑更多偏中后端的数据产品，比如用户行为分析平台等。</p>",
    "publish_time": "2023-02-07 10:17:29",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "每天工作超17个小时后，马斯克称终于把Twitter从“破产”边缘拉回来了",
    "url": "https://www.infoq.cn/article/GV2p2VQyx4G2yoQmqJPZ",
    "summary": "<p>2月6日，马斯克在Twitter上发文称，过去的三个月非常艰难，不得不在履行特斯拉和SpaceX的基本职责的同时，还要努力将Twitter从“破产”中拯救出来。Twitter仍然面临挑战，但现在有达到收支平衡的趋势。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/f4/f428e7e0fb6d79f1855ed76d53a855e7.png\" /></p><p></p><p>去年10月，马斯克以440亿美元的价格收购了Twitter，回忆接手Twitter的几个月里，马斯克称，这是“极其艰难的”，“我不希望任何人遭受这种痛苦。”他还表示：“Twitter仍然面临挑战，但如果我们坚持下去，它现在有实现收支平衡的趋势。非常感谢公众的支持。”</p><p></p><p>收购Twitter后的一个月，马斯克曾在一档访谈节目中透露，自从10月收购Twitter之后，马斯克的工作时长已经从80小时跃升至120小时。算上周末，马斯克平均每天工作超17个小时。</p><p></p><p>“我睡觉，起床，工作，睡觉，起床，工作…就这么一周七天循环，必须得这么做一段时间，没别的选择。但等Twitter走上正轨，管理特斯拉和Space X要容易得多。”</p><p></p><p>马斯克不止这么要求自己，也这么要求手下员工。</p><p></p><p>收购Twitter后，他明确告诉Twitter员工：要么接受高强度工作，要么走人。甚至直接把Twitter的几间办公室改造成了卧室，方便员工通宵加班。</p><p></p><p>2018年，他在一条推文里写道：“世界上有很多不那么卷的公司，但没人能靠一周工作40小时改变世界。”</p>",
    "publish_time": "2023-02-07 10:50:47",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "低代码编程及其市场机遇剖析 | 低代码技术内幕",
    "url": "https://www.infoq.cn/article/Us10TOa418u2xwfZ19Gp",
    "summary": "<p></p><blockquote>自 2020 年来，网易数帆探索可视化低代码编程已两年有余，打造了轻舟低代码平台用于企业应用开发。然而，不少编程技术人员对这一领域还比较陌生。我们开设《低代码技术内幕》专栏，旨在讨论低代码编程领域中的困难、问题，以及高效的解决方案。本文为第一篇，深度剖析低代码编程带来的机遇。</blockquote><p></p><p></p><p>据说早期人类语言只有“听说”系统，后因国家税收之需，又演化出了“读写”系统。而读写相较于听说的方式，有易于复制传播、歧义少、保存持久等优点……类似的，早期用于人机交流的程序语言只有“字符”系统，现在因为某些诉求，市场上涌现出一批“可视化低代码”系统。什么是低代码，它有哪些优势，我为什么要学习、使用它？低代码未来的市场是怎样的？ 本文重点描述低代码未来 5~10 年的广阔市场 ，但仍循序渐进，从概述低代码编程的历史发展开始。（所以想要了解市场规模和前景的读者，请直接跳转到<a href=\"https://www.infoq.cn/article/Us10TOa418u2xwfZ19Gp#market\">低代码的市场和机遇</a>\"部分）</p><p></p><h2>低代码定义：发展与变迁</h2><p></p><p></p><p>提高生产效率是人类永恒的主题。正因此，我们认为广义的低代码编程，取其字面意思，应当是指在某个时间段内，完成项目所需的代码量（大幅）低于其他语言（平均值）的编程模式。无独有偶，我们的认知与&nbsp;<a href=\"https://www.itprotoday.com/no-codelow-code/evolution-low-codeno-code-development\">ITPro Today</a>\"相合 [1]：文中描述 Fortran 和 COBOL 在&nbsp;1950 年代刚出现时，它们作为高级编程语言的始祖，是那个年代里不折不扣的低代码编程语言——即便现在大多数的编程人员已经不这么认为。文章 [1] 还表示，1987 年苹果公司开发的&nbsp;<a href=\"https://zh.wikipedia.org/wiki/HyperCard\">HyperCard 编程语言</a>\"（尽管不为大多数人所知）是低代码发展中的一个里程碑。HyperCard 融合了一套图形化 、可扩展、可编辑的接口和数据库功能，它的部分设计理念与微软的 Visual Basic 相似，但早于后者 4 年发布。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/41/9d/41a40fe4f4a757f7192bd6540e1f259d.png\" /></p><p></p><p>图 1：HyperCard 图标。图片来源：<a href=\"https://en.wikipedia.org/wiki/HyperCard\">维基百科</a>\"。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/73/bc/73641126bdee7489bd883fab1afb9abc.png\" /></p><p>图 2：HyperCard 界面。图片来源：<a href=\"https://osxdaily.com/2017/05/27/run-hypercard-macos-web-browser-emu/\">OSXDaily</a>\"。</p><p></p><p>1990 年代，随着第四代编程语言（SQL、MATLAB、Clipper 等）的发展与成熟以及高效的应用程序开发工具如 Visual Studio，Delphi 等的横空出世，UML + 设计器 + MDD 红极一时，模型驱动设计、自动代码生成和可视化开发思想成为了当年低代码开发的核心 [2]。直到这时为止，低代码的核心诉求都是提高专业开发人员的开发效率 。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/c0/3a/c06f6b2e8b58e776f79b4cd32f63d33a.png\" /></p><p>图 3：UML 设计图</p><p></p><p>2010 年代，低代码的核心诉求发生剧烈变化，开始向“让业务专家将自己的专业知识和经验落地成在线应用 ”转移 [2]。很多公司没有经费聘用专业的开发人员，因此希望业务专家经过一定的培训也可以上手开发应用，这些应用很大一部分是用于市场营销、销售的，也比较同质化，容易从统一的模板中搭建出。由此，便有了我们所熟知的在当前时代背景下的（狭义）的低代码编程，国际上最具有影响力和代表性的产品有 OutSystems、Mendix、MicroSoft Power Apps 等，这些产品具有以下特点 [3]：</p><p>为让非专业编码人员易于使用，配备了完善的可视化开发框架，不仅提供可视化开发前端、UI 的能力，还提供可视化开发复杂逻辑 的能力：无需记忆编程语言的语法，通过拖拽和点击即可实现业务功能。提供完整的前后端、数据库、部署、运维等解决方案，屏蔽了前端（HTML、JS、Vue / React 等）、后端（NodeJs 或 Java + SpringBoot 等）、数据库（SQL 或 MongoDB 等）、云服务等技术，无需点击，即开即用。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/34/33/349af93ee00f46f43a3885d7ee644233.png\" /></p><p>图 4：OutSystems 可视化逻辑。图片来源：轻舟低代码团队为什么要做编程语言？</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/91/69/919a5ce0ca153e59911628548b25c369.jpeg\" /></p><p>图 5：轻舟低代码可视化逻辑。图片来源：轻舟低代码团队为什么要做编程语言？</p><p></p><p>了解了低代码的大致历史后，我们便知道它并不是先有定义再发展起来的事物 [2]：它的定义随着时代发展而变化，以反应当前时代市场的诉求。因此，我们不妨援引西门子 Mendix 的定义来概述 21 世纪 20 年代的低代码：低代码开发是一种可视化应用开发方法。通过低代码开发，不同经验水平的开发人员能够通过图形用户界面，使用拖放式组件和模型驱动逻辑来创建 Web 和移动应用。了解了低代码的概念后，我们来看看低代码在未来 5~10 年的广阔市场。</p><p></p><h2>低代码的市场和机遇</h2><p></p><p></p><p><span name=\"market\">本章我们先讨论低代码这一新兴技术在全球的发展，再描绘其在中国特定时代背景下（更大）的前景。</span></p><p></p><h3>全球的发展</h3><p></p><p></p><p>在低代码领域，目前海外大约活跃着六十七家供应商，而且它的生态系统正在迅速成长。2017年是一个分界点，在大型软件供应商中，2017 年之前只有 Salesforce 采用 Force.com 的低代码平台。随后，微软、甲骨文、IBM 和 SAP 等企业都纷纷加入了这个市场，低代码（含无代码）市场呈爆发式增长：</p><p>2020 年市场规模达到 108.2 亿美元 [4]。2021 年市场规模达到 163 亿美元 [5]。……2030 年市场规模达到 1485 亿美元 [5] 。……</p><p></p><p>更重要的是，目前低代码市场的增长是超过预期的，例如 2021 年 2 月曾有机构预测改年的低代码市场为 138 亿美元 [6]，而 2022 年回顾的市场实际值为 163 亿 [5]。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/c2/d4/c2c09fdeda44cc12b36c3036yy0208d4.png\" /></p><p>图 6：低代码全球市场份额。原始数据来源：<a href=\"https://www.spreadsheetweb.com/how-big-is-the-global-low-code-no-code-market-and-how-fast-is-it-growing/\">SpreadSheetWeb</a>\" [7]</p><p></p><p>当我们聚焦代表性的个体时，数据同样展现出了潜力 [2]：</p><p>2018 年 Outsystems 获得 KKR 和高盛 3.6 亿美元融资，估值超过 10 亿美元。WordPress、Wix 已逐渐成长为生态完善的可视化（低代码）建站平台，数以百万计的个人和企业在这些平台上搭建自己的官网或者应用。其中 WordPress 的生态厂商 Elementor 在 2020 年初获得 1500 万 A 轮融资，在过去一年中，该插件已部署了 300 多个新功能，还被翻译成 55 种语言，目前获得超过了 400 万活跃安装。低代码建站市场和低代码企业服务领域一样快速发展中。……</p><p></p><p>为什么低代码会有如此广阔的市场？正是因为低代码开发高效灵活稳定，降低了应用搭建的门槛和对专业工程师的依赖，让业务部门用拖拽的方式自行搭建应用平台，减少与 IT 部门反复沟通的流程，最终实打实地降低了人力成本，克服了传统开发交付周期长、定制能力差、难以应对不断变化的市场和客户期望等弱点 [8]：</p><p></p><blockquote>You don’t need to invest in expensive training programs for your employees. You can have them build apps faster, with less training. And at the end of the day, all of this makes your business more revenue [9]. 翻译：你不需要为你的员工投资昂贵的培训项目。你可以让他们以更快的速度建立应用程序，并减少培训。而在一天结束时，所有这些都使你的企业获得更多的收入。</blockquote><p></p><p></p><h3>中国的优势</h3><p></p><p></p><p>在《“十四五”数字经济发展规划》等政策以及企业数字化转型大背景下，能为企业提供降本、增效、提质，并推动数字经济发展的低代码、无代码在正在蓬勃发展 [10]；数字化转型是企业必经的可持续进化历程，越来越多的企业将从“不得不转”转变到“主动要转” [11]。其中无论是政企、医疗、金融业务，还是房地产、制造、零售等，我们都能看到低代码的身影 [12]（以下内容均来自该引用）：</p><p>泰康人寿-泰行销 APP 分公司专栏项目，包含新闻、文章管理，搜索、滚动新闻，消息提醒，新闻、文章列表，大量的数据统计、业绩数据、排名数据、考核数据以及客户数据等特性、内容。使用轻舟低代码平台，通过可视化方式实现数据建模、页面搭建以及业务逻辑编排，在教练指导下&nbsp;2 周完成开发。项目通过扩展组件实现 IT 资产复用，可导出为模板并成为平台资产，其他分公司从而可以通过模板快速搭建专栏。中国联通软件研究院针对业务部门业务需求多样化，开发门槛高，开发周期长等问题，通过研究低代码在轻量级业务场景、通用型业务场景下的应用，帮助企业开发人员提高研发效率，降低开发门槛，赋能企业运营，助力数字化转型。同时，中国联通低代码赋能政企业务受理集约，实现联通政企业务受理集约流程可视化、分钟级配置、所见即所得，流程发布由原来的 2 周提升至 0.5 天，支撑 30 省超 300 个地市，8 大类业务的受理集约。重庆长安汽车与华为基于&nbsp;AppCube 合作，构建智慧党建系统、在线业务预算系统等 6 个企业应用。其中在线业务预算系统需要将庞杂的表单业务在线化，实现计划管理系统、合同管理系统、整车利润分析系统，以及填报、审核、分析、自动生成相应财务报表等预算编制流程等。借助 AppCube 低代码，应用构建效率整体提升了 2~3 倍，经过 3 个多月的努力，基本实现预期目标。中国雄安集团电子招标采购交易平台，结合雄安集团业务复杂性和具体需求，最终在评审结果汇总计算、价格评审计算、费用计算等招采业务场景中使用计算规则引擎整体解决方案，只需 2 小时即可完成传统做法需要 5 天的业务系统升级迭代流程。此方案的计算代码部分由低代码组成。……</p><p></p><p>宏观统计数据也表明：</p><p>2022 年中国低代码无代码市场规模预计为&nbsp;40.6 亿元，并预计在 2025 年达到 118.5 亿元，其年均复合增长率高达 42.9%。其中，低代码产品是总体市场的主要构成，占比 77.6% [10]。2022 年将有&nbsp;40%~60% 的大型企业使用低代码开发应用 [13]。低代码的领军之一 Mendix 更是表示，低代码市场在中国展现出巨大潜力 [14]：低代码发展正当时，中国将取代美国成为低代码开发的全球领导者。报告显示&nbsp;85% 的 IT 决策者表示表示正积极拥抱低代码技术，认为低代码是他们不容错过的趋势，且近一半（44%）的日常开发工作可以在低代码平台上完成。尽管转型领军者的数字化优势进一步加大，2022 年进入转型领军者行列的企业比例仅为 17%，与去年（16%）基本持平。低代码在中国有着巨大的增量市场[11, 14]。低代码应用在高校放彩，促进产学研全链路一体化建设 [15]…………</p><p></p><p>立足中国市场，随着“十四五”规划的推进，中国企业的数字化转型必将取得长足的进步，在降本增效的驱使下，低代码也必将成为中国大多数企业的最佳选择。</p><p></p><h3>更多的统计数据</h3><p></p><p></p><p>根据 UserGuiding 的统计，人们对低代码持有以下观点 [16] ：</p><p><a href=\"https://code.org/promote\">美国有超过50万个</a>\"计算机科学职位空缺，预计它的增长速度是其他工作领域的2倍，但世界上只有&nbsp;<a href=\"https://www.weld.io/blog/only-0-5-percent-of-the-worlds-population-knows-how-to-code\">0.5%</a>\"的人口知道如何编码。到 2024 年，低代码将占到应用开发活动的 65% 以上。“易用性”是人们在描述 低代码 / 无代码开发平台时使用最多的<a href=\"https://aimultiple.com/low-code-platform\">(20%)</a>\"正面词汇，这是基于从所有低代码 / 无代码开发平台公司的客户评论中收集的数据。<a href=\"https://www.mendix.com/blog/infographic-low-code-application-development-trends/\">24%</a>\"的用户在使用低代码 / 无代码平台之前完全没有经验。其中 40% 的用户大多有商业背景。<a href=\"https://assets.appian.com/uploads/2019/03/forrester-tlp-lowcode.pdf\">84%</a>\"的企业转向低代码 / 无代码，因为它们能够减少IT资源的压力，提高上市速度，并让企业参与数字资产开发。<a href=\"https://assets.appian.com/uploads/2019/03/forrester-tlp-lowcode.pdf\">31%</a>\"使用低代码/无代码的企业没有使用它们来构建和交付任何最高价值的应用程序。<a href=\"https://www.mendix.com/blog/infographic-low-code-application-development-trends/\">72%</a>\"的用户在 3 个月或更短的时间内用低代码应用开发应用程序。低代码 / 无代码解决方案有可能将应用程序的开发时间减少&nbsp;<a href=\"https://www.redhat.com/cms/managed-files/mi-451-research-intelligent-process-automation-analyst-paper-f11434-201802.pdf\">90%</a>\"。<a href=\"https://assets.appian.com/uploads/2019/03/forrester-tlp-lowcode.pdf\">30%</a>\"的企业在未来更愿意使用定制的低代码 / 无代码来处理复杂的商业逻辑。……</p><p></p><h2>现有的低代码产品</h2><p></p><p></p><p>最后我们再介绍一些支撑起低代码市场的代表性产品，从离我们比较近的国内产品开始。时至今日，国内的低代码产品已经比较丰富，例如<a href=\"https://sf.163.com/product/lcap\">轻舟低代码平台</a>\"、<a href=\"https://lowcode-engine.cn/index\">阿里低代码引擎</a>\"、<a href=\"https://www.grapecity.com.cn/solutions/huozige\">葡萄城活字格</a>\"、<a href=\"https://www.h3yun.com/site/home?g=Chuanyun&amp;m=Index&amp;a=index\">奥哲氚云</a>\"、<a href=\"https://qingflow.com/\">轻流</a>\"、<a href=\"http://www.primeton.com/products/ep/\">普元 EOS 平台</a>\"等：</p><p>轻舟低代码是网易数帆打造的企业级应用开发平台，兼具（下述）原生低代码和开发工具的特点。它通过简单易上手的可视化编程语言，帮助企业搭建高复杂度、融合企业 IT 资产、交互视觉高保真还原的企业级应用，致力于帮助企业实现低成本、高效率的数字化转型和应用创新。阿里低代码引擎的代表产品有钉钉宜搭等。钉钉宜搭基于阿里云的云基础设施和钉钉的企业数字化操作系统，提供低门槛、高效率的数字化业务 [2]。云平台的厂商希望借助低代码吸引更多用户购买其云服务，因此其低代码产品的发展方向上以深度整合自家云资源，降低门槛为主。葡萄城活字格（Forguncy）是厂商整合自身的开发工具资源后推出了低代码产品，发展方向上以产品力提升为主，在技术门槛和扩展性中间会更倾向于后者 [2]。用户集中在初创型软件开发团队、行业软件代理商、系统集成商和中大企业 IT 中心，而不是一线业务人员。奥哲氚云是低代码行业的创业公司，正处于风口快速发展阶段，后获得阿里系投资，更关注流量和市占率。产品发展上倾向于在降低门槛、与钉钉等流量平台整合 [2]。类似的还有明道云、简道云等。轻流是专注于流程和表单的 BPM 厂商在自身软件的基础上增加可视化设计器，进一步降低使用门槛后，从而实现低代码转型的产品。这些产品的核心优势是强大的工作流引擎，但这种基于表单而不是数据模型的架构，在应对复杂应用场景时可能会遇到诸多障碍 [2]。类似的产品还有炎黄盈动 AWS PaaS 等。普元 EOS 平台可以看成行业软件向通用平台的演进的尝试，它希望利用低代码技术降低实施、特别是实施中客户化开发环节的工作量，提升行业软件自身的竞争力 [2]。典型产品还有用友的 iUAP 等。</p><p></p><p>目前上述产品的海外市场并不多。根据 Fortune Business Insights [4]，我们列出几个重要的海外低代码产品及其简介 [17, 18] 供参考：</p><p>Appian：Appian 配备了原生部署工具和与 Jenkins 等开发工具的集成选项，允许用户建立业务流程管理（BPM）应用程序，帮助企业组织和优化业务流程。Microsoft Power Apps：可快速构建客制化的商业应用程序，它包含了预建的人工智能组件，还具备良好的可扩展性。Salesforce：为每个用户创建个性化的体验，用拖放字段和动作来定制页面，在正确的时间提供正确的信息，构建智能的、可移动的应用程序。OutSystems：提供可视化、模型驱动的工具，以实现快速开发和部署应用程序。它还提供实时性能监控和拥有高安全性。Mendix：常被用于构建改善公司内部流程的解决方案，其用户只需最少量的编程知识和一个良好的策略。Mendix 被用于数字保险、SAP 供应链、货物交付管理和商业分析等各种市场领域。Oracle APEX：Oracle APEX 使开发人员能够快速构建应用程序并解决实际问题。开发人员不需要成为掌握大量网络技术的专家，他可以专注于要解决的问题，Oracle APEX 会完成其余繁重的工作。……</p><p></p><p>说了这么多，哪个低代码平台最火爆呀？对于这个程序员永远关注的话题，我们找到了来自 GradientFlow 的“排名” [19] 如下（选购产品时需综合考量，不能依赖单一排名）：</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/de/3c/de39b441dbfdf748489293403e04403c.png\" /></p><p>图 7：低代码开发平台指数。数据来源：<a href=\"https://gradientflow.com/ranking-low-code-development-platforms/\">GradientFlow</a>\"</p><p></p><p></p><h2>小结</h2><p></p><p></p><p>我们概述了上世纪和本世纪的低代码产品定位（提高专业开发人员的开发效率 vs 让业务专家将自己的专业知识和经验落地成在线应用），讨论了低代码的大致定义，然后通过大量统计数据和一些中国的典型案例描绘了低代码在近年的高速发展和其在未来 5~10 年国内外的巨大市场，最后介绍了一些支撑起这个市场的国内外的低代码产品。为了较好地解决低代码产品的诉求，低代码平台具体需要怎么做，技术上有哪些挑战，不同的方案效果如何？我们会在本专栏文章的后续篇章中一一解明。 </p><p></p><h2>参考</h2><p></p><p></p><p><a href=\"https://www.itprotoday.com/no-codelow-code/evolution-low-codeno-code-development\">[1] The History of Low-Code/No-Code Development - ITPro Today</a>\"</p><p><a href=\"https://mp.weixin.qq.com/s/vN0Mk4q4bQMbilNlQXS8Yg\">[2] 低代码发展现状调研和思考 - 管中窥豹非其全</a>\"</p><p>[3] 轻舟低代码团队为什么要做编程语言？(起草中，后续发布)</p><p><a href=\"https://www.fortunebusinessinsights.com/low-code-development-platform-market-102972\">[4] Low Code Development Platform Market Scope with Size, Share - Fortune Business Insights</a>\"</p><p><a href=\"https://www.globenewswire.com/news-release/2022/09/15/2517120/0/en/Low-Code-Development-Platform-Market-Size-is-projected-to-reach-USD-148-5-Billion-by-2030-growing-at-a-CAGR-of-27-8-Straits-Research.html\">[5] Low Code Development Platform Market Size is projected to - Globe News Wire</a>\"</p><p><a href=\"https://www.gartner.com/en/newsroom/press-releases/2021-02-15-gartner-forecasts-worldwide-low-code-development-technologies-market-to-grow-23-percent-in-2021\">[6] Gartner Forecasts Worldwide Low-Code Development Technologies Market to Grow 23% in 2021 - Gartner</a>\"</p><p><a href=\"https://www.spreadsheetweb.com/how-big-is-the-global-low-code-no-code-market-and-how-fast-is-it-growing/\">[7] How Big is the Global Low-Code / No-Code Market and How Fast is it Growing? - Spread Sheet Web</a>\"</p><p><a href=\"https://pdf.dfcfw.com/pdf/H3_AP202103221474638909_1.pdf\">[8] 化繁为简：低代码行业研究报告 - 艾瑞咨询</a>\"</p><p><a href=\"https://kissflow.com/low-code/history-of-low-code-development-platforms/\">[9] The History of Low-Code Development Platform - kissflow</a>\"</p><p><a href=\"https://www.donews.com/news/detail/4/3210864.html\">[10]《2022年中国低代码无代码市场研究及选型评估报告》- 海比研究院</a>\"</p><p><a href=\"https://www.accenture.cn/content/dam/accenture/final/markets/growth-markets/document/Accenture-China-Digital-Transformation-Index-Report.pdf#zoom=50\">[11] 数字化转型：可持续的进化历程 - 埃森哲</a>\"</p><p><a href=\"https://www.sgpjbg.com/baogao/93515.html\">[12] 《2022 低代码 · 无代码 应用案例汇编》，2022 年 8 月第一版 - 企业数字化发展共建共享平台</a>\"</p><p><a href=\"https://new.qq.com/rain/a/20220106A03NY900\">[13] 2022中国“低代码”领域十大趋势 - 腾讯新闻</a>\"</p><p><a href=\"https://www.163.com/dy/article/GNQLJJUQ051494RM.html\">[14] 低代码发展正当时，中国将取代美国成为低代码开发的全球领导者 - 美通社资讯</a>\"</p><p><a href=\"https://www.163.com/dy/article/H34TF96605118VBB.html\">[15] 2022年中国低代码行业生态发展洞察报告 - 艾瑞咨询</a>\"</p><p><a href=\"https://userguiding.com/blog/no-code-low-code-statistics/\">[16] No-Code / Low-Code Statistics and Trends - User Guiding</a>\"</p><p><a href=\"https://www.trio.dev/blog/low-code-platforms\">[17] 9 Best Low-Code Platforms To Use in 2022 - Trio Developers</a>\"</p><p><a href=\"https://mobitouch.net/blog/10-best-low-code-no-code-platforms-to-create-an-effective-digital-product/\">[18] 10 Best Low-Code / No-Code Platforms To Create an Digital Product - Mobi Touch)</a>\"</p><p><a href=\"https://gradientflow.com/ranking-low-code-development-platforms/\">[19] Ranking Low-code Development Platforms - Gradient Flow</a>\"</p><p></p><p>作者简介： </p><p></p><p>网易数帆编程语言实验室负责轻舟低代码平台核心编程能力的设计，包括类型系统、语义语法、声明式编程、可视化交互等 NASL 的语言设计，Language Server、可视化引擎等，以及后续演进方案的规划和预研，旨在创造低门槛高上限的低代码开发体验。</p>",
    "publish_time": "2023-02-07 11:26:14",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "搜索引擎要变天了：谷歌正式宣布推出 Bard，应对突然上线的增强型Bing",
    "url": "https://www.infoq.cn/article/z30mE0bxrvItO9Mm52Nw",
    "summary": "<p>北京时间2月7日，谷歌CEO桑达尔·皮查伊突然在官方博客上宣布推出谷歌下一代AI对话系统 Bard。面对来自微软 Bing 和 OpenAI 的 ChatGPT 日益激烈的竞争，该对话系统将很快集成到谷歌的搜索引擎中。皮查伊说，该软件今天将提供给一组“受信任的测试人员”，然后“在未来几周内更广泛地向公众提供”。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/7c/7cb0da3a8b8ef044c8a56ad1a12a451a.jpeg\" /></p><p></p><p>桑达尔·皮查伊署名文章</p><p>&nbsp;</p><p>“两年前，我们推出了对话应用程序语言模型（简称 LaMDA）提供支持的下一代语言和对话功能，”皮查伊在文章中说。“我们一直在研究一种实验性的对话式 AI 服务，由 LaMDA 提供支持，我们称之为 Bard。”</p><p><img src=\"https://static001.infoq.cn/resource/image/d2/e9/d2262fbabfbabdb5db0yya05b03bc7e9.gif\" /></p><p></p><p>&nbsp;</p><p>皮查伊还指出，Bard“利用网络信息提供新鲜、高质量的回复”，这表明它可能能够回答有关最近事件的问题——这是 ChatGPT 难以解决的问题。比如，Bard可以帮你向 9 岁的孩子解释 NASA 的詹姆斯·韦伯太空望远镜的新发现，或者为你提供关于当前足球界最佳前锋的信息。</p><p>&nbsp;</p><p>Bard 看起来可以与 ChatGPT 的对话能力相媲美，但似乎更侧重于搜索和可解释性，而不是成为能够写诗或散文的通用语言模型。Bard 的预览片段显示模型以要点形式生成响应。</p><p>&nbsp;</p><p>谷歌相信语言模型可以更有效地从互联网中提取信息，让人们更容易直接找到他们正在寻找的东西，而无需自己去浏览多个网站。</p><p>&nbsp;</p><p>“当人们想到谷歌时，他们通常会想到向我们寻求快速的事实性答案，比如‘一架钢琴有多少键？’ 但是，越来越多的人转向谷歌寻求更深入的见解和理解——比如，“钢琴还是吉他更容易学习？每个乐器需要多少练习？”了解这样的话题可能需要花费很多精力来弄清楚你真正需要知道的东西，人们往往希望探索各种不同的意见或观点。”皮查伊解释道。&nbsp;</p><p>&nbsp;</p><p>Bard 最初由LaMDA提供支持，随后会有一系列更多的模型。谷歌还表示，它计划创建一套让开发人员和企业可以使用的工具和API，该 API 将包含一系列基于其 LaMDA 系统的语言模型，如 OpenAI 基于 GPT-3 的模型。&nbsp;</p><p>&nbsp;</p><p></p><h2>ChatGPT 驱动的 Bing曾短暂上线</h2><p></p><p>&nbsp;</p><p>去年 ChatGPT 推出后，搜索巨头谷歌拉响了“红色代码”警报。这次关于Bard 匆忙、信息含糊不清的公告，很可能是谷歌“红色代码”的产物。</p><p>&nbsp;</p><p>尽管 ChatGPT 的基础技术不是革命性的，但 OpenAI 在网络上免费提供该系统后，让大众有机会接触到了这种新型的自动文本生成形式。其影响是巨大的，人们对这项新技术显然十分着迷，瑞银分析师最近的一份报告称，ChatGPT 每月用户已达到 1 亿，成为历史上增长最快的互联网应用程序。&nbsp;</p><p>&nbsp;</p><p>已向 OpenAI 投资数十亿美元的微软也适时抓住了这个机会，据说微软正在将 ChatGPT 集成到其 Bing 搜索引擎及其他办公软件套件中。</p><p>&nbsp;</p><p>前一两天，有几位 Bing 用户注意到，集成了 ChatGPT 的新版 Microsoft Bing 曾短暂地上线了，这表明该公司在准备推出一种革命性的网络搜索新方式。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/11/11cdb9a90da5f8d8d6e884ed5d780d5a.jpeg\" /></p><p></p><p>&nbsp;</p><p>根据其中一位用户提供的一些简单测试截图显示，新系统不仅可以回答问题，还可以以对话的方式提问。新Bing显然也可以引用其来源，这是一个重要的特性，因为像 ChatGPT 这样的语言模型无法描述它们的信息来源，这让它们显得不那么可靠。不过几分钟后，该AI增强的Bing就下线了……“当我意识到我在看什么时，下巴都惊掉了！”</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/38/38a70d8343d1a033e6e16ede96f1e798.png\" /></p><p></p><p>Bing与用户的对话</p><p>&nbsp;</p><p>根据这些截图来看，这些界面都与 ChatGPT 本身的 UI 相似，它还提供了有关如何最好地使用 AI 聊天机器人的建议，并警告自己的答案可能不可靠。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/b1/b119990ea947a3a98a833684a150a1a8.png\" /></p><p></p><p>新Bing未能回答有关编码的问题。该UI 可能是一个早期的开发项目，被意外地推出了。</p><p>&nbsp;</p><p></p><h2>搜索引擎要变天了？</h2><p></p><p>&nbsp;</p><p>虽然谷歌在为 ChatGPT 提供支持的人工智能技术方面拥有深厚的专业知识（事实上，谷歌发明了关键技术——GPT 中的“T”，即transformer），但该公司一直以非常谨慎的方式进行公开。谷歌之前通过其AI Test Kitchen App应用程序提供了支持 Bard 的语言模型 LaMDA ，但这个版本非常受限，只能生成与少数查询相关的文本。</p><p>&nbsp;</p><p>LaMDA 和 GPT-3.5（为 ChatGPT 提供支持）等大型语言模型有可能会吐出仇恨言论等有毒内容，或者是虚假信息。谷歌一直对此表示担忧，但即将推出的 Bard 标志着谷歌对这项技术的态度发生了重大变化。</p><p>&nbsp;</p><p>关于微软想用AI改造其搜索引擎 Bing 的说法，一定程度上促使了谷歌推出Bard服务。</p><p>&nbsp;</p><p>谷歌在搜索市场占据主导地位，并利用其力量收获了数十亿美元的在线广告营收——Alphabet 最大的收入来源。由于微软的威胁，谷歌不得不迅速提出自己的人工智能搜索解决方案。&nbsp;</p><p>&nbsp;</p><p>如果微软用更强大的语言模型来增强网络搜索，用户会突然背弃谷歌而涌向Bing吗？这还有待观察，但很明显，搜索领域变革时代开始了。</p><p>&nbsp;</p><p>在谷歌发布 Bard 之后，微软也随即宣布将于 2 月 7 日北京时间晚上11点，与OpenAI一起在微软总部举办重大发布会。关于要发布什么内容该公司并没有太多预告，但很可能是关于传闻中的 ChatGPT 与 Bing 的整合，以及与 OpenAI 更广泛的合作。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/4e/4e4aef4915e8b00b5ac819372f0d1d57.png\" /></p><p></p><p>&nbsp;</p><p>与此同时，谷歌也宣布将于 2 月 8 日举办一场关于搜索和人工智能的活动，该活动将会在Youtube上进行直播。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/9f/9f5aaf1891ecc85757d2982d7a452a2d.jpeg\" /></p><p></p><p>&nbsp;</p><p>&nbsp;</p><p>参考链接：</p><p><a href=\"https://blog.google/technology/ai/bard-google-ai-search-updates/\">https://blog.google/technology/ai/bard-google-ai-search-updates/</a>\"</p><p><a href=\"https://www.youtube.com/watch?v=yLWXJ22LUEc\">https://www.youtube.com/watch?v=yLWXJ22LUEc</a>\"</p><p><a href=\"https://medium.com/@owenyin/scoop-oh-the-things-youll-do-with-bing-s-chatgpt-62b42d8d7198\">https://medium.com/@owenyin/scoop-oh-the-things-youll-do-with-bing-s-chatgpt-62b42d8d7198</a>\"</p><p><a href=\"https://www.theverge.com/2023/2/3/23584675/microsoft-ai-bing-chatgpt-screenshots-leak\">https://www.theverge.com/2023/2/3/23584675/microsoft-ai-bing-chatgpt-screenshots-leak</a>\"</p><p><a href=\"https://www.theverge.com/2023/2/2/23583701/google-search-ai-event-february-maps\">https://www.theverge.com/2023/2/2/23583701/google-search-ai-event-february-maps</a>\"</p><p><a href=\"https://twitter.com/Owen_Yin\">https://twitter.com/Owen_Yin</a>\"</p>",
    "publish_time": "2023-02-07 11:33:53",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]