[
  {
    "title": "改善开发者体验，小公司也能在技术竞争中崭露头角",
    "url": "https://www.infoq.cn/article/vAOw5SZdk5OkQYbiS98j",
    "summary": "<p>一种改善开发者体验的策略是消除开发人员和为他们提供支持的平台团队的耗时任务和瓶颈。如何引入改变很重要，在实现变更之前理解“为什么”可以让事情进展得更加顺利。</p><p></p><p>Jessica Andersson在<a href=\"https://ndcoslo.com/?accessToken=eyJhbGciOiJIUzI1NiIsImtpZCI6ImRlZmF1bHQiLCJ0eXAiOiJKV1QifQ.eyJleHAiOjE2ODg3MTUxMjAsImZpbGVHVUlEIjoiY1c0ZG9NNnRycDRHbTA1NCIsImlhdCI6MTY4ODcxNDgyMCwiaXNzIjoidXBsb2FkZXJfYWNjZXNzX3Jlc291cmNlIiwidXNlcklkIjo2MjMyOH0.zr6hTdl8Y6F9Q6OcpcXTn54Wwj5fR42-mmDfX0tqmn0\">NDC 2023大会</a>\"（于挪威首都奥斯陆举行）上谈到了如何改善小型团队的开发者体验。</p><p></p><p>Andersson解释说，开发者体验包括软件开发人员在开发和维护软件的工作中所做的所有事情，例如编写代码、测试、构建、部署、监控和维护：</p><p></p><p></p><blockquote>我经常从产品的角度来考虑这个问题，因为开发团队对产品的生命周期负责。良好的开发者体验可以让开发人员专注于让产品在竞争中脱颖而出，并为用户创造价值。</blockquote><p></p><p></p><p>他们改善开发者体验的策略是消除耗时的任务和瓶颈。首先是让开发者可以放开手脚去干。Andersson说，如果一名开发者的进展必须等待团队之外的人，那么他们就无法作为一个自主的团队，也无法完全掌握自己的产品生命周期。</p><p></p><p>接下来，从平台团队中移除耗时的任务。为了能够持续地向开发者提供更好的开发者体验，他们需要确保平台团队不会陷入无休止的升级和迁移循环中。</p><p></p><p>在将平台团队解放出来之后，重点转向了帮助开发人员移除耗时的任务，从而让他们获得更好的开发者体验。</p><p></p><p>Andersson提到，如何引入变更很重要，如果你在引入变更之前理解“为什么”要这么做，那么实现变更就会更容易。他们为开发者引入了一个完全不同的工作流程，他们认为这将是一个巨大的改进，但在开发者理解为什么以及如何做出改进之前遇到了一些阻力：</p><p></p><p></p><blockquote>从长远来看，它变成了一种非常受欢迎的工作方式，但是如果我们在实现变更之前花更多的精力在思考为什么引入变更上，那么交付可能会变得更加顺利。</blockquote><p></p><p></p><p>Andersson说，你需要让开发者相信你能够为他们带来价值，与开发者保持良好的关系是了解他们的问题以及如何改善他们日常工作的关键。</p><p></p><p>InfoQ就如何改善开发者体验采访了<a href=\"https://www.linkedin.com/in/anderssonjessica/?accessToken=eyJhbGciOiJIUzI1NiIsImtpZCI6ImRlZmF1bHQiLCJ0eXAiOiJKV1QifQ.eyJleHAiOjE2ODg3MTUxMjAsImZpbGVHVUlEIjoiY1c0ZG9NNnRycDRHbTA1NCIsImlhdCI6MTY4ODcxNDgyMCwiaXNzIjoidXBsb2FkZXJfYWNjZXNzX3Jlc291cmNlIiwidXNlcklkIjo2MjMyOH0.zr6hTdl8Y6F9Q6OcpcXTn54Wwj5fR42-mmDfX0tqmn0\">Jessica Andersson</a>\"。</p><p></p><p>InfoQ：你在为小团队改善开发者体验方面遇到了哪些挑战？</p><p></p><p></p><blockquote>Jessica Andersson：我们不可能什么都做，也不可能一次性做完所有事情。我们每次只做一件事，简化它并做好它，一旦做到“刚刚好”，就可以转向下一件事。我们还需要注意我们引入的依赖关系和所使用的工具，所有东西都需要保持最新，处在一种不断更新却没有新改进空间的状态是一种风险。</blockquote><p></p><p></p><p>InfoQ：你能举个例子说明你是如何改善开发者体验的吗？</p><p></p><p></p><blockquote>Andersson：在为开发人员清除阻碍方面，我以我们使用DNS进行服务发现为例。DNS需要手动处理，只有两个人可以访问Cloudflare，我就是其中之一。这意味着每当开发人员想要部署新服务或更新或删除现有服务时，他们都必须来找我。这并不是我们想要的理想的工作方式，所以我们开始研究如何在Kubernetes环境中采用不同的方式来解决这个问题。我们对ExternalDNS做了调研，发现它支持通过Kubernetes资源来管理DNS记录。对于我们来说，启动和运行它真的很简单，并且迁移手动创建的现有DNS记录到ExternalDNS也很容易。开发人员很快就适应了新流程，我们在几周内就看到了这么做的好处！</blockquote><p></p><p></p><p>InfoQ：“黄金路径”或“平坦路径”能为开发人员带来什么好处？</p><p></p><p></p><blockquote>Andersson：开发人员可以重用用于解决已知问题的黄金路径，例如，对不同的应用程序使用相同的监控解决方案。另一个好处是降低认知负担，在不同的应用程序上应用相同的方法，维护多个应用程序也会变得更容易。</blockquote><p></p><p></p><p>InfoQ：对于想要改善开发者体验的小型团队或组织，你有什么建议？</p><p></p><p></p><blockquote>Andersson：我最强烈的建议是，在决定做什么之前，先评估一下你自己的组织和环境。找出你可以对开发者体验产生影响的地方，选择做一件事并加以改进！避免抄袭别人的做法，除非它对于你的组织来说也有意义。</blockquote><p></p><p></p><p></p><p>原文链接：</p><p><a href=\"https://www.infoq.com/news/2023/06/developer-experience-small-org/?accessToken=eyJhbGciOiJIUzI1NiIsImtpZCI6ImRlZmF1bHQiLCJ0eXAiOiJKV1QifQ.eyJleHAiOjE2ODg3MTUxMjAsImZpbGVHVUlEIjoiY1c0ZG9NNnRycDRHbTA1NCIsImlhdCI6MTY4ODcxNDgyMCwiaXNzIjoidXBsb2FkZXJfYWNjZXNzX3Jlc291cmNlIiwidXNlcklkIjo2MjMyOH0.zr6hTdl8Y6F9Q6OcpcXTn54Wwj5fR42-mmDfX0tqmn0\">https://www.infoq.com/news/2023/06/developer-experience-small-org/</a>\"</p>",
    "publish_time": "2023-07-12 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "加速大模型应用落地最后一公里，AI基础设施如何再升级？",
    "url": "https://www.infoq.cn/article/6EWvNa5y5YP97buj3Rdw",
    "summary": "<p>AI 大模型热潮来袭，当下，越来越多的大模型在千行百业中落地应用。作为 AI 大模型的“底座”，AI 基础设施承载着顶层大模型的建设，也是大模型应用落地的关键。在算力、数据和基础软件三大 AI 基础设施中，<a href=\"https://www.infoq.cn/article/FRXOJ4dDWCK34mzO9EDM\">算力</a>\"是驱动大模型发展的底层动力，数据是训练大模型的信息基础，基础软件则是大模型应用落地的主要效率支撑。</p><p>&nbsp;</p><p>6 月 30 日，九章云极DataCanvas 举办“New AI · New Data · New Software”主题发布会，发布了“AIFS（AI Foundation Software）”、“DataPilot”两款新系列产品。</p><p>&nbsp;</p><p>在发布会上，九章云极DataCanvas 董事长方磊提到，“大模型时代需要完整基础设施升级，而不是依靠单个大模型解决所有的问题；大模型的落地将解决更困难的问题，引起更深远的影响，而它并不比小模型更容易。”</p><p>&nbsp;</p><p>大模型时代的 AI 技术依然需要“最后一公里”的结合。方磊指出，软件、模型和硬件的统一优化空间巨大，是创新最活跃的地方。强大灵活的基础软件，开放弹性的白盒模型，精通业务的专业人才，将加速实现最后一公里的跨越。</p><p></p><h2>大模型时代，AI 基础软件扮演什么角色？</h2><p></p><p>&nbsp;</p><p><a href=\"https://www.infoq.cn/article/bQHRqFcQ1TlJCqHuczGR\">ChatGPT</a>\" 的爆火加速 AI 大模型应用落地。今年以来，越来越多的企业涌入 AI 大模型赛道，行业进入“白热化”竞争状态。有不少专家表示，大模型背后的技术理念早已存在多年，因此 AI 大模型并不存在技术壁垒。</p><p>&nbsp;</p><p>“现在训练 AI 大模型最大的挑战主要集中在算力和数据层面”，九章云极DataCanvas 副总裁于建岗在接受 InfoQ 采访时表示，大模型的构建本身并没有不可逾越的基础鸿沟，主要是基于 Transformer 进行构建，对企业而言，如何更好且更有效率地运用算力和数据才是核心痛点。“大模型对算力的需求巨大，对于中小企业而言，本身没有足够的 GPU 支撑其去搭建大模型。此外，大模型对数据的需求量也有一定的要求，中小企业很难获得足够的数据训练大模型。”</p><p>&nbsp;</p><p>在这一背景下，AI 基础软件的重要性凸显。未来随着算力性能逐渐同质化和标准化，数据的差异性和企业需求的个性化逐渐加大，“AI 基础软件”将成为模型训练效率和算力使用效率的决定性因素。作为模型生态系统的中坚力量，AI 基础软件将会成为大模型应用落地的最主要的效率支撑，并通过大模型+小模型的方式，形成模型训练新范式。</p><p>&nbsp;</p><p>与构建传统应用相比，构建大模型应用的基础软件主要解决系统和架构层优化，通过一系列工具和服务，帮助企业快速、高效构建上层 AI 应用。于建岗表示，“训练大模型需要庞大的计算集群，如何更好的处理集群之间的通信？如何更好的进行模型切分？如何更好的利用内存和显存？这些都需要 AI 基础软件来解决。AI 大模型时代对基础软件最大的诉求就是如何实现模型训练优化，包括运行时推理效率的优化等等。”</p><p></p><h2>模型训练新范式：大模型+小模型</h2><p></p><p>&nbsp;</p><p>AI 基础软件使得 AI 技术的应用更加广泛和高效，并为各个行业和领域的发展提供了强有力的支持。当前，企业对 AI 技术的关注度高涨，也为 AI 基础软件市场带来新的增长机遇。Gartner 预测，中国的 AI 软件市场将保持快速增长。预计未来五年，该市场的营收将从 47.67 亿美元增长至 138.58 亿美元，年复合增长率(CAGR)达到 28%。</p><p>&nbsp;</p><p>“现在，越来越多的企业意识到 AI 基础软件的重要性。九章云极DataCanvas在基础软件领域耕耘多年，我们认为只要针对企业在训练和应用大模型的过程中的痛点提供切实有效的解决方案，企业完全可以做出自己的 AI 大模型并且落地本企业的应用。”于建岗说道。</p><p>&nbsp;</p><p>基于这种认知，九章云极DataCanvas 正式发布了人工智能应用构建基础设施平台 AIFS（AI Foundation Software），其覆盖了大模型的训练、精调、压缩、部署、推理和监控以及小模型的全生命周期过程，为数据科学家、应用程序开发人员和业务专家提供了一套工具，使不同角色的人员可以相互协作，轻松地处理数据并使用这些数据来开发、训练和部署任何规模的模型。</p><p>&nbsp;</p><p>作为人工智能基础软件体系，AIFS 主要包括 DataCanvas Alaya 九章元识大模型、DataCanvas APS 机器学习平台、DataCanvas BAP 面向业务自动建模平台、开源 DAT 自动机器学习软件、开源 YLearn 因果学习软件等一系列全开放、高自动、高协同的软件工具，为用户自主构建全生命周期的“大+小”模型提供一站式支持。</p><p>&nbsp;</p><p>“我们认为一个足够智能的、能够覆盖所有小模型的大模型时代还没有到来，比如在精准科学计算和符号推理方面大模型并不比小模型可靠，所以当前还是大小模型并存的时代。”在于建岗看来，大模型可以基于对通用知识的理解变得更广泛，也可以通过压缩或者知识蒸馏，部署到小模型环境中去替代一部分能力。但整体而言大小模型并存的时代还会延续一段时间。</p><p>&nbsp;</p><p>九章云极 DataCanvas 董事长方磊也曾在一场演讲中表示，尽管大模型当前表现优异，但对于各行业使用者来说，实际应用于业务场景仍然存在较高的技术和成本门槛。方磊指出，当前迎来“大+小”的新纪元，不仅仅是<a href=\"https://www.infoq.cn/news/g945FdRPEtDy3dHckEIU\">大模型和小模型</a>\"的融合使用，大模型的小型化，或者说以大模型为底座的小型化微调，也是一种趋势，这种方式能够以低廉的成本解决大量的问题。</p><p>&nbsp;</p><p>“大和小是一个相对的变化。”当前大模型的参数标准并不统一，相对于参数级，模型的效果且是否能够支持快速迭代对于用户实际应用来说更为重要。用户能够在一个白盒大模型基础上快速地、低成本地微调和迭代出客制化的小模型，才能高效地实现丰富场景的大模型应用。这就再次点明了 AI 基础软件工具链的重要性。</p><p>&nbsp;</p><p>值得一提的是，本次发布的 DataCanvas Alaya九章元识大模型，具有“通识+产业”系列模型矩阵、多模态大模型、优化的训练机制和友好的开源协议管理等特点。在开源支持方面，九章元识不仅支持 Apache2.0 协议，还为用户提供白盒模型。于建岗强调，这是公司对产品“开放性”的坚守，旨在为用户赋予更大自由度的 AI 创新能力，以求加速实现大模型在多元业务场景中的应用。</p><p></p><h2>数据处理新范式：DataPilot</h2><p></p><p>&nbsp;</p><p>在过去的十几年，数据通常被认为是 AI 的原料、基础要素。而大模型的出现，让数据得到了AI的反向赋能。</p><p>&nbsp;</p><p>利用 DataCanvas Alaya 九章元识大模型的通用文本的理解和生成能力以及在数据领域的微调优化，九章云极DataCanvas 发布了数据处理新范式——DataPilot 数据领航员，可以帮助用户实现数据在建模全生命周期的智能化与自动化。</p><p>&nbsp;</p><p>九章云极 DataCanvas 公司副总裁周晓凌介绍，DataPilot 的特性包括多模“向量海”数据架构，按需自动化数据集成、代码生成、流程编排和分析计算，以及基于自然语言的数据获取、分析和机器学习建模能力。DataPilot 能够大幅降低数据集成、治理、建模、计算、查询、分析、机器学习建模全链路的技术门槛，降低数据驱动业务发展的成本，加快数字化创新的进程。</p><p>&nbsp;</p><p>基于“向量海”理念，DataPilot 所包含的 DataCanvas RT 实时决策中心平台、开源 DingoDB 多模向量数据库等各类数据软件，让用户具备 AI 技术突破情况下亟需的实时、多模态的数据能力。</p><p>&nbsp;</p><p>其中，DingoDB 作为一款开源的多模态向量数据库，将是向量海时代的强大引擎。它结合了数据湖和向量数据库的特性，支持存储任何类型（键值、PDF、音频、视频等）和任何大小的数据。通过 DingoDB，用户可以构建专属的数据“向量海”，不论是结构化还是非结构化数据，仅通过 1 套 SQL 即可完成多模态数据的分析与科学计算。</p><p>&nbsp;</p><p>“未来，AI 基础软件的发展会更加多样化，模型之间的数据交换也会更加频繁，也许会产生新的连接方式与生态。此外，在国家战略与政策推动下，未来可能会出现一些相对统一化的模型，这些都会驱动 AI 基础设施进一步升级。”周晓凌说道。</p>",
    "publish_time": "2023-07-12 09:41:47",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "探索大模型智能：众安保险基于AIGC 的应用实践",
    "url": "https://www.infoq.cn/article/9SwCpK6cIk4sReXDDjq5",
    "summary": "<p>采访嘉宾｜蒋纪匀，众安保险 CTO</p><p></p><p>每一次技术浪潮的兴起，或多或少都会对各行各业产生深远的影响，并带来突破和进步的机会。此时行业中总有一些敏锐的从业者会及时抓住机遇，积极采用新技术，优化业务流程，改进产品和服务，从而获得更大的竞争优势。</p><p></p><p>众安保险，是当下 <a href=\"https://www.infoq.cn/minibook/g1WRWQi0OhjlSdUI6kPI\">AIGC</a>\" （ AI-generated Content，人工智能生成内容）浪潮里其中一个敏锐的先行者，它自 2022 年开始调研 ChatGPT 并探索 AIGC 在自身业务的落地应用。</p><p></p><p>“随着 AIGC 浪潮的兴起，我们认为，协作智能将成为数字化向智能化转型的科学前沿。而在这个趋势下，特别是金融保险这类数据密集、并且直接服务于人的行业，将迎来快速突破和进展。”众安保险 CTO 蒋纪匀近日接受 InfoQ 采访时如是说。</p><p></p><h2>探索 AIGC 在保险业务的应用，技术与业务双向奔赴</h2><p></p><p></p><p>作为互联网保险公司，<a href=\"https://www.infoq.cn/article/xAWCqCUkkWKqFQTdhhsQ\">众安保险</a>\"一直都侧重于通过科技手段打破传统保险业的行业壁垒。据了解，目前众安保险已将 AIGC 技术应用到内部多个流程环节中，尤其在营销服务场景， AIGC 已经做到能够辅助众安保险的员工快速生成各类营销素材、加速产品上线，比如制作文案内容、视觉设计、优化推文效果等等。</p><p></p><p>其中，在制作文案内容方面，员工可以利用 AIGC 工具生成符合品牌形象和市场趋势的文案、标题、描述、标语等内容，提高广告文案的工作效率，并快速批量生成科普类文章。</p><p></p><p>视觉设计方面，通过 AIGC 相关的工具和平台，能够快速生成符合品牌形象和市场趋势的视觉设计元素，大幅提升了营销素材的设计效率。比如，以前需要三天才能完成的产品海报图，现在只需两三个小时就能生成多套不同风格的图片。此外，在直播背景墙、活动营销图片、图标、动画等多个场景中，员工都可以迅速应用 AIGC 工具为营销的各个环节赋能，加快产品和活动的上线速度。</p><p></p><p>与此同时，众安保险还可以利用 AIGC 的文本数据分析能力优化营销内容，根据社交媒体平台的数据分析，优化现有的营销内容，生成更具吸引力的推文标题、内容和标签，以提高推文的点击率和曝光率。</p><p></p><p>此外，除了内容生成相关的能力，AIGC 还被应用在智能客服领域，充当辅助助手的角色。当坐席与用户沟通的时候，它可以帮助坐席自动生成回答，并在通话结束后自动生成会话总结，根据场景和语义提取新线索。</p><p></p><p>据了解，众安保险一直都有配智能客服服务，但传统智能客服是基于自然语言处理（NLP）技术，如今团队则基于<a href=\"https://www.infoq.cn/article/kPUyVsWATRdiJuGWKCSt\">LLM</a>\"开发了新的智能客服，并通过AB测试发现新的智能客服在准确率方面提高了25%，实现了更高级别的智能化。</p><p></p><p>“这些应用都取得了积极的效果，并得到各业务部门的肯定和积极反馈。”蒋纪匀表示，目前众安保险内部的业务人员对数据 AI 模型的认知不断提升，许多人都积极学习 AI 技术，包括 AIGC 的使用，“技术和业务团队之间开始展现双向奔赴的趋势”。</p><p></p><h2>有针对性地应用 AIGC</h2><p></p><p></p><p>当我们使用像 ChatGPT 或 Midjourney 这类 AIGC 应用时，可能会觉得这很简单，就像雇了一个数字员工。然而，在垂直行业里的实际应用情况并没有宣传片中看起来那么简单。</p><p></p><p>面对 AIGC 的应用，不同公司会采取不同策略，比如自建大模型、fine-tuning（微调）和embedding（嵌入）等，每种方式都有其优缺点。众安保险认为，中小型保险公司采用embedding是较为合适的路径，因为自建大模型需要大量的数据、资源和人力来标注，这对普通公司来说是难以承载的。此外，数据的合法性和合规性也是一个核心问题，尤其对于像保险公司这样的金融机构来说，客户数据的安全和隐私不可忽视，因此不可以拿客户数据来训练。</p><p></p><p>此外，由于ChatGPT 3.5已经无法很好地支持fine-tuning，所以众安保险最终选择基于embedding的思路打造了自己的 AIGC 中台——灵犀，为企业提供了一套 AIGC 应用场景研发落地的标准范式，其 embedding 能力主要基于一站式文本嵌入、知识库切片的复杂性屏蔽，以及知识库向量化复杂度的屏蔽等。</p><p></p><p>蒋纪匀指出，将 AIGC 应用于保险业务场景的过程中还面临着一些比较大的挑战。</p><p></p><h4>寻找价值点，“对话”不是唯一形式</h4><p></p><p></p><p>首先，众安保险团队需要根据AIGC场景下的最佳实践进行产品化，并进行内部调优和提升。</p><p></p><p>对此，蒋纪匀进一步解释称，虽然 AIGC 在处理自然语言和逻辑推理方面非常强大，但若面对一些感性或过于复杂难以理解的问题，它可能无法给出准确的答案。这也是通用人工智能的一个比较显著的问题。</p><p></p><p>因此，团队首先需要对复杂问题进行理解和抽象，将其简化为大模型可以解决的问题。在这个过程中，众安保险团队进行了很多适应不同场景的提示工程和知识库的开发。这些提示工程和知识库的目的是帮助用户更好地使用 AIGC ，而不是仅依赖通用化的人工智能来解决问题。</p><p></p><p>对于上述挑战，蒋纪匀分享了一些实践经验。一方面，始终坚持以价值为导向，寻找 AIGC 在落地应用中的价值点。</p><p></p><p>“将 AIGC 应用到实际业务中是为了增加业务价值，而不是为了验证技术的可行性。”其指出，很多时候，我们可能会陷入一种误区，就是认为任何问题都可以通过 AIGC 来解决。然而，最核心的问题其实是要判断某个问题是否适合使用 AIGC 来解决。</p><p></p><p>而在此判断过程中，需要进行价值增量的分析和推演，判断是否简化了原有流程、提升了用户体验、增加了整体吞吐量，以及对业务价值和成本降低的贡献。如果最终答案不能令人满意，那就不应该在这个点上投入资源。</p><p></p><p>其次，要意识到对话是一种选项，但不是唯一的选项。虽然在使用AIGC时，默认的交互方式是对话，许多人认为只要不断与之对话并细化需求，最终问题就能得到解决。然而，在实际应用中，提示工程对微小变化非常敏感，而对大多数用户来说，掌握这些技巧并不容易。</p><p></p><p>因此，如果仅仅以对话的方式供用户使用，效率并不高。因此，众安保险的工程团队需要不断积累针对具体问题的提示工程，让终端用户无需重复输入；同时，设计一些图形化的用户界面，隐藏背后的复杂性，让业务人员专注于他们擅长的领域，而不必关注繁琐的工程问题。</p><p></p><p>简言之，众安保险主要通过封装和提示工程来聚焦和优化 AIGC 的回答，使其更加高效和专注于解决问题，而不会“胡言乱语”。</p><p></p><h4>如何确保可靠性和安全性</h4><p></p><p></p><p>除了针对特定场景定制化应用，AIGC 的另一大落地难点在于敏感信息的安全性。</p><p></p><p>蒋纪匀提到，应用 AIGC 难免涉及到大量的数据和训练模型。由于在 ChatGPT 3.5 及以上版本中无法进行调优式训练，因此通常采用提示工程与 ChatGPT 进行交互。在提示工程中，需要向 AIGC 的供应商提供问题和一些上下文信息。然而，这种情况存在数据隐私泄露的风险。</p><p></p><p>为了解决这个问题，众安保险需要建立相应的数据安全保障机制。首先，如果直接让每个人直接调用 AIGC ，肯定会出现各种问题，因此众安保险在平台架构层面采取了一些封装措施，使其输入和输出更可控。</p><p></p><p>灵犀的产品架构划分为模型即服务层（MaaS层）、大模型应用框架层和平台层，通过不同的分层能力为企业内部提供基础的模型服务和开发能力。而通过这样的封装，他们在输入和输出端便实现了安全可控的拦截机制。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/b9/b92e7a28b83f0bbd3983ca85fb8596b0.png\" /></p><p></p><p>平台能力方面，蒋纪匀首先介绍了审计能力，对于大模型服务的使用，他们需要审计用户输入的合理性以及模型服务的输出的合理性，这是在 AIGC 服务网关中必须具备的功能。如此一来，当发生风险事件时，可以根据审计日志进行追溯，这也有助于规范用户对 AIGC 相关应用的使用。</p><p></p><p>其次，敏感信息的检测和脱敏也是核心举措之一。为了应对敏感信息泄露的挑战，众安保险采用了正则表达式和敏感词知识库两种方式进行敏感词检测，以拒绝非法的输入和输出。这有效地规避了政治敏感、数据敏感和用户敏感信息泄漏等事件的发生。</p><p></p><p>第三，API 的安全性。众安保险要求所有的大模型服务 API 都必须进行身份验证和健全，无论是用户调用还是应用程序调用，以确保用户使用的合法性和可追溯性。</p><p></p><h2>保险行业如何应对技术发展</h2><p></p><p></p><p>谈及众安保险如何保持对技术的敏锐度和关注，蒋纪匀指出，保险行业一直注重数据分析和运用，但该行业过去主要使用老旧的机器学习范式，整体模型是分散的，并且需要从零开始构建，导致效率相对较低。</p><p></p><p>尽管一些头部的保险公司逐步采用机器学习平台和特征工程化平台等方法来降低模型研发成本，但基于这种范式的效率仍然偏低，限制了模型的发展潜力。</p><p></p><p>于众安保险而言，从 2010 年开始，其采用了文本加结构化数据的多模态模型的方式，显著提高了健康险理赔风控模型的性能。从 2022 年开始，众安保险还基于Transformer结构的用户行为序列模型，在头部互联网媒体的实时广告投放筛选模型中取得了传统模型无法达到的水平，并简化了在海量稀疏特征场景下的特征工程开发。</p><p></p><p>“这些都是采用新的模型策略来应对技术发展速度变化、并在尝试过程中取得的进步。”蒋纪匀感慨道。</p><p></p><p>他亦再次强调场景驱动的重要性，“不能因为现在有了 AIGC 就认为所有场景都可以用 AIGC 解决，需要判断它是否适合。”</p><p></p><p>不同的模型在不同场景有各自的优势，企业可以通过对大模型的调优，或者提示工程来满足定制化需求。而一旦找到合适的场景，如何实施则因企业而异，这也是企业未来最重要的核心竞争力。</p><p></p><p>对于众安保险而言，目前他们在 AIGC 方面的应用和服务还没有对外销售或提供，仍处于自我探索阶段，需要持续研究如何更好地应用 AIGC 技术。</p><p></p><p>短期内，众安保险计划在智能营销、保险核心业务系统、研发运维一体化平台和数据产品等方面应用 AIGC。从中长期来看，众安保险将继续基于 AI 和 AIGC 构建具有差异化的核心竞争力。“只有具备差异化的核心竞争力，公司才能在国内竞争激烈的保险行业中脱颖而出。”</p><p></p><p>据悉，未来，众安保险还可能会孵化一些产品，并将这些成果输出到保险行业中。在众安保险看来，AIGC的普及将缩小中小型保险公司与大型保险公司在 AI 技术能力方面的差距，同时也为中小型保险公司提供了“弯道超车”的机会。</p>",
    "publish_time": "2023-07-12 10:33:11",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "数据引擎，One Size Fits All真的能实现么？",
    "url": "https://www.infoq.cn/article/CPkG7swG4NONLDxf6S6N",
    "summary": "<p>随着数据的爆炸性增长和多样化，传统的数据处理方式面临着诸多挑战。近年来，我们经常听到关于流处理和批处理的讨论，以及一体化数据融合平台的概念。但是，是否真的存在一种适用于所有场景的解决方案？在组装式Lambda架构和一体化Kappa架构间，为何越来越多的组织选择后者？多云环境中，企业在选择数据平台时应该考虑哪些关键因素？以上问题将是本场直播探讨的重点。</p>",
    "publish_time": "2023-07-12 11:30:08",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]