[
  {
    "title": "阿里、蚂蚁、酷家乐为你分享业务出海实践｜QCon",
    "url": "https://www.infoq.cn/article/hjUIzz29SzfH0QC3JjuP",
    "summary": "<p>技术出海的架构演进路线？面向海外复杂监管环境下的业务可扩展性如何设计？如何利用云基础设施建设全球化架构？等等一些关于出海的技术问题，是需要正在谋求海外发展的企业所关心的。</p><p>&nbsp;</p><p>为了给你提供更多可参考的案例，在 <a href=\"https://qcon.infoq.cn/2023/guangzhou/schedule\">QCon全球软件开发大会（广州）站</a>\"，InfoQ策划了【出海的思考】专题，以下为专题内容介绍：</p><p>&nbsp;</p><p>本专题我们邀请了蚂蚁安全科技技术负责人<a href=\"https://qcon.infoq.cn/2023/guangzhou/track/1510\">姚伟斌（文景）</a>\"担任专题出品人，为专题内容的质量进行把控，他现负责蚂蚁业务安全技术能力出海战役，曾任阿里云 CDN 技术负责人、Tengine 开源项目负责人。在本专题下，我们邀请了三位技术专题为你分享：</p><p>&nbsp;</p><p>首先，我们邀请了蚂蚁集团大安全技术部认证技术架构师张放，他将以《海外业务 1 年暴增 20 倍，ZOLOZ 是怎么做到的》为主题展开分享。据张放介绍，随着互联网金融在东亚、东南亚等地区的快速发展，如何对终端用户进行高效的 KYC 成为了困扰电子钱包等行业发展的一大痛点。蚂蚁大安全孵化出来的 ZOLOZ 可信身份平台应运而生，但是ZOLOZ 在实现技术出海的过程中，遇到一系列全新的技术挑战，例如，一国一策复杂多变的监管环境对于业务可扩展性的要求，统一业务架构与高度异构的部署环境之间的尖锐矛盾，高敏感数据如何在公有云 SaaS 内合规的流转、处理和存储等等。本次演讲，他将就这些问题展开细致的分享；</p><p>&nbsp;</p><p>其次，我们邀请了阿里云高级合规专家廖智杰，他拥有十六年信息安全从业经验。在阿里云负阿里云国际站云产品安全合规、数据隐私合规。拥有丰富的数据安全合规经验，帮助企业在云上构建更安全的体系，助力业务合规开展。他将以《企业出海合规及云上数据合规实践》为主题进行分享，通过他的分享，你可以了解到出海数据合规常见问题、以及了解云上数据合规实践；</p><p>&nbsp;</p><p>最后，我们也邀请了酷家乐云原生中间件资深技术专家<a href=\"https://qcon.infoq.cn/2023/guangzhou/presentation/5283\">王栋年</a>\"，他目前担任群核科技（酷家乐）中间件团队负责人，期间完成了多款中间件的开发建设以及升级换代。成功主导了多云架构、全球化基础架构等的设计以及落地实施。他将围绕出海面临的技术挑战，结合酷家乐海外业务拓展过程中遇到的问题，以酷家乐的技术和架构迭代为例，为大家分享如何通过演进式架构支撑业务的快速出海和稳定运行等。通过他的分享，你可以了解到多数据中心下的关键技术实现细节、以及如何利用云基础设施建设全球化架构。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/50/509f04f4c98f08886f5dc0a15ac69a2f.png\" /></p><p></p><p>&nbsp;</p><p>更多精彩议题持续上线中...</p><p>&nbsp;</p><p>活动推荐：</p><p>&nbsp;</p><p>在5月25-26日，QCon全球软件开发大会（广州）站即将落地，在此峰会上，共有十二个专题，近五十余场分享。其中包括稳定性即生命线、编程语言实战、DevOps vs 平台工程、AGI 与 AIGC 落地、下一代软件架构、数据驱动业务、出海的思考、云成本优化、现代数据架构、AIGC浪潮下的效能智能化、新型数据库、大前端技术探索。欢迎与你一起交流，更多详细信息可扫描下方海报二维码了解。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/44/44286d1374db883a04a6acbda9c6bd2f.png\" /></p><p></p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "publish_time": "2023-05-05 11:43:21",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "中国信通院金融数字化探索: 用技术搞定中小企业融资、绿色双碳、流量反欺诈等棘手问题",
    "url": "https://www.infoq.cn/article/wMayrlSP8IHzWBTdaROI",
    "summary": "<p>互联网连接了人，物联网连接了物。如今，金融机构的产品服务正沿着这两类庞大网络延伸到个人衣食住行以及企业经营的各个生态场景，以数字金融形态赋能实体经济的发展。</p><p></p><p>在最新一期的 InfoQ《<a href=\"https://www.infoq.cn/article/OuAe5PBxryakC5IliQru\">超级连麦. 数智大脑</a>\"》直播中，中国信通院泰尔终端实验室数字生态发展部主任王景尧博士介绍了中国信通院在金融数字化转型领域的探索，围绕金融机构如何利用物联网、大数据等数字技术实现金融产品和服务模式的创新，以及在这背后，金融机构基础 IT 能力如何进行迭代升级等内容进行了分享。</p><p></p><p>以下是分享全文，经 InfoQ 编辑整理（点击链接观看完整<a href=\"https://www.infoq.cn/video/rOARbiN1flkQTADUpBdc\">直播回放</a>\"）：</p><p></p><h3>通过物联网金融数字化平台解决中小企业融资问题</h3><p></p><p></p><p>我们首先介绍一些物联网金融相关的场景，这些场景主要是针对中小制造企业而设计的。</p><p></p><p>中小微企业融资，尤其是实体制造中小企业融资难、融资贵一直是金融行业的难点，也是国家非常关注的问题之一。对于这些企业来说，最大的问题是难以提供有效的抵押物来获得银行融资。</p><p></p><p>在这种情况下，我们通过大量使用物联网设备，可以帮助中小企业以无抵押的方式获得金融支持，从而帮助更多的制造业中小企业开展相关业务，促进企业发展。通过物联网设备监控中小企业的核心设备，如设备手环等，了解企业的开工率和生产经营状况。不同企业、不同行业的开工率反映了它们的生产经营情况，通过分析这些数据，可以了解企业的生产经营状况，降低银行贷款的金融风险。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/11/1184f69c2cf6e19bc4fc52c1ed23ec7e.png\" /></p><p></p><p>具体来说，在贷前，针对中小企业经营不透明、材料不规范的情况，可以通过设备监控了解中小企业的生产经营情况，用更低的成本找到可以授信或者放贷的中小企业客户；</p><p></p><p>在贷中，可以降低银行对企业的尽调和勘察成本，因为中小企业单笔贷款比较小，反复勘察给银行带来的成本压力比较大，而通过物联网手段就可以减少银行人员尽调的工作；</p><p></p><p>在贷后，还可以通过监控设备了解企业设备的残值以及设备的使用情况，帮助银行做更好的贷后资产管理和不良资产处置，从而提高银行在放贷过程中的投入产出比。</p><p></p><p>去年，中国信通院与平安银行合作成立了泰尔-LAMBDA 实验室，通过支持<a href=\"https://www.infoq.cn/article/qZm63L9zkiD57cpFMsv7\">金融场景</a>\"的应用，已经支持实体经济融资超过 6,500 亿。我们的方法就是通过设备数据的采集，包括交易数据和经营数据的流转，来实现两方面的工作。</p><p></p><p>一方面，可以对企业的经营生产行为进行预测，实时监控后期金融处置，包括抵押物设备残值和资产价格分析，从而降低贷款业务风险和银行开展成本，提高中小企业融资投入产出比。</p><p></p><p>另一方面，通过设备大量部署，采集生产经营数据，可以帮助企业提高生产效率，了解生产经营情况，帮助企业更好地增信并开展二次放贷业务，更好地利用银行的企业资源。</p><p></p><p>此外，我们还与平安银行联合发布了《物联网金融研究报告》，并成立了“星云开放联盟”，旨在促进金融发展，推动中小企业发展，寻找资源和客户合作，通过输出金融能力，支持中小企业获得更好的金融支持。</p><p></p><h3>通过绿色金融数字化平台助力双碳战略落地</h3><p></p><p></p><p><a href=\"https://www.infoq.cn/article/xlshY7xzPkVyq5rK4BtT\">绿色金融</a>\"是我们近期拓展的重点之一。随着国家发布一系列双碳政策，绿色金融也成为企业的创新重点之一。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/b8/b8c3966acdf81a877cf039b79af4ab1a.png\" /></p><p></p><p>对此，中国信通院推出了绿色金融和治理平台（中国信通院探索绿色监测技术和平台），通过部署物联网设备，可以帮助中小企业更好地管理能源使用，实现节能减排。</p><p></p><p>中小企业在使用电力时面临很大的成本压力，因此我们在平台上进行了峰谷电价的差别制定，并帮助中小企业预测其生产经营情况，以更好地利用碳价的电价波动来节约成本。在许多省份中，使用绿色能源可以获得绿色证书，这些证书又可以用于获得碳排放交易指标。这些指标是可以进行交易的。</p><p></p><p>我们看到，在整个系统中，一方面我们可以帮助企业利用碳价、电价的波动来节约成本；另一方面，还可以让更多的中小企业使用绿色能源。</p><p></p><p>绿色能源的供应受环境影响非常大。例如，太阳能和风能都受到天气条件的限制，特别是在没有风的情况下，风能就无法产生电能。因此，大型企业很难大量使用绿色能源。但是，由于中小企业的生产经营灵活性，它们可以提前预测其生产经营需求，并在使用绿色能源时更多地使用绿色能源。</p><p></p><p>这样做有两个好处：首先，绿色能源的价格相对较低。其次，使用绿色能源的同时也可以获得绿色证书，这些证书可以作为质押物，作为节能自愿减排的碳配额，帮助企业获得更多的质押物，从而实现更好的融资。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/6d/6d2355db2aabf9fd71f187822143f6cf.jpeg\" /></p><p></p><p>总而言之，我们的绿色金融探索包括两个方面：一是碳排放交易的回购和质押融资；二是通过碳排放监测系统帮助企业积攒碳资源，并让政府更好地了解本地碳排放情况，从而促进本地企业的发展。</p><p></p><h3>基于个人业务数字化平台赋能金融服务创新</h3><p></p><p></p><p>除了对公业务以外，中国信通院在个人业务方面也做了一些数字化创新。例如客户分层场景，<a href=\"https://www.infoq.cn/article/6YjkNdjohVMLBYeM9j6G\">银行</a>\"普遍存在的问题是大量存量客户如何进行运营。很多客户在办卡后可能不会长期使用银行卡，但他们仍然是银行宝贵的资源。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/be/be1be6216adad6721e1b52a8bc2f366e.png\" /></p><p></p><p>在当今互联网流量见顶的情况下，新客户拓展变得异常困难且成本高昂。因此，充分利用存量客户资源来提升效率，对金融机构而言是极具价值和意义的工作。</p><p></p><p>对此，我们构建了总行和省分行的整体架构。借助数据和分层能力，总行可以更好地识别有意愿或目标的客户，然后将客户拓展和相关工作交由分行来执行。这将有助于提升分行和地市银行的效率，因为本地许多客户是通过分行或本地银行的人员开拓的。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/c3/c3be40894c09a762b5ad02b31299d89c.png\" /></p><p></p><p>在有限的人力资源和时间下，如何找到最高效率的方法开拓目标客户，是所有银行都需要解决的问题。我们通过这套架构的设计和外部数据的引入，可帮助银行提升本地人员的效率，在单位时间内开拓更多客户，从而提高银行整体收入和投入产出比。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/e5/e5dc746e1ff1aaf2c4c3a38013751486.png\" /></p><p></p><p>除此之外，我们还在移动互联网的个人业务方面进行了创新。中国信通院和中国互联网协会利用自身资源，在反欺诈、统一推送和移动 ID 服务方面做出了很多工作。目前，我们的工作已经覆盖了国内至少超过 15 亿的设备。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/25/250a4b6abe28af4f7ecfa6c5468e7652.png\" /></p><p></p><p>首先，金融流量反欺诈是所有行业面临的重要问题之一。今天的客户营销和数字经济的核心在于如何更好地利用数据要素来开源节流，数字化转型可以通过数字方式来开源，主要是通过在线上引入流量。然而，互联网流量中存在很多假量，这些流量背后并不是真人，这导致金融机构和银行在在线上活动中浪费大量资金，导致整个金融效率下降，并且被人恶意利用。因此，我们提供了不同的解决方案来帮助金融机构提高流量投放效率，避免流量欺诈。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/95/95c762ffbd4f8dbe4e10ac9ef2e2f66a.png\" /></p><p></p><p>这些解决方案包括对设备、IP 和用户行为进行验证，以识别整个流量中的假量。例如，行为验证可以检测到用户在短时间内在不同地点的多次点击等异常行为，我们就可以抓取这些行为并验证用户是否真实存在。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/2e/2e683e8534f80dd681cbe5ed50d1ea4c.png\" /></p><p></p><p>此外，我们还利用运营商的能力，通过网关取号的方式实现本机号码校验和设备一致性校验，从而更好地保护个人资金安全。在用户登录时，判断号码是否属于用户本人，以及设备是否为用户常用的手机设备，为金融机构提供更好的保护措施。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/cf/cfa0d1a4897e22fb48d20de95ef2abab.png\" /></p><p></p><p></p><p>自 2007 年苹果发布第一代 iPhone 以来，我国信息化智能终端已经发生了巨大变化，移动互联网的生态也随之改变。然而，在传统行业中，比如金融行业，大部分营销仍然采用短信或电话的方式，这种方式不仅不友好，而且无法实现很多复杂功能。因此，在移动互联网时代，如何更快地为用户提供服务，而不仅仅是通过电话触达，是所有银行都面临的重要问题。</p><p></p><p>在这个场景中，我们实现了许多功能，其中包括与三大运营商合作开发的“推必达”技术。这种技术的核心是使用短信通道发送 push 消息，通过 push 消息来拉起快应用。即使用户没有安装 APP，也可以享受到服务，这在许多场景下非常有价值。</p><p></p><p>例如，在<a href=\"https://www.infoq.cn/article/29uvshLBl6ZIeuxTdNOx\">保险</a>\"场景中，当我们在外地出险时，很难通过电话告诉勘验人员我们的出事地点。这时，使用定位方式告诉保险公司我们的位置信息更加方便。然而，在电话中上传位置信息并不容易。因此，我们通过“推必达”技术，使用下发的 push 消息和短信通道来实现这一功能。只需点击一下即可获得即点即用的服务，提高用户体验。</p><p></p><p>我们知道，金融行业本质上是一个服务业，如果我们能更好地为用户提供服务并提高用户体验，就可以帮助我们吸引更多的业务。当然，这个方案不仅适用于线上场景，许多线下场景也可以使用。</p><p></p><p>例如，在银行柜台，我们可以通过一条推送消息向我们的手机发送服务信息，从而避免排队等待的痛苦。同时，由于我们的消息是发送到注册号码的持有人，因此无法转发，这保证了点击的准确性和流程的安全性。这种创新不仅提高了我们的工作效率，而且大大增强了数据的保护。</p><p></p><h3>基础 IT 能力的数字化创新</h3><p></p><p></p><p><img src=\"https://static001.geekbang.org/infoq/58/58bfbb779a2c3a1219848e3a82a7f3bb.png\" /></p><p></p><p>虽然传统的数据<a href=\"https://www.infoq.cn/article/9FRdGfIdRe3OIoygTBrt\">中台</a>\"是许多企业采用的技术，但是这种架构相对臃肿。为了在业务快速部署方面提供更好的解决方案，我们提出了“微中台”的概念，它可以涵盖传统中台的技术模式或技术壁垒。特别是在分支机构和非总行等场景下，通过“微中台”架构，可以快速打通业务数据，为新业务的开展提供更好的模式。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/97/97282cebf6ef449af938eadbb4aca91b.png\" /></p><p></p><p>我们使用微中台集成外部数据资源，为金融行业的营销用户洞察、渠道优化、产品创新和运营提升提供更好的数据支持，以更好地了解客户画像。</p><p></p><p>金融行业是一个数据处理信息的行业，通过数据信息获得生产力，数字化转型的核心是提高数据使用效率。然而，基于传统中台架构，业务的上线时间和构建时间都较长，可能会对业务开展造成影响。在需要快速上线新业务的场景下，我们需要更新的 IT 架构来提高用户和业务的流畅性和敏捷性做到极致。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/83/8364d3d48baec6a675fef0de3bade561.png\" /></p><p></p><p>同时，我们还发现，金融机构所需的数据不仅是本地数据，还需要外部数据建模。因此，我们采用分布式数据库架构来打通本地数据和外部数据。数字化金融的目的是做更多的客户洞察、业务优化、宣传营销和竞品分析，这都需要大量的外部数据洞察。对于银行来说，了解客户和竞争对手的信息都是有限的，因此在进行营销和客户分析时，需要大量的外部资源。那么如何获取这些外部资源呢？</p><p></p><p>在许多场景下，获取外部数据不仅需要在短时间内获取数据，还需要在短时间内将其应用到业务中。例如，在进行广告投放时，需要在 200 毫秒内决定是否向用户投放广告并进行竞价。这样短的时间内，如果采用隐私计算等方式，则无法满足实时性要求。因此，我们通过分布式数据库架构将外部数据和本地数据集成，同时与山东数据交易所共同构建了卓信大数据联合建模中心。</p><p></p><p>通过这种分布式数据库，可以在短时间内实现数据交互和打通，满足高市值业务的需求，并更好地承接外部资源，实现数据资源的流转。对于一些非实质性的业务，比如授信业务、风控业务以及竞品分析业务，我们认为它们也可以在很大程度上帮助我们更灵活地实现这些业务。通过使用原生的 SQL 技术，我们可以实现数据的打通、融合和分析，甚至可以在 IT 架构的更底层完成这些功能，从而极大地提升了数据要素的价值和效率。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/27/27ca206a51ca1e0f2f715bac35bdf03a.png\" /></p><p></p><p>上图是卓信数据库的一个介绍。通过原生外部资源、原生隐私计算、原生数据安全和原生数据治理这四个原生工作，我们可以帮助金融机构和更小、更灵活的业务开展这些业务，甚至像分行或本地机构这样的面向本地的业务也可以更快地运转起来。</p><p></p><p>我们相信，这也是未来金融数字化转型的一个重要方向。</p><p></p><p>关注「InfoQ 数字化经纬」公众号，输入 “信通院金融”便可下载本次演讲的 PPT。&nbsp;我们将持续为您推送更多、更优质的数字化案例内容和线上线下活动。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/d3/da/d31d4e0e474feb853493fb404102b3da.png\" /></p><p></p>",
    "publish_time": "2023-05-05 12:11:46",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]