[
  {
    "title": "AI技术2023第三季度速览：开源大模型发展迅猛，应⽤场景得到进一步探索",
    "url": "https://www.infoq.cn/article/zT7BgPgJaJU2jGdZpQ2Q",
    "summary": "<p></p><p><img src=\"https://static001.geekbang.org/infoq/5f/5fe2af1b2dd36c7e13d0528db5e15094.png\" /></p><p>2023年技术领域最亮眼的关键字非生成式AI莫属，从硅谷掀起的技术浪潮不断席卷和影响国内技术创新市场。这一年中生成式AI为首的人工智能领域的讨论度居高不下。2023年第三季度InfoQ研究中心根据大模型领域市场发展更新了<a href=\"https://www.infoq.cn/minibook/IV4VhedKw1E1tY8Hleje\">《2023中国人工智能领域技术成熟度模型报告》</a>\"，为技术的应用决策和未来投资参考提供研究分析工具。同时，InfoQ研究中心也将持续关注人工智能领域的发展动态与未来走势，并定期更新我们的研究成果，欢迎大家持续关注。</p><p>大模型产品方面，2023年第三季度生成式人工智能讨论热度不断升高，其中大模型相关技术发展整体呈现出迅速向行业贴近的走势。第三季度行业层面应用得到进一步拓展，金融、医疗、交通、营销、政务、法律、气象等行业均发布了国产大模型产品。其中金融和医疗行业表现最为突出，蚂蚁集团的AntFinGLM金融大模型、度小满的开源大模型轩辕70B等金融行业大模型；百度的医疗AI大模型灵医大模型、京东健康的京医千询医疗大模型纷纷落地。其他行业中，作业帮的银河教育大模型、携程的问道出行场景大模型、北京交通大学开源的交通大模型TransGPT·致远、北京大学开源的中文法律大模型ChatLaw等也纷纷在行业模型方面为市场做出了进一步的探索。</p><p>大模型发布机构方面，企业、高校与科研院所持续在大模型领域深耕，并且企业推出的大模型数量仍然远高于高校与科研院所。企业努力试图通过提升训练速度并降低训练成本，来实现技术的规模化经济。除头部互联网和科技企业如百度、阿里巴巴、腾讯、华为、字节跳动、京东、360等，更多玩家开始推出人工智能技术产品，如极光推出GPTBots平台、微脉推出健康管理领域大语言模型应用CareGPT&nbsp;等等。</p><p>在技术评价层面，上海交通大学、达摩院等分别发布大模型测试基准，中文大模型评价体系逐渐完善。</p><p>政策层面对生成式人工智能的监管也在迅速跟进，并成为生成式人工应用快速落地与安全性保障的有力支撑。7月，发改委、教育部、工业和信息化部等部门联合发布《生成式人工智能服务管理暂行办法》。百度的文心一言、抖音的云雀大模型、智谱的GLM大模型、中科院的紫东太初大模型、商汤的日日新大模型等首批通过备案的&nbsp;AI&nbsp;大模型产品已经开始陆续上线。该办法将进一步促进生成式人工智能健康发展和规范应用。</p><p>部分工信部备案大模型</p><p><img src=\"https://static001.geekbang.org/infoq/4f/4fa71b3ec152492ddebf974cf03f0c7f.png\" /></p><p>国际市场方面，人工智能和大模型的发展竞争依旧十分激烈。开源闭源均迅速发展，并且多模态大模型版本更新迅速。</p><p>在开源方面，开源大模型迭代迅速。Meta开源了免费可商用版本大模型&nbsp;Llama&nbsp;2，一度登顶Hugging&nbsp;Face开源大语言模型排行榜。榜首更替频繁，在LLama&nbsp;2发布后，FreeWilly&nbsp;1等大模型相继登顶榜首。虽然开源大模型迭代迅速并有很多企业依托其进行产品构建，但是开源大模型的能力表现仍然普遍逊色于闭源大模型。</p><p>已有的文生3D、文生图等多模态大模型，如DALL-E&nbsp;系列、Stable&nbsp;Diffusion等均推出新版本。同时，OpenAI、xAI等科技公司宣布将向打造AGI方向发展。</p><p>InfoQ研究中心认为，在人工智能领域接下来的发展中，人工智能技术将在应用受限的因素上优先取得一定突破，然后带动技术难点上的突破，并在安全层面上提出更成熟的解决方案。同时现有的产品在2023年第四季度和2024年将会面临更大的来自市场的竞争压力。只有进一步向实际需求贴近，在效果与成本上做出平衡，并向企业与公众展现产品价值，或者在技术实现上有较大的飞跃才能够在激烈的竞争中脱颖而出。期待飞速演化的人工智能领域不断探索和突破，为生产和生活带来更多积极的变革。</p>",
    "publish_time": "2023-11-21 10:28:40",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]