[
  {
    "title": "黄仁勋：OpenAI首台AI超算是马斯克买的；字节跳动游戏大撤退内情曝光；互联网大厂月薪2万抢AI数据标注员 | AI一周资讯",
    "url": "https://www.infoq.cn/article/pov3o4pJUJDqKZ66Mxip",
    "summary": "<p></p><h2>资讯</h2><p></p><p></p><p></p><h4>字节游戏大撤退内情曝光：张一鸣不满业绩</h4><p></p><p></p><p>北京时间11月27日，字节跳动公司27日证实，旗下主要游戏业务朝夕光年将进行大规模收缩。继教育、房产中介以及虚拟现实业务后，字节跳动撤出了另外一个大力押注，本希望帮助公司扩张的领域。</p><p></p><p>自2019年以来，字节跳动在视频游戏业务上投入了数十亿美元，成立了自己的创意部门，并收购了热门游戏开发商。然而，字节跳动的豪赌换来的只是又一次失败。外媒爆料了这背后的内情。</p><p></p><p>知情人士称，包括字节跳动创始人张一鸣、董事长梁汝波在内的高级管理层一直对朝夕光年的业绩表现不满意，因为该部门开发的游戏一直难以留住玩家，也未能在全球推出一个爆款游戏。</p><p></p><p>字节跳动的这次大撤退将导致大部分朝夕光年员工被裁减，数百名员工丢掉工作。朝夕光年高级管理人员称，将继续探索视频游戏领域的人工智能技术和应用。</p><p></p><p>其实，这只是字节跳动简化运营聚焦核心业务，提高利润的举措之一。本月，字节跳动还对旗下VR公司PICO进行了组织架构调整，裁员数百人。</p><p></p><p></p><h4>黄仁勋：OpenAI首台AI超算是马斯克买的</h4><p></p><p></p><p>11月30日消息，英伟达首席执行官黄仁勋周三在《纽约时报》的年度DealBook峰会上表示，人工智能正在超越人类。他指出，如果通用人工智能（AGI）被定义为一种计算机，能够以与人类智能相媲美的方式完成测试，那么“在接下来的五年里，显然，人工智能可以完成这些测试”。</p><p></p><p>英伟达第三财季的营收增长了两倍，净利润从去年同期的6.8亿美元攀升至92.4亿美元。黄仁勋回忆了他向OpenAI交付“世界上第一台人工智能超级计算机”的情景。当时，作为OpenAI联合创始人的埃隆·马斯克（ElonMusk）尚未离开，他在一次会议上听到了黄仁勋对这台设备的介绍。</p><p></p><p>黄仁勋回忆称：“马斯克听到了我的介绍，他说，‘我也想要一个’，并告诉了我关于OpenAI的情况。当天，我向OpenAI交付了世界上第一台人工智能超级计算机。”</p><p></p><p></p><h4>阿里云开源通义千问 720 亿参数模型 Qwen-72B</h4><p></p><p></p><p>12月1日，阿里云举办通义千问发布会，宣布开源通义千问720亿参数模型Qwen-72B。通义千问-72B (Qwen-72B) 主要特性：</p><p></p><p>大规模高质量训练语料：使用超过3万亿tokens的数据进行预训练，包含高质量中、英、多语言、代码、数学等数据，涵盖通用及专业领域的训练语料。通过大量对比实验对预训练语料分布进行了优化。</p><p></p><p>强大的性能：Qwen-72B在多个中英文下游评测任务上（涵盖常识推理、代码、数学、翻译等），效果显著超越现有的开源模型。具体评测结果请详见下文。</p><p></p><p>覆盖更全面的词表：相比目前以中英词表为主的开源模型，通义千问还开源了18亿参数模型Qwen-1.8B和音频大模型Qwen-Audio。至此，通义千问共开源18亿、70亿、140亿、720亿参数的4款大语言模型，以及视觉理解、音频理解两款多模态大模型，实现“全尺寸、全模态”开源。</p><p></p><p>项目地址：https://modelscope.cn/models/qwen/Qwen-72B/</p><p></p><p></p><h4>全国数十家 985、211 大学宣布开设华为鸿蒙 HarmonyOS 相关课程</h4><p></p><p></p><p>据IT之家报道，今年 9 月份，华为正式宣布鸿蒙原生应用全面启动，HarmonyOS NEXT 开发者预览版将面向开发者在 2024 年第一季度开放。这也意味着 HarmonyOS NEXT 系统底座全线自研，去掉了传统的 AOSP 代码，也就是大家口中的“纯血鸿蒙”。</p><p></p><p>为了实现这一目标，华为将投入百亿资金支持伙伴发展，全面覆盖 18 个领域应用，目前已有多个主流应用宣布适配鸿蒙原生应用。</p><p></p><p>此外，根据华为人才在线官网的最新公示信息，2023 年教育部产学合作协同育人项目的华为第二批项目已经立项公示，其中包括哈尔滨工业大学、天津大学、电子科技大学等 16 个知名高校的鸿蒙项目。在此之前，诸如清华大学、北京航空航天大学、武汉大学等 985 高校已经率先开设了 HarmonyOS 的相关课程。</p><p></p><p></p><h4>互联网大厂疯抢AI数据标注员，起薪1万</h4><p></p><p></p><p>近期，百度、字节、京东等知名企业疯狂招聘“AI数据标注员”，工资月薪在1-2万元之间，且发布时间仅在一周到一个月之内。除了新以外，岗位招聘显然非常急迫。据招聘软件显示，HR们都异常活跃，一天24小时几乎全程在线，日均回复次数在十次以上，隔几分钟就回复一次。</p><p></p><p>高薪的背后，对标注员的要求并不低，基本学历要求本科以上，985、211优先，需具备语言学、中文信息处理、计算语言学、文学等相关专业背景。同时，需了解一些AI技术的原理。但值得注意的是，“AI数据标注员”招聘不是由这些大厂直接操作，而是通过猎头公司来负责招聘。在黑猫投诉平台上，一些猎头公司成为了数据标注投诉的重灾区。</p><p></p><p></p><h4>雷军回应小米没有核心技术</h4><p></p><p></p><p>雷军在第九届校友珞珈论坛上表示，不少人对小米还有很多误解，总有人说，“小米就是组装厂，小米研发投入少，小米没有核心技术”，“我们不是组装厂，我们之前一个工厂也没有，要黑我们，可以黑我们是皮包公司，不要黑我们是组装厂。”雷军回应道。</p><p></p><p>在被视为小米最不擅长的5G标准专利中，小米也有较好的成绩。“在今年中国信息通信研究院发布的《5G标准必要专利声明有效全球专利族企业排名》中，华为是全球老大，占比14%；而小米专利占比4.1%，已经进入了全球前十。”雷军还表示，2022年小米的研发投入了162亿元，2023年预计将达到200亿元，未来五年还会投入超过1000亿元用于技术研发。</p><p></p><p>“反过来说，大家拿13岁的小米，跟苹果比、三星比、华为比，是对我们有极高的期待、极高的要求。只不过，饭是一口一口吃的，路是一步一步走的。我认为，随着小米研发投入持续加大，实力越来越强，我们一定能凭借自身不断的成长，来赢得大家的信任和认可”，他说。此外，对于给母校捐款13亿元，他表示，这就是为了让中国有更多的华为、更多的小米、更多的比亚迪、更多的宁德时代。</p><p></p><p></p><h4>苹果给ARM专利费曝光，每颗芯片不到30美分</h4><p></p><p></p><p>苹果向软银集团旗下芯片设计公司Arm支付的每颗芯片专利费不到30美分。尽管苹果是Arm最大、最重要的客户之一，但该公司对Arm年收入的贡献还不到5%。据外媒报道，苹果和Arm似乎没有断绝关系的打算，因为这两家公司在今年9月初就芯片技术授权签署了“延续至2040年以后”的新合作协议。</p><p></p><p>需要注意的是，今年9月初的时候，软银安排苹果、英伟达、英特尔为ARM美国IPO的战略投资者，持股方还包括三星、AMD、谷歌，众多出资方分别认购公司股票。</p><p></p><p>值得一提的是，苹果和英伟达都属于ARM的大客户。</p><p></p><p></p><h2>IT业界热评新闻</h2><p></p><p></p><p></p><h4>天涯社区将转型直播带货，创始人：要培养出董宇辉那样的主播</h4><p></p><p></p><p>据媒体报道，天涯创始人、董事长邢明称，天涯预计于12月在抖音、淘宝、视频号正式开启官方直播，将向直播电商进行坚定战略转型，打造社交型会员制电商。邢明表示：“电商业务很卷，这次我们公司准备了半年，要把天涯老人们聚起来，也希望能培养出类似新东方董宇辉那样的主播。”</p><p></p><p>据公开信息显示，天涯社区旗下天涯好东西（海南）电子商务有限公司此前申请注册了“天涯臻选”商标，国际分类为广告销售。</p><p></p><p>天涯社区创立于1999年，曾涌现出《明朝那些事儿》的作者当年明月、《鬼吹灯》的作者天下霸唱等一系列高质量用户。</p><p></p><p>然而在今年5月份，因拖欠服务器费用，天涯社区的域名被法院冻结无法访问，引发了全网的“悼念潮”。</p><p></p><p>随后天涯的总编辑宋铮（老黑），聚集起一批天涯资深用户，为了300万元的费用，开启了七天七夜不间断卖货直播，但最终7天带货36万元，仅有15万元利润。</p>",
    "publish_time": "2023-12-03 14:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]