[
  {
    "title": "“TDD就是死亡”？我要为单元测试辩护",
    "url": "https://www.infoq.cn/article/Brwh11Pqd6Oa2T8VBpC2",
    "summary": "<p>在2014年的时候，<a href=\"https://dhh.dk/\">David Heinemeier Hansson</a>\"在软件开发界引起了轩然大波。他在<a href=\"https://youtu.be/9LfmrkyP81M\">RailsConf</a>\"的台上公然宣布“<a href=\"https://TDD is Death\">TDD就是死亡</a>\"”。</p><p>&nbsp;</p><p>这是个大胆的举动，但他也成为了很多不满于测试的人所寻找的领头人。很多人选择了跟随，开发者们就此分成了两个阵营。</p><p>&nbsp;</p><p>当时所掀起的新浪潮一路带我们到了今天，单元测试不再重要，集成测试占据上风。Mike Cohn所提出的著名测试金字塔如今被重塑为菱形形状。推动这股浪潮的因素并不唯一，在对现有测试实践不满的背后，或许并不难找到许多原因。</p><p>&nbsp;</p><p>这种情况常常伴随固化的实践传播、缺乏的正确指导，以及沉溺的抽象思维出现。人人都试图做到最好，不断尝试、失败，再尝试，直到有人能打破锁链，开拓不同的道路，一条承诺通往低维护性测试套组的道路。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/db/db8a8ffba8339f72ef138754c5a44898.png\" /></p><p></p><p>&nbsp;</p><p></p><h2>什么是最好的方向？</h2><p></p><p></p><p>即使是在新领域，我们也很容易遗忘历史，这是我在这个行业中所学到的事。飞速发展的步伐让我们相信过去没有答案，而未来充满奇迹。我不知道未来会如何，但我相信我们总会倾向于追寻创新而非寻找信息。</p><p>&nbsp;</p><p>或许下面这些问题能让很多质疑用测试菱形替代金字塔的声音：</p><p>问题是由单元测试或单元测试编写所引起的吗？集成测试是否应用于需要的组件？我的误解是否导致了多处相同的断言？我是通过测试优化设计，还是围绕现有设计进行测试？</p><p>&nbsp;</p><p>&nbsp;</p><p></p><h2>寻根&nbsp;&nbsp;</h2><p></p><p></p><p>答案或许又一次藏在了过去。</p><p>&nbsp;</p><p>那么在集成测试上，历史能告诉我们什么呢？历史中，集成测试是不同开发单元一同测试的阶段。这些单元独立开发，且通常来自不同团队。在这一阶段，我们要确保的是所有接口的实现和运行正常。</p><p>&nbsp;</p><p>如今的集成测试常常用于同一团队所开发的代码单元，这就意味着每个源码文件都是一个系统边界，相当于每个代码文件都是由同一个自主团队开发一样，模糊了单元测试和集成测试之间的界限。</p><p>&nbsp;</p><p>因此，我们可以断定，集成测试与单元测试之间区别的根源是个错误。认定集成测试是用于团队之间测试，而单元测试是用于单一团队测试，这种区分观念本身便是不对的。我们所要解决的果正是自己造下的因。</p><p>&nbsp;</p><p>我们应当明确这二者的界限，明确开发团队之间的界限而非层次。界限的明确会让你从新的角度看待系统的角色，以及它与其他领域的交互。类似于Alistair Cockburn所描述的<a href=\"https://alistair.cockburn.us/hexagonal-architecture/\">六边形架构</a>\"，后者也被称作是“端口与适配器”。在他的描述中，系统拥有里外两个面，而我们要做的，就是通过明确定义的边界来连接这两个面。</p><p>&nbsp;</p><p>这有什么用呢？正是这个内外层的关系，明确了单元测试与集成测试之间的关系。单元测试负责从外向内地测试界限，而集成测试则是从内向外地对边界测试。具体来说，集成测试确保了适配器、网关和客户端，这些负责连接其他开发单元（如API、插件、、数据库和模块）之间关系的正常运作。</p><p>&nbsp;</p><p></p><h2>针对行为的测试</h2><p></p><p></p><p>“单元测试”中的“单元”是什么？单元是指行为的单元。这段定义中完全没有提到过任何针对单一文件、对象，或者函数的测试。那么，为什么编写针对行为的测试很难？</p><p>&nbsp;</p><p>多数测试类型都会遇到的问题来自软件结构和测试之间的紧密联系，其中开发者忽视了测试目标，并以透明盒（有时也被称作是白盒）的方式应对测试。透明盒测试是指内部设计时以系统正常运作为目标，常见于单元测试。但透明盒的问题在于，测试往往会过于细化导致产生大量用例，而这些用例又与底层结构紧密耦合，给维护增加了难度。</p><p>&nbsp;</p><p>人们对单元测试的不爽部分来源于此。而集成测试由于更多地脱离底层的设计，受重构的影响往往比单元测试要小。</p><p>&nbsp;</p><p>我更倾向于从另一个角度看问题。这一点是集成测试的优势，还是由透明盒测试所带来的问题？如果我们以基于行为的不透明盒（有时也被称作黑盒）方式进行单元测试，那么结果是否一样或更好？</p><p>&nbsp;</p><p>人们常常以为不透明盒测试只能应用于系统的外部边界，但这是不对的。我们的系统是由许多边界组成，有些可以借助通信协议访问，有些可以通过进程中的适配器扩展。这些适配器都有自己的边界，可以通过基于行为的方式进行测试。</p><p>&nbsp;</p><p></p><h2>模拟：孤注一掷</h2><p></p><p></p><p>透明盒测试通常大量使用模拟（mock），可一旦过度依赖模拟，测试便会更难维护。也许这就是Mark Seemann所说的“<a href=\"https://blog.ploeh.dk/2022/10/17/stubs-and-mocks-break-encapsulation/\">桩（stub）和模拟破坏了封装</a>\"”。在正视这类由过度使用模拟所带来的问题后，厌恶、甚至不惜一切代价地避免模拟是很正常的。仅使用API的测试通常会导致对模拟的过度依赖。</p><p>&nbsp;</p><p>但问题又回到了最初，这是否真的是由模拟或对模拟的误用导致的呢？</p><p>&nbsp;</p><p>模拟和桩或许更难维护，但它们的存在是有意义的。它们让测试更快也更稳定，我们需要掌控它们，且不在必要之外滥用模拟和桩。</p><p>&nbsp;</p><p></p><h2>减少代码的公共表面</h2><p></p><p></p><p>透明盒测试的另一弊端在于其会导致更多代码的暴露。验证器、映射器，以及其他可能的内部实现细节都会因为测试的缘故暴露在公共契约（contract）内。任何使用Java或C#的人都知道接口在代码库中的普遍程度。仅仅为了模拟一个依赖，开发者很可能会引入一个新接口。</p><p>&nbsp;</p><p>可被从外部访问的代码将会更难变动，测试也将成为必须项，让代码的可维护性受到质疑，在没有大量重写单元测试的情况下，重构几乎成为不可能。乍一看，这一问题似乎利于集成测试；集成测试更关注于外层，不会暴露很多的实现细节。</p><p>&nbsp;</p><p>但还是那个问题，这究竟是单元测试的问题，还是我们在实现单元测试方式的问题？如果我们以不透明盒的形式进行单元测试，无视内部设计方式，仅关注于消费者需求，或许我们会收获更小的契约，一个更易于测试的契约，更少的测试量，以及更便于维护的测试。</p><p>&nbsp;</p><p></p><h2>以架构为指导原则</h2><p></p><p></p><p>测试常常是围绕架构进行的。我们常常在系统设计完成之后才会考虑测试，但这也会让系统测试的难度更上一层楼。多层架构中这种情况屡见不鲜，对数据访问技术的依赖让领域层的单元测试更加繁复。</p><p>&nbsp;</p><p>采用测试隔离的架构可以轻松避免这种问题。无论是六边形架构还是干净架构（Clean Architecture），可选的有很多。这类架构的构建是独立于设备的，所有基础设备依赖都会通过依赖配置接入系统。架构的单元测试会更加舒适，并引导集成测试到适当的应用下：测试连往外部的适配器。</p><p>&nbsp;</p><p>集成测试的适配器会为我们的测试策略带来一个薄弱点。在所有组件相连的情况下进行集成测试，将收获测试在配置和组合方面的优势，显然这是我们想要的目标。当然我们也可以继续在组件全部相连的情况下测试，但这些测试只会是“烟雾弹”，不需要测试所有的边界情况，从而导向更稳定，也更可靠的测试。</p><p>&nbsp;</p><p></p><h2>结论</h2><p></p><p></p><p>质疑行业中的固有观念很重要，但在质疑之前先充分理解这些观念也同样重要。</p><p>&nbsp;</p><p>我们都知道历史是不断重复的，过去会带给我们关于将来决定的信息。但我们也应该明白同样的错误将会不可避免地一遍遍发生。这是人之本性，是否能规避这些错误将取决于我们自己。测试策略也是这些不断重复的错误之一。我们要面对这些由于信息或知识匮乏，以及错失已有优秀实践而导致的痛点。</p><p>&nbsp;</p><p>测试与架构是息息相关的。我们需要在设计架构时不忘测试情况，在我们追寻优秀测试策略时，单元测试仍会是我们可用的工具。</p><p></p><p>原文链接：</p><p><a href=\"https://www.infoq.com/articles/unit-tests-testing-pyramid/\">https://www.infoq.com/articles/unit-tests-testing-pyramid/</a>\"</p><p></p><p>相关阅读：</p><p><a href=\"https://www.infoq.cn/article/l0jqESl4bgNs3jC0GFvG\">个性化测试流程，不搞一刀切</a>\"</p><p><a href=\"https://www.infoq.cn/article/SxEUUtjMIWxc2cvJGZK4\">只擅长构建软件是不够的，我们必须擅长构建可测试的软件 | QCon</a>\"</p>",
    "publish_time": "2023-01-09 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "字节回应员工因没年终奖与HR互殴；乐视实行 4 天半工作制：不降薪无 996，研发可准点下班；亚马逊发全员信，拟裁员超1.8万人 ｜ Q资讯",
    "url": "https://www.infoq.cn/article/2VOCzMCsy7JQT27Aa8XR",
    "summary": "<p></p><blockquote>字节回应员工因没年终奖与HR互殴；乐视实行 4 天半工作制：不降薪无 996，研发可准点下班；Salesforce宣布重组计划：裁员10%并削减办公空间；Twitter解雇40名广告团队的工程师；亚马逊CEO发全员信，拟裁员超过1.8万人；谷歌希望 RISC-V 成为“一级”Android 架构；微软将推出AI版必应搜索，采用ChatGPT爆红技术；Debian 移除 Python 2；黑客免费公开2.35亿Twitter用户的数据，含姓名、邮件地址等信息……</blockquote><p></p><p>&nbsp;</p><p></p><h2>科技公司</h2><p></p><p>&nbsp;</p><p></p><h4>字节回应员工因没年终奖与HR互殴</h4><p></p><p>&nbsp;</p><p>1月4日，有报道称，字节跳动开启裁员后，有网友爆出被离职员工表示自己干到12月份，每天晚上做到7点半却没有年终奖，因此与HR产生肢体冲突，双方在公司内互薅头发后HR也被离职。对此，字节跳动相关人士对媒体表示，网传“裁员没年终奖字节员工与HR互殴”信息不实。经排查，公司内部未发现互殴情况；字节跳动今年的年终奖评定工作还没有启动，一般在每年4月发放。</p><p>&nbsp;</p><p>根据之前的媒体报道，字节跳动计划将整体规模优化10%左右，而到2022年底，该公司员工有约11万人左右，也就是说，此次裁员将涉及1.1万人，各条业务线也基本确定了优化目标。据称，抖音、TikTok、今日头条、飞书、商业化、Data、懂车帝都收到了裁员通知。</p><p>&nbsp;</p><p></p><h4>乐视实行 4 天半工作制：不降薪无 996，研发可准点下班</h4><p></p><p>&nbsp;</p><p>1 月 3 日，乐视 CEO 张巍发布了 2023 年致全体员工的一封信，名为《乐视，从来与众不同》。全员信中，乐视宣布自 2023 年 1 月 1 日起，公司将执行每周四天半工作制，每周三实行弹性的半天工作制，考勤时间调整为连续 5 小时，如上午 10 点至下午 15 点、上午 11 点至下午 16 点都符合规定。</p><p>&nbsp;</p><p>据潇湘晨报报道，乐视市场部的一名员工称，自去年 7 月起，乐视就已经提出这个制度了，这项决策并不是管理层的一时兴起，而是作为一项长期执行的制度。而且最重要的是，实行 4 天半工作制并不会降薪。</p><p>&nbsp;</p><p>乐视在公开信中表示，这项工作制有四点好处：</p><p>&nbsp;</p><p></p><blockquote>1、有利于员工和家人及时就医。疫情让我们认识到健康的重要性，周三休息半天，员工不用请假可以更灵活安排自己和家人就诊，对自己负责，更是对家庭、对社会负责。&nbsp;2、有利于缓解“周一工作焦虑症”。大城市工作压力大，上下班路远时间长，很多人周末休息后因周一至周五要连续工作五天，一到周一便感到焦虑。周三休息半天，员工可以去跑跑步、健健身或进行其他娱乐活动，能有效缓解这种焦虑。&nbsp;3、有利于员工学习和提高专业技能。活到老学到老，工作不只是输出，更需要充电。对于想要提升自己的员工尤其是刚毕业的年轻员工，周三弹性工作能增加周二晚和周三晚学习时长，规避周末突击学习的弊端，有利于提高学历和备考各类专业证书。&nbsp;4、有利于提升家庭幸福感。对于已经组建家庭的员工，可以更好的平衡工作与家庭。如果家里有孩子，周三不需要请假就可以接送孩子上下学 ; 如果还没有孩子，那么也有利于提高员工生育率，拥护国家政策。</blockquote><p></p><p>&nbsp;</p><p></p><h4>Salesforce宣布重组计划：裁员10%并削减办公空间</h4><p></p><p>&nbsp;</p><p>1月4日消息，美国软件开发商Salesforce宣布一项重组计划，包括裁员约10%，旨在降低运营成本，提高运营利润率。Salesforce预计，与此次重组计划相关的费用约为14亿美元至21亿美元，其中约8亿美元至10亿美元预计将在2023财年第四季度产生，该计划下的员工重组相关行动预计将在公司2024财年结束时基本完成。</p><p>&nbsp;</p><p></p><h4>Twitter解雇40名广告团队的工程师</h4><p></p><p>&nbsp;</p><p>1月6日消息，据The Information报道，Twitter于周三深夜解雇了约40名从事广告业务的数据科学家和工程师，这至少是自去年12月中旬以来的第三轮裁员。这位知情人士说，裁员的对象是Twitter领导层认为失败的领域，比如广告产品，以及不重要的领域，比如数据科学。有网友表示：“作为一名数据科学家，我极为愤慨。马斯克居然说数据科学不重要。”</p><p>&nbsp;</p><p></p><h4>亚马逊CEO发全员信，拟裁员超过1.8万人</h4><p></p><p>&nbsp;</p><p>1月5日，据亚马逊官网，亚马逊CEO安迪·贾西发布全员信，称公司计划裁员超过1.8万人，比较早时媒体报道的亚马逊将裁员逾1.7万人更多，裁员占亚马逊约30万企业员工的 6%。Andy Jassy在全员信中称，鉴于经济的不确定性，以及在过去几年中大规模招聘，年度规划变得更加困难，而且“由于我们的一位同事对外泄露了这项计划，我们决定提前公布消息，以便直接向大家传达细节。我们希望从1月18日开始，与受影响的员工展开沟通。”</p><p>&nbsp;</p><p></p><h2>IT业界</h2><p></p><p>&nbsp;</p><p></p><h4>谷歌希望 RISC-V 成为“一级”Android 架构</h4><p></p><p>&nbsp;</p><p>1月5日消息，谷歌已经正式宣布Android将支持RISC-V指令集架构。该消息的公告来自去年12月举行的RISC-V峰会，谷歌 Android 工程总监 Lars Bergstrom 在会议上提到了 Android 对 RISC-V 架构的支持愿景。他表示希望 RISC-V 成为 Android 支持的 “一级” 架构平台 (tier-1 platform)。</p><p>&nbsp;</p><p>目前，用户可以为RISC-V下载具备非常有限支持的Android版本，但它不支持用于Java工作负载的Android Runtime (ART)。大多数Android应用程序都使用Java代码发布，这意味着目前几乎没有应用程序会在Android上支持RISC-V。</p><p>&nbsp;</p><p>在峰会之前，Bergstrom 还曾表示过在 RISC-V 上优化 Android 构建需要 “大量工作”，并概述了需要 “几年” 才能实现目标的路线图。而现在，谷歌表示官方模拟器支持即将到来，而ART支持预计将在2023年第一季度的某个时候到来。一旦ART支持到来，可以一定程度上将Java转译为RISC-V，因此大多数Android应用程序将无需开发人员额外的工作即可运行。</p><p>&nbsp;</p><p></p><h4>微软将推出AI版必应搜索，采用ChatGPT爆红技术</h4><p></p><p>&nbsp;</p><p>1月4日，据彭博社报道，有知情人士透露，微软正准备将 OpenAI 的 ChatGPT 聊天机器人添加到其 Bing 搜索引擎中，以吸引竞争对手谷歌的用户。</p><p>&nbsp;</p><p>这位知情人士表示，微软相信，对于搜索用户来说，提供更具对话性和上下文回复，可以比链接提供更好的答案，从而赢得用户。微软可能在未来几个月内推出附加功能，但现在仍在权衡聊天机器人的准确性以及将其纳入搜索引擎的速度。该知情人士表示，最初的版本可能是对一小部分用户的有限测试。</p><p>&nbsp;</p><p>微软的 Bing 服务规模远小于 Alphabet Inc.占主导地位的谷歌搜索引擎，这位知情人士表示，微软几个月来一直在试用 ChatGPT。微软尚未置评，OpenAI不予置评。</p><p>&nbsp;</p><p></p><h4>Debian 移除 Python 2</h4><p></p><p>&nbsp;</p><p>Debian 从 FTP 服务器上移除了 Python 2 包。Python 2 已经在 2020 年结束支持，Python 开发者在 2020 年 4 月发布了 Python 2.7 分支的最后一个版本，也是一个非常特殊的版本：Python 2.7.18（近似欧拉常数）。大部分 Linux 发行版开始着手移除 Python 2 包。</p><p>&nbsp;</p><p></p><h4>63GB！黑客免费公开2.35亿Twitter用户的数据，含姓名、邮件地址等信息</h4><p></p><p>&nbsp;</p><p>1月5日消息，有黑客在论坛上泄露了含有2.35亿Twitter用户的数据。据Cybernews报道，此次泄露的数据大约有 63GB，其中包括用户的姓名、电子邮件地址、粉丝数量和账户创建日期。该数据库甚至是公开的，允许任何人下载它。</p><p>&nbsp;</p><p>据《华盛顿邮报》报道，这些记录很可能是在2021年底利用Twitter的一个漏洞泄露的，该漏洞允许掌握电子邮件地址或电话号码的外人在Twitter上找到任何与该信息相匹配的账户。这些查询可以自动化，以检查无限数量的电话号码和电子邮件地址。</p>",
    "publish_time": "2023-01-09 08:03:57",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "马斯克极致省钱：推特员工自带卫生纸上班；裁员不发年终奖致员工薅头发互殴，字节跳动辟谣；马云露面称希望尽快回国 | AI一周资讯",
    "url": "https://www.infoq.cn/article/oxYBmr0IeBykqjQUM2zR",
    "summary": "<p></p><p></p><blockquote>创下裁员记录！亚马逊裁员将增加到1.8万人；百度研究院发布2023年十大科技趋势，这些技术上榜；国产特斯拉大幅降价，公司副总裁陶琳回应：坚持以成本定价；报告称，2亿多推特用户的电子邮箱被黑客泄露；李彦宏内部讲话：马化腾说的问题，百度也都有；打击谷歌？微软必应搜索或将引入ChatGPT....</blockquote><p></p><p></p><p></p><h2>资讯</h2><p></p><p></p><h4>羊了个羊招聘研发，最高年薪40万，推荐奖金最高达1万</h4><p></p><p>近日，羊了个羊发布招聘公告，招聘岗位包含Cocos研发工程师和动画设计师两个岗位，推荐奖金最高达1万元。据该公司有关负责人介绍，动画设计师年薪在12万～20万元。研发工程师薪资则将根据面试情况评级，最高年薪40万。</p><p></p><h4>马斯克疯狂省钱：推特员工“自带卫生纸”上班</h4><p></p><p>据外媒报道，随着马斯克在推特公司实施全面的成本削减措施，包括解雇了公司的一些保洁人员之后，推特员工被迫自己带卫生纸进入“有臭味的办公室”。</p><p></p><p>《纽约邮报》称，为了节省开支，马斯克本月突然解雇了该公司旧金山总部的一些保洁人员，这些保洁人员是在为加薪而罢工后被解雇的。</p><p></p><p>《纽约时报》援引知情人士消息具体补充说，由于缺保洁人员，推特公司的“办公室一片混乱”，卫生间变得“脏兮兮的”，“吃剩的外卖（味道）和（人的）体味”挥之不去，并且一些员工甚至只能从家里自己带厕纸。</p><p></p><p>有网友拿题为“在埃隆·马斯克裁掉保洁人员后推特员工用上了自己的厕纸”的《纽约邮报》报道发问，“这是真新闻还是假新闻”，马斯克在推特上回复这名网友称，“BYOTP！哈哈，有半天是这样的。”另有网友提到，马斯克说的“BYOTP”是“自带卫生纸”的英文首字母缩写。《独立报》认为，马斯克的这一回应“似乎证实了有关报道的真实性”。</p><p></p><h4>创下裁员记录！亚马逊裁员将增加到1.8万人</h4><p></p><p>1月4日，据彭博社报道，亚马逊决定裁员1.8万余人。报道指出，该数字比之前预计的要多，这是美国技术行业衰退加重的迹象。</p><p></p><p>报道称，亚马逊首席执行官安迪·贾西（Andy Jassy）4日在给员工的备忘录中宣布了这一决定，称其遵循了公司的年度规划流程。据悉，裁员主要集中在公司的企业级别，包括零售部门和人力资源的招聘部门。亚马逊打算从1月18日开始与受到影响的员工沟通。</p><p></p><p>“亚马逊从曾经的经济不确定性和困难中走过，我们将继续这样做，”Andy Jassy在备忘录中说道，“这些变化将帮助我们以更强大的成本结构寻求长期机会。”</p><p></p><h4>2022，俞敏洪给自己打8分：没欠任何员工一分钱工资</h4><p></p><p>1月4日，新东方创始人俞敏洪在其个人公众号中表示，对于2022年，“我给自己打了一个8分的分数”。</p><p></p><p>这8分主要有两个依据：首先，“毫无疑问稳定了新东方的发展”。“不管2022年怎么变化，但2022年新东方还有5万多员工，没有欠员工一分钱的工资，没有欠员工奖金，也没有更多的员工被新东方淘汰掉，而是进入了一个稳定的布局”。第二就是因为有了东方甄选。他表示，东方甄选从2021年12月28号第一个粉丝买第一单开始，在一年里实现了跨越式发展，“也给新东方带来了更好的发展基础，提供了一个新的机会”。</p><p></p><h4>百度研究院发布2023年十大科技趋势，这些技术上榜</h4><p></p><p>1月5日，百度研究院发布2023年十大科技趋势预测，今年上榜的十大科技趋势涵盖了大模型生态、数实融合、虚实共生、自动驾驶、机器人、科学计算、量子计算、隐私计算、科技伦理和科技可持续发展等领域，凸显了技术底座不断夯实、AI跨领域融合更加扎实、智能化创新更加务实，“技术向实”正在发生。百度研究院认为，2023年的核心科技趋势将围绕技术底座不断夯实、AI跨领域融合更加扎实、智能化创新更加务实三大方向展开。</p><p></p><h4>裁员不给年终奖致员工互殴？字节跳动回应：消息不实</h4><p></p><p>近日，有网友爆料字节跳动有员工被离职，没有年终奖，并因此与HR产生了肢体冲突，双方在公司内互薅头发后，HR也被离职。对此，字节跳动相关人士回应中国证券报记者称：网传“裁员没年终奖字节员工与HR互殴”信息不实。经排查，公司内部未发现互殴情况；字节跳动今年的年终奖评定工作还没有启动，年终奖一般在每年4月发放。</p><p></p><h4>马云公开露面：希望尽快回国</h4><p></p><p>马云现身了。12月30日，农历腊月初八，马云公益基金会发起的“乡村教师计划”如期举办。马云公益基金会微博公布的照片中，马云身穿白色立领衬衫，面带笑容，在一台苹果电脑前做了双手比心的动作。该微博称，当天马老师全程连线参加，他跟老师说，腊八之约他从不缺席，希望尽快能和大家线下见面。</p><p></p><h4>国产特斯拉大幅降价，公司副总裁陶琳回应：坚持以成本定价</h4><p></p><p>1 月 6 日，特斯拉中国宣布&nbsp;Model 3 与 Model Y 价格调整。其中，Model 3 后轮驱动版 22.99 万元起售，Model Y 后轮驱动版 25.99 万元起售，降价幅度从 2 万元-4.8 万元不等。</p><p></p><p>对于大幅降价，特斯拉公司全球副总裁陶琳回应称，特斯拉价格调整的背后，涵盖了无数工程创新，实质上是独一无二的成本控制之极佳定律：包括不限于整车集成设计、产线设计、供应链管理、甚至以毫秒级优化机械臂协同路线…… 从“第一性原理出发”，坚持以成本定价。以实际行动响应国家号召，促进经济发展，释放消费潜力。</p><p></p><h4>报告称，2亿多推特用户的电子邮箱被黑客泄露</h4><p></p><p>1月5日，据路透社报道，以色列网络安全监控公司Hudson Rock的联合创始人阿隆·加尔（Alon Gal）于2022年12月24日首次在社交平台上发布了一份有关推特邮箱地址泄露的报告，称黑客正将2亿多推特用户的电子邮箱地址发布于一个在线黑客论坛上。</p><p></p><p>加尔于1月4日在社交平台上写道：“这次入侵将很不幸地导致大量黑客攻击、有针对性的网络钓鱼和信息泄密”，他称之为“见过的最严重的泄密事件之一”。</p><p></p><p>据报道，该电子邮箱泄露事件可能最早发生于2021年，早于埃隆·马斯克接管推特的时间。目前尚没有可用于追踪黑客身份或位置的线索。截至目前，推特方面暂未对该报告发表评论，也尚不清楚推特是否采取任何行动来调查或弥补该问题。</p><p></p><h4>SaaS巨头Salesforce宣布裁员8000人</h4><p></p><p>1月5日，全球最大的 SaaS 软件公司Salesforce宣布，由于对经济的担忧，公司计划裁减10%的岗位，即约8000名员工，并缩减办公空间。&nbsp;该公司联席首席执行官马克·贝尼奥夫在致员工的一份宣布裁员的报告中表示，“环境仍然充满挑战，我们的客户在做出购买决定时正采取更加审慎的态度。”</p><p></p><p>在一封信中，贝尼奥夫暗示公司在那段时间招聘过于激进。&nbsp;贝尼奥夫表示，“我们雇用了太多人，导致了我们现在面临的经济衰退，我对此负有责任。” 截至10月底，Salesforce的员工人数接近8万人。</p><p></p><h4>打击谷歌？微软必应搜索或将引入ChatGPT</h4><p></p><p></p><p>据 Information 周二报道，微软公司于 2019 年向 OpenAI 投资了 10 亿美元，该公司正在努力推出其搜索引擎 Bing 的一个版本，该版本使用现在流行的 ChatGPT 背后的人工智能。</p><p></p><p>这位知情人士表示，微软相信，对于搜索用户来说，提供更具对话性和上下文回复，可以比链接提供更好的答案，从而赢得用户。微软可能在未来几个月内推出附加功能，但现在仍在权衡聊天机器人的准确性以及将其纳入搜索引擎的速度。该知情人士表示，最初的版本可能是对一小部分用户的有限测试。</p><p></p><p>微软的 Bing 服务规模远小于 Alphabet Inc. 占主导地位的谷歌搜索引擎，这位知情人士表示，微软几个月来一直在试用 ChatGPT。The Information 早些时候报道了微软的计划。</p><p></p><h4>Facebook“吹哨人”给马斯克指明方向：推特算法必须开源，才能成为公共广场</h4><p></p><p>据新浪科技报道，1月3日，Facebook“吹哨人”弗朗西斯·豪根（Frances Haugen）在接受媒体采访时表示，如果埃隆·马斯克（Elon Musk）想把推特变成公共广场，就应该对其算法开源。“对埃隆·马斯克来说，要证明他想要打造一个公共广场，最重要的事情之一就是发布算法。”</p><p></p><p>马斯克之前曾经讨论过将推特打造成一个数字城镇广场，以供讨论对人类未来至关重要的事情。</p><p></p><p>“开源算法，”她补充道，“他会得到更多帮助——成本会降低，利润会更高。”</p><p></p><h2>IT界热评新闻</h2><p></p><p></p><h4>乐视宣布实行4天半工作制度</h4><p></p><p>1 月 3 日，乐视 CEO 张巍发布了 2023 年致全体员工的一封信，名为《乐视，从来与众不同》。全员信中，乐视宣布自 2023 年 1 月 1 日起，公司将执行每周四天半工作制，每周三实行弹性的半天工作制，考勤时间调整为连续 5 小时，如上午 10 点至下午 15 点、上午 11 点至下午 16 点都符合规定。而且最重要的是，实行<a href=\"https://mp.weixin.qq.com/s?__biz=MzU1NDA4NjU2MA==&amp;mid=2247585256&amp;idx=1&amp;sn=b1d7b3eb976a7ad9bb23ed91fc20f157&amp;chksm=fbeb3427cc9cbd3173f2ea90748e0ecbcdf2520751f356a6a6f6204cba8de037ce74892cd475&amp;token=1509420125&amp;lang=zh_CN#rd\">4 天半工作制</a>\"并不会降薪。</p><p></p><p>乐视这封公开信一出，便引起了极大的关注度。“4 天工作制要不要推行”， “全国推行 4 天半工作制可行吗”，“如果上 4 天班你会搞副业吗”等相关话题很快登上热搜，引发广泛讨论。在国内，“四天工作制”的呼声也很高涨，但要想短时间内并不容易实现。</p><p></p><h4>小米汽车陷舆论漩涡</h4><p></p><p>1月2日晚间6点半，微博自媒体博主“理记”爆料称，小米汽车车型已经定版，酷似Taycan。截至目前小米汽车的品牌仍未获批，且被列入到资本无序扩张概念，可能将来不准叫小米汽车，只能给别人代工。后该条微博因被投诉侵权，已被删除。</p><p></p><p>1月2日晚间9时许，小米公关部总经理王化发微博回应称，该消息不实，不存在所谓品牌需要批准的说法，此外小米汽车进展顺利。</p><p></p><p>王化回应后，“理记”又发文称，王化的“辟谣”比较模糊，是针对具体用词而不是信息本身所表达的意思，并表示自己的信息均来自小米汽车内部的权威信源。“理记”进一步爆料，“小米造车生产销售资质不一定能批下来”是十一月份时的消息，当时情况是车不能挂小米的牌子，可以找个现有的有生产资质的工厂，车造出来后，挂的不是小米的牌子。</p><p></p><p>1月3日早间，博主“理记”再次发微博称：“小米汽车生产销售资质审批遇挫折的事，在业内也不算什么秘密。”</p><p></p><p>1月3日午间，王化再次回应：“辟谣非指责谁，仅仅是对有误导性的不实信息做澄清……这年头网络信息这么发达，谁不认识几个内部人士呢，如此反复纠结于道听途说的小道消息也不用干活了。”</p><p></p><p>随即，“理记”在回复中表示，对事不对人，对王化本人敬业态度表示理解，守土有责。不过，“理记”表示，王化不针对具体信息而专注于扣帽子显得反应过度。这种处理方法只是把辟谣当口号喊出来了，实际上并没有起到效果，因为明眼人看到的是人家在说ABC，你辟的“C不该大写”。</p><p></p><p>而1月6日，据《晚点 Auto》获得的消息，小米造车有了关键进展，已在讨论定价区间。第一款车为中型溜背式轿车（内部代号 Modena 摩德纳），分为两个版本，内部讨论方案为一个版本定位 26 万-30 万元区间，另一个版本在 35 万元以上。</p><p></p><h4>李彦宏内部讲话：马化腾说的问题 ，百度也都有</h4><p></p><p>据36氪报道，1月3日晨间，百度内网发布了一篇题为《简单之约：谈机会谈挑战，新思考新要求》的文章，其内容取自2022年12月末，李彦宏面向全体员工的一场内部直播。这场直播由主管百度人力资源体系的百度集团资深副总裁崔珊珊主持。</p><p></p><p>在直播中，有员工问及Robin（李彦宏）是否关注到马化腾的内部讲话。此前马化腾在2022年内部员工大会上，谈及了业务部门改革表面、追求大数字营收、内部贪腐“触目惊心”等问题。</p><p></p><p>“腾讯的那些问题，百度也都有。”李彦宏答道。李彦宏同时指出：“我们也是零容忍，一旦发现这种事情就去处理，不会妥协。马化腾说的那些问题，百度也都有，我们也在试图积极地去解决这些问题。” 崔珊珊也补充：反腐的例子百度也经常看到，也是“吓死人”。</p>",
    "publish_time": "2023-01-09 10:19:02",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "智能时代，操作系统的升维所面临的挑战",
    "url": "https://www.infoq.cn/article/meREfszLYp0xsG6XlE7m",
    "summary": "<p></p><p>近几年来，智能操作系统非常火爆，不亚于芯片。其实在每个时代，它都会被放到风口浪尖上。每个人无时无刻不在用操作系统，尤其是作为一名开发者。有的人用Windows，有的人用Linux，还有些人用Mac OS。每个时代的操作系统不一样，从Unix到今天智能手机的操作系统。</p><p></p><p>我们当前所处的智能时代，操作系统的升维面临哪些挑战？操作系统后续如何演化？下面我分享一下我的观点和建议。（本文整理自中科创达战略产品部首席架构师刘寿永在<a href=\"https://dive.infoq.cn/2021/beijing/track/1205\">DIVE全球基础软件创新大会2022</a>\"的演讲分享）。</p><p></p><p>以下为刘寿永演讲的精华内容，经编辑。</p><p></p><p>首先我会介绍下中科创达。然后回顾一下操作系统的历史，读史可以明智，知古鉴今，我们可以通过历史发展的车轮看到操作系统的演化，从而预判它未来的发展趋势。第三部分主要分享下操作系统面临什么样的挑战，在每一个时代，引爆操作系统发展的点往往不一样。第四部分，从更高的维度，看看操作系统未来的发展是什么样子。创新和历史是我所谓的阴阳之道，是正反两面。因为做创新时往往会背负历史包袱，我们应该怎么去看待操作系统的创新和历史，最后会总结一下我的观点，并展望下操作系统未来的趋势。</p><p></p><h1>创达简介</h1><p></p><p>中科创达是智能系统技术供应商，成立于2008年，在2015年上市，现在大约有一万多名员工，其中90%是软件开发工程师，服务于全球一千多个客户，分布在全球大约三十个城市。</p><p></p><p>创达的核心业务主要有四块。第一块是传统的智能手机和其他智能终端；第二块是智能物联网；第三块是智能汽车；第四块是智能行业，现在无论是物联网，还是汽车，人工智能都是必不缺少的模块。</p><p></p><p>创达的技术范围覆盖了所有的类型终端，比如说摄像头、安全、人工智能，还有近几年来比较火爆的边缘。边缘端的微服务、混合云、容器编排、以及云端和云端链接、设备管理等等，创达的技术范围都能覆盖到。创达已经建立了全套的产业链上下游合作服务伙伴，包括ODM、芯片厂、云厂商、操作系统厂商等等。</p><p></p><h1>操作系统历史回顾</h1><p></p><p>从70年代的Unix小型机，到80、90年代的个人电脑，到2010年开始的智能手机，再到从2020年开始到现在的物联网，每个发展时期，都有不同的操作系统作为主导，都有其成功因素和核心系统。</p><p></p><p>比如说Unix系统，它的主要核心技术在于分时共享、C语言的编程接口。其主要成功因素则在于通用计算，一切皆文件。到今天为止，大部分的类Unix操作系统的核心概念还是文件。</p><p></p><p>到了80年代，个人PC出来以后，操作系统以MacOS和Windows为典型代表，主要强调图形界面交互。另外，它们有了自己的应用软件，尤其是办公软件。</p><p></p><p>到了90年代，随着因特网的发展，Linux横空出世。Linux是因为因特网诞生的，它的一个著名发行版是Red Hat，提供了优秀的操作系统和服务。它的主要成功因素是移动互联网和开源运动。现在整个Linux世界里，几乎所有的软件都是开源软件，它们推动了Linux整个生态和基础软件的发展。</p><p></p><p>到了2010年，智能手机出现，典型的操作系统代表就是iOS和安卓。它们更强调交互，不是键盘式的交互，而是多点触摸，触摸屏式的交互。另外它们第一次有了“应用商店”概念。所以它们最主要的成功因素是移动互联网的发展和更好的用户体验。</p><p></p><p>到了今天，物联网的发展更强调自然交互，已经超越了触摸，也不仅仅是视觉、手势、语音，而是各方面的交互。这主要取决于人工智能的发展，还有开放协作的模式，能够把物联网系统打造得更流畅、更人性化，交互体验更好。</p><p></p><h1>操作系统面临的挑战</h1><p></p><p>在每个时代，每个操作系统都有自己的挑战，就像《易经》里讲的“物极必反，否极泰来”。当一个时代发展到某个程度时，某一类操作系统变得不再适应时代的发展，它要么自我突破，要么被另外一个系统取代。</p><p></p><p>在不同的时代，系统都需要做哪些突破？</p><p></p><p>二零零几年时，出现了MID（Mobile Internet Device）。以前的手机屏幕很小，这时出现了大的交互式屏幕，图形系统就显得尤为重要，大家都致力于如何把图形的性能提高，交互性做好。</p><p></p><p>到了智能手机时代，又面临另外一种挑战。智能手机的发展越来越复杂，硬件设计越来越复杂，功能系统越来越复杂。硬件的复杂使得整个系统的模块越来越复杂。现在整个安卓系统的代码，可能就有上亿甚至十亿的代码行数，已经远远超过了以前的系统。另外还有了“应用”生态。很早以前，应用和系统是绑定的，没有人要单独去装一个应用。随着智能手机的到来，产生了各种各样的应用。比如大家经常刷的抖音、社交经常用的微信、还有一些轻音乐软件，甚至还有一些行业上的APP等等应用。为什么现在应用占据了生态？因为脱离了这些应用，手机可能就只是一个打电话的工具了</p><p></p><p>而到了现在我们所处的智能时代、物联网的时代，操作系统的发展又面临着一些新的挑战。</p><p></p><p>第一，整个物联网时代，设备形态越来越多样化。大家可以观察一下自己的家里和外面，像无人机、扫地机、监控摄像头，还有语音交互设备和Box等等，它们的形态不一样。形态不一样，产业链上下游的路径会变得越来越长，会有不同的硬件供应商、AI算法供应商、系统集成商、云厂商等等，它们交织在一起，形成了一个庞大的产业链上下游。</p><p></p><p>第二，不同的设备上运行着不同的操作系统。如何打通这些多样化的操作系统？这是现在面临的挑战。不是说所有设备上必须装统一的操作系统，但所有的设备互联互通，是智能物联网时代应该解决的问题。</p><p></p><h1>从更高维度看智能系统</h1><p></p><p></p><h2>软件×硬件=人体</h2><p></p><p>现代的操作系统已经不单纯是软件问题，而是包含了软件和硬件两个部分。底层的硬件，从设计到产品，再到上面运行的软件，软件又包含了一些可拆卸的模块，典型的比如UI模块、多媒体模块、互联模块、设备管理模块、安全模块、AI模块。每个模块功能各有不同，这些模块是可以拆卸的组合，根据不同的设备形态和应用场景，把这些模块做一个排列组合，就能形成一套系统，来适配物联网设备。</p><p></p><p>所以我们把软件和硬件的结合，称为一个统一的智能系统，就相当于人体一样，由肌肉、骨骼、血液，组合在一起，形成了整个人体。所以不能单纯从软件角度去看智能系统，而应该把硬件也囊括在内，通过软件硬件统一看待整个系统的发展。</p><p></p><h2>计算×感知=智慧</h2><p></p><p>再从另一个维度看一下，如果人有了骨骼、肌肉，还缺什么？缺大脑和感知。人能和自然界交互，主要就靠这两样。感知，用佛教的说法叫“眼耳鼻舌身意”，能够感觉到、看到、触摸到、听到，才会对外部世界有感知。有了感知以后，更重要的是大脑要进行处理，也就是计算。</p><p></p><p>2001年时，云计算刚开始发展起来，是中央控制的计算模式。现在，随着硬件和边缘感知的发展，计算和感知融合到了一起，不仅仅发生云端，也可能发生在边端，甚至可能发生在设备端。</p><p></p><p>这产生了几个特点：</p><p></p><p>第一，超低功耗。可能随便一个超低功耗的设备就可以具有感知和计算能力。</p><p></p><p>第二，维护变易。之前的电话线、网线都是有线连接，未来可能是无线连接，随时更换，系统更容易升级。</p><p></p><p>第三，隐私安全。一些隐私安全的问题，可以直接在设备端做AI分析，比如人脸识别、物体跟踪，不用传输到云端。路径越短越安全，因为限制到一个局域网的范围之内，不会脱离到广域网，就不容易被黑客攻击。</p><p></p><p>第四，集成智能。一些内置的AI等丰富的算法可以供设备端使用。</p><p></p><p>第五，丰富连接。尤其是WiFi、BT、ZigBee等无线连接，都可以无缝连接。未来，计算与感知的应用领域也会非常广泛，比如像智能零售、智能楼宇、智慧家庭、安全监控、入侵检测等。</p><p></p><h2>人×物=社交</h2><p></p><p>除了计算与感知之外，未来的社交范围也扩大了。</p><p></p><p>现在我们是人与人之间的社交，以后是物与物之间的社交。比如说边缘端和近端的交互、边缘端和云端的交互。</p><p></p><p>另外，人与物之间也产生了交互。未来，人的交互对象可能未必是一个人，可能是一个物。物与物之间也可以做一些交流，这样，可以建立人与物之间的互动场景。</p><p></p><p>通过软件，可以定义一些场景模型。就像现在比较火爆的元宇宙一样，人也进入了一个虚拟环境，物也进入一个虚拟环境，虚拟与现实结合，形成很大的社交群体——人、物的社交群体。</p><p></p><h2>技术×行业=数字化</h2><p></p><p>行业的技术落后于互联网发展，也落后于行业本身的发展。如果把一些新技术应用在行业上，帮助行业做数字化改造，形成一套广泛应用的行业系统，这时操作系统就有了新的定义。比如导入一个AI，建立一个视觉融合平台，再在产线上配套一些摄像头，内部有一些预处理模块、AI算法、账户绑定，可以做缺陷检测、物体识别、尺寸测量这样的系统，然后部署到工业场景，这对工业场景的数字化改造有非常大的帮助。</p><p></p><p>所以说不能简单地看待操作系统，像传统意义上的那种操作系统：有一个内核、几个中间件，能跑在X86、ARM或者RISC-V上，并不是那么简单。可能更多要从场景驱动，通过场景来定义不同行业的操作系统。</p><p></p><h2>端×云=边</h2><p></p><p>现在，边缘计算发展非常迅速，应用场景也越来越多。边缘计算未来会形成自己独特的领域，现在好多云计算的场景、技术，可能会下沉到边缘。因为随着处理器的速度、AI的运算能力在边缘侧不断增长，无论是技术还是平台，都可以移到边缘上。</p><p></p><p>边缘端会发展为由许多边缘设备组合到形成的边缘集群网络，然后在边缘网络上运行一些边缘的组件，比如设备的编排、算力网络的编排、容器化、以及边缘协同、边缘链接等。</p><p></p><p>另外，边侧会内置一些算法。因为有些情况下，需要做实时交互，如果能在边侧处理，就尽量在边侧处理，不需要到云侧绕一圈。</p><p></p><p>还有一些操作系统的核心模块，比如作为一个开发者，需要去做低代码开发、H5编程，或者需要连接物联网设备，在边的场景，这些都可以轻而易举触摸到。</p><p></p><p>还有一些边缘模块，像安全模块，比如设备认证、区块链加密的，可以放在边缘上，让边缘变得更加安全。</p><p></p><p>另外可能还有些特殊的模块融入到边缘，比如图形处理模块，还有一些机器人的模块，也可以放在边缘，作为一个机器人的控制中心。</p><p></p><h1>创新和历史包袱的碰撞</h1><p></p><p>从应用场景创新来看，到目前为止，操作系统的发展还是比较快的。但这产生了另外一个问题：创新和历史的碰撞。就像《易经》里说的“一阴一阳之谓道”。因为创新就意味着要破除旧的东西，是不是旧东西就没有用，就应该抛弃它？我分享一下我的观点。</p><p></p><h2>内核的纠结——“大脑”：安全还是效率？</h2><p></p><p>关于内核，提到Linux时，我们讲的更多是Linux内核（Linux内核是一个宏内核的结构，历史上就有微内核和宏内核之争）。没有内核就没有顶层的应用，世界上能提供安全内核的没有几个厂家，尤其是在消费市场上。</p><p></p><p>内核意味着安全可靠和效率。效率往往和安全可靠是一种平衡关系。无论是宏内核还是微内核，在什么样的场合就应该用什么样的内核。关键还是要发展自主内核，这条路我们还是要坚持走下去，因为它是操作系统的根基。</p><p></p><h2>中间件的缺失 ——“器官”：新生还是移植？</h2><p></p><p>除了内核之外，还有中间件。</p><p></p><p>为什么中间件如此关键？安卓系统之所以被称为操作系统，正是因为它在Linux内核上叠加了一层中间件，这就是它区别于Linux的最大不同。比如它的硬件抽象层和Linux不一样，整个中间件，整个框架层，比如SurfaceFlinger、AudioFlinger，和以前的Linux的PulseAudio、Gstreamer，还有S11系统，都是完全不一样的模式，所以安卓被称为操作系统。它的顶层支撑的应用也有单独的API，包括应用商店。所以中间件的创新，对整个操作系统是非常关键的创新。</p><p></p><p>今天讲操作系统，我们更多是缺失中间件，这意味着更多的是缺失基础软件的创新。如果缺失了中间件，我们就回到了原始的编程状态，比如要用API去调POSIX的接口；如果要画一个图，还要去操作Frame Buffer。</p><p></p><p>为什么说中间件需要创新？从开源的历史上讲，软件设计思想都集中在开源模式里，都集中在以前的软件设计的模式里。如果跳出以前的软件设计模式去看现在的应用场景，看现在的系统的设计模式，可能是不一样的。</p><p></p><h2>应用要扎根</h2><p></p><p>说到中间件，不得不说应用，因为所有的中间件都是用来支撑应用发展的。很多人从应用讲生态，如果没有应用，操作系统是没有用的。所以应用非常关键，它也是一个操作系统生态能够野蛮生长、顺利成长的一个关键因素。</p><p></p><p>但不是说有了应用，就可以抛弃中间件和底层内核。因为它们是基础，所有的应用都是建立在基础之上的，就像建立在沙滩上的城堡一样，如果根基不稳，大水一来，整个城堡都会垮掉。应用很重要，应用很关键，的确应用也是生态的一部分，但是永远不要忘了，还有基础。</p><p></p><h2>人才不足</h2><p></p><p>目前，我国基础软件领域尤其是操作系统这块的人才不足。智能系统的发展要素里，硬件或云的发展，IOT设备的种类，AI.....这些都不是关键。</p><p></p><p>创新的人才才是真正的关键。从计算机的教育系统开始，如何去培养这种创新性人才？如何给予这些创新性的人才一些精神和物质上的资助，这些很关键，这样才能让这些创新性人才不停发展。</p><p></p><p>基础软件的商业模式还是比较难的，所以培养人才比较关键，从学校开始，包括社会上的支持，共同打造整个人才发展的路径。</p><p></p><h2>开源是机会</h2><p></p><p>开源对操作系统发展来说，是很大的机会。如果了解了操作系统和开源的历史——尤其是理查德·斯托曼发起的开源运动，它标志着整个Linux生态野蛮生长，就知道开源对操作系统来讲，是一个绝妙的机会。因为它带来了几点好处：</p><p></p><p>首先，开源这种合作模式是一个全球异地化的合作模式。</p><p></p><p>另外，它需要企业之间的合作、协同，而不是单一的企业搞一个小作坊就能生产出一套软件来，因为现在软件越来越庞大，系统越来越复杂。</p><p></p><p>除了企业之间的合作，它也是人与人之间的一种合作模式。这有利于更好地发展软件的可交互性和稳固性。</p><p></p><p>还有一点就是开源的商业模式，我希望未来开源软件有比较好的商业模式，这样才能支撑开源软件的发展。比如说单个项目的开源版本、商业版本、收费服务、订阅服务，需要我们去尊重开源软件、基础软件开发者的劳动成果。另外还有用开源项目做成产品化的。这些就是开源的商业模式。</p><p></p><p>还有开源软件的生态环境，这也是为什么开源能够发展得如此大的一个重要原因。比如像现在的开源芯片RISC-V，在短短的几年之内发展势头非常迅猛。</p><p></p><p>Linux操作系统已经有30多年的历史了，现在依然占据着很重要的位置。另外中间件，比如像K8s、AJX这种边缘中间件、编排管理中间件、甚至一些调度中间件，它们形成了操作系统中间件的一层很稳固的生态。从生态环境来看，无论从底层到上层，从硬件到软件，它们是很好的环境，有利于整个生态的发展。</p><p></p><p>另外，对每个工程师来讲，开源是一个可以自我成就的过程。从组织上讲是全球的协作分工，大家能学到很多东西；从技术上讲，很多开源项目都来源于大企业，你可以和顶尖人才去交流。</p><p></p><p>最后就是人才方面。它能够帮助我们培养出更多具有先进软件工程思想的人才，有利于发展我们自己的基础软件，所以说开源是我国操作系统发展的一个绝好的机会。</p><p></p><h1>总结</h1><p></p><p>如果我们看过历史，看过未来，却不去思考，那将是一种毁灭性的灾难。</p><p></p><p>内核依然要坚持，因为内核才是根。比如说有个内核过了ASIL-D认证，那它就是一个安全的内核，可以应用到很多安全的行业里去。</p><p></p><p>中间件是发动机，是最需要创新的地方，也是我们把它称之为操作系统的地方。如果未来我们有一个称之为操作系统的东西，那它一定是在中间件和传统的操作系统上有很大的不一样，无论是和Linux、安卓或者其他操作系统。中间件是发动机，是我们需要创新的地方，是我们需要改变软件架构思想的地方。</p><p></p><p>应用也非常关键，是连接、繁荣整个生态的地方。但是没有好的发动机，没有好的根，应用也会死亡。</p><p></p><p>所以，未来的系统是一个软硬结合的系统，软件离不开硬件，硬件离不开软件；未来的系统也是一个端云结合的系统，从端侧到云侧，端、边、云协同工作，成为一个整体。</p><p></p><p>还有技术与行业的结合，把移动互联网的技术，一些新的技术，应用于行业当中，帮助行业做数字化转型，推动整个行业发展，也是未来智能系统的一个很关键的要素。</p><p></p><p>最后是边缘。边缘是系统发展的未来，因为无论是从端侧，还是云侧，现在都开始往中间走。所以我认为边缘是一个很重要的场景。边缘算力网络未来必定会成为整个智慧行业的中心，无论是智能楼宇还是智慧家庭。</p><p></p><p>讲师介绍</p><p></p><p>刘寿永 ，中科创达软件股份有限公司战略产品部 首席架构师。2011年至今在中科创达从事软件开发相关工作，任职战略产品部首席架构师，负责中科创达操作系统相关技术和产品的设计与研发，熟悉高通、Intel、ARM、海思、展讯、MTK等多个芯片平台，主要专注在Linux/Android/鸿蒙/RTOS等操作系统整个架构设计和生态建设。积极贡LF/LFEdge/AGL/Autoware/RISC-V等开源社区和技术联盟。和芯片厂、OEM、OEM、操作系统厂商、互联网、开源基金会等产业链上下游共同合作，为行业客户提供稳定易用的Mobile/IoT等操作系统平台方案和产品。</p>",
    "publish_time": "2023-01-09 11:44:21",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "IT系统为什么需要可观测性？",
    "url": "https://www.infoq.cn/article/2rkRbQ4m88UD6S0Aqrjt",
    "summary": "<p>为什么需要可观测性？是新瓶旧酒的概念炒作，还是指标、日志、追踪数据的统一管理，抑或是解决分布式系统的未知问题？我们的答案是：可观测性的价值在于大幅提升IT人员的开发和架构能力。本次活动将从可观测性的核心概念出发，深入探讨可观测性平台的三个关键能力及三类构建方式，为可观测性的系统性落地指明道路。本次活动亦将通过对金融、运营商、智能制造等大型行业用户的实战用例分析，进一步说明可观测性可以解决的实际问题，以及可观测性如何为各行业的IT人员带来认知与技能的真正提升。</p>",
    "publish_time": "2023-01-09 13:24:15",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "构建统一的云原生应用可观测性数据平台",
    "url": "https://www.infoq.cn/article/cJrI2mJLDweVsYsv1qZu",
    "summary": "<p>\"随着越来越多的应用采用云原生架构，可观测性的受关注程度急剧上升，成为2021年业界讨论的云原生热点话题。在Metrics、Tracing、Logging三大支柱理论体系的指导下，开源社区已经形成了一大批优秀的可观测性软件组件和解决方案。然而企业在实际践行可观测性的过程中，往往会遇到应用代码改造多、观测数据割裂、数据引擎性能瓶颈等挑战，阻碍可观测性乃至云原生的快速落地。</p>\n<p>基于云杉网络可观测性平台DeepFlow的长期技术积累，我们将其核心 —— 零侵扰的可观测性数据引擎 —— MetaFlow正式开源。MetaFlow深入运用了领先的eBPF技术，并结合高性能的数据传输管道、统一数据标签、统一数据查询体系，帮助用户组合Grafana、Prometheus、Skywalking、ClickHouse等开源技术栈搭建一套完善的云原生应用零侵扰可观测平台。\"</p>",
    "publish_time": "2023-01-09 13:24:31",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "高清云网可观测之全链路追踪实战",
    "url": "https://www.infoq.cn/article/rgGX6UEaZw1DE3EMoqIw",
    "summary": "<p>随着可观测性话题的热度越来越高，链路追踪也被频繁的谈及到，但开发人员的主要关注点通常只停留在应用代码层面，对冰山之下深不见底的云网络知之甚少。由于云网络的复杂性，“网络问题”经常成为应用故障用于甩锅的话术；由于云网络可观测性的缺乏，大量问题遗留下来成为悬案并又频频重现。对云网的诊断如何才能摆脱对云厂商的依赖？如何解释客户端的高时延和服务端的风平浪静？K8s Service NAT前后的流量如何追踪？VXLAN、IPIP、GRE等层层隧道封装的流量如何追踪？穿过云上云下错综复杂的各类网关流量如何追踪？云网络的全链路追踪问题实实实在在的困扰着我们的工程师们！</p>",
    "publish_time": "2023-01-09 13:24:33",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "5GC与电信云构建云网络可观测性平台的必要性",
    "url": "https://www.infoq.cn/article/XDD4gmQBcPrydcAGgvu2",
    "summary": "<p>\"随着5G核心网NFV化的技术演进，IT领域的云技术、容器技术在通信网得到越来越广泛的应用，伴随而来的是在新的技术架构下5G核心网运维和可靠性保障的巨大挑战。</p>\n<p>首先现阶段5GC运维工作面临着系统“黑盒化”、运维技术难度高、跨专业协同难、故障定界难、面向业务保障难等诸多困难；其次5GC三层解耦演进的工作推进困难。</p>\n<p>为什么会出现这样的局面呢？根本的技术原因在于，在新的技术架构下云基础设施运维与上层软件运维之间隔离，缺乏跨专业、跨技术栈的运维方法和工具。而云网络可观测性则是拉通5GC和网络云之间运维能力，消除三层解耦的阻塞点，实现网络云和云上5GC业务高可靠性运行的必要手段。\"</p>",
    "publish_time": "2023-01-09 13:24:45",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "DeepFlow —— 开启高度自动化的可观测性新时代 - 第八期",
    "url": "https://www.infoq.cn/article/Xb2FfL5eaY1i3l32aLZx",
    "summary": "<p>为了让观测更自动，让开发者更自由，云杉网络开源了 DeepFlow（原名 MetaFlow），它是一个高度自动化的可观测性平台，能够显著降低开发者的埋点、插码、维护负担。DeepFlow 通过 AutoTagging 机制打破数据孤岛，解锁数据下钻能力；基于创新的高性能 SmartEncoding 机制告别高基烦恼和资源焦虑。我们很高兴宣布 DeepFlow 第一个开源版本的发布，基于eBPF/BPF 的技术创新，使得它能够自动化的呈现任意服务的全栈性能指标、全景访问依赖，并能够自动追踪Spring、Istio等架构下的分布式调用。在此基础上，DeepFlow已支持集成并无缝关联 OpenTelemetry、SkyWalking、Prometheus、Telegraf数据，下一步还将逐步集成 Sentry、Promtail、Fluentbit等。DeepFlow 是我们给这个世界精心准备的一份礼物，期待和你分享这一时刻。</p>",
    "publish_time": "2023-01-09 13:24:58",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "挥别“中国芯”？消息称戴尔计划2024年全面停用中国芯片",
    "url": "https://www.infoq.cn/article/7buffIjmsP0LumMANDhP",
    "summary": "<p></p><blockquote>全球芯片产业变局不断，对“<a href=\"https://www.infoq.cn/article/IIrxAaTj0zL0vmWeDqMl\">中国芯</a>\"”而言，有“危”亦有“机”。</blockquote><p></p><p></p><h2>消息称戴尔计划明年逐步淘汰 PC 产品中的国产芯片</h2><p></p><p>&nbsp;</p><p>近日，据《日经亚洲新闻》援引知情人士消息称，戴尔计划到 2024 年停止在产品中使用由中国生产的芯片。</p><p>&nbsp;</p><p>据悉，戴尔在 2022 年年底就告知供应商，公司目标是要“显著减少在产品中使用中国制造芯片的数量，包括非中国芯片制造商在中国工厂生产的芯片”。到 2024 年，戴尔要实现其产品使用的所有芯片都在中国以外生产。而且在此之前，戴尔就打算大幅减少产品中使用的中国制造集成电路。知情人士补充道，除芯片外，戴尔还要求电子模块和印刷电路板等其他组件的供应商和产品组装商，提高在中国以外国家的产能。</p><p>&nbsp;</p><p>目前尚不清楚戴尔是否真的从 2024 年开始执行这一政策，亦不清楚此次供应链多元化调整是否/或将如何影响成品价格。</p><p>&nbsp;</p><p>据《时代财经》报道，戴尔 CPU 和 GPU 主要供应商是英伟达、AMD、<a href=\"https://www.infoq.cn/article/SBvuCMSKhdFQlvRbovdZ\">英特尔</a>\"，这些芯片并不在中国大陆制造，戴尔的芯片政策可能会影响国内通信芯片、电源管理芯片等领域的企业。</p><p>&nbsp;</p><p>据了解，中芯国际和华虹等中国芯片制造商生产的大多是相对简单的低端芯片，包括用于各类 PC、显示器、键盘、鼠标和其他设备的显示驱动器集成电路（MCU）、电源管理集成电路（PMIC）及微控制器单元（MCU）产品。与此同时，三星和 SK 海力士等厂商在中国工厂中生产 3D NAND 和 DRAM 芯片，美光则在中国设有测试和封装工厂。</p><p>&nbsp;</p><p>广东一家为戴尔制造显卡的工厂对《时代财经》表示，厂里一直在做戴尔订单，目前没有受影响，“（戴尔）很多芯片都是从中国台北、中国香港周转过来的，GPU 生产全部来自境外。”戴尔很多零件产地是广东、江苏等省份，包括电容、电阻，“若戴尔改用国外厂商，可能导致某些国内工厂停产，影响交料给我们”。</p><p></p><h2>戴尔回应：正在全球范围内不断探索更加多元的供应链构成</h2><p></p><p>&nbsp;</p><p>目前，戴尔并未证实到 2024 年在产品线中剔除中国制造芯片的计划，仅表示“正在全球范围内不断探索更加多元的供应链构成”。</p><p>&nbsp;</p><p>有评论认为，戴尔现在的生产很大程度上依靠中国供应链，但从全线产品中剔除中国制造芯片是一项艰巨的任务，因为众多设备是由第三方生产，搞清楚其中的元件来历和用途并非易事，由此引发的成本震荡更是难以估量。</p><p>&nbsp;</p><p>一位为戴尔和惠普供应芯片的芯片制造商高管向《日经亚洲新闻》证实，“笔记本电脑中有成千上万的组件，中国多年以来已经发展出一套非常成熟和完整的生态系统。以往我们就知道戴尔计划从高度依赖中国转向多元供应，但这次的行动有点激进。戴尔甚至打算直接拒绝使用中国制造的芯片，理由是担心美国政府的政策……而且这不是立场表达、不是空口白话，而是一项真实的、正在推进的计划，整体趋势看起来已经不可逆转。”</p><p>&nbsp;</p><p>公开信息显示，戴尔在国内的关联公司戴尔（中国）有限公司成立于 1997 年 12 月，该公司共有 20 余家分支机构，包括沈阳分公司、西安分公司、南京分公司等，其中戴尔（中国）有限公司杭州办事处、戴尔（中国）有限公司成都分公司等 8 家已被注销或吊销。年报信息显示，戴尔中国 2021 年参保人数为 3332 人。</p><p></p><h2>对国内半导体产业而言，有“危”亦有“机”</h2><p></p><p>&nbsp;</p><p>近两年，全球半导体产业来到转折点，“缺芯潮”、“涨价潮”不断。</p><p>&nbsp;</p><p>有分析师悲观地预测，2023 年全球芯片市场将出现不可逆的极度衰退。花旗分析师 Christopher Danely 更是预计，芯片行业的下滑将是至少十年甚至二十年来最严重的。他指出，每一家公司和每一种芯片产品都可能受到影响。</p><p>&nbsp;</p><p>有专家表示，戴尔此次全面停用中国芯片，如果搞成供应不足，将对其发展非常不利。</p><p>&nbsp;</p><p>据《环球时报》报道，通信行业资深专家项立刚表示：“中国制造的芯片总体来说成本更低，现在个人电脑这样的产品利润空间并不大，竞争非常激烈。如果一家企业生产成本上升，影响是非常负面的。”项立刚说，戴尔现在的生产很大程度上依靠中国供应链，如果要去找替代方，短时间内很难解决。“在这个过程中，企业本身就会伤筋动骨，如果搞成供应不足，那对它的发展就非常不利，造成竞争力下降。最后就只能回到美国销售，把其他竞争对手赶走。”</p><p>&nbsp;</p><p>总的来说，戴尔此举对于对国内半导体产业而言，有“危”亦有“机”。</p><p>&nbsp;</p><p>存储芯片厂商深圳市铨兴科技有限公司黄少娃在接受《时代财经》采访时表示，这是中国芯片企业的机会。她表示，国内很多应用终端都在用国外的芯片，要提倡用国货、倡导内循环，大力推动产业链上下游协同，加速国产供应链完善。</p><p>&nbsp;</p><p>尽管当前全球半导体产业风云变幻，但近几年，芯片国产化成果有目共睹。</p><p>&nbsp;</p><p>大概从 2014 年开始，国内开启了芯片<a href=\"https://www.infoq.cn/article/SS8RFtU37FI6Ay7l1aVK\">国产化</a>\"替代潮。不到十年时间，从无到有，从有到优。虽然当前最先进制程的高端芯片全套工艺以及设备国产化存在一定难度，但中低端芯片已经基本实现了自给自足。</p><p>&nbsp;</p><p>半导体行业人士陈启此前在接受 InfoQ 采访时曾表示，“这几年，芯片国产化的成果有目共睹，这也是全体半导体行业上下游共同努力的结果，下游给机会，上游能进步。一方面，资本以及其他生产关系资源进入到了半导体行业，形成良性循环；另一方面，下游客户态度发生了巨大改变，从过去的不敢用、不敢试，到现在的敢用、敢试，上游供应环节也从简单的打价格战，变成了靠产品综合实力打天下，靠技术赚钱，靠实力拿订单。这种产业链上下游态度上的转变，带来的影响力是巨大的，是正面的。”</p>",
    "publish_time": "2023-01-09 14:17:21",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]