[
  {
    "title": "OpenAI API 功能升级：ChatGPT 支持描述函数调用",
    "url": "https://www.infoq.cn/article/P9BKLy4VOaKEpyJAALBM",
    "summary": "<p>OpenAI对API进行了更新，其中包括一种名为<a href=\"https://openai.com/blog/function-calling-and-other-api-updates\">函数调用（function calling）</a>\"的功能，它允许开发人员向<a href=\"https://openai.com/research/gpt-4\">GPT-4</a>\"和<a href=\"https://platform.openai.com/docs/models\">GPT-3.5</a>\"描述函数，并让模型创建代码来执行这些函数。</p><p></p><p><a href=\"https://openai.com/blog/function-calling-and-other-api-updates\">根据OpenAI的说法</a>\"，函数调用有助于聊天机器人的开发，这些聊天机器人能够利用外部工具，将自然语言转换为数据库查询，并从文本中提取结构化数据。这些模型经过了微调，不仅可以识别应该调用函数的实例，还可以提供与函数签名一致的JSON响应。</p><p></p><p>由于函数调用发挥了至关重要的作用，人工智能模型可以智能地与外部工具和API连接。开发人员可以通过为这些模型指定函数来访问大量的功能和服务。通过使用外部工具来响应查询、搜索数据库或从非结构化文本中提取结构化数据，这种连接使人工智能模型能够完成超出其自然能力之外的任务。由于函数调用，人工智能模型变得更加通用和有效，能够应对现实世界中的复杂挑战。</p><p></p><p>随着<a href=\"https://platform.openai.com/docs/models\">gpt-4-0613</a>\"和<a href=\"https://community.openai.com/t/gpt-3-5-turbo-0613-function-calling-16k-context-window-and-lower-prices/263263\">gpt-3.5-turbo-0613</a>\"的发布，开发人员现在可以向这些模型描述函数。因此，模型可以智能地生成<a href=\"https://en.wikipedia.org/wiki/JSON\">JSON</a>\"对象，这些对象包含调用这些函数所需的参数。这一激动人心的开发提供了一种更可靠的方式，将GPT的功能与外部工具和API连接起来，为无缝集成开辟了新的可能性。</p><p></p><p>这些模型已经开发出了一种能力，可以根据用户输入通过仔细的微调来识别应该激活哪个函数。此外，他们还学会了提供与特定函数签名相匹配的JSON答案。开发人员现在可以通过使用函数调用更可靠、更一致地从模型中获取结构化数据。</p><p></p><p>除了函数调用，OpenAI<a href=\"https://openai.com/blog/function-calling-and-other-api-updates\">还推出</a>\"了<a href=\"https://platform.openai.com/docs/models\">GPT-3.5-turbo</a>\"的增强版本，该版本提供了一个显著扩展的上下文窗口。该上下文窗口以标记或原始文本为单位测量，表示模型在生成进一步文本之前考虑的文本量。这一扩展允许模型访问和整合更大的信息体，使其能够做出更明智和与上下文相关的响应。</p><p></p><p>人工智能开发中的函数调用允许模型使用开发人员设计的工具，使它们能够扩展自己的能力并集成定制的功能。这种协作方法弥合了人工智能模型和开发人员设计的工具之间的差距，促进了人工智能系统的多功能性、适应性和创新性。</p><p></p><p>原文链接：</p><p><a href=\"https://www.infoq.com/news/2023/06/openai-api-function-chatgpt/\">https://www.infoq.com/news/2023/06/openai-api-function-chatgpt/</a>\"</p><p></p><p>相关阅读：</p><p><a href=\"https://www.infoq.cn/article/UNmAT4eReyYCOISHbrTc\">AI 进入普及应用阶段，用友已启动企业应用大模型训练</a>\"</p><p><a href=\"https://www.infoq.cn/article/85UCQYO6sJUC23W1JWBu\">用 AIGC 重构后的智能客服，能否淘到大模型时代的第一桶金？</a>\"</p><p><a href=\"https://www.infoq.cn/news/AsiUxMs8ARkZEkuEZYgL\">OpenAI 又赢麻了！谷歌 DeepMind 创始人刚称 Gemini 能碾压 GPT-4，OpenAI 的挖人大计就出炉了</a>\"</p>",
    "publish_time": "2023-07-05 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "解锁 Serverless 新进展：与 AIGC 结合会有哪些搞头？ ｜InfoQ《极客有约》",
    "url": "https://www.infoq.cn/article/ihlWu9yppWciFjm7b0NH",
    "summary": "<p>Serverless有哪些最新进展？AIGC 给研发领域带来了哪些影响？Serverless+AIGC会有什么价值？本期《极客有约》，阿里云智能 Serverless研发负责人杨皓然(不嗔)、高德服务端负责人孙蔚和阿里云智能高级技术专家聂大鹏（拓山），与大家一起聊聊Serverless与AIGC如何碰撞出新的火花。</p>",
    "publish_time": "2023-07-05 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "银行智能化转型：AI 中台的关键要素与实施策略",
    "url": "https://www.infoq.cn/article/xPds1taN1Xcgx1jWBXH4",
    "summary": "<p>数字化时代，<a href=\"https://www.infoq.cn/topic/AI\">人工智能（AI）</a>\"正日益成为各行各业的核心驱动力。近几年在竞争激烈的银行业内， AI  中台逐渐崭露头角，成为银行不可或缺的战略工具。</p><p></p><p><a href=\"https://www.infoq.cn/article/5_2QekZHvBj88q859P2U\">AI 中台</a>\"通常被定义为一种集中管理、整合和开放人工智能能力的平台。它提供了一种基础设施，使得银行能够有效地整合和管理各种 AI 技术、算法和模型，以支持业务创新和优化。通过 AI 中台，银行可以更好地利用数据、进行智能决策、提供个性化的服务，并优化内部业务流程。</p><p></p><p>针对这一趋势，近年来关于银行 AI 中台建设的讨论日益频繁。与此相关，InfoQ 最近与东亚银行（中国）有限公司（以下简称“东亚中国”）研发中心副总经理、<a href=\"https://tgo.infoq.cn/\">TGO鲲鹏会</a>\"（上海）会员周文彬进行了交流，探讨了 AI 中台的技术能力构建、应用场景、新旧技术的冲突和选择等话题，希望能为读者提供有价值的参考。</p><p></p><h2>银行纷纷打造 AI 中台</h2><p></p><p>银行建设 AI 中台并非什么新鲜事，国内无论是四大行还是规模较大的商业银行，这几年都有在加大投入布局 AI 中台/平台的建设。综合来看，这些银行搭建 AI 中台的原因主要包括“降本增效”、“推动业务创新和发展”以及“提高客户体验”等等。</p><p></p><p>首先，通过集中管理和调度 AI 资源，银行能够更好地利用算力和数据资源，提高业务处理的效率和准确性，同时降低相关的运营成本。</p><p></p><p>其次，AI 中台相当于为银行内部各个部门和团队提供了一个统一的平台，这有利于促进协作和共享，加速新的AI应用的开发和部署。</p><p></p><p>第三，通过 AI 中台，银行能够更好地分析和理解客户数据，提供个性化的产品和服务，提升客户体验和满意度。</p><p></p><p>周文彬进一步表示，由于 AI 任务对算力有很大的需求，为了合理地分配和调度 GPU 资源，并提供便捷的调用方式，这时候就需要建立一个中台来统一管理AI资产，包括数据、算法、算例、模型、服务，并提供统一的AI能力接口供其他业务系统调用。</p><p></p><p>据悉，目前东亚中国战略及数字化办公室和资讯科技处的 IT 团队也正共同打造 AI 中台的技术能力中心，以便可以在整个银行系统中充分利用 AI 技术。“构建 AI 中台，是为了形成行内数智化升级的 AI 能力底座，为业务场景建设提供丰富的 AI 原子能力及算法模型支撑。”</p><p></p><h2>AI 中台三大核心技术能力</h2><p></p><p>AI 中台的核心目标之一是建立统一的 AI 核心能力底座。据周文彬介绍，东亚中国 AI 中台的技术能力主要分为以下三大模块： OCR（光学字符识别）、ASR 和 TTS（语音识别和文字转换成语音播放）以及 NLP（自然语言处理）。</p><p></p><p>OCR ：利用光学字符识别技术，实现对纸质文档的自动化识别和转换，提高数据录入的效率和准确性；NLP ：利用自然语言处理技术，实现对文本信息的分析和理解、关键信息提取、提供智能问答、情感分析、文本摘要等功能；ASR &amp; TTS ： TTS技术（TextToSpeech） ，即文本到语音的转换，又称计算机语音合成。 ASR 技术（ Automatic Speech Recognition ），是将声音转化为文字，可类比于人类的耳朵。</p><p></p><h3>OCR 在银行的应用：提高工作效率和准确性</h3><p></p><p>OCR技术在银行中的应用，传统典型的应用场景主要是识别身份证、护照和银行卡等要素，为客户提供便捷的身份验证和账户开立流程。总的来说，通过使用OCR技术，银行可以实现自动化的识别和数据提取，提高业务处理的效率和准确性，降低成本，并改善客户体验。</p><p></p><p>周文彬举例道，票据录入是银行在办理业务时经常面临的场景之一。尽管在简单环境下，基于专用的OCR技术可以实现高准确率的识别，但其处理过程却极为繁琐复杂。该过程涉及多个步骤，比如灰度化、二值化、去黑边等，导致识别速度缓慢，并且对于识别图像的质量有比较高的要求——例如票据只允许单张上传，多张票据混合在同一页面会造成识别失效。</p><p></p><p>随着银行业务的数字化进程的加速，用户对OCR的智能化能力提出了更高的要求。比方说在报销场景中，需要识别多种不同类型的票据，如船票、车票、全电发票等。同时，这些票据往往会混合在同一张图片上，或者手机拍摄的照片或复印件，导致图像模糊不清。传统的OCR方法在这种“混合场景”中显得力不从心。因此，东亚中国研发团队正在引入深度学习的OCR技术解决方案，以来应对各种复杂的业务场景。</p><p></p><p>除了上述混合识别场景，OCR在银行合同签署管理上也发挥巨大作用。传统的合同管理过程通常繁琐且容易出错，而通过将合同扫描到系统中，并利用OCR技术自动识别合同内容和变化，银行可以实现快速合同比对和审核，大大提高了合同管理的效率和准确性。</p><p></p><p>周文彬介绍了合同审核中的一个常见难题：尽管公司拥有标准的合同模板，但每次与供应商合作都存在特殊性：合作内容和条款通常需要根据公司要求对标准模板进行补充和调整。然而，项目经理并非专业的法律顾问，因此在调整过程中可能会出现词汇不够准确的情况。此外，在整个合同审核流程中，还需要多个部门（如采购、科技风险和法务等）进行审核。一旦业务条线提出异议，就需要将合同退回给发起人进行修改，整个过程涉及多个版本的合并。</p><p></p><p>所以为了有效应对法律风险、合规风险和操作风险，审核工作需要人工逐页核对、与模版合同做对比，判断条款是否有增、删、改。但当合同有数十页甚至上百页时，即使投入了大量的人力进行检验审核，也无法完全保证核对效果，效率也很低，同时也对后续的审计工作产生较大的困难。因此，东亚中国利用OCR技术和NLP技术对关键信息进行提取，可以将所有合同扫描进系统，AI 会自动识别并比对签署版本内容和合同模版之间的差异，包含一对一比对与批量一对多比对，在确保审核准确度的前提下，大幅提升效率。</p><p></p><p>总的来说，东亚中国目前主要利用 OCR 来解决复杂场景识别和合同审核场景所对应的“准确度”和“效率”两大痛点。而 AI 中台里的OCR能力，则是往精准度和灵活度更高的方向去发展。</p><p></p><h3>ASR &amp; TTS，从语音质检到“智库”</h3><p></p><p>语音方面的技术，周文彬表示目前主要是在呼叫中心智能化建设方面发挥着重要作用。</p><p></p><p>他主要提到两个方面，首先是语音质检，即通过语音转写和语义理解，对客服接听电话的语气、语音和内容是否符合要求进行评估，取代了以往的人工抽检方式。</p><p></p><p>其次是<a href=\"https://www.infoq.cn/article/32r9H4xdWYmRQLk7vGFC\">辅助功能</a>\"，比如在客服工作中，以前需要查阅手册、搜索电脑系统来获取问题答案和客户信息。未来则希望能通过智能化升级给出话术推荐和营销建议，以最优解方式呈现在客服桌面上，提供更高效的支持。同时，“辅助”能力还包括对客服语速过快、音量调整、检测违规词等情况的实时提醒，以帮助客服及时调整。</p><p></p><p>此外，周文彬表示，东亚中国正在研发自己的智能话术库。不过他指出，其他银行已经有在应用智能话术库，但在运营过程中，其实也是一把双刃剑，用得恰当是一个得力助手，过度依赖的话也会影响客户体验。他举例说，最优秀的保险销售员通常是通过线下社群方式面对面运营的，即使话术再好，也不一定能与客户建立有效链接。因此，技术的作用主要是帮助新手迅速成长、用标准回复提升工作质量，但要成为资深专家，还需要其他经验和技能的积累。</p><p></p><h3>NLP 的多重应用场景</h3><p></p><p>银行业可以将自然语言处理应用到大量的文本和语音数据，其常见应用场景也比较多。比如在银行的呼叫中心智能化建设中，银行可以利用NLP技术构建聊天机器人，以回答客户的常见问题、提供账户信息、处理简单的交易请求等。</p><p></p><p>电话中的智能语音助手也可以通过NLP技术来完成，使得客户能够通过语音与银行进行交互，包括查询账户余额、进行转账、报告卡片丢失等操作。NLP技术可以让语音指令能够被准确地解释和执行。</p><p></p><p>此外，NLP还可以用于分析客户的文本反馈、社交媒体帖子和评论等，以获得有关客户满意度、产品偏好和市场趋势的洞察。</p><p></p><h2>旧方案与新技术的“冲突”，如何平衡？</h2><p></p><p>然而，周文彬指出 AI 中台的建设过程往往会面临一些挑战和难点。</p><p></p><p>比如，很多中小银行为了满足各业务条线的人工智能场景需求，选择引入成熟的 AI 厂商能力。然而，这导致了AI应用场景分散在各业务系统中，虽拥有多种 AI 的原子能力，但是无法实现能力的复用与合理编排。</p><p></p><p>在东亚银行 AI 中台的建设过程中，也遇到了类似的挑战。其中一个难点是如何将现有的 OCR 系统与中台内新的 OCR 解决方案整合成一体，以确保统一的业务逻辑和结果输出。这类似于超市的“翻新”工程，超市要如何既进行翻新工程但又不耽误经营呢？</p><p></p><p>针对这一难题，东亚目前采取了以下方案：集中管理OCR的能力，并利用已有的 OCR 解决方案来处理现有简单场景，而对于复杂的新场景则采用新的OCR解决方案。在架构规划上，将新旧两个 OCR 解决方案都定义为工具类服务，提供OCR的标准接口，以增强统一性和复用性。每新增一个业务场景，如涉及OCR能力的使用，都会调用银行内部统一的OCR服务。通过这种整合方式，可以确保不同场景对于OCR的需求，同时能够统一管理AI能力，以避免重复造“轮子”。</p><p></p><p>此外，这也引出了一个重要问题，即在引入 AI 技术时，大概率会面临现有架构的冲突。这时候是新场景用新 AI 技术，还是说全部推倒重来？</p><p></p><p>这个问题的复杂性在于不同场景可能需要不同的解决方案，尤其对于银行这种业务复杂、多条线业务并存的情况。周文彬强调，新的业务场景下，有时需要使用新的 AI 技术，而在某些场景中，保持现有复杂的解决方案可能更为适合。每个银行和机构都有其特定的需求和实际情况，因此需要针对不同场景进行定制。</p><p></p><p>他认为，虽然已有一些国内银行在 AI 中台建设方面取得了成果，但整个领域仍处于探索的初级阶段，还需要不断尝试和落地。</p><p></p><h2>数字化思维和业务理解并行</h2><p></p><p>在银行内实施 AI 项目，除了需要具备数字化思维，深入了解业务同样很重要。</p><p></p><p>比如在设计数字化场景或产品时，需要充分了解业务数据安全和产品定位。尤其是在银行等领域的应用中，个人信息保护、商业机密及数据安全是需要格外关注的方面。我们要避免让 AI 技术带来便利性的同时，忽略了安全和合规问题。</p><p></p><p>其中，周文彬举了合同比对功能的例子。其指出，在进行合同比对功能时，会涉及到多种不同类型的合同，如个人贷款合同和企业合同。但 AI 中台或 OCR 等技术只是工具，它可以帮助处理合同数据、提取关键信息等，业务合规方面的考虑应由调用方业务系统来完成。</p><p></p><p>最初，技术供应商设计的合同比对功能如下：如果发现不一致之处，文字会被存储在数据库中，以便查看历史记录。从工具类系统设计的角度来看，将文字对比后的差异片段保存下来并没有太大问题。然而，结合业务场景来评估的时候，我们发现发现该功能可能会涉及个人合同比对或企业商务合同中个人信息部分的核对，各类业务场景的调用可能会无意间导致系统存储大量客户敏感信息。而该功能仅作为一个工具服务存在，是不应涉及存储与管理客户敏感信息。</p><p></p><p>因此，在每个系统设计之初，关注数据信息的使用和保护是至关重要的。这里就凸显了架构平台部对整体架构统一规划和管理的重要性，在该系统的前期架构评审中，就明确为工具类应用，不存储和管理客户敏感信息。经东亚银行项目团队与供应商产品团队的沟通后，供应商同意对原产品进行改造，在每一次的查询结果显示完毕后，比对数据立即从后台数据库中被删除。当需要查看历史记录时，则通过业务系统调用的方式重新提交查询，这样的改进保证了数据的安全性和隐私保护。</p><p></p><p>“技术本身并无好坏，其使用效果的好坏取决于人们如何运用。在评估供应商提供的技术产品时，我们需要提前了解新场景的需求和后续的发展方向，保持专业的敏感度和前瞻性，对产品的差异性进行评估。这包括产品设计、详细构成、设计要求、功能、使用范围和用途等方面。”周文彬进一步说，“我们不能简单地认为市面上成熟产品一定是最好的，每家金融机构都有自己的定位，经过差异性分析后往往需要进行大量的客制化改造，以打造出适应各家机构自己的系统。因此，最适合自身需求的产品才是最好的选择。”</p><p></p><h2>小结</h2><p></p><p>综上，在数字化历程中，对于银行搭建 AI 中台或应用其他 AI 技术时需要重点考虑的因素，周文彬总结了以下方面的建议：</p><p></p><p>首先，明确目标和战略。每个银行对于数字化转型的定义都不同，因此明确机构的目标和战略非常重要。比如是追求业务增长、改善客户体验，还是确保数据的准确性和合规性，这些都需要明确定义。东亚银行的战略及数字化办公室在推动和实现数字化转型方面取得了重要的成效，因此得到了高层领导的关注与支持。</p><p></p><p>其次，制定综合的计划。在企业数字化转型的过程中，AI的应用是一个复杂的过程，涉及多个业务场景和技术。制定综合计划时，需要考虑组织的资源和人员能力是否足够，并制定明确的路线图，逐步实施和集成。</p><p></p><p>第三，重视数据管理和数据质量。数据在 AI 应用中起着核心作用，无论是训练模型还是其他应用，有效的数据管理策略是必要的，包括收集、存储、清理和标准化等环节，以保证数据质量和满足后续的要求。</p><p></p><p>第四，培养内部的数字化技能和文化。人员的技能需要与业务的数字化要求相匹配，例如供应链业务的线上签约场景，需要对各个环节数据的保密性、完整性、和抗抵赖性以及证据链的防篡改等方面具备相应技能的数字化人才参与。此外，鼓励创新和探索的文化也是重要的，以提高效率和推动进步。</p><p></p><p>第五，风险管理和合规性是不可忽视的方面。应用 AI 技术时，必须重视风险管理和合规性，确保结果可靠和符合监管要求。需要建立有效的风险管理措施，进行新产品评估和相关审查，并参考监管要求以保持一致性。</p><p></p><p>（本文受访嘉宾所提供的信息和发表观点为其个人意见，不代表所在企业立场。）</p>",
    "publish_time": "2023-07-05 12:14:21",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]