[
  {
    "title": "开源社区为职业发展带来机会，助力开发者实现“加薪”梦想",
    "url": "https://www.infoq.cn/article/yAEo200pmK3aSXAzc07o",
    "summary": "<p></p><h2>开源的作用</h2><p></p><p>软件开发过去主要在公司或组织内进行，与外部的合作很少。只有存在合同关系的情况下，才会与合作伙伴及其他人合作。开发人员很少能够分享或讨论他们正在进行的工作。你需要加入一家公司并按照他们的指示进行编码。在整个行业中，过往的工作几乎没有得到利用，工作的重复性很高。所有这些在20世纪90年代的开源软件运动开始后发生了改变。</p><p>&nbsp;</p><p>在过去的30年里，世界变得互联互通而且越来越数字化。越来越多的企业和组织是建立在软件上，尤其是开源软件。行业研究显示，超过90%的公司使用开源软件，我们的软件技术栈中有60-90%是开源的。每一天我们都在使用开源软件。</p><p>&nbsp;</p><p>开源也是我们进行现代软件开发的方式，我们将下载的开源库、框架和其他代码组合在一起，创建新的应用程序或功能。这就是为什么每个开发人员和高级角色都需要了解什么是开源以及它是如何工作的原因。</p><p>&nbsp;</p><p></p><h2>开源项目中的高级角色</h2><p></p><p>许多科技公司的高级员工角色，如首席工程师或杰出工程师，可以在开源项目中工作。我在亚马逊的团队中有三位首席工程师，他们在开源战略方面处理公司范围内的激动人心的挑战。他们指导、影响并对整个组织的开发人员产生很大影响。许多人对人员管理没有兴趣，但希望在公司中产生广泛影响并解决重大问题。</p><p>&nbsp;</p><p>在科技行业，一些高级员工角色可以管理一些专家团队，这些团队是特定技术主题的首选团队。我之前的公司的高级员工角色几乎都是个体贡献者（IC）角色。但现在时不时地，你也会看见带领小团队的高级员工角色。这使得高级领导者可以将他们作为技术专家的工作与人员管理角色相结合。这些小团队通常是专家团队，他们是该技术主题的首选人员，并可让个体贡献者将他们的知识扩展到整个公司。</p><p>&nbsp;</p><p>我作为康卡斯特公司的工程研究员是这样的角色。我可以领导一个小团队，同时还有时间从事个人贡献工作，比如撰写论文和在会议上演讲。这是可能的，因为我领导的团队，即开源项目办公室（OSPO），是一个小型专家团队，为公司各个部门的开发人员和业务负责人提供咨询。这使我有时间从事个人工作，如战略规划、撰写论文或在活动中演讲。</p><p>&nbsp;</p><p>通过灵活地选择只做个人贡献者，一个人可以将管理和个人贡献角色结合起来，为职业生涯增加更多的灵活性。即使作为高级个人贡献者，一位高级工程师也需要具备人际交往技巧，如指导他人、传达观点、谈判和影响力。</p><p>&nbsp;</p><p></p><h2>高级开发者为开源项目做贡献时所面临的挑战</h2><p></p><p>首要的挑战是在工作之外腾出时间为开源项目做贡献。很少有机构会给你时间来为与你日常工作无关的开源项目做贡献。你可能需要在晚上和周末找到时间。特别是女性，她们通常有照顾他人的责任，很难找到额外的时间。</p><p>&nbsp;</p><p>你需要说服你的组织，为什么应该允许你或你的团队花费一部分时间回馈开源社区。对一个组织来说，这些好处通常是长期的，包括信任和影响项目的能力等软性好处。因为组织都关注硬性、可量化的底线影响，所以管理者不愿意为团队腾出时间来提交补丁或志愿服务。</p><p>&nbsp;</p><p>高级技术人员，比如那些高级职位的角色，拥有组织的信任，并且可以展示投入开源的时间如何有助于维持项目，尤其是如果它是公司路线图的关键依赖的时候。一位与我密切合作的首席工程师通常了解与开源项目密切合作的回报。他们向业务提供建议，指导我们的开发人员如何与开源社区项目建立关系，以便支持我们的客户。当我们在公司中对云原生开源项目建立起更多的专业知识时，事情变得非常有帮助。高级领导者可以借用他们的信誉和知识，帮助管理者投资对组织至关重要的开源项目。</p><p>&nbsp;</p><p>高级技术人员或高级领导者还可以在开源活动中发表演讲，并在公司参与的社区中展示自己。公司内部会发生的困难讨论之一是是否应该开源公司开发的技术。公司重视对新想法进行专利保护并建立专利组合。当组织将他们的技术开源时，担心会让竞争对手得到机会，而不得不放弃他们的知识产权。然而，当你仔细研究这项技术时，你会意识到并非所有内容都需要保密。开源可能会使整个行业团结在你所创造的标准化方法周围。它可能使你创建出一个更具可扩展性的项目，具有新的用例或对新硬件的支持。特别是在该特定领域，高级技术人员可以在帮助组织思考为何要这样做方面发挥关键作用。</p><p>&nbsp;</p><p>有些开源社区可能不太友好，很难参与进去。通常是因为他们没有太多时间来帮助新加入者。通过观察邮件列表，了解社区需要帮助的地方，你可以通过满足他们的需求来赢得他们的信任。让自己能提供帮助是打入困难社区的最佳方式。有时候，你可能不会成功，但需要继续前进。通过付出时间和代码贡献来赢得你的位置，这件事情需要坚持不懈。</p><p>&nbsp;</p><p>开源项目和代码可能很复杂，没有文档或提交信息。这可能会让人难以理解并做出贡献。如果你坚持下去并付出时间，你就会有回报。</p><p>&nbsp;</p><p></p><h2>我的开源旅程</h2><p></p><p>很多年前，我就成为了一名开发者，并对其他的技术角色充满好奇。这促使我去探索产品管理、市场营销和战略，在我的不同角色中广泛涉猎。</p><p>&nbsp;</p><p>通过广泛涉猎而非深入研究，我能更有效地参与技术战略，并理解我们的创新和将产品和技术推向市场的不同方面。我在上世纪90年代末开始参与开源，这让我在公司中扮演了许多角色，从管理基于开源的产品到为财富50强公司运营开源办公室。</p><p>&nbsp;</p><p>这些角色一点都不无聊，因为开源涉及法律、技术和社交等多个维度，这让我能够充分探索创建新技术的各个方面。我很幸运能够结识一些优秀的人，并参与一些伟大的社群。由于开源跨越组织边界，我经常与不同公司和来自非营利基金会的人合作。我有机会参加各种会议和会谈，游历世界各地。这是一段又有回报又令人兴奋的旅程。</p><p>&nbsp;</p><p></p><h2>参与开源贡献的软件工程师所获收益</h2><p></p><p>了解开源的社会技术方式对职业发展有许多好处。参与贡献的人学会了如何沟通自己的工作，学会了与全球的人合作，并了解如何在开源项目和社区中运作。这些技能在高级及以上级别员工尤为重要，因为你必须发展自己的影响力和沟通技巧。</p><p>&nbsp;</p><p>同时，确保一个项目生存下去并为用户提供服务，也给人一种使命感，尤其是如果这个领域是你热衷的。</p><p>&nbsp;</p><p>许多知名的贡献者和维护者备受依赖他们项目的公司的追捧，这些公司需要他们的专业知识。维护者甚至可以在公司工作的同时继续做他们自己的工作。</p><p>&nbsp;</p><p>我非常感激能够发现和参与开源项目，以及我所属于的伟大的全球社区的成员们。</p><p>&nbsp;</p><p></p><h2>开源对组织的好处</h2><p></p><p>各个组织都在使用开源软件，并且需要雇佣懂得如何使用开源软件和参与开源社区的人员。拥有开源专家可以帮助组织管理对开源项目的依赖关系。使用开源就好像组织拥有了外部的开发团队，需要与他们密切合作。</p><p>&nbsp;</p><p>通过参与开源社区和项目，公司还能够支持那些急需资源或资金以继续运行的项目。作为组织，我们广泛使用开源软件。开源项目通常是由志愿者运营的，并且很难维持项目的运作。通过为项目提供财务支持或所需的工作，公司可以维持项目的发展，尤其是那些公司可能依赖的项目。</p><p>&nbsp;</p><p>支持开源的组织在招聘、保留和培养技术人才方面更加成功。他们可以在开源项目中展示自己的工作，并展示他们正在进行创新工作。</p><p>&nbsp;</p><p>最后，开源有助于公司更快地创新，并让他们小而专的团队集中在他们擅长的领域，同时依赖开源来处理无差异的领域。</p><p>&nbsp;</p><p></p><h2>如何将人们的才能运用到开源中</h2><p></p><p>参与开源项目或社区的门槛很低。你不需要签订合同或加入一家公司。你可以在GitHub或GitLab上找到喜欢的语言或项目，加入邮件列表，并找到帮助项目的方法。</p><p>&nbsp;</p><p>项目通常会列出需要帮助的内容和初学者问题。你可以修复一个bug，提交一个问题，帮助编写文档或翻译，甚至宣传这个项目。通常，项目需要帮助审查用户提交的问题，决定如何解决这些问题，或者审查开发者提交的合并请求。</p><p>&nbsp;</p><p>项目的维护者希望你能帮助他们，而不是给他们增加更多工作。在开源中，我们称这些需要帮助的任务为\"砍柴和打水\"。这些通常是基础性的任务，如管理项目——保持文档更新、回答问题等。这些工作可能不够吸引人，但非常必要。</p><p>&nbsp;</p><p>根据Tidelift<a href=\"https://blog.tidelift.com/open-source-maintenance-can-be-stressful-lonely-and-financially-unrewarding\">对开源项目维护者的报告</a>\"，41%的开源项目只有一个维护者，并且非常需要帮助。通常，这些项目被全球数千名开发人员使用。这些资源匮乏的项目需要额外的帮助，以支持全球用户。</p><p>&nbsp;</p><p>在开源中所做的工作可以丰富你的晋升或绩效故事。使用开源的公司认可开发人员在开源中的工作。成为项目的贡献者（有权接受代码并加入项目）或担任领导角色往往被公司内部视为一项成就。</p><p>&nbsp;</p><p></p><h2>我对积极参与的开发人员和高级员工的建议</h2><p></p><p>参加开源活动，比如Linux基金会的<a href=\"https://events.linuxfoundation.org/open-source-summit-north-america/program/schedule/\">开源峰会</a>\"或<a href=\"https://2023.allthingsopen.org/\">Raleigh的开源大会</a>\"。了解社区并参与其中。通常会有针对首次参会者和101课程的会议，它们帮助你参与其中。活动期间的走廊交流是与开源专家见面并了解他们的好方法。</p><p>&nbsp;</p><p>看看你所在的组织是否有一个开源办公室（OSPO），以及你是否可以参与到办公室的工作中。查看你使用的项目及其社区，看看你如何贡献和支持它。</p><p>&nbsp;</p><p>像首席工程师和高级研究员这样高级角色通常是成为开源办公室顾问和战略家的最佳选择。他们通常能够提出为什么公司应该开源某个项目的论点，并向业务上提供建议，以投资于员工和支持该项目。在我负责开源办公室的所有组织中，与高级技术人员的合作是制定正确策略和在开源方面投资的关键。</p><p>&nbsp;</p><p>从小处着手，并持之以恒，这将是一次有回报的体验，有助于你的职业发展并带来个人满足感。我见过的最好的贡献指南之一是GitHub创建的<a href=\"https://opensource.guide/how-to-contribute/\">开源指南</a>\"。</p><p></p><p>原文链接：</p><p><a href=\"https://www.infoq.com/articles/developers-staff-plus-open-source/\">https://www.infoq.com/articles/developers-staff-plus-open-source/</a>\"</p>",
    "publish_time": "2023-09-28 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "Llama 生态现状：下载量超过 3000 万次，GitHub 上有超 7000 个相关项目",
    "url": "https://www.infoq.cn/article/2Kg4JCGdZWc632qllp9t",
    "summary": "<p><a href=\"https://ai.meta.com/blog/large-language-model-llama-meta-ai/\">Meta发布Llama 1</a>\"至今已经 7 个月左右，而<a href=\"https://ai.meta.com/blog/llama-2/\">Llama 2</a>\"以及<a href=\"https://ai.meta.com/blog/code-llama-large-language-model-coding/\">Code Llama</a>\"的发布也有了数月的时间。当地时间9月27日，Meta发布博文系统介绍了当前 Llama 生态的情况。官方统计，通过 Hugging Face 的 Llama 模型下载量超过 3000 万次，其中仅在过去 30 天就超过了 1000 万次。</p><p>&nbsp;</p><p>当前的Llama 生态情况如下：</p><p>&nbsp;</p><p>云厂商：AWS、Google Cloud 和 Microsoft Azure 等主要平台已在其平台上采用了 Llama 模型，并且 Llama 2 在云中的使用正在扩大。Google Cloud 和 AWS 总共有超过 3,500 个企业项目基于 Llama 2 模型启动。此外，Meta 还宣布 AWS 成为 Llama 2 的首个托管 API 合作伙伴，各种规模的组织都可以访问 Amazon Bedrock 上的 Llama 2 模型，而无需管理底层基础设施。</p><p>&nbsp;</p><p>创新企业：包括 Anyscale、Replicate、Snowflake、LangSmith、Scale AI 等在内，已有上万家初创公司正在使用或评估 Llama 2。“像 DoorDash 这样的创新者正在使用它进行大规模试验，然后再发布由LLM支持的新功能。”</p><p>&nbsp;</p><p>众包优化：截至目前，社区已在Hugging Face上微调并发布了7000多个衍生品。平均而言，在标准基准测试中，它们将常见基准测试的性能提高了近 10%，对于 TruthQA 等基准数据集的性能提升高达 46%。</p><p>&nbsp;</p><p>开发者社区：GitHub 上现在有超过 7,000 个基于 Llama 构建或提及 Llama 的项目。为方便将 Llama 引入边缘设备和移动平台，新的工具、部署库、模型评估方法，甚至 Llama 的“微型”版本都在开发中。此外，社区还扩展了 Llama 以支持更大的上下文、增加了对其他语言的支持等。</p><p>&nbsp;</p><p>硬件支持：各大硬件平台AMD、Intel、Nvidia、Google均通过软硬件优化提升了Llama 2的性能。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/61/6123307306e980cfff4e10cfa74fbb84.png\" /></p><p>对于Llama 生态的未来，Meta表示，仍致力于为当今的人工智能提供开放的方法，主要会在多模态、安全责任和社区上投入更多关注。</p><p>&nbsp;</p><p>&nbsp;</p><p>参考链接：</p><p><a href=\"https://ai.meta.com/blog/llama-2-updates-connect-2023/\">https://ai.meta.com/blog/llama-2-updates-connect-2023/</a>\"</p>",
    "publish_time": "2023-09-28 10:04:12",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "AIGC时代，如何提升端侧算力利用效率？| InfoQ《极客有约》",
    "url": "https://www.infoq.cn/article/w4UPiNImmKac6OSgpEiP",
    "summary": "<p>ChatGPT 的爆火掀起了 AI 大模型热潮，也进一步拉动了算力需求的爆发，面对呈指数级增长的算力需求，如何用得起、用得上、用得好算力成为大家普遍关心的问题。那么，在大规模 AI 模型训练中，如何保证算力的高效利用？有哪些技术或方法可以提升训练的效率和稳定性？AIGC 应用如何下沉到终端？本期，我们邀请到了英特尔中国技术部总经理高宇，为大家分享《AIGC 时代，如何提升算力利用效率？》。</p>",
    "publish_time": "2023-09-28 10:46:25",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "Kyligence 联合创始人兼 CTO 李扬，确认担任 FCon 银行数智化建设专题出品人",
    "url": "https://www.infoq.cn/article/1DpIt2XjUKaqzD8jDOhC",
    "summary": "<p><a href=\"https://fcon.infoq.cn/2023/shanghai/?utm_source=infoqweb&amp;utm_medium=atricle\">FCon 全球金融科技大会</a>\"，将于 11 月在上海召开。Kyligence 联合创始人兼 CTO 李扬将担任「<a href=\"https://fcon.infoq.cn/2023/shanghai/track/1590?utm_source=infoqweb&amp;utm_medium=article\">银行数智化建设</a>\"」的专题出品人。在此次专题中，你将了解到数据是企业的战略资产，数据治理能力强弱直接影响数据价值的释放，以及金融企业在数据治理方面的实践与经验。</p><p></p><p><a href=\"https://fcon.infoq.cn/2023/shanghai/track/1590?utm_source=infoqweb&amp;utm_medium=article\">李扬</a>\"，Apache Kylin 联合创建者及 PMC Member，曾任职 eBay、IBM InfoSphere BigInsights、摩根士丹利，曾获 IBM “杰出技术贡献奖”获得者，专注研究大数据分析、并行计算、数据索引、关系数学、近似算法和压缩算法等前沿技术。在过去多年的工作经历中，直接参与并见证了 OLAP 技术的发展。</p><p></p><p>相信李扬的到来，可以帮助提升此专题的质量，让你认识到，数据治理是一个涉及企业战略、组织架构、数据标准、管理规范、执行落地、技术工具的综合体，同时也是企业数字化转型成功的前提与基石。通过本专题对金融企业在数据治理方面的实践与经验分享，为其他企业进行数据治理提供了思路，指明了方向。</p><p></p><p>除上述专题外，FCon 上海还将围绕 DevOps 在金融企业落地实践、金融行业大模型应用、创新的金融科技应用、金融实时数据平台建设之路、金融安全风险管控、数据要素流通与数据合规等专题进行交流。</p><p></p><p>FCon 上海 2023，相约 11 月！现在购票，前 100 人可享 5 折特惠购票，咨询购票请联系：17310043226（微信同手机号）。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/a8/a8ec7f7fb25c7949931b2b8a5deffddd.png\" /></p><p></p>",
    "publish_time": "2023-09-28 11:30:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "探索AI技术对古彝文保护与研究应用",
    "url": "https://www.infoq.cn/article/ad5b3a17e30bbacebaaa95034",
    "summary": "<p></p><h1>一、古彝文</h1><p></p><p></p><h2>1.1 古彝文介绍</h2><p></p><p>古彝文是彝族使用的一种古老文字系统，彝族是中国的少数民族之一，主要分布在中国西南地区。古彝文具有悠久的历史和独特的文化意义，被认为是世界上最古老的文字之一。</p><p></p><p>古彝文的起源可以追溯到公元前13世纪左右，据信是由古代彝族人民创造和使用的。它是一种表音文字系统，每个字符代表一个音节或一个音节的组合。古彝文的书写方式是从上到下、从左到右，类似于竖排的文字。它的形状多样，有直线、弯曲、斜线等不同的组合，形成了独特的图形。</p><p></p><p>古彝文的内容涵盖了丰富的彝族文化和历史信息，包括祭祀、婚姻、宗教、传统习俗等方面。通过研究古彝文，人们可以了解到彝族人民的生活方式、价值观念和社会结构。古彝文也是研究彝族历史和文化的重要线索和工具。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/0e/0ef06b4876a57028448005b08dfa1d97.png\" /></p><p></p><h2>1.2 古彝文古籍保护背景</h2><p></p><p>古彝文的研究对于彝族文化的保护和传承具有重要意义。通过深入研究古彝文，人们可以更好地理解彝族文化的独特之处，并促进彝族文化的传统与现代的交流与融合。</p><p></p><p>随着现代科技的进步，人们开始探索利用人工智能和计算机技术来识别和研究古彝文。合合信息与上海大学社会学院签署校企合作协议，通过将人工智能和计算机视觉技术应用于古彝文识别，可以更快速、准确地解读古彝文文献，并将其数字化保存，助力推动古彝文古籍保护和研究。</p><p></p><h2>1.3古彝文识别的重难点</h2><p></p><p>古彝文识别的重难点主要包括以下几个方面：</p><p></p><p>1.数据样本稀缺性：由于古彝文的使用较为有限，古彝文的数据样本相对稀缺。这使得训练和优化古彝文识别模型变得困难，因为需要大量的样本数据来训练模型以提高识别准确性。因此，缺乏充足的古彝文数据样本是古彝文识别的一个重要难点。</p><p></p><p>2.古籍修复：由于很多彝族文献遭到破坏和流失，存在缺失、污渍、模糊、噪声干扰等现象，像这样：</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/6a/6a8c5db1f8859507fff231f7865c4b6b.png\" /></p><p></p><p>3.字符形状多样性：古彝文的字符形状非常多样，包括直线、弯曲、斜线等不同的组合。这使得古彝文的字符识别变得复杂，因为不同的字符可能具有相似或相同的形状，而相似的字符可能具有不同的语义。因此，准确地区分和识别古彝文字符的形状是一个重要的难点。</p><p></p><p>4.字符数量和组合规则：古彝文字符的数量较多，约有600个以上的字符。而且，古彝文的字符通常是由多个基本形状组合而成的，这种组合规则也具有一定的复杂性。因此，要准确地识别古彝文字符，需要对字符的数量和组合规则进行深入的研究和理解。</p><p></p><p>5.字词辨别和语义理解：古彝文的词汇和语义理解也是一个挑战。由于古彝文是表音文字系统，一个字符可能代表一个音节或一个音节的组合。因此，对于词句的辨别和语义理解需要结合上下文信息和语言学知识。这对于古彝文的自动识别和翻译来说是一个重要的难点。</p><p></p><p>为了应对这些重难点，古彝文识别需要结合人工智能和计算机视觉技术，如深度学习、图像处理和自然语言处理等。通过建立大规模的古彝文数据库、优化识别算法和加强语义理解，可以提高古彝文识别的准确性和效率。此外，加强对古彝文的研究和保护，提高对古彝文的认知和使用，也是解决古彝文识别难题的重要途径。</p><p></p><h1>二、AI技术助力古文识别应用</h1><p></p><p>作为世界上最古老的文字之一，古彝文是中华文明地图上神秘而耀眼的印记。合合信息联合上海大学、华南理工大学团队针对现有的西南彝志、云贵一带古彝文字符开展统一编码，并于近期发布了业内首个古彝文基础编码数据库（简称“数据库”）。</p><p></p><p>该数据库包含上千个古彜文基础编码，通过API数据接口等形式，该数据库有望帮助高校研究人员、文化工作者、兴趣爱好者等人群快速找到古彝文在字典中的读音、汉语释义、用法，如同“大字典”一般，帮助人们降低古彝文书籍、文献阅读的门槛，以数字化手段助力传统文化保护、创新之路。</p><p></p><p>研究古彝文字集，有助于理解尚未被翻译成汉文、用字尚未规范化的古籍，更深层、透彻地作用于传统文化保护，同时通过建立古彝文数据库，填补当前国内外研究的空白。合合信息与华南理工大学共同成立文档图像分析识别与理解联合实验室，联合上海大学社会学院，共同解决数据库建设中的学术性、技术性难点。</p><p></p><p>合合信息与上海大学将合力完成以《西南彝志》为中西的贵州古彝文图像识别及数字化校对工作，帮助后续古彝文的检测、识别、标注，利用旗下扫描全能王的智能高清滤镜技术也可以进行古彝文的古籍修复。</p><p></p><h2>2.1 智能高清滤镜技术</h2><p></p><p>智能高清滤镜技术可智能检测图像中存在的问题，自动判定图像优化方式，实现模糊、阴暗、手指等干扰因素全处理。传统古籍问卷存在水迹、残旧、破损等情况，通过智能高清滤镜能够去除相关痕迹复现高清文档并开展识别。</p><p></p><p>从而增强文字的可读性，为接下来的文字信息提取、识别创造了良好的条件。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/fd/fde30d10f8d38ffad4fcd4bc5237a467.png\" /></p><p></p><h2>2.2 基于深度学习的复杂场景文字识别技术</h2><p></p><p>基于深度学习的复杂场景文字识别技术是一种能够自动识别和提取复杂场景中的文字信息的技术。它可以应对各种复杂的场景，如模糊、扭曲、光照不均、背景干扰等，实现高准确度的文字识别。这种技术的核心是深度学习模型，通常使用卷积神经网络（Convolutional Neural Network，CNN）和循环神经网络（Recurrent Neural Network，RNN）的结合来处理图像中的文字。整个过程可以分为三个主要步骤：文本检测、文本定位和文本识别。</p><p></p><p>1、首先是文本检测：它的目标是在图像中定位出文字的位置。通常使用卷积神经网络来进行文本区域的检测，网络会学习到图像中文字的特征，通过滑动窗口或区域提议的方式来检测可能的文字区域。</p><p></p><p>2、接下来是文本定位：这一步是为了更精确地定位出文字的位置。通常使用回归模型或者基于锚点的方法来对文本区域进行精确定位，以获得更准确的文字边界框。</p><p></p><p>3、最后是文本识别：这一步是将文字从图像中提取出来并进行识别。通常使用循环神经网络（如长短时记忆网络，LSTM）来对文字进行识别，网络会学习到文字的上下文信息，从而提高识别的准确度。</p><p></p><p>4、此外，为了提高复杂场景文字识别的准确度，还可以采用一些技巧和策略，如数据增强、多尺度处理、注意力机制等。数据增强可以通过旋转、缩放、扭曲等方式生成更多的训练样本，提高模型的泛化能力。多尺度处理可以通过在不同尺度下对图像进行处理，提高对不同大小文字的适应能力。而注意力机制可以帮助模型更关注重要的文字区域，减少背景干扰对识别结果的影响。</p><p></p><p>古彝文项目将根据上海大学古彝文研究员设计的四字节编码系统，引入合合信息智能文字识别技术，对异体字、变体字、误用字和混用字等进行标注、识别、比对，并由此建立起精确的彝文古籍电子数据库，识别标注效果如下所示：</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/b6/b6eec476252e8fbc94fb22b1df29f577.png\" /></p><p></p><h2>2.3 自然语言处理（NLP）技术</h2><p></p><p>自然语言的语义理解是指对自然语言文本中的意义和语义进行理解和解析的过程。它是自然语言处理（NLP）中的一个重要研究方向，旨在使计算机能够准确地理解和推断文本的含义，从而实现更高级别的语言处理任务。</p><p></p><p>注意力机制在语义理解中可以发挥重要作用，下面是一个基于注意力机制语义理解的实现过程：</p><p></p><p>数据预处理：首先，需要对古彝文数据进行预处理。这包括分词、词性标注、句法分析等步骤，以便将古彝文转换为计算机可以理解的形式。建立词嵌入模型：将古彝文中的每个字或词映射为一个高维向量表示，可以使用预训练的词嵌入模型（如Word2Vec、GloVe等）或自定义的古彝文词嵌入模型。构建编码器-解码器模型：使用Transformer作为编码器-解码器模型的基础架构。编码器将输入的古彝文序列转换为高维特征表示，解码器根据编码器的输出和目标序列生成对应的输出序列。自注意力机制：在编码器和解码器的每个层中，使用自注意力机制来捕捉输入序列中不同位置之间的依赖关系。自注意力机制能够计算输入序列中不同位置的相关性，并根据相关性对特征进行加权。上下文编码：利用自注意力机制，在编码器中对输入序列中的每个字或词进行上下文编码。通过对输入序列中的每个位置进行自注意力计算，可以得到每个位置的上下文信息。解码过程：在解码器中，根据编码器的输出和目标序列，使用自注意力机制生成对应的输出序列。解码器通过不断预测下一个字或词来生成输出序列，直到遇到终止符号或达到最大长度。语义理解结果：根据解码器生成的输出序列，可以得到对古彝文的语义理解结果。这些结果可以包括句子的情感、主题、语义角色等。</p><p></p><p>注意力机制能够帮助模型在语义理解任务中更好地捕捉输入序列中的重要信息，从而提高古彝文的语义理解能力。通过对输入序列中不同位置的相关性进行建模，注意力机制使模型能够更好地关注句子中的关键部分，从而更准确地理解古彝文的语义。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/3d/3dc656b8ba9e876dd18db809032e12ac.png\" /></p><p></p><p>目前针对古彜文虽然能够识别出相关基础编码，但对应的释义需要根据上下文重新解读，在古彝文识别项目中，合合信息就借助了注意力机制（Transformer）完成语义理解。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/86/862354fdc1178ee1c432f2f051d42ccd.png\" /></p><p></p><h1>三、古彝文识别的意义</h1><p></p><p>在2021年、2022年的世界人工智能大会上，合合信息展现了智能文字识别技术在甲骨文、西周钟鼎文（金文）中的应用，这些研究成果为古彝文的识别提供了良好的基础。甲骨文和古彝文同源于骨刻文，这种文字最早出现在骨头上，随后发展为甲骨文、金文、小篆、隶书、楷书等不同的书写形式。这些文字之间存在许多相通之处，使得文字识别技术在不同阶段得以延续和发展。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/7e/7e9183b617a96a7c6d5052ff67d9b105.png\" /></p><p></p><p>通过与上海大学联合开启的“贵州古彝文图像识别及数字化校对项目”，合合信息将智能文字识别技术应用于古彝文的保护和传承中。这个校企合作项目的成功开展，为合合信息在小语种保护和古文化传承方面提供了重要的支持。通过智能文字识别技术的应用，古彝文的数字化处理变得更加高效和准确，使得更多人能够了解和认识古彝文这一珍贵的文化遗产。</p><p></p><p>随着人们对小语种和古文化的保护意识不断提高，合合信息将继续加强智能文字识别技术的研究和应用，为保护和传承这些珍贵文化遗产做出更大的贡献。</p>",
    "publish_time": "2023-09-28 09:14:46",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "ChatGPT 再迎重大升级！终于“联网”，不再局限于旧数据，新功能即将对所有人开放",
    "url": "https://www.infoq.cn/article/LWyly6ZX8NrO37FQu22Y",
    "summary": "<p>当地时间周三（9月27日），OpenAI在X（前身为推特）上宣布，其聊天机器人产品ChatGPT可以通过微软的必应搜索引擎进行网络搜索，将不再局限于2021年9月之前的数据。</p><p>&nbsp;</p><p>OpenAI称：“现在ChatGPT Plus和Enterprise（企业版） 用户可以使用浏览功能，将很快扩展到所有用户。要启用，请在GPT-4下的选择器中选择‘使用必应浏览’（ Browse with Bing）。”</p><p>需要说明的是，OpenAI早些时候测试了相关功能，允许Plus用户通过必应搜索访问最新信息，但后来因担心用户绕过付费墙，禁用了这项功能。</p><p></p><p>值得一提的是，OpenAI本周早些时候还宣布了另一项重大更新，将使ChatGPT可以通过图片和语音命令交互。</p><p></p><h2>ChatGPT再迎重大升级：“能看、能听，也能说”</h2><p></p><p>&nbsp;</p><p>本周一，OpenAI宣布对ChatGPT进行重大更新，使其GPT-3.5和GPT-4两大AI模型能够分析图像内容，并在文本对话中据此做出反应。OpenAI方面表示，ChatGPT移动版应用还将引入语音合成选项，在与现有语音识别功能配合使用时，能够与AI助手进行全口语对话。</p><p>&nbsp;</p><p>OpenAI也强调，语音合成功能目前仅适用于iOS和Android平台，而图像识别则将登陆Web版和移动版应用。</p><p>&nbsp;</p><p>OpenAI解释称，ChatGPT中的全新图像识别功能允许用户基于GPT-3.5或GPT-4模型，根据上传的一张或多张图像开展对话。该公司在其宣传博文中宣称，这项功能能够对接各类日常应用，例如为冰箱和食品储藏室拍摄照片以确定晚餐吃点什么，还有排除烧烤炉出故障的原因。该公司还提到，用户可以使用设备的触控屏圈出自己希望ChatGPT重点关注的部分。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/d3/d3ecbe3dd514cb5fac3cf128f52ebbf1.png\" /></p><p></p><p><img src=\"https://static001.geekbang.org/infoq/9d/9ded80c7d4ae015cccf9d974c0d2883e.png\" /></p><p></p><p><img src=\"https://static001.geekbang.org/infoq/51/515adb30560e8a8c090846a0c0b5fd18.png\" /></p><p></p><p>&nbsp;OpenAI宣传视频中的画面，ChatGPT在分析用户照片以帮助其调整自行车座高。</p><p>&nbsp;</p><p>在官方网站上，OpenAI发布了一段宣传视频（<a href=\"https://openai.com/blog/chatgpt-can-now-see-hear-and-speak\">https://openai.com/blog/chatgpt-can-now-see-hear-and-speak</a>\"），展示了与ChatGPT的交流过程。其中用户询问要如何升高自己的自行车座垫，并上传了车辆、说明手册以及工具箱的照片。ChatGPT迅速做出反应，并为用户提供了完成调整过程的说明。我们还没有亲自测试过此功能，因此不太清楚实际效果是否真有这么惊艳。</p><p>&nbsp;</p><p>那这一切到底是怎么实现的？OpenAI尚未发布GPT-4或其多模态版本GPT-4V的底层运行细节。但根据其他厂商（包括OpenAI合作伙伴微软）的已知AI研究，多模态AI模型往往能够将文本和图像转化为共享编码空间，借此通过同一套神经网络处理多种类型的数据。OpenAI可以使用CLIP来弥合视觉与文本数据间的差异，从而在同一潜在空间（一种表达数据关系的向量化网络）上实现图像和文本表示对齐。正是这项技术，让ChatGPT具备了跨文本和图像进行上下文推理的能力——当然，这一切都只是外界的推测。</p><p>&nbsp;</p><p>与此同时，报道还指出ChatGPT的全新语音合成功能允许用户与其进行直接对话，而且此功能由OpenAI的“新文本转语音模型”驱动。尽管文本转语音技术已经相当成熟，但该公司表示在此功能推出之后，用户可以在应用端的设置中选择语音对话，之后从五种不同的合成语音中做出选择，具体包括“Juniper”、“Sky”、“Cove”、“Ember”和“Breeze”几个选项。OpenAI称这些声音均是与专业配音演员合作开发而来。</p><p>&nbsp;</p><p>OpenAI的Whisper是一套开源语音识别系统，此次也由它继续负责对用户语音输入的转录。Whisper于今年5月正式与ChatGPT iOS版应用集成，随后在7月登陆ChatGPT的Android版应用。</p><p></p><h2>“请注意，ChatGPT给出的结果不一定准确”</h2><p></p><p>OpenAI于今年3月公布GPT-4时，就曾经展示过该模型的“多模态”功能，据称可以处理文本和图像输入。但在随后的测试阶段，公众一直无缘真正体验其图像功能。期间OpenAI与Be My Eyes合作开发了一款可以为盲人描述场景照片的应用。今年7月，有报道称OpenAI的多模态功能之所以迟迟未能发布，主要是受到隐私问题的影响。与此同时，微软则于7月匆忙在基于GPT-4的AI助手Bing Chat中启用了图像识别功能。</p><p>&nbsp;</p><p>在最近的ChatGPT更新公告中，OpenAI称其扩展功能仍有一些限制，并承认该模型仍可能出现潜在的视觉混淆（即对某些内容的错误识别）、对非英语语种无法完美识别等问题。该公司表示，他们已经“在极端场景和纯科学验证角度”对新功能进行了风险评估，同时征求了alpha版本内测人员的意见，目前的观点仍然是建议谨慎使用，特别是在科学研究等高风险或专业性较强的背景之下。</p><p>&nbsp;</p><p>鉴于在开发Be My Eyes应用时遇到的隐私问题，OpenAI表示已经采取“技术措施来尽量限制ChatGPT对人类对象做分析和直接描述的能力。因为ChatGPT给出的结果不一定准确，AI系统应当尊重个人隐私。”</p><p>&nbsp;</p><p>尽管仍有种种缺陷，但OpenAI在营销材料中还是强调ChatGPT如今已经“能看、能听，也能说”。当然，并不是每个人都能认同这种充满拟人倾向的炒作宣传。Hugging Face公司AI研究员Sasha Luccioni博士就在X上发推称，“别再像看待人类那样看待AI模型了。ChatGPT根本就没法看、没法听，也没法说。它只能跟各种传感器相集成，以不同于人类的方式接收和发出信息。”</p><p>&nbsp;</p><p>虽然ChatGPT及其底层AI模型还远远算不上“人”，但如果本次公布的结果不假，那也至少代表着OpenAI的这款虚拟助手实现了巨大的功能增强。</p><p>&nbsp;</p><p>此外，OpenAI也强调了推迟开放有其充分理由：“我们认为应该逐步推出自己的工具，这样我们才能随时间推移不断改进并完善风险缓解措施，同时也让大家能为未来更强大的AI系统做好准备。”</p><p>&nbsp;</p><p>参考链接：</p><p><a href=\"https://twitter.com/OpenAI\">https://twitter.com/OpenAI</a>\"</p><p><a href=\"https://arstechnica.com/information-technology/2023/09/chatgpt-goes-multimodal-with-image-recognition-and-speech-synthesis/\">https://arstechnica.com/information-technology/2023/09/chatgpt-goes-multimodal-with-image-recognition-and-speech-synthesis/</a>\"</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "publish_time": "2023-09-28 14:00:23",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "腾讯云数据库凭借这项创新再获顶会认可，论文入选VLDB2023",
    "url": "https://www.infoq.cn/article/xC4osqfB6XVbkybGJ1Kf",
    "summary": "<p>近日，InfoQ获悉，在第49届数据库国际顶会VLDB大会上，来自腾讯云TDSQL的2篇论文成功被VLDB 2023收录，创新技术再次被国际顶级会议VLDB认可。</p><p>&nbsp;</p><p>作为数据库领域的三大顶级会议之一，VLDB每届会议都集中展示了当前数据库研究的最前沿方向以及工业界的最新应用，吸引了众多全球顶级科技公司和研究机构的参与。因会议对系统创新性、完整性、实验设计等方面都要求极高，VLDB会议的论文接受率总体较低（约 18%）。</p><p>&nbsp;</p><p>入选论文中，腾讯云与南京大学、苏黎世联邦理工学院(ETH)&nbsp;合作研发的《Efficient Black-box Checking of Snapshot Isolation in Databases》解决方案，提出了一种新颖的黑盒检查器——PolySI，它能高效地检查快照隔离（Snapshot isolation，SI），并在检测到违规时提供可理解的反例。</p><p>&nbsp;</p><p>快照隔离是一种常见的弱隔离级别，它避免了串行化所带来的性能损失，同时可以防止很多常见的数据异常。然而，某些声称提供快照隔离保证的生产云数据库仍会产生SI数据异常，尤其在金融领域，会造成巨大影响。业界现有同类工具要么不支持快照隔离级别的测试，要么效率较低。鉴于数据库系统的复杂性，以及通常无法获取数据库内部信息的现状，业内亟需一种黑盒快照隔离检查器。</p><p>&nbsp;</p><p>为了解决该问题，我们提出并设计了“PolySI”算法与工具。PolySI的理论基础是基于广义多图（Generalized Polygraphs，GPs）的SI刻画定理，该定理保证了PolySI的正确性与完备性。PolySI采用SMT求解器（MonoSAT），并利用GPs的紧凑约束编码方案以及领域特定优化加速SMT求解。</p><p>&nbsp;</p><p>目前，通过广泛的评估，PolySI成功地重现了已知的SI异常，并在三个生产云数据库中检测到了新的SI异常、提供了可理解的反例。PolySI在多类工作负载下均优于目前最先进的SI黑盒检查器，并能够扩展到大规模工作负载。</p><p>&nbsp;</p><p>据了解，腾讯云与西蒙菲莎大学(Simon Fraser University)联合完成的《Online Schema Evolution is (Almost) Free for Snapshot Databases》论文，则介绍了“Tesseract”，一种新的在线和事务性模式演化方法，主要用于解决数据库在线修改schema过程中存在的挑战。</p><p>&nbsp;</p><p>当前，现代数据库应用经常根据不断变化的需求进行模式更改，数据库在线修改schema的主要优势在于，无需停止数据库服务或中断正在进行的事务，即可进行结构修改，这使得数据库能够在满足动态变化需求的同时，无需停机维护或重新启动数据库。</p><p>&nbsp;</p><p>但诸多问题也随之而来，在现有数据库系统中，支持在线和事务性模式（schema）演化仍然具有挑战性，如数据一致性，在进行结构修改时，为确保数据的一致性，需要使用事务或其他机制来保证数据的完整性和正确性；其次是长时间运行，某些结构修改预计需要较长的时间来完成，特别是对大型数据库或复杂结构的修改，导致对数据库性能产生一定的影响，因此需要在合适的时间窗口进行修改，以最小化对业务的影响。</p><p>&nbsp;</p><p>在以往的解决方案中，通常采用临时方法对模式演化进行“补丁”应用于现有系统，导致许多边缘情况和功能不完整。因此，应用程序通常不得不仔细安排停机时间进行模式更改，从而牺牲可用性。</p><p>&nbsp;</p><p>“Tesseract”的出现则有效避免了上述缺点。在广泛使用的多版本数据库系统中，模式演化可以被建模为改变整个表的数据修改操作，即数据定义即修改（DDaM）。这使得Tesseract可以通过利用并发控制协议几乎“免费”地支持模式。</p><p>&nbsp;</p><p>在Tesseract应用测试中，通过对现有快照隔离协议进行简单调整，在40核服务器上的工作负载下，Tesseract能够提供在线、事务性的模式演化，而无需服务停机，并在模式演化进行时保持高应用性能。</p><p></p><p>&nbsp;</p>",
    "publish_time": "2023-09-28 14:06:50",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "第四范式成功登陆港股，开盘涨13.49%",
    "url": "https://www.infoq.cn/article/di421fc7YtuJhSvQ5vjV",
    "summary": "<p>2023年9月28日，中国最大的以平台为中心的决策类人工智能公司第四范式，正式于香港联合交易所主板挂牌上市，股份代号为6682.HK。</p><p>&nbsp;</p><p>首日第四范式开盘涨13.49%，报于每股63.1港元，对应总市值达293亿港元。这一市值也使得第四范式成为今年迄今为止港股市值最大的TMT项目，同时也是近两年来第一家登陆港交所的AI独角兽。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/9b/9b052bac181aaf3f10d6ecbeedc26e1e.png\" /></p><p></p><p>据悉，第四范式在本次IPO中总计发售18,396,000股股份。其中，香港公开发售部分获约11.4倍超额认购；国际发售部分获约1.57倍超额认购。新华资本管理有限公司、中关村科学城公司以及澜起科技作为基石投资者参与本次发行，累计认购近亿美元，以示对第四范式长期价值的看好。</p><p></p><p>第四范式本次募集资金净额约为8.36亿港元。募集资金净额将用于：(1) 在未来三年分配至加强公司的基础研究、技术能力和解决方案开发。(2) 在未来三年分配至扩展公司的产品、建立公司的品牌及进入新的行业领域。(3) 在未来三年分配至寻求战略投资和收购机会，从而实施公司的长期增长战略，以开发公司的解决方案并扩展及渗透公司所覆盖的垂直行业。(4) 用作一般企业用途。</p><p></p><p>第四范式成立于2014年，专注于提供以平台为中心的人工智能解决方案，并已在金融、零售、制造、能源与电力、电信、运输、科技、教育、媒体、医疗保健等场景中落地。</p><p>&nbsp;</p><p>2023年3月，第四范式推出了专为企业业务场景设计的生成式人工智能产品“式说”（SageGPT），“式说”具有多模态大模型互动能力及企业级人工智能工具特性。 </p><p>&nbsp;</p><p>第四范式董事会主席兼CEO戴文渊表示：“第四范式长期致力于助力企业智能化转型和推进人工智能发展，成长为决策类AI平台领先企业。今天在港交所成功挂牌上市，对第四范式而言是一个重要的里程碑。未来，我们将继续巩固自身技术壁垒，不断提升商业化能力，持续助力客户业务成功。”</p>",
    "publish_time": "2023-09-28 14:18:26",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "埃森哲使用 Amazon CodeWhisperer 助力开发人员提高工作效率",
    "url": "https://www.infoq.cn/article/DbfXLTXZ4WkiaGscCHWI",
    "summary": "<p><a href=\"https://www.infoq.cn/article/JcIQOLpgqVK3AAgQxNQt\">Amazon CodeWhisperer</a>\" 是一款 AI 编程助手，可根据开发人员使用自然语言编写的注释和 IDE（集成开发环境）中的代码生成建议，帮助开发人员提高工作效率。借助 CodeWhisperer，开发人员无需在 IDE 与文档或开发者论坛之间切换，加快编码过程。通过 CodeWhisperer 的实时代码建议，开发人员可以在IDE中专注地工作，更快地完成编码任务。</p><p></p><p>CodeWhisperer 由基于数十亿行代码训练的<a href=\"https://www.infoq.cn/article/h5zqC9Cq8UK4iOKrwPc7\">大语言模型（LLM）</a>\"赋能，已经学会使用15种编程语言编写代码。开发人员仅需编写注释，用简明的英语概述一个特定任务即可，例如“uploada file to Amazon S3”（上传文件到 Amazon S3）。在此基础上，CodeWhisperer 可自动确定适合于该指定任务的云服务和公共库，即时构建特定代码，并直接在IDE中提供一段代码建议。此外，CodeWhisperer 能够与 Visual Studio Code和JetBrains 等 IDE 无缝集成，使开发人员可以专注于开发，且无需离开 IDE。截至目前，CodeWhisperer支持的开发语言包括 Java、Python、JavaScript、TypeScript、C#、Go、Ruby、Rust、Scala、Kotlin、PHP、C、C++、Shell 和 SQL。</p><p></p><h3>埃森哲使用 CodeWhisperer 助力开发人员提高工作效率</h3><p></p><p></p><p>“埃森哲正在使用 Amazon CodeWhisperer 加快编码任务，这是我们 Velocity 平台软件工程最佳实践计划的一部分。”埃森哲技术架构高级经理 Balakrishnan Viswanathan 表示，“Velocity 团队在想方设法提高开发人员的工作效率，搜寻过多种工具后，发现 Amazon CodeWhisperer 可以帮助减少30%的开发工作量。因此，我们可以更专注于安全、质量和性能的提升。”</p><p></p><h3>CodeWhisperer的优势</h3><p></p><p></p><p>埃森哲Velocity团队一直在使用 CodeWhisperer 来加速其人工智能（AI）和机器学习（ML）项目。使用 CodeWhisperer 带来了如下优势：</p><p></p><p>团队减少创建样板代码和重复代码模式的时间，从而将更多时间用于提升软件质量等重要的工作上CodeWhisperer 助力开发人员负责任地使用 AI，创建语法正确且安全可靠的应用程序团队可以生成完整的函数和符合逻辑的代码段落，无需在网上搜索或定制代码可以帮助新手开发人员或使用不熟悉代码库的开发人员快速上手工作通过将安全扫描前置到开发人员的 IDE 中，让团队可以在开发过程的早期阶段就检测安全威胁</p><p></p><h3>帮助开发人员尽快熟悉新项目</h3><p></p><p></p><p>CodeWhisperer可以帮助不了解亚马逊云科技的开发人员更快地熟悉使用亚马逊云科技服务开发的项目。例如，借助 CodeWhisperer，埃森哲新的开发人员就能够为 Amazon Simple Storage Service（Amazon S3）和 Amazon DynamoDB 等亚马逊云科技服务编码。在短时间内，他们就能够高效工作并为项目做出贡献。CodeWhisperer 通过提供代码段落或逐行建议来辅助开发人员完成工作。此外，CodeWhisperer 还能理解上下文。指令（注释）越具体，CodeWhisperer 生成的代码越相关。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/c8/c8ebf09fb162a7c70ada7af68353bdd3.png\" /></p><p></p><p></p><h3>编写样板代码</h3><p></p><p></p><p>开发人员可以使用 CodeWhisperer 补全先决条件。他们只需输入“为机器学习数据创建预处理脚本的类”，就能够创建预处理数据类。开发人员只需几分钟编写预处理脚本，然后 CodeWhisperer 就能够生成整个代码段落。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/5d/5d689fe99bb8981fba9af145eba88728.png\" /></p><p></p><h3>帮助开发人员使用不熟悉的语言编写代码</h3><p></p><p></p><p>一个新加入团队的 Java 开发人员可以借助 CodeWhisperer 轻松编写 Python 代码，而不必担心语法问题。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/28/28450a1729c977ec681599213f92d95e.png\" /></p><p></p><h3>检测代码的安全漏洞</h3><p></p><p></p><p>开发人员可以在 IDE 中选择“运行安全扫描”来检测安全问题。发现的安全问题的详细信息会直接显示在 IDE 中。这可以帮助开发人员及早检测和修复问题。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/d1/d169fabf86d6fb122ec4f3d92d8c675b.png\" /></p><p></p><p>“作为一名开发人员，CodeWhisperer 能够让您更加快速地编写代码”埃森哲人工智能工程顾问 Nino Leenus 表示，“此外，CodeWhisperer 借助人工智能可帮助消除拼写错误及其他典型错误，让编码更准确。对于开发人员来说，多次编写同样的代码乏味而枯燥。通过建议后续可能需要的代码片段，<a href=\"https://www.infoq.cn/article/C6ZjsPGuFWk6LBP7i48E\">AI 代码补全技术</a>\"可以减少这类重复性工作。”</p><p></p><p>现在，用户可以在喜欢的 IDE 中激活 CodeWhisperer。CodeWhisperer 可根据现有的代码和注释自动生成代码片段建议。</p>",
    "publish_time": "2023-09-28 15:24:33",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "AIGC开辟云原生全新应用方向，一文带你盘点中国云原生 20+ 细分领域技术成熟度",
    "url": "https://www.infoq.cn/article/gjUd2KkFsrDwsSVIojhB",
    "summary": "<p>今年年初，InfoQ&nbsp;研究中心发布了<a href=\"https://www.infoq.cn/minibook/UGhD7MTY5Z43JG5YmWP3\">《中国软件技术发展洞察和趋势预测报告&nbsp;2023》</a>\"，在报告中将各个领域的关键技术按照不同成熟度阶段进行了划分，总结并生成了中国技术成熟度评估曲线。</p><p>在年度报告的研究和撰写过程中，InfoQ&nbsp;研究中心观察到，云原生是2022年的年度技术热词之一，同时也是很多企业数字化转型的技术支撑。作为年度趋势报告的延续，InfoQ&nbsp;研究中心希望更细致地梳理云原生领域技术的发展情况，并基于&nbsp;2023&nbsp;年云原生领域的种种变化与发展，更新<a href=\"https://www.infoq.cn/minibook/q2Rhj103VtuMcdPlFGGS\">《2023&nbsp;中国云原生领域技术成熟度模型报告》</a>\"。</p><p>同样，中国云原生技术成熟度模型也建立在三大核心指标（技术专利数量、技术发展时间、技术舆论指数）的基础上。同时InfoQ研究中心还参考了市场规模、融资事件等公开资料，结合了云原生领域内各位专家的观点，最终选择了20+关键技术点，并形成了相应的成熟度曲线。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/c7/c7366149b08050ba542b7e84e8efde19.webp\" /></p><p></p><p>备注：</p><p>1、技术专利相关数据来自国家知识产权局旗下专利检索及分析系统，检索时间为&nbsp;2023&nbsp;年&nbsp;9&nbsp;月&nbsp;10&nbsp;日。</p><p>2、技术发展时间使用知网论文库等学术平台进行相关技术领域论文最早收录年份统计计算。</p><p>3、技术舆论指数数据来源为各家技术媒体和开发者社区，包括&nbsp;InfoQ&nbsp;中文站和&nbsp;CSDN&nbsp;社区。</p><p></p><p>有关各发展阶段的具体特征，欢迎大家点击<a href=\"https://www.infoq.cn/minibook/q2Rhj103VtuMcdPlFGGS\">《2023 中国云原生成熟度模型报告》</a>\"下载完整报告。</p><p></p><p>中国云原生技术成熟度三大核心指标气泡图</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/eb/ebc3f4247c38edddfbd625126d37fd61.webp\" /></p><p></p><p>此外，在模型生成的过程中，我们注意到云原生技术正聚焦于具体业务场景落地，并希望与各位读者分享我们的观点。</p><p></p><p>技术生态、行业环境、宏观环境共同推动云原生技术聚焦业务场景落地</p><p>一方面是技术生态的高丰富度为云原生落地具体场景的能力提供了有效的支撑。云原生技术脱胎于云计算，而云计算经过长时间的技术发展与积累，底层技术（如，容器技术、容器编排等）已经发展较为成熟。同时，云算力的大规模提升、云弹性的不断升级与云开发门槛的不断降低也为云原生技术的发展与推广奠定了基础（<a href=\"https://www.infoq.cn/minibook/UGhD7MTY5Z43JG5YmWP3\">《中国软件技术发展洞察和趋势预测报告2023》</a>\"）。这使得云原生可以迅速地形成完善的技术生态。相对应地，从单一技术点扩展到提供完整的解决方案，云厂商也已经尽可能全面地扩充产品矩阵并覆盖各个细分领域。</p><p></p><p>从行业环境来看，企业服务、新技术环境与多行业场景的发展特点都向云原生技术提出更多发展要求。云原生诞生于企业也服务于企业，并且发展主要由企业主导。从开源的角度来看，云原生开源的项目几乎全部由公司发起并开源，极少有个人开发者主导进行的项目。从专利来源也可以看出，云原生领域从前沿技术到成熟技术均是由企业占据绝对的主导地位。并且，云原生领域的专利数量分布并不像人工智能领域具有从高校和研发机构向企业的转移过程（<a href=\"https://www.infoq.cn/minibook/IV4VhedKw1E1tY8Hleje\">《2023 中国人工智能成熟度模型报告》</a>\"）。讨论度极其火爆的人工智能技术赋予了云原生更多的应用场景，例如使用云原生技术搭建AI开发平台等。此外，金融、制造、零售等行业的进一步精益化生产的需求也在为云原生提供更多落地场景。</p><p></p><p>最后，在宏观层面，VUCA时代的大背景下，企业加倍地希望借助科技力量去全方位赋能业务（<a href=\"https://www.infoq.cn/minibook/oDh5G4Rcsc1gW1O1Tou8\">《中国科技领导者画像研究报告 2023》</a>\"）。在这种背景下，云原生与业务结合的速度与深度得到了企业的进一步推动。</p><p>注：VUCA分别代表，Volatile易变不稳定、Uncertain不确定、Complex复杂、Ambiguous模糊。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/1b/1bd35d6a7a28031beb4d1c7c15022031.webp\" /></p><p></p><p>InfoQ&nbsp;研究中心也期待未来中国云原生技术领域能够实现更好地发展，并在更多行业拥有更广泛的应用。InfoQ研究中心也将持续关注中国云原生领域的各项最新动态，也欢迎各位读者与云原生开发者一起加入探讨。</p><p>此外，在报告中我们还对&nbsp;20+&nbsp;云原生及其细分技术领域绘制了企业图谱和名录，欢迎大家点击阅读原文，下载完整报告。</p><p></p><p>中国云原生技术企业生态图谱</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/04/04fda557a6ea3e8aa8e3938c61095a6a.webp\" /></p><p></p>",
    "publish_time": "2023-09-28 00:16:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]