[
  {
    "title": "1月9日举办2023 ICT深度观察政企数字化转型分论坛",
    "url": "https://www.infoq.cn/article/6d18bb25abba45707c1fd5724",
    "summary": "<p></p><blockquote>ICT深度观察报告会是中国信通院每年举办的成果汇报会，自2009第一次举办到2023年已举办了13届，本次为第14届。“政企数字化转型分论坛”作为平行论坛之一，将于1月9日上午9:00在线上举办。</blockquote><p></p><p></p><p>自2020年9月开始，中国信息通信研究院（以下简称“中国信通院”），云计算与大数据研究所就在积极探索以标准的形式来指导和引领政企数字化转型，彼时发布了作为整体数字化转型方法论的《企业数字化成熟度模型IOMM标准》。经过2年发展，当下数字经济与实体经济正在加速融合，新技术与新挑战不断涌现，数字化转型也逐渐进入深水区，需要更深入、更全面、更精细的方向指引。</p><p>&nbsp;</p><p>基于此背景，本次“政企数字化转型分论坛”将以体系化的形式，发布并解读多项企业数字化成熟度模型IOMM标准最新内容，同时邀请多位行业深度参与者对当下数字化转型的热议领域展开讨论，3大亮点集中呈现：</p><p></p><p>亮点1：多项数字化转型成果重磅发布</p><p>数字化转型经过多年发展，已踏入深水区，企业需要更全面、更体系化的方法论来规划和引导数字化转型发展，不同规模的企业对于数字化转型的需求也大为不同，大企业更加关心顶层设计与全局落地方案，而中小企业则更多关注落地抓手，如很多中小企业以数字化营销作为转型切入点；同时在转型过程中越来越多的企业希望与标杆企业对标。为此在本论坛中将重磅发布如下成果：</p><p><img src=\"https://static001.geekbang.org/infoq/c2/c24831c654c6ebdc211caf189bde7c06.png\" /></p><p>发布企业整体视角的《企业数字化成熟度模型IOMM标准》来提供更加全面的方法指引；针对中小企业转型的特色和痛点，发布中小企业版《企业数字化成熟度模型IOMM标准》；发布《“鼎新杯”数字化转型应用案例汇编》为企业数字化转型提供更多对标参考案例。</p><p></p><p>亮点2：多项数字化标准权威解读及实践分享</p><p>在本论坛中，不仅仅发布转型成果，还将对以上发布的成果进行权威细致的解读，包括在企业整体视角层面以及中小企业层面的数字化转型6大能力建设，6大价值评估体系及5级成熟度模型，以便不同规模企业对转型方法论核心要义进行整体把握。同时，针对政企数字化转型密切相关的各领域，如业务数字化转型，数字化平台建设，云边端一体化标准以及数字政府等领域分享最新趋势及相关实践。</p><p><img src=\"https://static001.geekbang.org/infoq/63/631f2322c8e3ebb4200e64e08bed88aa.png\" /></p><p></p><p>亮点3：多轮圆桌对话探讨时下转型热点方向</p><p>在本次论坛中，不单以标准视角阐述数字化转型的方法论和实践，同时也邀请了行业中极具代表性的企业从产业视角对政企数字化转型涉及的相关热点领域展开深入探讨，讨论的议题包括《数字时代下的流程变革创新》、《数字化平台，数字化赋能》以及《云数共生，助力数字政府创新发展》等，参与讨论的企业代表既有来自联通、移动、电信等的运营商企业，也有来自阿里云、金蝶、浪潮云、中国电子云、神州泰岳等技术平台型企业，同时也有来自德勤、IBM等外资企业，期待能为大家带来精彩的观点碰撞。</p><p><img src=\"https://static001.geekbang.org/infoq/6d/6d6c27167ac973ca9d6d79e403344496.jpeg\" /></p><p></p><p><img src=\"https://static001.geekbang.org/infoq/8c/8c817d3d641b3fa6902a995faab85ba1.jpeg\" /></p><p></p><p><img src=\"https://static001.geekbang.org/infoq/3a/3ac44ebd5825c0a6aa3f2adccc520bd5.jpeg\" /></p><p></p><p>数启新征程，转型更当时，让我们共同期待1月9日上午9:00“政企数字化转型分论坛”的精彩内容。</p><p>&nbsp;</p><p>会议议程如下，期待您的参与！</p><p><img src=\"https://static001.geekbang.org/infoq/5e/5ebb64fbf62c6f7ac4d4415fd768e546.jpeg\" /></p><p></p><p><img src=\"https://static001.geekbang.org/infoq/5f/5f8503c3b1f32f2c02a0e8fe1b372df5.jpeg\" /></p><p></p><p></p>",
    "publish_time": "2023-01-06 06:41:44",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "1月11日举办数字化业务安全生产沙龙第2期",
    "url": "https://www.infoq.cn/article/add2bcea669d98025d85830d2",
    "summary": "<p>并不乐观的数字化业务安全生产现状</p><p>数字化时代，信息系统正在逐渐成为企业乃至整个社会的基础设施，任何类型的设备宕机、系统瘫痪、网络故障等安全生产事件都有可能导致业务停摆，轻则影响业务使用和用户体验，重则给企业和用户带来巨大损失，甚至危及民生。</p><p>2021年6月，美国云计算公司Fastly出现长达1小时的服务故障，导致全球数千家政府、网站受到影响；2021年7月，国外多家银行、航空、政府、新闻机构的系统受DNS故障影响无法正常服务；2021年10月，Facebook发生全球性宕机，宕机时间超过6个小时，同周周五，再次出现约2个小时的宕机；2021年12月，西安健康码在全市全员核酸检测的需求下崩溃了，导致公众生活受到极大影响；2022年5月，某证据交易系统宕机，影响股民正常交易；2022年12月，某云服务商的服务中断事件，导致多个关键机构的网站、平台无法访问使用；</p><p></p><p>为此，企业及社会各方，在采用多种新型技术实现效率与效益提升的同时，如将业务部署在云上，引入大数据，人工智能等新兴技术；也要将如何保障数字化业务安全生产息息相关的连续性、安全性、稳定性等作为头等大事。而不断与行业交流并汲取行业最佳实践，是有效提升自身安全生产能力的重要途径。</p><p></p><p>群策群力，推进数字化业务安全生产</p><p>为进一步响应国家关于安全生产工作的号召，中国信息通信研究院（以下简称“中国信通院”）与合作伙伴达成共识，联合各方在企业数字化发展共建共享平台（EDCC）下成立“数字化业务安全生产推进中心”，旨在凝聚各方力量，整合优质资源，开展技术攻关，完善标准体系，提升企业数字化业务连续性，增强企业数字化安全生产能力。数字化业务安全生产推进中心自成立以来已聚集20家行业龙头企业和25名行业资深专家，围绕数字化业务安全生产输出多项标准，陆续发布《基于云计算的数字化业务通用安全工程要求》（行标报批）、《数字化业务应用运维平台》（团标已发布）等多项成果，同时支撑了工信部信管局联合中国信通院组织开展的“云服务稳定安全运行应急演练专项活动”。</p><p></p><p>第2期数字化业务安全生产沙龙聚焦“业务连续性”</p><p>1月11日14:00，将线上举办 “数字化业务安全生产，创新业务连续性管理”第2期主题沙龙并全程直播。本次沙龙将公布第三批数字化业务安全生产推进中心成员单位和技术专家、发布2022年度数字化业务安全生产推进中心突出贡献技术专家，并邀请业内权威专家分享数字化业务安全生产的最新实践经验，共同探寻保障数字化业务连续性的新路径，亮点如下：</p><p></p><p>亮点一：发布及解读数字化安全生产系列最新标准</p><p>2022年数字化业务安全生产推进中心对各行业企业数字化安全生产工作展开研究，深入调研企业数字化业务安全生产现状和短板，形成数字化安全生产治理相关最新标准，本次沙龙将进行发布并解读：</p><p>《可信数字化服务能力要求：数字化安全生产平台》《可信数字化服务能力要求：基于CMDB的数字化全链路端到端监控平台》《云服务稳定运行故障分类分级》《云服务稳定运行要求：应急响应规范》《云服务稳定运行要求：应急管理平台</p><p></p><p>亮点二：行业资深专家分享数字化业务安全生产最佳实践</p><p>本次沙龙邀请到来自浦发银行、中国联通软件研究院、中电信数智科技有限公司、广州嘉为科技有限公司、北京同创永益科技发展有限公司的资深专家，围绕“数字化业务安全生产，创新业务连续性管理”主题，带来数字化业务安全生产在各自领域内的最佳实践。</p><p></p><p>亮点三：公布第三批数字化安全生产推进中心成员单位及专家</p><p>“数字化业务安全生产推进中心”已汇聚了20家行业龙头企业和25名行业资深专家，并输出了多项数字化业务安全生产标准，为推动我国数字化业务安全健康发展做出了贡献。本次沙龙中，将公布新加入的6家成员单位和技术专家名单。</p><p></p><p>亮点四：公布2022年数字化业务安全生产推进中心突出贡献专家</p><p>“数字化业务安全生产推进中心”自成立以来，相关单位和专家围绕数字化业务安全生产在标准制定、评估测试、技术研究等方面输出宝贵经验与成果。为感谢专家在2022年度对数字化业务安全生产推进中心的突出贡献，本次沙龙中将公布2022年度数字业务安全生产推进中心突出贡献专家名单。</p><p></p><p>沙龙议程及直播链接如下，期待您的参与！</p><p><img src=\"https://static001.geekbang.org/infoq/fc/fc9a0526c986634245672e03886dde1f.jpeg\" /></p><p></p><p>活动联系人：吴佳琦 18352634685 wujiaqi@caict.ac.cn</p>",
    "publish_time": "2023-01-06 06:56:39",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "在DevOps引入产品思维：将想法转化为优质产品的手段",
    "url": "https://www.infoq.cn/article/2vry4XbtjT8MDFF4wzJ1",
    "summary": "<p>想要成功，组织需要有两样东西：客户认为有价值的产品和服务，以及提供这些产品和服务的能力……</p><p>&nbsp;</p><p>在这篇文章中，我将展示为什么必须像对待产品或服务一样设计、实现和操作我们的交付管道（将想法转化为用户手中的产品的手段）：通过引入“产品思维”。</p><p>&nbsp;</p><p>我将分三部分来阐述这个问题：一、“管道”（和DevOps）是指什么；二、为什么应该将管道视为一种产品；三、什么是产品思维，以及在实践中，产品管理可以提供怎样的帮助以及如何将其引入到DevOps中。</p><p>&nbsp;</p><p></p><h2>什么是（交付）“管道”？</h2><p></p><p></p><p>交付管道是一种工具、技术和实践，通过它，我们可以将想法转化为产品和服务，然后用户可以使用它，组织可以运营、支持和演进它。（就本文而言，DevOps是设计、构建和操作管道的准则）。</p><p>&nbsp;</p><p>我想从更广阔的视角来看待这个管道的端到端流程：从识别问题和机会、制定战略目标、定义流程，到解决方案设计、分析、实施和质量保证，再到合规、运营和客户支持，当然，还有产品使用，整个价值链。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/5b/5b81a336fa28aef27062bb7e4837fe3e.jpeg\" /></p><p></p><p>管道传统的“内”循环和覆盖整个价值链的更为全面的“外”循环。（图片来自<a href=\"https://www.flaticon.com/authors/elias-bikbulatov\">Flaticon: Elias Bikbulatov</a>\"）</p><p></p><h2>为什么管道很重要？</h2><p></p><p></p><p>我共事过的许多组织都认为，管道是“技术性的东西”，是那些汗流浃背的工程师在地下室的某个地方照管的东西，但非技术人员（当然不是管理人员）不用操心……</p><p>&nbsp;</p><p>事实远非如此，因为管道对于业务而言很重要，原因有三。</p><p>&nbsp;</p><p></p><h3>管道是驱动力</h3><p></p><p></p><p>最基本的，管道是将想法转化为用户手中的产品（并随后进行操作和管理）的驱动力。</p><p>&nbsp;</p><p>遗憾的是，许多组织的管道支离破碎（流程有断点，如阶段门或手动移交)、低效（手动测试、手动提供资源、有限的自助配置），或者满足了错误的要求（有些地方过度设计，有些不足却导致了其他方面的瓶颈，例如，认为难以配置的GUI工具比命令行更好用）。</p><p>&nbsp;</p><p>令人惊讶的是，人们经常认为“事情就是这样”，组织和团队基本上都接受了由此所导致的冗长而笨拙的流程，其结果就是：</p><p>用户可用的功能比较少质量比较低组织的学习速度比较慢并且总体上增加了交付和操作之苦（进而降低了团队的积极性）</p><p>&nbsp;</p><p>所以，如果仅仅是为了获得良好的流程、效率和效果，而不考虑其他方面的因素，那么你无疑需要一个灵活而流畅的管道。</p><p></p><h3>没有什么方法适用于所有情况</h3><p></p><p></p><p>我曾与早期初创公司合作，主要目标是快速进入市场，吸引用户并积累经验，使用Vercel或Heroku等轻量级工具将DevOps的成本和工作量降至最低，并能够每天多次直接部署到生产环境，通过LaunchDarkly等特性标记工具控制特性的可用性。</p><p>&nbsp;</p><p>我合作过的金融机构（也有许多其他机构）往往有一个多少有些零散的环境管道，包括开发、集成、UAT、过渡和生产，有时在本地，经常有非常正式的手工部署过程。最终，如何定义这些过程取决于每个组织的文化以及对风险和质量的态度。</p><p>&nbsp;</p><p>我还曾与一个大型政府部门合作，每天在多个环境中连续部署100多次，这些环境全部都是自动化的，并且最大可能地提供了自助服务能力，供工程师配置资源和运行测试。</p><p>&nbsp;</p><p>不久前，我的团队还曾与一家医疗服务公司合作。该公司曾为季度公开发布将代码和（手动创建的）发布说明刻录到DVD上，以满足监管要求。</p><p>&nbsp;</p><p>关键是：虽然存在管道的最佳实践模式和范例（如持续集成、高度自动化和通过自助服务赋能），但并不存在适用于所有组织的现成管道，也不存在随着时间推移不需要调整就适用于同一组织的管道；关于如何处理想法和需求，如何创建、部署和测试代码，如何保证质量，如何生成报告，如何运行、操作和审计，组织有着不同的需求和要求，他们的需求会随战略和环境（新的战略目标、新的客户期望、新的监管要求、新技术）而变化。</p><p>&nbsp;</p><p>所以，我们要根据当前的需求来调整、演进我们的管道，这样它们才能满足我们未来的需要。</p><p>&nbsp;</p><p></p><h3>管道是战略资产，可以带来竞争优势</h3><p></p><p></p><p>如果我们认为管道在组织中的内在角色是价值交付的“使能者”，并且它们的设计是环境相关的，那么我们不仅应该将其视为企业资产，而且还应该将其视为竞争优势的来源。</p><p>&nbsp;</p><p>三年来，我的团队帮助我上面提到的那家医疗服务公司简化了监管流程：允许合规部门针对史诗和故事提出风险，将它们与功能、代码库、测试用例和测试结果（在待办事项管理工具中）联系起来，并以可跟踪、可审计的方式自动生成涵盖所有这些方面并将它们联系起来的发布说明。这将每次发布的人天量由大约20天减少到几乎为零，并且提高了发布文档的质量。</p><p>&nbsp;</p><p>通过直接部署到生产环境，这家初创公司在一个竞争激烈、快速创新的领域中开展了业务，并依托更精简的机构（人员更少）和更快的上市速度（以更低的成本和更短的学习周期为客户提供更大的价值）获得了与其他公司竞争的优势。</p><p>&nbsp;</p><p>因此，如果我们把管道做好了，那么它就不仅仅是企业的又一个驱动力，而且还可以成为竞争优势的来源。</p><p>&nbsp;</p><p></p><h3>管道很重要，所以把它们当产品来对待</h3><p></p><p></p><p>如果管道很重要，那么我们不能拿一个现成的就用，我们需要仔细考虑慎重对待，知道现在和以后应该构建什么东西，并为我们的（DevOps）团队提供指导……所以换句话说，我们需要将它们视为产品，并引入产品思维。</p><p>&nbsp;</p><p>设想一下：我们不会只是要求工程团队为我们构建电子商务网站、支付门户或社交媒体应用。我们会确定目标、研究什么对用户有价值，并将其作为背景和指导信息，提供给我们的设计师和工程师……</p><p></p><h2>什么是产品思维？</h2><p></p><p></p><p>产品思维是指基于组织的战略和背景，为我们的用户提供有价值的产品，并做到可持续发展（即平衡现在和未来）。</p><p>&nbsp;</p><p>在这篇文章中，产品思维、产品意识和产品管理三个词可以互换。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/76/769d30d4d23ed4b6311e683a8cab0a0c.jpeg\" /></p><p></p><p>产品管理的工作就是通过平衡用户合意性、商业可行性和技术可能性来创造产品-市场契合点。</p><p>&nbsp;</p><p>在实践中，这意味着要通过平衡用户需要、想要并且发现有价值的东西（用户合意性）、我们作为一个组织需要实现（并且负担得起）的东西（商业可行性）和可能涉及的技术、文化、法律等（技术可行性），来实现产品与市场的匹配，与此同时，要谨防陷入过早优化或过早关闭选项的陷阱。</p><p>&nbsp;</p><p>举一个小而具体但很能说明问题的例子：对于那家医疗设备组织，我们选择将Bash作为脚本语言，因为DevOps主管对它很熟悉。最终，我们意识到，客户的工程师没有Bash经验，而作为.Net团队的成员，他们更熟悉Python。如果在早期阶段添加一个以用户为中心的方法（作为产品思维的一部分），就可以防止这种错误和由此导致的返工。</p><p></p><h2>如何对管道做“产品管理”？</h2><p></p><p></p><p>归根结底，你只是“添加产品”。这是一种比较随意的说法，意思是你所做的事情要与做任何其他产品或服务一样。</p><p>&nbsp;</p><p>在我共事过的一家初创公司中，这意味着首席工程师“要戴上产品的帽子”，从早期业务目标的视角来审视管道：在一个小而友好且高度可控的潜在客户群体中，使用MVP来衡量产品与市场的契合度。结果，他建议选择速度（如直接部署到生产环境）、管理特性可用性的特性标记、AWS Lambdas和AWS Cognito。然后，我们将监控业务发展，并在需要时扩展/构建更多的自定义功能（如身份认证）（而不是为可能永远不会到来的未来而构建）。</p><p>&nbsp;</p><p>我们在之前的例子中提到的保险公司曾要求我们帮助他们构建一个平台，用于支持100多个微服务，而且要云无关（以确保业务连续性）。由于这个环境很复杂，所以我们增加了一个专职的产品负责人来支持DevOps工程师团队。首先，她组织产品和工程团队召开了一系列研讨会，以了解他们目前的工作方式以及所做的工作。她很快就发现，组织错过了向客户承诺的里程碑，因为工程师无法高效地发布代码（原因是在环境之间迁移代码和配置资源是手动进行的，而且有资源限制）。她还发现，在接下来的12个月里，该组织将只有三个微服务，云无关只是一个长远的目标，并不是目前的必备要求。</p><p>&nbsp;</p><p>在深入了解了“价值”对于组织而言究竟意味着什么之后，所有人都一致认为，现在团队需要构建和发布高质量的功能，并达成向客户承诺的里程碑。因此，产品负责人与团队重新调整了优先级，制定了一个路线图，重点是消除只有两名工程师能够手动将代码部署到过渡环境和生产环境所导致的障碍，然后通过基本的自助服务（基于标准化模板自助配置新的微服务和其他资源）为工程师赋能。最初，他们会专注于一家云提供商，但也会考虑未来的云无关性。他们还指出，目前只有三个微服务，后续随着复杂性的增加，要解决构建微服务网格的问题……</p><p></p><h3>对管道做产品管理的工具</h3><p></p><p></p><p>一般来说，用于对管道做“产品管理”的工具和技术与“平常”用于产品管理的工具和技术一样。可以从下面这个“框架”入手：</p><p></p><h3>1. 确定环境</h3><p></p><p></p><p>从设定场景开始。理解管道的运行环境。定义并达成一致：</p><p>交付管道需要支持什么近期、中期和长期目标有什么重要的机会，有什么问题可以解决关键约束是什么，有什么可能性</p><p>&nbsp;</p><p>还记得医疗服务的例子吗？最初的任务概要是将现有的应用程序容器化，并迁移上云。虽然这样做是有必要的，但我们在分析过程中发现，单靠这一点并不能帮助组织实现预期的吞吐量提升，那只能通过简化监管审批流程来实现。</p><p>&nbsp;</p><p>在这个阶段，对现有任何流程建模都非常有用，特别是考虑到瓶颈和已错失的机会。</p><p>&nbsp;</p><p></p><h3>2. 识别潜在用户</h3><p></p><p></p><p>第二步，了解谁将使用管道，谁从管道受益，并受管道影响。这里要纵观全局。</p><p>&nbsp;</p><p>你会想到一些常见的岗位，如工程师、QA、DevOps工程师，但我建议你扩大受众范围，包括产品人员、销售和市场营销人员、专业涉众，如医疗软件示例中的合规和监管机构。涉众地图或涉众洋葱是我的首选模型，不过简单的列表也可以。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/93/9307967193c2ee78fc86ef3039155106.jpeg\" /></p><p></p><p>医疗服务组织的涉众洋葱图示例，重点关注法规遵从性涉众。</p><p></p><h3>3. 识别用户的工作、需求、收获和痛点</h3><p></p><p></p><p>在接下来的步骤中，你会希望了解这些用户需要完成什么工作、他们的基本需要、相关的收获和痛点、他们的期望和需求。价值主张画布或类似的模型，或用户角色，在这里很有效。在接下来的步骤中，我们可以使用这些工具开始为每个“需求”确定潜在的解决方案。</p><p>&nbsp;</p><p>注意，你可能不知道从哪里开始，但你也不想过度分析。这里，服务蓝图或体验地图可以派上用场了，我们可以利用它们将用户、需求和痛点联系起来，这样就可以确定哪些地方值得花费更多的精力分析。体验地图或服务蓝图也是很好的交流工具，我们甚至可以用它们来显示进展。</p><p>&nbsp;</p><p>回到医疗服务公司的例子，考虑一下合规经理：他们要考虑识别风险，他们的需求之一是证明可追溯性（解决方案：集成风险管理和待办事项跟踪），但是创建发布文档的过程很冗长且容易出错（解决方案：自动生成文档），并且他们希望可以将所有的文档都直接提交给监管人员（解决方案：集成）。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/7a/7ae519db955d414c9d4f35d09a4784cc.jpeg\" /></p><p></p><p>Futuris改版的构思画布（Ideation Canvas），用于识别用户期望和潜在解决方案（作为Strategzyer价值主张画布的替代方案）。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/cc/ccba186bb43b7b8e52307f2aa9da9808.jpeg\" /></p><p></p><p>说明过程和痛点的体验图。</p><p></p><h3>4. 定义优先级</h3><p></p><p></p><p>最后，你需要基于前面的所有工作确定优先级：首先做什么，下一步提供什么支持。在这方面，功能图是一个完美的工具。这里，最好的做法是将特性分组，放到实现组织和团队长期目标的不同版本中，然后回过头来与第一个活动中确定的目标建立联系，创建我们的产品路线图。</p><p>&nbsp;</p><p>对于医疗服务公司来说，这意味着：</p><p>实现一个基本的端到端流程，以便团队可以轻松地跨所有环境部署代码创建一个经过监管机构认证的实际运行环境实现合规文档自动化实现强大的自助服务功能</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/d1/d13b2c5651731484ffe31313469b6478.jpeg\" /></p><p></p><p>显示四个“版本”和功能优先级的功能地图示例，基于Jeff Patton首创的故事地图概念。</p><p></p><h3>自建还是购买？</h3><p></p><p></p><p>经常出现的一个问题是，在哪里投资和创新，在哪里构建，哪些方面要自有，哪些方面要外包、购买或租赁。</p><p>&nbsp;</p><p>我发现，在做这方面的决策时，沃德利（Wardley）地图是一个很好的工具，因为它根据整个价值链的相关内容和各种解决方案的行业成熟度来指导我们的战略方针，然后告知我们是“构建还是购买”，是实现商品化还是尽力防止商品化，以及如何促成或防止商品化。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/19/199783e4c2907bad53cedb9c6e1651b5.jpeg\" /></p><p></p><p>医疗器械公司的沃德利地图示例，说明了在创新法规遵从性流程方面具有的竞争优势。</p><p>&nbsp;</p><p>回到医疗服务公司，其交付管道的沃德利地图证实，有个好的集成服务器很重要，但也是商品化的，显然，我们应该选择一个最好的解决方案。更重要的是，它表明，合规过程的自动化是效率和竞争优势的来源，但没有现成的解决方案，这是一个我们应该进行创新的领域。沃德利地图随后提出的问题是，我们是应该对这一过程进行知识产权保护并保持其专有性，还是应该与竞争对手和监管机构合作创建一个行业标准，哪一种做法更有利。</p><p></p><h3>什么时候才算完成了呢？</h3><p></p><p></p><p>上述活动在管道工作的早期阶段特别有用，例如在启动阶段。这个<a href=\"https://www.beautifulabstraction.com/lean-inception-toolkit/\">启动工具包</a>\"为我们提供了用来制定计划的模式和模板。不过，就像开发任何产品一样，这个过程永远不会结束；产品管理是一个持续性的活动，而不是一次性的。</p><p>&nbsp;</p><p>组织的目标会变，用户的期望会变，有的技术会过时，也会有新的技术出现。因此，管道也得调整和演进。想想不断变化的合规环境，或者一个组织今天还在某个市场的某个行业中，明天所处的市场却已完全不同；此外，我们如何从本地托管迁移上云，再到无服务器，还有大数据和ML等新技术在基础设施方面提出了不同的要求。</p><p></p><h2>该怎么办？</h2><p></p><p></p><h3>引入产品思维是有好处的</h3><p></p><p></p><p>我从团队和客户那里得到的反馈，以及那些可度量的改进（吞吐量、周期时间、质量、价值交付），都清楚地表明，在DevOps中引入产品思维不是可有可无的，而是必须的。</p><p>&nbsp;</p><p>对于DevOps工程师来说，它使他们的生活更轻松，它使他们可以专注于正确的事情，它赋予他们能力：最基本的，它消除了噪音和担忧，使他们知道该做什么，使他们能够创建一个流畅的管道，让每个人都生活得更轻松；在最好的情况下，它使DevOps可以为组织创建战略资产。</p><p>&nbsp;</p><p>对组织来说，它可以保证价值交付，它使产品交付成为可能，并可以保证我们合理地使用资金，通过支持管道的创建，组织的所有部门都将朝着实现战略目标的方向努力，降低因为团队不确定应该做什么、不清楚应该听取谁的意见或不知道该专注于哪个解决方案而导致的风险和浪费。</p><p></p><h3>到底该怎么办？</h3><p></p><p></p><p>我们可以用一种非常轻量级的非正式方式“引入产品思维”：“只是在心里记着”。或者，我们可以用一种更正式的方式，增加一个专门的产品专家来支持DevOps工程师。也就是说，团队可以根据自己的喜好、文化和预算进行选择。</p><p>&nbsp;</p><p>当你觉得我建议的工具和实践适合自己，当你觉得这样会让自己很舒服，就没有理由不尽快采用它们。你甚至不需要做“每一件事”：我上面提到的任何一种技术，本身都可以带来增量价值。</p><p>&nbsp;</p><p>或许这一切对你来说都有点新鲜，不用担心，只要找一个产品的同事，让他们或多或少地参与下你的分析和决策过程……</p><p>&nbsp;</p><p>想要进一步了解这个主题或收听会议发言录音的话，请点击<a href=\"https://www.beautifulabstraction.com/productthinking-devops/\">这里</a>\"。</p><p></p><p>&nbsp;</p><p>原文链接：</p><p><a href=\"https://www.infoq.com/articles/product-mindset-devops/\">https://www.infoq.com/articles/product-mindset-devops/</a>\"</p><p></p><p>相关阅读：</p><p><a href=\"https://www.infoq.cn/article/kxOYolQQcddhKtCyim4E\">DevOps的未来是无代码</a>\"</p><p><a href=\"https://www.infoq.cn/article/DcIUD_gi17sQjvSt5XSS\">DevOps&nbsp;团队结构类型汇总：总有一款适合你</a>\"</p><p><a href=\"https://xie.infoq.cn/article/9503db5caf3d41db0abead30b\">什么是&nbsp;DevOps？看这一篇就够了！</a>\"</p><p><a href=\"https://www.infoq.cn/article/Zlsv8XVdRxjCQvVWjda2\">如何让&nbsp;DevOps&nbsp;发挥期望的效益</a>\"</p><p></p><p></p>",
    "publish_time": "2023-01-06 13:02:11",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "OpenAI计划以要约收购的形式出售股票，投资者质疑其盈利能力",
    "url": "https://www.infoq.cn/article/ZWixRo76hFsOw38tRHNF",
    "summary": "<p></p><h2>OpenAI被曝就收购要约展开谈判</h2><p></p><p>&nbsp;</p><p>当地时间1月5日，据《华尔街日报》报道，有知情人士透露，爆红的<a href=\"https://www.infoq.cn/article/AWWsrfb54zTvglZ0I5qS\">聊天机器人ChatGPT</a>\"背后的研究实验室OpenAI正在谈判以收购要约的形式出售现有股份，交易对该公司的估值达到290亿美元左右，使其在没有什么收入的情况下成为账面上最值钱的美国初创公司之一。</p><p>&nbsp;</p><p>这些知情人士说，风投公司Thrive Capital和Founders Fund正在商谈投资该笔交易，交易中出售的股票总额至少为3亿美元。这些知情人士说，这项交易将以要约收购的方式进行，投资者将从现有股东譬如员工的手中购买股份。</p><p>&nbsp;</p><p>这笔新的交易将使OpenAI的估值较2021年完成的要约收购增加大约一倍，《华尔街日报》当时报道，OpenAI在该笔交易中的估值约为140亿美元。OpenAI已经产生了数千万美元的收入，部分来自于向开发者出售其人工智能软件，但一些投资者对于该公司能否从这项技术中获得有意义的收入表示怀疑。</p><p>&nbsp;</p><p>这个可以通过文本和图像与用户交谈的聊天机器人迅速走红，并在五天内获得了超过100万的用户。一位知情人士透露称，有关 <a href=\"https://www.infoq.cn/article/Rsk9FJE3Nk4U1Yc3KhKO\">OpenAI </a>\"收购要约的讨论正在进行中，目前尚未达成最终交易，交易条款也可能发生变化。</p><p></p><h2>OpenAI称2024年营收将达到10亿美元，投资者表示质疑</h2><p></p><p>&nbsp;</p><p>尽管一些投资者对OpenAI的收益问题提出了质疑，但在刚刚过去的去年年底，OpenAI还是给投资者送了一剂“定心丸”。据三位知情者透露，OpenAI向投资者表示，预计2023年营收将会达到2亿美元，2024年将达到10亿美元。一位知情者称，OpenAI在去年12月下旬曾二次发售股票，公司估值达到200亿美元。</p><p>&nbsp;</p><p>在OpenAI的引领下，一些竞争对手和企业利用OpenAI开发的<a href=\"https://www.infoq.cn/article/k1EU1cHr1FflCxRuATtv\">生成式AI软件</a>\"制作应用。使用OpenAI技术需要获得授权，拿到授权要付费，一美分或者稍多能生成2万单词的文本，按照书面提示生成一张图片大约要2美分。</p><p>&nbsp;</p><p>OpenAI新闻发言人拒绝谈论公司财务状况及策略。2020年OpenAI开始推出商用产品，它宣称自己的使命依然是为人类增强AI安全。</p><p>&nbsp;</p><p>Synthesia和Jasper等创业公司已经吸引《财富》500强企业使用它们的视频生成工具或者AI文案工具，Jasper引入了OpenAI技术。OpenAI有机会成为AI提供商，甚至有可能威胁谷歌搜索。</p><p></p><p>Jasper公司直接使用OpenAI技术，已经有8万名营销者使用Jasper软件，用它生成广告、邮件、博文及其它内容。Jasper增长很快，今年营收预计将会翻倍，达到8000万美元。</p><p>&nbsp;</p><p>今年年初时一些大型VC公司放弃了对OpenAI的投资，OpenAI配得上如此高的估值吗？真的可以和谷歌竞争吗？一些投资者对此表示怀疑。</p><p>&nbsp;</p><p>OpenAI在2019年时曾设定“有限盈利”（capped-profit）架构，对VC投资做出限制。为了守护使命，OpenAI规定投资者的回报不能超过投资金额的100倍。</p><p></p><h2>微软“押宝”ChatGPT，要和谷歌“抢地盘”</h2><p></p><p>&nbsp;</p><p>尽管投资者对OpenAI的盈利能力持怀疑态度，但在技术层面，微软对OpenAI似乎很有信心，并已经加倍下注。</p><p>&nbsp;</p><p>据 Information 本周二报道，<a href=\"https://mp.weixin.qq.com/s?__biz=MzU1NDA4NjU2MA==&amp;mid=2247556939&amp;idx=2&amp;sn=c7661342e1b577fd05ad999d74ef03a4&amp;chksm=fbeaa684cc9d2f92d81224399dbf1603478d9a9b65a71754c76f5ddbc2c43760506bb7ccc15c&amp;scene=27#wechat_redirect\">微软公司于 2019 年向 OpenAI 投资</a>\"了 10 亿美元，该公司正在努力推出其搜索引擎 Bing 的一个版本，该版本使用现在流行的 ChatGPT 背后的人工智能。</p><p>&nbsp;</p><p>这位知情人士表示，微软相信，对于搜索用户来说，提供更具对话性和上下文回复，可以比链接提供更好的答案，从而赢得用户。微软可能在未来几个月内推出附加功能，但现在仍在权衡聊天机器人的准确性以及将其纳入搜索引擎的速度。该知情人士表示，最初的版本可能是对一小部分用户的有限测试。</p><p>&nbsp;</p><p>微软的 Bing 服务规模远小于 Alphabet Inc.占主导地位的谷歌搜索引擎，这位知情人士表示，微软几个月来一直在试用 ChatGPT。The Information 早些时候报道了微软的计划。</p><p>&nbsp;</p><p>与此同时，<a href=\"https://www.infoq.cn/article/lxDIGR1fQU5BRyH47mbe\">谷歌及其母公司</a>\" Alphabet 的首席执行官 Sundar Pichai 也在为谷歌做好准备以应对他所感知到的威胁。</p><p>&nbsp;</p><p>根据外媒报道， Pichai 参与了一系列探讨谷歌 AI 战略的会议，而且为了应对 ChatGPT 带来的威胁甚至推翻了内部众多团队的原有工作，并正在从其他部门抽调员工，以应对 ChatGPT 的威胁。谷歌的研究、信任与安全等部门和团队将进行组织重整，旨在帮助开发和发布新的 AI 原型和产品。</p><p>&nbsp;</p><p>未来会有更多企业拥抱AI，微软希望能借此东风拓展云业务。</p><p>&nbsp;</p><p>参考链接：</p><p><a href=\"https://www.reuters.com/markets/deals/chatgpt-creator-openai-talks-tender-offer-valuing-company-29-bln-wsj-2023-01-05/\">https://www.reuters.com/markets/deals/chatgpt-creator-openai-talks-tender-offer-valuing-company-29-bln-wsj-2023-01-05/</a>\"</p><p><a href=\"https://www.ft.com/content/10aadb2b-bd02-417d-ae34-8f162ad31dff\">https://www.ft.com/content/10aadb2b-bd02-417d-ae34-8f162ad31dff</a>\"</p>",
    "publish_time": "2023-01-06 14:20:15",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]