[
  {
    "title": "领导者如何告别责备文化，营造容纳失误、鼓励创新的组织文化",
    "url": "https://www.infoq.cn/article/PrK9S9oUZfeRccQ8yfo9",
    "summary": "<p>Diana Larsen 认为，责备文化是对人类潜力的浪费。当人们的精力都用在避免羞耻和责备上时，就无法完成最好、最有创造性的工作。她认为，要做到无责备领导，需要向学习和保持好奇心的方向转变。这需要建立或恢复与人们之间的信任和可信赖关系。</p><p></p><p>Diana Larsen 在 ScanAgile 2023 大会上发表了关于无责备领导的主题演讲。</p><p></p><p>Larsen 表示，企业在招聘最优秀的人才上投入了大量的时间、精力和金钱，但从实际的角度来看，将这些人带入一个责备盛行的文化中意味着这些投资的浪费：</p><p></p><p></p><blockquote>如果一个人总是担心自己会成为责备的对象，那么他就不可能达到自己的最佳状态。这会分散注意力，让人伤心，是对人类潜力的浪费。</blockquote><p></p><p></p><p>Larsen 提到，当人们感觉到责备即将降临在他们头上时，他们会尽其所能来避免。他们会回避、转移责任、隐藏错误。当责备来临时，他们会因为被认为不称职而感到羞耻。她说，当人们的精力用在这些反应上面时，就无法完成最佳或最有创造力的工作。</p><p></p><p>要想实现无责备领导，就需要转变思维方式，并深刻理解当指责盛行时，每个人都会受到伤害。Larsen 表示，责备的对立面是学习和好奇心。她建议，与其寻求指责，不如寻找导致意外、令人失望的事情的系统性根源，比如交付失误、编码错误或旷工等。</p><p></p><p>Larsen 提到，学习式领导可以表现为领导者在员工向其提出问题时承认自己并不了解所有答案。例如，你可以说：“我不知道该怎么做，让我们一起去找出解决办法！”当出现新的、意想不到的问题时，鼓励员工去探索、保持好奇心和学习。</p><p></p><p>无责备领导的第一步是建立或恢复与人们之间的信任和可信赖关系，正如 Larsen 所说的：</p><p></p><p></p><blockquote>我听到过一个挪威谚语：“他们的肩膀耷拉下来了。”我喜欢这句话。问问员工和团队成员，怎样才能让他们停止紧张地耸肩，以一种更顺畅、更放松、更投入的方式专注于工作。很多时候，我们可以很容易得到答案。</blockquote><p></p><p></p><p>Larsen 建议提出类似这样的问题：“怎样才能在把更多的时间投入到工作中？”、“你目前的工作环境缺少什么？”、“怎样才能让你学到完成团队工作所需的知识？”然后，采纳他们的建议，或解释你为什么不能（解释理由必须充分），并要求他们与你一起努力改进，这对你作为领导者以及他们作为团队成员来说都是更好的做法。</p><p></p><p>InfoQ 就无责备领导的话题对 Diana Larsen 进行了采访。</p><p></p><p>InfoQ：责备是如何成为领导方式中根深蒂固的一部分？</p><p></p><p>Diana Larsen：这是人们和人类系统很早就养成的习惯。回想一下，直到一二十年前，责备和打孩子仍然还是学校和家长公认的做法。现在，大多数人都对这种想法感到恐惧。人们把他们在家里和学校里学到和看到的习惯带到了工作场所。</p><p></p><p>甚至还有一些关于责备的传统格言，好像责备是一种预期行为。“让他们受点压力吧。”、“呆在你自己的泳道里！”、“你为什么不能像某某同事一样？”、“谁对这个错误负责？”还有很多其他的回应，比如“在这里，你必须想办法开脱罪责！”、“低调行事”，等等。员工、经理和企业高层领导都已经习惯了这种模式。</p><p></p><p>InfoQ: 领导者必须培养哪些技能才能实现学习式领导？</p><p></p><p>Larsen：如果他们在软件 /IT 行业工作，就需要培养识别、理解、影响和与复杂系统（技术和人文）协同工作的能力。其他的技能还包括学习领导团队而不是个体贡献者，了解动机的变化和团队环境中的重要因素。将领导者的注意力转移到为团队预期的工作性质创造最佳的工作环境上。</p><p></p><p>大多数软件开发团队在学习工作上花费的时间远远超过应用知识的时间。当工作环境充满不确定性、复杂性、模糊性和快速变化（VUCA）时，他们必须关注新的学习相关技能和了解信息的方法。</p><p></p><p>英文原文：</p><p></p><p><a href=\"https://www.infoq.com/news/2023/12/leading-without-blame/\">https://www.infoq.com/news/2023/12/leading-without-blame/</a>\"</p><p></p>",
    "publish_time": "2023-12-28 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]