[
  {
    "title": "传AMD上海将无差别裁员，可能赔偿N+7；微软新员工最高工资约265万；马斯克拟向X平台发帖新用户收费 | AI一周资讯",
    "url": "https://www.infoq.cn/article/0CoFw5ByYmvBVqVtotg9",
    "summary": "<p></p><blockquote>马斯克X平台拟向发帖新用户收费：每年1美元；高通将推出RISC-V架构智能穿戴芯片；威马回应“破产跑路”传闻；OpenAI正开发“AI生成图片识别器”：准确率高达99%……</blockquote><p></p><p></p><h2>资讯</h2><p></p><p></p><h4>字节跳动回应PICO将被关停传闻</h4><p></p><p></p><p>10月21日，有媒体报道称字节跳动将逐步放弃PICO业务，字节跳动相关负责人回应界面新闻称，此消息不实。PICO在正常运营，公司会长期投入XR业务。</p><p></p><h4>科大讯飞回应美国AI芯片出口管制：华为昇腾910B能力基本可对标英伟达A100</h4><p></p><p></p><p>10月19日晚间，科大讯飞在三季报业绩说明会上针对近日美国政府进一步收紧对尖端人工智能芯片的出口管制事项表示，前述管制对将大模型构建在英伟达算力上的大模型厂商会产生较大影响，但科大讯飞已于2023年初与华为昇腾启动专项攻关，合力打造我国通用人工智能新底座，当前华为昇腾910B能力已经基本做到可对标英伟达A100。在即将举行的科大讯飞1024全球开发者节上，公司和华为在人工智能算力底座上将有进一步联合发布。</p><p></p><h4>美国商务部澄清: RTX 4090显卡可在中国零售，不能生产</h4><p></p><p></p><p>10月18日，美国商务部就ECCN 3A090更新高科技出口管制政策作出澄清，关于3A090b部分NVIDIA GeForce RTX 4090显卡的禁令，美国商务部允许就在出口消费性应用作出豁免，可以中国零售市场贩售。</p><p></p><p>GeForce RTX 4090显卡可以在中国 (包括香港及澳门) 消费性市场继续零售，但不可以输入 RTX 4090晶片作商用及生产用途，意味着中国代工厂不能生产 GeForce RTX 4090，但普通消费者还是渠道能买到NVIDIA GeForce RTX 4090 。目前RTX4090公版/非公版显卡陆续下架，店铺均为无货状态。这也导致部分拥有RTX 4090库存的商家对其定价直接跳涨，多达2万元以上，甚至出现近5万元的高价。</p><p></p><h4>传AMD上海将无差别裁员，图形部门是重灾区</h4><p></p><p></p><p>近期，传AMD开始在中国裁员。据了解，10月25日当天AMD上海内部的会议室都被HR预订完（裁员前兆），裁员规模可能为10%-15%，涉及300-450名左右的员工，RTG部门（Radeon Technologies Group）是重灾区。AMD本次裁员的具体赔偿方案未定，参考其他外企在中国的裁员情况，网络上流传的N+4、N+7赔偿也有一定可能。</p><p></p><p>AMD上海研发中心成立于2006年，是AMD公司在美国本土以外最大的研发中心，员工总数约3000名。据悉，该中心主要负责CPU、GPU和APU等产品的设计、开发和测试等工作，曾经为AMD贡献了不少创新的技术和产品，例如Ryzen系列处理器、Radeon系列显卡等。</p><p></p><h4>诺基亚将裁员至多1.4万人以削减成本</h4><p></p><p></p><p>10月19日，诺基亚公布第三季度财报，营收49.8亿欧元，预估57亿欧元；第三季度调整后营业利润4.24亿欧元，预估5.564亿欧元，营收和利润表现均不及预期。</p><p></p><p>同日，诺基亚宣布调整营运策略，目标是到2026年底总成本基础较2023年降低8亿至12亿欧元，特别是人员开支将减少10%-15%。诺基亚目前有86000名员工，该计划预计将使员工人数降至72000-77000名，最多或减少14000人。</p><p></p><p>诺基亚表示，此次受到降本增效措施影响的部门主要包括移动网络、云和网络服务两大子业务部门以及集团职能部门，成本缩减规模将取决于终端市场的需求变化。</p><p></p><h4>B站广州研发工作室宣布解散，高峰期曾有400多人</h4><p></p><p></p><p>据报道，B站广州研发工作室日前宣布解散，CEO丁黔伟也将离开公司。一款日漫IP改编项目因有外部合作合同而被保留了下来，其他项目均被砍掉。也就意味着这个原本有400多人的研发工作室，经历了两次大裁员之后剩下约60人，被留下的人也处于等待合同结束离开的状态。</p><p></p><p>广州研发工作室是2022年B站收购广州心源互动而来。后者成立于2019年，最早是由丁黔伟与他人共同出资设立，公司专注于动作类游戏的研发，其高管曾在采访中表示“每个制作人都有10年以上做动作游戏的经验”。</p><p></p><h4>OpenAI正开发“AI生成图片识别器”：准确率高达99%</h4><p></p><p></p><p>据报道，OpenAI正在开发一款新工具，能够以相当高的精度判断一张图片是否是人工智能所绘制。</p><p></p><p>除了聊天机器人和撰稿工具ChatGPT之外，OpenAI公司还开发过一款名为“DALL-E”的人工智能图片生成器。当地时间周二，该公司首席技术官米拉·穆拉蒂（Mira Murati）透露，该公司开发的AI图片识别工具，能够以99%的准确率判断一张图片是否是人工智能工具所绘制。</p><p></p><p>穆拉蒂介绍，这款图片识别工具正在进行内部测试，后续将会发布，但是她并未提供很具体的发布时间。</p><p></p><h4>百度发布文心大模型4.0</h4><p></p><p></p><p>10月17日，百度发布文心大模型4.0。百度CEO李彦宏表示，文心大模型4.0是迄今为止最强大的文心大模型，实现了基础模型的全面升级，在理解、生成、逻辑和记忆能力上有着明显提升，综合水平与GPT4相比已经毫不逊色。</p><p></p><h4>贾跃亭：FF市值仅0.2亿美元，自己“心急如焚”</h4><p></p><p></p><p>日前，Faraday Future公司创始人兼首席产品及用户生态官贾跃亭发表致全体股东和投资人公开信。贾跃亭在信中表示：虽然公司成功达成一个又一个重大里程碑，为业务发展提供了坚实的基础，但股价和市值却遭遇了最至暗时刻，公司市值跌到仅为30多亿美元现金投入总额的1%都不到，我们对此感到无比痛心和失望，相信包括公众投资者在内的所有热爱公司的股东们也都无比痛心和失望。</p><p></p><p>贾跃亭在信中表示，FF将推出六大举措坚决捍卫股东利益。包括：对潜在的非法卖空行为展开调查；公司核心层增持；继续全力积极引入潜在战略投资者；进行组织升级；降低运营和供应链成本；让外界和投资人更好的了解FF的发展现状和真实价值等。贾跃亭最后表示：“对于FF真实价值和资本市场价值严重背离的表现，我其实是最心急如焚的，对没有给所有股东和投资人带来应有的价值回报深感惭愧，我也最希望全力推动实现FF价值最大化。”</p><p></p><h4>威马回应“破产跑路”传闻</h4><p></p><p></p><p>10月17日，有报道称，目前处于破产重整过程中的威马汽车仅剩800余名员工且已超四个月停发工资，随即威马汽车冲上热搜。</p><p></p><p>10月18日，威马汽车官方微博发文称，威马汽车并未申请破产，目前公司核心岗位运营正常，也不存在公司创始人跑路海外的情况。</p><p></p><p>该篇澄清声明指出，威马汽车目前正在进行的是经上海第三中级人民法院受理的预重整阶段。预重整不同于破产重整，是在企业面临困境的早期阶段进行的自救行为，旨在通过重组债务引进战略投资人，避免破产，实现重生蜕变。</p><p></p><p>针对创始人跑路的消息，威马汽车方面表示，目前公司的重点包括售后服务、复工复产、出口业务、海外合作、国际融资以及引进战略投资人等事项，已取得一定进展，公司会寻找合适的时机对外公布。“公司创始人沈晖于1991年赴美留学，在欧美多地工作和居住多年，近期工作重心以海外事项为主，因此不存在公司创始人跑路海外的情况。”</p><p></p><h4>马斯克X平台拟向发帖新用户收费：每年1美元</h4><p></p><p></p><p>10月18日凌晨，马斯克在X上引用了X的官方消息称，要向在网上发帖或与其他用户互动的新账户收取每年1美元的订阅费。据称该措施是为了减少X平台上，垃圾邮件、自动机器人账户和其服务的操纵。马斯克发帖称：“阅读免费，但写作每年1美元。这是不阻止真实用户的情况下对抗机器人的唯一方法。”</p><p></p><p>据了解，这项名为“NotaBot”的测试已在新西兰和菲律宾推出。不支付费用的新用户将无法在网站上执行某些操作，包括发帖、点赞、回复或添加书签。“这将帮助我们打击X上的机器人和垃圾邮件发送者，以增加平台的可访问性，现有用户不受这次测试的影响。</p><p></p><h4>高通将推出RISC-V架构智能穿戴芯片</h4><p></p><p></p><p>据路透社报道，移动处理器大厂高通于17日宣布，在与谷歌长期合作基础上，将推出支持Wear OS系统（基于 Android）的RISC-V构架的智能穿戴芯片，并将在全球市场进行商用推广。双方还持续投资高通的RISC-V Snapdragon Wear平台，高通也将成为Wear OS生态系的智能穿戴芯片供应商。</p><p></p><p>对于谷歌和高通而言，随着新款RISC-V智能穿戴芯片的即将推出，是商用RISC-V Android项目的首次尝试，这也是有史以来第一款宣布面向消费大众市场的RISC-V Android芯片。</p><p></p><h4>百川智能获3亿美元战略投资</h4><p></p><p></p><p>近日，百川智能宣布已完成A1轮战略融资，融资金额3亿美元，阿里、腾讯、小米等科技巨头及多家顶级投资机构均参投了本轮融资。加上天使轮的5000万美元，其融资金额已达3.5亿美元，成立不到半年时间便跻身科技独角兽行列，创下国内大模型初创企业晋升独角兽速度之最。</p><p></p><p>百川智能成立于2023年4月10日，由前搜狗公司CEO王小川创立。其核心团队由来自搜狗、Google、腾讯、百度、华为、微软、字节等知名科技公司的AI顶尖人才组成，目前团队规模170余人，其中硕士及硕士以上学历员工占比近70%，研发人员占比超80%。</p><p></p><h2>IT 业界热评新闻</h2><p></p><p></p><h4>微软新入职员工最高基本工资约265万，最低约31万</h4><p></p><p></p><p>近日，根据国外科技媒体披露的一份微软内部文档显示，新入职成员最高基本工资为 23.17 万美元至 36.15 万美元（当前约 169.6 万元至 264.6 万元人民币），此外还有最高 120 万美元（当前约 878.4 万元人民币）的入职奖金，以及 100 万美元（当前约 732 万元人民币）的年度股票奖励。</p><p></p><p>目前尚不清楚这份披露的文档适用于所有新入职员工，还是仅限于某些特定的组织角色，这份文档也显示在纽约和旧金山地区的微软新入职员工工资更高。文档显示级别最低的新入职员工至少年薪为 4.25 万美元（当前约 31.1 万元人民币），但没有入职奖金和年度股票奖励。而最高级别为 70 等级，基本工资在 23.17 万美元至 36.15 万元之间，此外还可以获得 31 万美元到 120 万美元的入职奖金。</p><p></p><h4>接受开发者“贿赂”，至少 5 名国内 App Store 员工被苹果开除</h4><p></p><p></p><p>据外媒报道，至少有五名在中国App Store工作人员因与开发者和顾问有不当行为而被开除。</p><p></p><p>据了解，App Store负责审核和编辑的员工不应该与开发者见面，但一次内部审计引起了对半打员工的怀疑，并导致了调查。苹果公司发现，这些员工接受了开发商和顾问提供的免费餐饮和夜店活动，而这些开发商和顾问经营的企业声称他们可以让游戏在App Store上架。</p><p></p><p>涉案员工虽无法让应用程序在App Store上架或删除，但他们确实有权对App Store中的某款应用程序进行专题报道，通过更多的曝光量被用户所看到。目前尚不清楚这些员工是否以不适当的方式展示了与他们互动的开发者的应用程序。</p><p></p><p>苹果发言人在一份声明中表示，苹果希望员工遵守其商业行为政策。“苹果公司希望全球员工遵守其严格的道德和商业行为政策，但不对本报告中的具体指控发表评论。我们会对不当行为的报告进行彻底调查，并在适当的时候采取包括解雇在内的行动。”</p>",
    "publish_time": "2023-10-22 15:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]