[
  {
    "title": "华为最高领袖孟晚舟解读2022年报，研发投入10年近万亿",
    "url": "https://www.infoq.cn/article/HRQ4yh7RfR5VAQV22LjG",
    "summary": "<p>3 月 31 日下午，华为发布 2022 年年度报告。根据报告，华为 2022 年实现全球销售收入 6423 亿人民币，净利润 356 亿人民币，同比下滑 68.7%。华为首席财务官孟晚舟表示，2022 年华为经营依然面临较大压力，但总体而言，经营业绩符合预期。</p><p></p><p>谈及净利润下滑的原因，孟晚舟解释称主要是经营利润下滑以及研发投入持续加大所致，并指出截至 2022 年末，华为手上的净现金为 1763 亿，按现在的商业计划足够能够支撑公司未来几年的投入。2022年，华为在研发费用及比重均破历史记录，研发投入高达 1615 亿，约占全年收入的 25.1%。过去十年，华为累计投入的研发费用超过 9773 亿人民币。“持续高强度的研发资源投入，使得我们能够持续完成器件替代、单板重构，以及操作系统、数据库等等的开发。”</p><p></p><p>从具体业务看，2022 年，华为在运营商业务领域实现销售收入 2840 亿人民币，华为企业业务实现销售收入 1332 亿人民币，终端业务实现销售收入 2145 亿人民币。</p><p></p><p>华为轮值董事长徐直军表示，在芯、软、硬、端、网、云的协同，是华为构筑差异化竞争的优势。要让每一个 bit 以最科学的方式被采集、传输、处理和呈现，以实现极简架构、极高质量、极低成本、极优体验的目标。</p><p></p><h2>数字化与低碳化是确定的产业方向和机会</h2><p></p><p></p><p>此外，华为首次披露产业维度收入。目前，华为已经形成由 ICT 基础设施、终端、华为云、数字能源和智能汽车解决方案等面向客户的产业组合，以及由 2012 实验室、海思作为后盾的技术支撑平台。</p><p></p><p>从五大产业业务的维度看，2022 年 ICT 基础设施业务销售收入 3540 亿元人民币，保持稳定增长；终端业务销售收入 2145 亿元人民币，下行趋势放缓；数字能源和华为云业务快速增长，其中数字能源业务收入为 508 亿元人民币，云业务销售收入 453 亿元人民币。智能汽车解决方案部件业务 21 亿元人民币。</p><p></p><p>华为认为，在未来不确定的宏观环境中，数字化与低碳化是确定的产业方向和机会。因为历史发展进程的差异，每个国家的数字经济之路都不同，每个行业和组织的数字化转型路径也都不同。这种情况下，最先进的技术并不一定总是最好的解决方案。为此，华为至今已先后面向金融、矿山、政务、交通（机场、轨道、公路、水运、口岸）、电力等领域成立了军团，联合伙伴的产品以及能力，已打造了 100 多个场景化解决方案。</p><p></p><p>在数字人才培养方面，华为表示自从 2008 年开始就致力于帮助业务所在国培养 ICT 人才，发起“未来种子”项目，帮助行业和公共部门的专业人才提升技能，培养领导力，激励高校学生和举办各类竞赛，并在全球各地多个社区提供基本数字技能培训。目前该项目已覆盖 150 多个国家，受益人数超过 243 万人。</p><p></p><h2>重申不造车，严禁华为品牌出现在汽车品牌前</h2><p></p><p></p><p>尽管华为一再重申“不造车”，但相关传闻始终沸沸扬扬。在同一日，华为内部再次发布了《关于华为不造车的决议》公告，由华为创始人、董事长任正非署名发出，再次强调“华为不造车”。据悉，2020 年任正非曾签发类似“不造车文件”，有效期截至今年 10 月，本次决策的有效期再度延长 5 年。除此之外，任正非还对华为标志在汽车设计上的露出提出了严格要求，不能使用华为/HUAWEI 出现在整车宣传和外观上。</p><p></p><p>在本次发布会上，徐直军亦对上述消息作出了回应，华为的战略没有变，华为不造车，而是帮助企业造好车，做增量部件供应商。严禁华为品牌出现在汽车品牌前或作为汽车品牌，华为将对所有旗舰店和授权店进行清理整顿，要回归到华为的战略和定位上来。</p><p></p><p>华为表示，华为目前与车企有三种合作模式：一、标准化零部件的模式；二、HI模式(Huawei Inside)；三、华为智选模式。</p><p></p><p></p><h2>孟晚舟接班华为最高领袖</h2><p></p><p></p><p>3月31日，华为官网还发布了《关于公司轮值董事长的当值公告》，根据公司轮值董事长制度，2023年4月1日～2023年9月30日期间由孟晚舟当值轮值董事长。轮值董事长在当值期间是公司最高领袖，主持公司董事会及董事会常务委员会。</p><p></p><p>对于此次接班，孟晚舟回应称依照华为的治理章程，接班从来是体制制度的接班，不是个人的接班，公司不会把集体命运系在个人身上，而是“一张蓝图画到底”。公司的董事会治理规则已经明确了轮值的职责，她和其他轮值董事长都一样会依据治理章程推进工作。“作为一家企业没有办法改变生存环境，只能尽最大的努力适应环境。”</p><p></p><p></p><p>附华为2022年年度报告下载链接： https://www-file.huawei.com/minisite/media/annual_report/annual_report_2022_cn.pdf</p>",
    "publish_time": "2023-04-01 00:29:40",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]