[
  {
    "title": "电商巨头 Shopify 提升 LLM 辅助工具，优化电子商务生态",
    "url": "https://www.infoq.cn/article/uNJmOYLgQK062KPYFWDw",
    "summary": "<p>在使用大型语言模型聊天机器人打开了创新解决方案之门的同时，Shopify 的工程师 Ates Goral 认为，要使用户体验尽可能自然，需要一些特定的努力，以<a href=\"https://shopify.engineering/sidekicks-improved-streaming\">防止产生卡顿并减少延迟</a>\"。</p><p>&nbsp;</p><p>由大型语言模型返回的 Markdown 响应流会导致渲染卡顿，因为特殊的 Markdown 字符（如 *）在完整表达式被接收之前保持模糊不清，例如，直到接收到闭合的 *。同样的问题也适用于链接和所有其他 Markdown 运算符。这意味着 Markdown 表达式在完全完成之前无法正确渲染，这意味着在短时间内 Markdown 渲染不正确。</p><p>&nbsp;</p><p>为了解决这个问题，Shopify 使用了一个缓冲解析器，它在 Markdown 特殊字符之后不会发出任何字符，并等待 Markdown 表达式完全完成或收到意外字符。</p><p>&nbsp;</p><p></p><blockquote>在进行流式传输时，需要使用一个有状态的流处理器，可以逐个字符地消耗字符。流处理器要么按照字符接收的顺序传递字符，要么在遇到类似 Markdown 的字符序列时更新缓冲区。</blockquote><p></p><p>&nbsp;</p><p>然而，Goral 表示，虽然从原理上讲，这个解决方案相对容易手动实现，但要支持完整的 Markdown 规范，则需要使用现成的解析器。另一方面，延迟主要是由于需要进行多次大型语言模型往返来消耗外部数据源，以扩展大型语言模型的初始响应所导致的。</p><p>&nbsp;</p><p></p><blockquote>大型语言模型对一般的人类语言和文化有很好的理解，但它们并不是获取最新准确信息的绝佳来源。因此，我们告诉大型语言模型通过使用工具来告诉我们当它们需要超出其理解范围的信息时。</blockquote><p></p><p>&nbsp;</p><p>换句话说，基于用户输入，大型语言模型提供的初始响应还包括要咨询以获取缺失信息的其他服务。当这些额外的数据片段被接收后，大型语言模型将构建完整的响应，最终显示给用户。</p><p>&nbsp;</p><p>为了防止用户需要等待所有外部服务都响应完成，Sidekick 使用了 \"卡片\" 的概念，即占位符。Sidekick 渲染了从大型语言模型收到的初始响应，包括任何占位符。一旦额外的请求完成，Sidekick 将占位符替换为接收到的信息。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/43/43afd7d3246a2f60947117a72536422b.gif\" /></p><p></p><p>&nbsp;</p><p>在 Sidekick 中实施的解决方案充分利用了此工作流程中固有的异步性，并将响应分流步骤与 Markdown 缓冲解析器集成在一起。如果您对他们的解决方案的完整细节感兴趣，不要错过 Goral 的原文文章。</p><p>&nbsp;</p><p>&nbsp;</p><p>原文链接：</p><p><a href=\"https://www.infoq.com/news/2023/08/Shopify-sidekick-llm-improvement/\">https://www.infoq.com/news/2023/08/Shopify-sidekick-llm-improvement/</a>\"</p>",
    "publish_time": "2023-09-26 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "PICO 首届 XR 开发者挑战赛正式启动，助推行业迈入“VR+MR”新阶段",
    "url": "https://www.infoq.cn/article/EjqbmPdv0fSvUkWqgZ2k",
    "summary": "<p>9 月 25 日，“PICO 2023 首届 XR 开发者挑战赛”（下文简称“挑战赛”）媒体启动会在北京圆满落幕，官方赛事报名通道已于今日开启。据悉，本次挑战赛是 PICO 首次针对全球开发者举办的大型挑战赛事，旨在与开发者保持连接，共同探索 XR 行业新成长。作为主办方，PICO 将为参赛者提供平台、专业技术、资金等全方位支持，而全球领先的芯片厂商英特尔也将作为本届赛事技术合作伙伴为参赛者保驾护航。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/bb/40/bbb0993bf6845538a460d7737734a740.png\" /></p><p>图1：PICO 2023首届XR开发者挑战赛报名通道正式开启</p><p>&nbsp;</p><p>启动会现场，除了官宣赛事启动，PICO 相关负责人还围绕行业、技术、资金/人才投入等维度详细阐述了 PICO 一直以来对于开发者的重视及此次举办开发者挑战赛的初衷，呼吁更多开发者投入XR开发新领域，与 PICO 及行业共成长。</p><p></p><p>“新阶段的 XR 行业，值得开发者关注与参与。”PICO OS 产品负责人马杰思谈到，“XR 行业已经迈入新的发展阶段，开始从强调虚拟的‘VR’向虚实融合的‘VR+MR’阶段过渡，这种变化不仅能给用户提供更多样化的产品价值，一定程度也赋予了开发者更大的创作空间。各行各业的开发者，都有机会融入到XR开发的领域之中，一起创造新机会和新市场。同时，光学显示、芯片算力、环境感知、人机交互等技术的突破，也加速了 XR 行业发展。”</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/ae/29/aef7883c92bd3a90944a3aa27c5ff629.jpg\" /></p><p>图2：PICO OS产品负责人马杰思现场分享</p><p></p><p>马杰思同时表示，想要实现整个 XR 赛道高水平发展的局面，决不是凭借 PICO 或者某一家品牌一家之力就可以做成的事情。一直以来，PICO 都相当重视广大的开发者伙伴，先后启动了“PICO 开发者计划”“PICO 创作者激励计划”等，从硬件、技术、营销等维度，全链路助力开发者成长。此次主办首届开发者挑战赛事，是在 XR 行业新阶段下 PICO 与开发者链接的一次新尝试。新趋势下，PICO 将持续围绕空间感知、图形渲染、人机交互等 XR 核心底层技术能力持续完善，并协同字节底层技术能力，为开发者提供前沿、便捷的开发服务。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/a7/b8/a7a445324980c41320ab0e00dbc13fb8.jpg\" /></p><p>图3：PICO中国区游戏商务负责人郭文山现场分享</p><p>&nbsp;</p><p>作为全球知名的 XR 品牌，PICO 在近两年保持快速增长，2022 年全年销量同比之前翻了 8 倍。此外，IDC 数据显示，2022 年市场份额 PICO 全球排名第二、国内位居第一，2023 年上半年国内 VR 市场的厂商份额中，PICO 以 58.7% 的占比大幅领先同行。这些成果背后，离不开庞大的用户群体以及众多开发者共建内容生态的支持。</p><p></p><p>PICO 中国区游戏商务负责人郭文山表示：“截止目前，PICO 应用商店的应用数量已超 530 款，‘大作’占比近四成。其中，国内开发者贡献不容忽视，PICO 应用商店中包括游戏、视频、运动、办公、教育、音乐等在内的 100 多款应用均来自国内开发者。此外，PICO 也给开发者带来更多用户和收入，&nbsp;有 180 款游戏收入超过 10 万元，近 50 款应用下载量超过 10 万，而部分平台头部开发者，在 PICO 的年收入已超过 800 万元。”</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/8e/8f/8e2daabe3454191f157eb6ffd0f6c68f.png\" /></p><p>图4：PICO将为开发者们提供专业指导、投资机会、流量曝光等全方位支持</p><p>&nbsp;</p><p>据了解，本次“挑战赛”将在欧洲、北美、东南亚、日韩、中国等多个国家和地区同期举办，为全球开发者提供展示才华、实现创意的舞台。所有未发行/已发行且没在往届同类型比赛中 PICO 赛道获奖的作品均可报名。赛事报名通道于 9 月 25 日正式开通，开发者可通过 PICO 官网开放平台赛事专区报名参赛，并于 10 月 2 日至 11 月 10 日期间完成作品提报。<a href=\"https://www.infoq.cn/article/z1CW0cFhLxLi2KYk258t\">PICO</a>\" 将于 11 月 30 日前组织评委完成评审，并于 12 月 5 日举办颁奖仪式，公布获奖名单。</p><p>&nbsp;</p><p><a href=\"https://www.infoq.cn/article/Vsc9cCloJx9mCOTyURGT\">针对</a>\"本届“挑战赛”重点赛区之一的中国区开发者，本次挑战赛设置了前五名，另外还单独设置了游戏类、创新类、MR 赛道、手势识别四个不同赛道奖项。获奖者除收获最高达 6 万元的丰厚奖金外，还有机会得到技术大咖指导、投资圆桌交流、<a href=\"https://xie.infoq.cn/article/40e1258dc998d9c7ce6380c8a\">PICO</a>\" 创投基金和面试直通等额外支持。 赛事技术合作伙伴英特尔也将为获奖参赛作品上线运行提供更多维的算力支撑，搭载英特尔 ARC dGPU 显卡的运行环境后续将开放给大赛开发者实现项目落地。</p><p>&nbsp;</p><p>通过本次挑战赛，开发者们不仅可以充分展示自己的才华和创新能力，同时也能够获得更多的机会和支持。有兴趣的开发者们，不妨立即行动起来，前往 PICO 官网开放平台赛事专区（<a href=\"https://www.picoxr.com/cn/2023picodevjam/#/introduce?trackingFlag=EkWdMubc\">链接</a>\"），报名参加这场挑战赛。</p>",
    "publish_time": "2023-09-26 08:44:05",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "首个千亿医药对话大模型来了，要打破医药研发“三十定律”",
    "url": "https://www.infoq.cn/article/0higrDEDX6Zs81dXCaSf",
    "summary": "<p>10年时间，投入超10亿美金，但成功率只有10%——这是医药研发领域的“三十定律”。从某种程度来说，它像是医药行业的一个“魔咒”。</p><p></p><p>一个药物在正式上市之前，需要经过立项调研、早期药物发现、早期临床前研究、临床试验药物重定位等各个流程。对于药企而言，整个过程存在三大痛点：第一，信息繁杂，对专家依赖度极高；第二，探索空间有限，湿实验（*注）迭代慢；第三，投入成本高，失败风险大。</p><p></p><p>为了打破这个“魔咒”，近日水木分子发布了新一代对话式药物研发助手ChatDD&nbsp;(Drug&nbsp;Design)&nbsp;和全球首个千亿参数多模态生物医药对话<a href=\"https://www.infoq.cn/article/Joe403tMlSW3gHQVOHTm\">大模型</a>\"ChatDD-FM&nbsp;100B。其中，ChatDD&nbsp;能够在立项、临床前研究、临床试验各环节提供服务，预计将于10月中下旬邀请基础版本内测；ChatDD-FM&nbsp;100B在C-Eval评测中达到全部医学4项专业第一，是唯一在该4项评测中平均分超过90分的模型。</p><p></p><h3>从人工炼药到人机交互，医药研发经历四个阶段</h3><p></p><p></p><p>回顾研发模式的发展历程，<a href=\"https://www.infoq.cn/article/Bydle1aR2REAdNOLVOrC\">水木分子</a>\"首次定义了医药研发的四个阶段：</p><p></p><p>第一阶段称为TMDD（Traditional&nbsp;Manual&nbsp;Drug&nbsp;Design），从远古时代一直持续到19世纪末，主要以手工合成、提取和筛选为主，基于大量试验、错误和经验主义，缺点是低通量、缺乏系统性、耗时长且成本高；</p><p></p><p>第二阶段称为CADD（Computer-Aided&nbsp;Drug&nbsp;Design），从20世纪中叶到21世纪初，计算机的出现开始辅助加速药物发现和设计，底层有物理化学规则做支持，在一定程度上实现了高通量，但是计算机只具有工具属性，因此只能解决单个问题，在研究过程中，仍然在很大程度上依赖研究人员经验；</p><p></p><p>第三阶段称为AIDD（AI&nbsp;Drug&nbsp;Design），从21世纪初至今，人工智能技术的成熟发展和应用，开始改变药物研发，研究人员可以从训练数据中挖掘药物发现和设计，优点是能够满足超高通量，实现流程化，但是缺乏模型与专家交互，依赖大规模高质量标注数据，面临信息与知识分离，工具服务分散，处理模态单一等挑战；</p><p></p><p>第四阶段称为ChatDD（Chat&nbsp;Drug&nbsp;Design），即基于当下的大模型能力，对多模态数据进行融合理解，与专家自然交互人机协作，重新定义药物研发模式。</p><p></p><p>在整个过程中，每个阶段的技术革新都带来了不同程度的效率提升和科学发展，为药物研发带来了新的机遇和挑战。“但是，目前市场上至少还有超过&nbsp;1/&nbsp;3&nbsp;的药还是通过TMDD研发设计的。”清华智能产业研究院（AIR）首席研究员、水木分子首席科学家聂再清教授表示，这正是如今医药研发周期长、投入大、风险高很重要的原因。</p><p></p><p>虽然计算机、人工智能技术能够起到一定的研发辅助作用，但是仍然停留在工具阶段，研发过程很难摆脱对专家的知识依赖。“并且专家的知识储备也是有限的，无法掌握所有的文章、专利、数据。我们认为，把专家知识与大模型知识联结，二者进行协作，这才是药物研发现在和未来应该有的模式。”聂再清教授强调。</p><p></p><p>除此之外，利用此前的技术辅助医药研发还面临两个挑战：一方面，海量的实时<a href=\"https://www.infoq.cn/news/oZkw8G2uXvv2oVNJ7XFm\">数据</a>\"散落在各处；另一方面，生物医药涉及大量细分领域，每个领域需要配备对应工具，这些工具的使用门槛和成本也相对较高。“这也是我们发布ChatDD的原因，希望通过一个自然语言的交互界面，能够把专家从繁琐的数据处理和工具使用工作当中解放出来，把更多的精力放在更加开创性的、更有价值的工作上。”</p><p></p><h3>搞定立项、临床前研究、临床试验难题，ChatDD的三个场景应用</h3><p></p><p></p><p>水木分子在此次发布会上展示了&nbsp;ChatDD的在医药研发环节的三个具体应用场景，包括ChatDD-BI&nbsp;立项场景、ChatDD-Discovery研发探索场景和ChatDD-Trail&nbsp;临床试验场景应用。&nbsp;&nbsp;</p><p></p><p>ChatDD-BI：辅助立项调研</p><p></p><p>和仿制药生产制造不同，在药物研发过程中，立项环节极为重要，甚至一个错误的决定都可能导致巨大的经济损失。</p><p></p><p>在传统模式下，这一工作存在三个主要痛点：第一，信息繁杂，涉及对大量数据的搜集、整理和分析，比如病人需求、疾病机制、医药行业现状、专利和文献检索等等，并且这些数据散落各处，收集难度大、耗费时间长，一份高质量的立项报告的输出需要专家投入大量精力。第二，这一工作是非标准化的，对专家依赖极高，还存在信息不全面的问题，可能对项目的决策和发展产生负面影响。第三，立项涉及企业商业秘密难以外包，这也增加了信息搜集的难度。</p><p></p><p>针对这一问题，ChatDD-BI的角色是作为立项助手，通过与专家的数轮对话辅助立项调研，从而提升立项的效率和质量。</p><p></p><p>ChatDD-Discovery&nbsp;：启发研发灵感，提高工具使用效率和体验</p><p></p><p>针对临床前研究场景，传统的做法是做湿实验，然后根据结果不断迭代。但是随着时间的推移，找到针对已知靶点的药物越来越难。因此，科学家们需要更大的探索空间来寻找新的靶点和治疗方案。&nbsp;对此，水木分子认为，大模型的<a href=\"https://www.infoq.cn/article/TSJbOkWweAvFh44Oo2dL\">幻觉</a>\"在科学研究探索性中可能会带来“意外”的灵感。&nbsp;</p><p></p><p>以针对渐冻症治疗方案的探索场景为例，研发人员可以通过对话获得“渐冻症”疾病画像，包含疾病的描述、已有治疗方案等等，如下图：</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/d0/d06fc8de62c99ce371fc91dbf7a746e8.png\" /></p><p></p><p>同时，ChatDD还会通过查询外部数据库，如ClinicalTrails，给出渐冻症在研药物进展。&nbsp;以“利司扑兰”为例，研发人员可以利用ChatDD进一步探究其作用靶点，ChatDD找到利司扑兰的作用靶点“SMN2”，通过建立疾病、靶点、药物之间的潜在链条关系，发现并建议“SMN2是渐冻症的潜在靶点，可进行下一步探究探索”。根据已发表的多项研究成果，证明了ChatDD推断的合理性。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/f8/f8a8b1ce54aa8d167fb0ffdc2f68e7a0.png\" /></p><p></p><p><img src=\"https://static001.geekbang.org/infoq/c9/c9e7e0b87173bb4289b50245431e387b.png\" /></p><p></p><p>除了“灵感激发”之外，ChatDD-Discovery同样可以提高研究人员的研发效率。在医药研发过程中，研究人员需要查询大量文献和检索专利等，这需要高频使用各种工具，学习成本高且难以与专家知识互动融合。而ChatDD-Discovery采用自然语言交互方式，将专家知识模型参数化，只需简单回答问题，就能使用虚拟筛选功能，使研究人员更高效地完成任务。</p><p></p><p>值得一提的是，ChatDD-Discovery&nbsp;研发助手可以处理生物医药多模态数据，如分子、蛋白质、基因序列以及多样的生物医药下游任务，如DDI（药物-药物相互作用计算）、亲和力计算、药物敏感性预测、单细胞类型注释等。&nbsp;例如，输入分子式ChatDD-Discovery就可以生成该分子的完整描述信息，并且支持用户针对该分子进行进一步提问。</p><p></p><p>ChatDD-Trial：提高临床试验成功率</p><p></p><p>在药物研发的全流程中，临床试验是耗资最多、风险最大的那一环，因此，想要打破“三十定律”，提高临床试验成功率是重中之重。换个角度来看，由于成本巨大，所以，在这个环节只要有一点点的提升，就能带来可观的经济效益。</p><p></p><p>对此，水木分子ChatDD目前主要关注四个小场景：药物生物标记物发现、临床试验入组设计、临床试验报告撰写、药物重定位和适应症扩展。</p><p></p><p>比如，ChatDD-Trial可以辅助临床试验研究人员找到最适合入组的患者人群；比如，通过发现药物敏感的生物标志物，更好地理解疾病亚型，实现精准的患者分类，确保患者与试验药物更匹配，减少不必要的变量干扰，提高临床试验成功率；再比如，作为临床试验设计助手，帮助研究团队优化试验设计，通过分析大量的相关数据，提供有关患者选择、临床试验阶段和标准化流程的建议，确保试验的科学性和可行性，减少不必要的误差和风险。</p><p></p><p>据聂再清教授介绍，目前ChatDD提供了三类服务方式：一是订阅服务，支持企业账户；二是API服务，支持高速推理服务，提供开发者培训；三是私有化部署，支持本地数据微调，定制场景方案。</p><p></p><h3>三级淬炼出千亿级生物医药行业大模型</h3><p></p><p></p><p>ChatDD的底层，基于的是水木分子千亿参数多模态<a href=\"https://xie.infoq.cn/article/7edc5aaa592a490f71b758299\">生物医药</a>\"对话大模型ChatDD-FM。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/db/dbde600079d32101cfb662330be99d95.png\" /></p><p></p><p>上图是ChatDD-FM多模态生物医药大模型的架构图：首先，对生物医药垂直领域的知识图谱、分子、蛋白质、单细胞测序、文本等多模态进行编码；然后，将各种不同模态对齐到统一的特征空间，进行模态融合、专业领域指令微调；最后，在产品端支撑ChatDD-BI、ChatDD-Discovery和ChatDD-Trail&nbsp;三大应用。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/ec/ecc9f2becb64d9eebae23b16ef3190cf.png\" /></p><p></p><p>水木分子首席技术官、联合创始人乔木博士强调，ChatDD-FM是一个灵活、可扩展的架构，在当下版本基础上，还可以持续增加其它不同模态。而对于用户而言，可以通过自然语言对话方式与大模型进行交互。其背后，是ChatDD-FM对数千篇中英文生物医药文献、千万级通用场景对话、数十万个工具调用指令集等高质量数据的预训练，以及指令微调和智能工具调用。</p><p></p><p>水木分子由AIR孵化，在今年6月份成立，主要专注于生物医药垂直行业大模型的研发与应用。而早在今年4月，聂再清教授团队就已经开源了生物医药版GPT&nbsp;BioMedGPT1.6B，从研究层面验证了将文献、分子、蛋白、测序、知识图谱等数据压缩到统一的多模态大模型框架内，可使模型具备“融会贯通”的能力，在分子性质预测、药物-靶点亲和力预测、性质预测、药物敏感性预测、分子-文本跨模态检索、分子-文本跨模态信息生成等多项任务上优于单一专用模型，从研究层面验证了技术可行性。</p><p></p><p>8月，水木分子又开源了全球首个可商用的百亿级参数规模多模态生物医药大模型BioMedGPT-10B。其中，首次提出了分子QA和蛋白质QA任务，给定特定分子/蛋白质，可以用自然语言回答相关功能、属性等问题，有效评估模型在自然语言和生物编码语言之间的翻译能力。</p><p></p><p>据聂再清教授介绍，虽然BioMedGPT已经实现商用，但由于是科研项目，所以使用的仍然是英文界面，中文对话能力较弱，因此在国内市场实现商用普及有限。这便是水木分子成立背后的原因之一。</p><p></p><p>“接下来，BioMedGPT&nbsp;仍然会继续往前推进，作为科研品牌继续开源。而此次ChatDD和ChatDD-FM的孵化，则是大模型都科研迈向产业化，是产学研结合的关键一步。”聂再清教授强调，“我们认为大模型未来必将成为&nbsp;AI&nbsp;时代的操作系统，就像我们PC时代的Windows，移动互联时代的Android、iOS。而现在我们正在做的生物医药大模型，未来在整个AI&nbsp;for&nbsp;science领域都有可能用上。对此，我们充满了期待。”</p><p></p><p>而现下，ChatDD和ChatDD-FM的发布，已然重新定义了医药研发模式，不仅可以提高研究人员的工作效率，还可以为研发新药提供更多的可能性。未来，随着技术的持续迭代革新，医药研发的效率和成功率将会得到显著提高，打破“三十定律”的“魔咒”指日可待。</p><p></p><p></p><blockquote>*注：“湿”实验指的是将待测样本利用实验室方法进行核酸提取、文库构建（包括片段化、富集、扩增等一系列过程）到完成上机测序的实验过程；“干”实验则是从得到下机数据开始，到完成生信分析和报告解读的整个过程。</blockquote><p></p>",
    "publish_time": "2023-09-26 10:15:56",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "欧伟杰博士：突破算力边界！YashanDB 实现理论与工程双重突围",
    "url": "https://www.infoq.cn/article/Bmx2CIoj4icEQgzeghdz",
    "summary": "<p>随着数字化进程的加速，数据处理的规模和速度需求持续攀升。传统数据库系统在处理大规模数据时，存在单表记录数不超过 500 万条的限制，这已成为业务发展的瓶颈。为了解决此问题，分布式数据库通过横向扩展来分担单节点的压力。然而，随着数据规模的增长，数据库节点的数量也会增加，这会导致成倍增长的运维问题和对 IT 运维工作的需求。</p><p></p><p>同时，移动互联网、智能设备、汽车和物联网终端的发展，对并发访问和响应时间提出了更高的要求。现有的解决方案通常基于独立的内存缓存来满足热点数据的读写需求，然而由于缓存容量有限且热点数据不在数据库中，导致无法参与统计分析，数据的价值没有得到充分利用，仍然存在优化空间。</p><p></p><p>除此之外，随着大数据应用场景的快速普及与创新业务的发展，传统的数据管理方案已愈发难以满足海量数据实时分析的需求。实时应用、高通量在线交易和实时分析等混合负载的场景成为业务的基本诉求。</p><p></p><p>面临这些新的挑战，我们认为有以下三个核心命题要去回答：</p><p></p><p>如何在不消耗大量算力资源的情况下，低成本地满足海量数据的计算要求？如何设计一个高效、易用的数据库系统来满足不同的业务诉求？如何避免差异化实现，高效构建一个统一行列存、混合负载的架构？</p><p></p><p>本文将从理论和工程两方面分享由“0”构建全自研数据库系统 YashanDB 的设计理念与背后思考，并试图回答上述的几个关键问题，与大家共同探讨面向未来数据库技术创新之道。</p><p></p><p></p><h1>有界理论打破大数据算力增长挑战</h1><p></p><p></p><p>关系代数理论诞生于上世纪 80 年代，为关系数据库系统奠定了基础。但是随着数据规模的不断增长，传统的数据库无法解决的问题越来越多。</p><p></p><p>因此，人们重新定义了大数据及其基于并行计算的解决方案。这种方案的核心理念是通过大量的计算资源来满足数据的计算需求。然而，计算资源的增长速度远远跟不上数据的增长速度，同时，数据库节点数量和运维复杂度也呈指数级增长，这成为大数据处理所面临的一项关键挑战。</p><p></p><p>但通过观察具体业务不难发现一个现象，绝大部分查询涉及的数据量与全量数据相比是微乎其微的，如果能针对查询找出一个特定的，包含所有正确结果的小数据集，那么就可以节省大部分针对无关数据的扫描和计算开销，这正是有界计算的出发点。</p><p></p><p>有界计算的关键挑战是如何避免数据扫描而找出查询相关的小数据集。首先需定义一个概念为“访问约束”，其意义为对于特定的 X 取值，其对应的 Y 的取值有且仅有 N 种可能，这里的 N 可理解为通过已知的 X 找到对应 Y 的边界。例如在知道某位同学对应班级的前提下，这位同学的 ID 取值不可能超过班级最大人数。</p><p></p><p>这种属性之间的语义在关系理论中并没有被识别和利用，下面我们通过一个简单的例子看下如何运用访问约束来解决查询问题，直观感受有界计算与传统方法的差异：我们想找出 2019 年 5 月份我朋友在 NYC 去过的餐馆的价位。</p><p></p><p>按传统方式需要将朋友关系表 friend 和就餐表 dine 进行连结后再通过餐馆信息表 cafe 找出其价格，但这样就涉及大量数据扫描和连结计算开销巨大，即使使用索引替代全表扫描也会因为随机 IO 使得提升有限。</p><p></p><p>而有界计算通过特定属性间的访问约束（Access Constraint），仅需要访问三个有限的小数据集，避免了大量无关数据之间的计算。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/da/ee/daca7e24a62d7e31a078b1ba6583b6ee.png\" /></p><p></p><p>例子中提到的访问约束是基于 YashanDB 列式存储引擎实现的。将特定 X 取值对应的 Y 连续存储，可以基于轻量化算法实现去重和压缩，并在计算时还原原始取值确保语义完整。用户执行查询时优化器根据已有访问约束判断能否实现查询加速，无需人工干预或修改 SQL 语句。与此同时，访问约束也不是一成不变的，对于持续变化的业务数据，可以在业务运行过程中不断刷新已有访问约束，我们发现其维护成本远低于物化视图。</p><p></p><p>有界计算适用于记录中存在大量重复信息的详单分析场景，其原型实现已在电信详单管理和北美航空记录分析两个真实场景中完成验证，最大加速效果可达到 10000 倍。基于有界计算可以大大降低大数据分析的算力要求，拓展数据库系统的能力边界。该理论也获得了 2018 年的 Royal Society Wolfson Research Merit Award（英国皇家学会沃夫森研究优秀奖）。</p><p></p><p></p><h1>自主技术架构：面向混合负载的存储与 SQL 技术</h1><p></p><p></p><p>随着通信和互联网技术的不断发展，业务对数据管理的实时性要求持续提升。传统数据库受制于软硬件处理能力限制，将交易型操作和分析型查询分而治之，带来了数据分析的滞后性和数据库运维上的复杂性。</p><p></p><p>对于新型业务而言更强调混合负载实时数据管理的能力，这也需要数据库系统在存储引擎到 SQL 引擎上采用新的技术与架构。下面我们将详细介绍 YashanDB 如何从混合存储及 SQL 执行两方面实现混合负载能力的。</p><p></p><p></p><h3>混合引擎架构</h3><p></p><p></p><p>为了兼顾高并发数据访问和实时数据分析两类截然不同的需求，YashanDB 在存储架构上大胆尝试多种数据组织形式。</p><p>首先是支持面向高并发短事务的行式存储，简称行表（Heap），将一条记录的多个字段连续存储在一起。而作为存储的最小单元，同一个数据块上存储了多条完整记录和对应事务信息，这种方式可以最小化数据访问的开销，并通过支持原地更新进一步降低数据修改的管理成本。</p><p></p><p>另一方面，为了管理海量数据并支持实时分析，YashanDB 还支持冷热分离的列式存储，简称列表（LSC, Large-scale Storage Columnar Table）。与行表最大的差异是，列表将不同记录的相同字段连续存储在一起。由于大部分查询仅用到记录中的部分字段，因此按字段连续存储可以避免整行读取，从而提高 IO 资源利用率。与此同时，同一字段存在重复取值，基于轻量化压缩算法可实现存储空间的成倍缩减。列表相较行表对于写入不太友好，因为一条记录写入可能要访问多个数据块，造成大量 Cache Miss 和额外 IO。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/f1/75/f159d710b6e0e8d5ecaec339c655e475.png\" /></p><p></p><p>值得一提的是，存储引擎的能力不仅是数据组织与管理，还包括事务、持久化等。YashanDB 对于上述两类数据组织均提供完整事务和持久化能力，使得针对快速变化数据的高性能分析不再高不可攀。</p><p></p><p>业界在实现行列混合存储方面仍存在一定的优化空间：采用读写存储的内部转换，为了避免数据变化对列存储数据的影响，需要预留数据量两倍的内存空间；如按副本方式分别管理 TP 和 AP 数据，虽然可以在资源上进行隔离，但引入了数据转化的延迟与开销。</p><p></p><p>YashanDB 提出了一份数据上的混合负载能力，在保证完成 ACID 能力的前提下，提供可更新列存数据存储，通过不同的 SQL 执行引擎来同时实现高通量事务处理和低时延复杂查询。其架构如下图所示，主要差异在于数据仅保存一份，所有已提交的变更都可以通过查询反映到结果集中。这里面包含了三个技术点：</p><p></p><p>支持快速更新和查询的列式存储组织，通过 In-place Update 解决数据变更导致的空间膨胀和无效数据回收问题；面向交易和分析负载的差异化需求，通过不同执行模型最大化资源利用率，火山模型支持低时延短事务，向量化模型支持全面扫描数据分析；细粒度配置的资源与调度管理，避免不同类型处理之间的资源争抢和固定配置带来的资源闲置，会话级配置结合业务特征灵活调整。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/14/41/14c330ac09ayy4eddc8c1fe679f32e41.png\" /></p><p></p><p></p><h3>SQL 引擎设计与关键优化</h3><p></p><p></p><p>对于 SQL 引擎而言，优化器和执行器对查询性能的影响最为显著。而优化器的复杂度取决于执行器有多少种不同的算子，每种算子代表了一种可能的访问路径。特定算子之间可以根据规则进行优化。</p><p></p><p>YashanDB 的 SQL 引擎为了达到极致性能，同时支持了行列两类算子分别满足低时延短事务和大数据量查询场景的差异化需求。因此优化器的实现挑战要高于传统数据库系统。这里列举了我们实现的三个关键能力：</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/40/3b/40269e4581yy73ebc8a701a4c2865b3b.png\" /></p><p></p><p>面向差异化代价模型的行列混合评估。针对行列算子建立独立的代码模型，在最优计划选择时考虑行转列或列转行的整体代价，并结合启发式算法提前排除不理想的备选计划，避免搜索空间过大问题。行列统一的并行优化框架。并行计算是 YashanDB 高性能查询重要的能力，而针对行列算子使用一套并行框架也能大大降低优化器的复杂度，避免大量访问路径需要根据算子类型进行差异化实现。这套框架的并行执行单位为 Pipeline，能够支持单算子的并行，在不同 Pipeline 之间需要通过 PX 算子进行数据的交换，PX 算子可以适用于单机和分布式两种场景下的不同交换策略。面向特定模型的动态优化规则。行列统一是 YashanDB 的架构目标，但在具体工程实现过程中由于算子实现难度各异，需要针对行列算子按照特殊规则进行调整。为了避免这类优化影响优化器基本框架，因此 YashanDB 优化器先生成不区分行列的通用计划，再执行前根据行列算子的特点进行动态优化调整。这其中包括部分列算子未实现的内置函数，都可以动态转为行算子来计算，同时提升了优化器的可维护性。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/80/ca/809710232d9b36bb1c93c45yy8638aca.png\" /></p><p></p><p>硬件配置：2288 虚拟机（16 核，160G 内存，3.4T SSD）</p><p>软件版本：OS(CentOS 7)，DB(YashanDB 22.2、Oracle 19C Inmemory 、Greenplum 6.17.1)</p><p>测试模型：TPC-H 100G 数据</p><p></p><p>总体来说，SQL 引擎的整体性能和架构的持续演进非常重要，而优化器作为关键能力，需要充分发挥各执行算子的优势，并减少差异化规则带来的实现复杂性。我们正在探索基于深度学习的查询优化，但目前面临冷启动和假阳性等挑战。</p><p></p><p></p><h1>深度兼容性和一键业务迁移</h1><p></p><p></p><p>作为一款面向企业用户的新型全自研数据库系统，YashanDB 需要考虑用户在切换到该系统时所面临的挑战：一方面是业务系统需要改造以适应新的数据库系统，另一方面是数据搬迁过程如何实现平滑可控。</p><p></p><p></p><h3>改造成本</h3><p></p><p></p><p>首先是改造成本，这主要是由于新老数据库在 SQL 语法 / 数据类型 / 存储过程等方面存在差异导致的。YashanDB 从设计之初就确定了 Oracle 全面兼容的目标，这里的全面不止包含 SQL 语法 / 语义、各类数据类型的处理差异，还包括复杂存储过程，触发器以及系统视图等高级能力。另外，我们还考虑到了资深 DBA 习惯使用的一系列运维工具的支持，如 AWR 和 RMAN 等。在对 Oracle 的兼容性设计中，每一个细节都需要反复论证和推敲，避免全盘照搬导致泥沙俱下，以下是一个 Oracle 的例子。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/46/34/46b3d357a11c7985d63177ef6a072934.png\" /></p><p></p><p>前两条语句结果证明在 Oracle 内核中，绑定参数没有同名加载机制，即使命名均为:B1，也都是按位置加载. 最后一条语句可以运行即证明并非所有场景都是按位置加载，猜测 Oracle 为了避免存储过程无法使用 GROUP BY 语句，对按位置加载的绑定参数原则，做了特殊“优化”，这类“优化”在语义表达上会让用户困惑。</p><p></p><p></p><h3>数据迁移</h3><p></p><p></p><p>其次是数据迁移。数据迁移的目标不仅仅是简单的数据导入 / 导出，而是基于业务设计的全自动化处理。YashanDB 的自动化迁移平台具备业务兼容性评估、一键数据迁移和数据完整性校验等功能。</p><p></p><p>业务兼容性评估为迁移计划提供必要的输入，识别当前数据库系统无法兼容的对象和 SQL 语句，并给出改造建议；一键数据迁移可以满足存量数据搬迁和实时增量同步两类需求，目前支持Oracle/MySQL/PostgreSQL 数据库系统；数据完整性校验可以避免数据迁移在异常情况下的数据丢失 / 错误，自动识别并可在人工指导下自动修补错失数据，从而大大提升迁移的可靠性。</p><p></p><p></p><h3>写在最后</h3><p></p><p></p><p>随着数据规模的爆发式增长，我们创新性地将有界计算理论转化系统能力，在不消耗大量算力资源的情况下能够低成本地满足海量数据的计算要求。</p><p></p><p>同时随着数字化转型的持续深入, 很多客户都提出了数据驱动的实时业务决策，这要求数据库能够满足混合负载，兼顾高通量数据变更和实时查询，因此我们设计了一套统一行列存、混合负载的架构。同时充分考虑用户在切换到该系统时所面临的挑战，实现了高度的商业数据库兼容性，极大地降低了应用改造迁移成本。</p><p></p><p>当然我们不仅要考虑当前的需求，还要为未来的需求做好准备。那随着 AI 等技术的快速发展，我们认为智能化机遇将会给数据库带来重大变革：</p><p></p><p>首先，面向大模型场景，数据库管理的对象已经不再是关系表，而是 Embeddings 向量，这类对象的计算方式更复杂，且具有不可解释性，前景非常广阔。另一方面，机器学习也可以将传统数据库调优这类只有资深 DBA 才能搞定的任务变成固定的模型，大大降低了数据库的运维门槛；此外，NLP2SQL 在大模型的赋能下让更多用户可以使用大数据分析。</p><p></p><p>未来，我们将持续探索更多创新技术的可行性和落地方案，拓宽数据库应用的广度和深度，为更多企业的数字化转型提供有力支撑。</p><p></p><p>作者介绍</p><p></p><p>欧伟杰，武汉大学博士，深圳计算科学研究院 YashanDB 研发总监。10 年以上数据库内核设计与开发经验，多篇顶级会议论文及技术专利。作为创始成员之一加入 YashanDB 团队，负责 YashanDB 的架构设计与内核研发，从零到一打造全自研数据库产品在多行业落地应用。</p><p></p><p>关于 FCon</p><p></p><p>FCon 上海 2023，相约 11 月！现在购票，前 100 人可享 5 折特惠购票，咨询购票请联系：17310043226（微信同手机号）。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/a8/a8ec7f7fb25c7949931b2b8a5deffddd.png\" /></p><p></p>",
    "publish_time": "2023-09-26 11:02:36",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "答记者问：从 PICO 视角，看 XR 行业发展",
    "url": "https://www.infoq.cn/article/ARwQIt6s0vBAwArADjfW",
    "summary": "<p></p><blockquote>接受采访嘉宾：马杰思-PICO OS产品负责人郭文山-PICO 中国游戏商务负责人顾知-PICO 中国非游商务经理李卓然-PICO 消费者市场部内容团队市场经理熊俊杰-PICO 视频内容负责人</blockquote><p></p><p></p><p>“PICO 2023 首届 XR 开发者挑战赛”报名链接：</p><p><a href=\"https://www.picoxr.com/cn/2023picodevjam/#/introduce?trackingFlag=EkWdMubc\">https://www.picoxr.com/cn/2023picodevjam/#/introduce?trackingFlag=EkWdMubc</a>\"</p><p></p><h4>问题 1： 请问随着应用达到 500 家，您在这几年发展过程中，应用增加和用户活跃度是否产生变化，有关键节点和相关曲线的描述吗？</h4><p></p><p></p><p>郭文山：我们内部看到两个维度，关注用户留存和用户活跃度提升的影响因素。当前的 500 多款应用供给不足以满足每个用户的需求。我们认为关键不在于绝对数量，而是长期来看，而是满足不同类型用户品味的内容。其次可以看购买设备后第一个月购买几款内容，这也是很重要的指标。我们内部发现，用户在使用设备的第一个月能找到 3- 4 款最适合自己的内容，会显著提高留存率。</p><p></p><h4>问题 2： 预计应用达到什么量级时，生态能有一个比较大的超级爆发？</h4><p></p><p></p><p>郭文山： 这个问题也是我两年前加入 <a href=\"https://www.infoq.cn/news/EjqbmPdv0fSvUkWqgZ2k\">PICO </a>\"时就在探讨的。我认为关键是提供优质、破圈的内容。比如，如果推出像“节奏光剑”这样的产品或者类似“健身环”的破圈产品，可能会快速推动行业进入下一个阶段。我们期待开发者生态中能够结合技术发展趋势，去发现简单、易玩的交互方式，这样的内容有可能成为真正的大作，帮助行业走向下一个阶段。</p><p></p><h4>问题 3： 关于技术侧，随着苹果和国内一些新品发布，伴随 AI 技术的发展，行业对 AR 方向更加肯定。想请问我们对 VR、AR 或 MR 未来格局趋势的看法，会坚定 VR 路线还是会有相应调整？</h4><p></p><p></p><p>马杰思：从一开始的讨论就可以看出，行业发展趋势明显是从 VR 向 XR 发展，从沉浸式虚拟世界向能赋能更多现实世界的 MR 能力发展。因此，我们采取了 VR+MR 的策略，设备可以无缝切换 VR 和 MR 状态。这种技术的优势在于一个设备可以同时满足 VR 和 MR 的需求。我们会持续进行这方面的发展，将设备设计成既能满足虚拟场景需求又能满足现实场景需求的 VR+MR 设备。同时，在 MR 方面我们分享了很多关于环境感知的技术，这是一个开始，未来我们将在这方面做更多的创新和发展。</p><p></p><h4>问题 4： 我们注意到硬件产品迭代速度非常快，每代产品的技术和创新点都不同。一些开发者担心如果现在开发完整产品可能不适应未来产品特性，选择先制作一些 Demo 并放在平台上。另外，尽管产品迭代提升，我们很难看到高质量的产品内容展示，只能看到一些创新的 Demo，但却没有看到后续版本的更新。您如何看待这种情况，认为在硬件产品迭代和内容创新适配方面，包括版本更新上，如何取得较好的平衡？</h4><p></p><p></p><p>马杰思： 这个问题可以分别由我和文山来回答。首先关于兼容性问题，就我们 PICO 产品线而言，你不会看到这种情况。我们现在为 PICO 4 或 PICO Neo 3 开发的产品，肯定也能在未来的产品上运行。例如，我们现在使用的 SDK 2.3.0 版本，如果用于开发 MR 游戏或应用，它在我们下一代产品上肯定也能完美运行，所以不存在你所担心的问题。但是在不同厂商之间，是否存在生态分裂需要开发者适配的情况，这确实存在。当开发者要跨足多个不同硬件时，他们需要去做适配的准备。</p><p></p><p>郭文山：接着来谈谈内容更新的问题。确实，有些开发者会快速制作 Demo 上线，但后续却没有更新。为什么会出现这种情况呢？事实上，中国的 XR 开发者生态规模相对较小，大多数是小团队制作，面临经营资金的压力。当他们上线一个 Demo 时，他们首先验证的是什么？并不是期望立刻爆红成为热门，很多开发者也知道这样的机会不是轻松得到的。但他们仍然要尝试，这也是我理解XR开发者生态的难处，这需要克服困难，他们要拿出第一版作品。他们先测试核心玩法是否奏效，这对于大多数开发者和同行来说是内容制作阶段的一种经历。只有少数开发者可能考虑得更长远，构思不同版本，如半年或一年后的迭代版本。然后会出现这样一种情况，有可能刚上线一个版本，你可能看到他只有 10 个内容，但实际规划可能是 50 个。然而，在第一天上线 10 个内容后，他发现核心玩法未能满足用户需求，就会撤退，进入下一阶段，打磨自己的玩法。我尝试<a href=\"https://www.infoq.cn/article/Vsc9cCloJx9mCOTyURGT\">理解</a>\"为什么我们会注意到和观察到这种现象，这也是行业发展的一种规律。</p><p></p><h4>问题 5： 除了开发者大赛，还有哪些方面可以完善我们的内容建设？对于生活教育、培训、游戏、体育等方面，目前我们更侧重于哪一个？</h4><p></p><p></p><p>郭文山：我们认为需要多个方面共同努力，而不是单一侧重于某个方面。首先，对于 PICO 来说，最重要的是确保硬件产品的 OS 和 SDK 强大可靠，这是我们的首要任务。我们要把 PICO 设备在中国和全球推广好，这是最关键的。我们也在和开发者交流，了解他们的期待。大部分开发者的第一反应是我们要推广 PICO 设备，这对我们的硬件、软件 OS 至关重要。此外，我们也要注重内容生态。我们正在尝试多种方式，包括成立专门团队进行发行，解决开发者资源不足的问题。我们也推出了 Beta 版本的快速体验通道，并举办了社区活动。我们认为不能依赖于单一点，我们需要系统地探索哪个环节对开发者最重要，这也需要和开发者共同讨论，因为每个开发者面临的困难都不同。我们希望能根据不同的情况，提供组合服务，以满足大家的需求。</p><p></p><p>顾知：针对不同行业的适用情况也不同。例如，视频行业可能已经比较成熟，而新兴领域如汽车发布可能需要更多的行业和企业付费。创意工具可以适用于办公场景、线下培训、会展等多个场景。我们还可以探索从沉浸式到虚拟现实的新想法，结合大环境和大空间，这是一个有创意的领域。从 2D 移动端到 VR 入口端，可以尝试多种使用情况。我们也有“抢先体验专区”，提供一种轻松快捷的尝试方式，以及今天的挑战赛等，让开发者可以尝试新的想法。我们鼓励大家在不同行业想象和尝试，从 2D 到 VR，尝试多种入口端，以满足不同用户的需求。</p><p></p><h4>问题 6： 之前有媒体提及 PICO 在内容方面要追赶内容数量和质量，并指出可能受到海外同行的压力。对此，PICO 是如何看待这种评价？</h4><p></p><p></p><p>郭文山：我们并不是以同行之间的压力为考量。我们更关注用户的需求和视角。当用户决定花费 400 美金购买 PICO 时，他们综合考虑了很多因素，不仅仅是硬件配置和系统体验的流畅程度，也包括是否有丰富的内容。因此，我们认为从用户视角出发，内容工作和内容生态的建设非常重要。</p><p></p><p>从绝对数量上看，确实在去年的时间点，我们去年应用数量确实落后于同行不少，但这不是我们的压力来源，我们真正面临的压力来自于用户。我们感受到了我们还需要在满足用户需求方面，做出更大努力。这种压力将持续存在，不仅是今天，也会延续到下一个阶段。因此，我们将持续努力以满足用户的多元化需求。竞争考虑对我们来说是次要的，我们更关注如何为我们的<a href=\"https://xie.infoq.cn/article/40e1258dc998d9c7ce6380c8a\">客户</a>\"提供优质服务。</p><p></p><h4>问题 7： 对于非游戏类开发者，PICO 这次比赛侧重于哪些方面，有哪些机会？</h4><p></p><p></p><p>李卓然：PICO 这次比赛更加侧重非游戏类开发者。在中国，XR 游戏开发者圈子相对较小，而面向未来的技术趋势和交互提出了新的可能性。原本从事手机、安卓、iOS 等开发的人员也有机会进入 XR 这个领域。这次 XR 开发者挑战赛的重点是不要求开发者制作出可运行的实际 demo，也鼓励传统行业以及 ToB 领域的开发者参与。比赛规则还强调更开放的场景设置，降低比赛门槛，拉动不同背景的开发者参与。同时，比赛设置了非游戏赛道奖励，直接激励非游戏内容的产出。</p><p></p><h4>问题 8： 未来，PICO将如何加强与开发者之间的联系，促进生态的发展？</h4><p></p><p></p><p>郭文山：PICO 将采取多种方式加强与开发者之间的联系，推动生态的发展。首先，技术布道是重要的一方面，通过与垂直领域的媒体合作，向开发者群体介绍产品 SDK、技术进展和最新可能性。这将提供开发者更多了解 PICO 技术方面的机会。</p><p></p><p>其次，PICO 重视社区工作，包括开发者社区的建设。他们鼓励开发者利用抢先体验端等平台，建立与用户的社区，分享经验、交流技术。PICO 还会有计划地组织社区交流活动，分享最佳实践，例如通过专访形式将实践经验传播给更多同行。</p><p></p><p>总的来说，PICO 将通过技术布道、社区建设和合作活动等多种方式，与开发者建立紧密联系，促进XR生态的健康发展。</p><p></p><h4>问题 9： 对于开发者来说，在未来 2 至 3 年的市场情况中，消费者对哪种内容和技术更感兴趣？从 PICO 的角度，对开发者开发哪些内容有推荐？</h4><p></p><p></p><p>郭文山：针对这个问题，我们首先要考虑到两年的时间维度内的技术限制。XR行业长期愿景可能是下一代计算终端，但在短期内（两年）技术的限制可能会对开发者创意造成限制。例如，手势自定义的可能性在两年内可能受到技术的限制，比如你只能基于有限的手势去做组合，这是一种限制。</p><p></p><p>要回答这个问题，我们需要考虑两年的时间跨度，但不仅仅从 PICO 的角度来看，还要考虑整个行业的技术发展。共识是从显示方面来看，在未来两年内可能会发生重要转折。从 VR 到 VR 加 MR 的可能性，这可能是因为屏幕和前置摄像头发生了变化，我们觉得这个方向一定有可能产生非常有趣的新内容。交互方面则是杰思提到的更加多元的人机交互，多模态的融合交互等是会有很多机会。</p><p></p><p>具体内容的创新和发展会依赖于生态合作伙伴的创意和开发。例如，可以想象在新一代设备中，以前玩的游戏像 Pokémon Go，你可以使用新的裸手技术去抓小怪兽，可能会有更自然的交互方式，比如裸手扔球。我们认为，XR原生要抓住技术趋势，创新出吸引消费者的内容，这肯定有可能实现，但是具体是哪家公司实现，我们无法确定。</p><p></p><h4>问题 10： 未来是否会和开发者签订一些独占协议？如果会，独占内容和非独占内容的比例会如何控制？ 如果可能会独占，独占的内容是否会进行自研？是否会为多平台开发者提供适配 PICO 平台的小工具？</h4><p></p><p></p><p>郭文山：我们一直在思考独占的问题，特别是在加入字节后。独占是否关键，是否能成为用户购买的理由，是我们需要思考的重要问题。当前行业的主要矛盾是行业仍处于早期阶段，整个行业的出货量较小，应用生态中很有人没有盈利。因此，对于绝大多数开发者来说，独占并不是一个好的选择，特别是对于多人联机类的内容。独占会使他们失去与其他开发者合作的机会，让用户失去获得更优秀的游戏体验的可能性。对于独占，我们内部非常谨慎和克制。与此同时，我们更强调开放，我们希望每个品类都有一大批第三方开发者贡献创意。</p><p></p><p>对于自研，我们认为自研是一个很好的方向。举个例子，我们推出了全身动捕的新 feature（技术特性），我们可能会在前沿领域进行自研，前进一步，做探索类似“闪韵灵境”（全身动捕类音游）这样的玩法。但我们的目标并非自研，而是通过自研打造、演示实践案例，并在后续开放实践经验。我们希望通过开放合作的方式推动行业进步。</p><p></p><p>马杰思：对于多平台开发者，我们已经推动了一些行业标准，比如 OpenXR 标准。我们积极参与 OpenXR 的制定，以便开发者基于这个标准开发游戏，从而增强游戏的可移植性。 PICO 是 OpenXR 的贡献者之一，我们会与 OpenXR 成员一起努力，建设好 OpenXR 生态，使开发者能更容易地将内容移植到不同平台上。</p><p></p><h4>问题 11： 请问关于三体VR项目，能否透露一下上线日期以及开发进展情况？</h4><p></p><p></p><p>熊俊杰： 三体 VR 目前正在紧锣密鼓地开发进行中，但由于项目内部保密要求，暂时无法公布太多细节。但可以分享的一点是，整个开发的进展符合我们的预期，并且我们会加快开发进度，尽早与大家见面。</p><p></p><h4>问题 12： 近半年 PICO 是否倾向引入或自研人文历史、自然探索等类型的内容？</h4><p></p><p></p><p>熊俊杰：PICO 在视频和直播方向探索的范围是相当广泛的。除了人文历史和自然探索等内容外，我们也探索了诸如互动游戏和互动剧等内容，比如“探灵”和“我的 48 次心动”。我们的主要目标是探索创新技术如何服务内容创作，尤其在行业早期，探索行业的创新方向。</p><p></p><p>我们非常关注 PICO 硬件性能和软件能力，如8K清晰度、空间音频应用、六自由度互动能力、宽频马达和面部追踪技术等，以更好地服务内容创作。目前，我们已经与全球 30 多个机构合作，持续开发各种创新内容，包括视频和直播。在直播方向，我们合作了体育赛事、电竞、演唱会等多种领域，并将继续在MR方向探索创新，如如何更好地结合MR和视频，以及更自然的交互方式等。</p><p></p><h4>问题 13： 我是 PICO 的用户，我观察到 PICO 的内容在不断增加，也感觉到 PICO 的进步很大。我想了解一下，PICO 的设备已经卖出去多少，以及用户的活跃情况如何？</h4><p></p><p></p><p>郭文山：关于 PICO 活跃用户的数据我们不方便直接透露，但可以大概说明一下全球 VR 行业活跃情况，行业维度看 VR 用户活跃水平可以大致理解为与游戏主机相当，游戏主机的用户平均每月活跃大约在 5-8 次左右。在当前硬件和内容情况下，这是一个相当大的行业性挑战。提高活跃水平需要更多技术突破和内容创新，我们相信 PICO 可能略优于游戏主机，因为我们之前的调研显示很多 PICO 用户也是游戏主机的用户。</p><p></p><h4>问题 14： PICO 平台上有 500 多款应用，可以分享一下这些应用背后开发者的背景以及开发者群体的画像吗？</h4><p></p><p></p><p>郭文山：在这 500 多款应用中，大约有 1/5 由中国开发者开发的。中国开发者的画像可以大致分为几类。首先是热爱 VR 技术的游戏开发者，他们可能在 2015 年和 2016 年第一波 VR 时代就已经开始了。他们有游戏研发背景，一部分持续在做 To C（面向消费者）的产品，一部分可能转向偏向 To B（面向企业）的项目。第二类是创业者，特别是在 Meta、苹果等公司的号召下，有创业经验的人开始涌入 XR 行业。他们对新技术、新趋势敏感，有可能并非来自 XR 行业。第三类是来自行业的开发者，比如曾经做 2D 应用的公司，像爱奇艺、哔哩哔哩等大公司，也是 PICO 的重要合作伙伴。</p><p></p><h4>问题 15： 我注意到 PICO 平台上的视频应用大多数都是平台类应用，比如bilibili、爱奇艺，以及一些工具类应用。在 VR 平台上，我很少看到综合性、现代化、更软件化的视频应用，像抖音这样的综合性应用。PICO 有没有意向去引导或建议开发者往这个方向去探索或开发更新的视频软件形式？</h4><p></p><p></p><p>熊俊杰：在 VR 和 XR 这个全新媒介下，创作有着基本属性，比如空间性和互动性。这与传统视频以摄像头方式连接的方式有很大不同。互动性使视频和游戏的边界变得模糊，内容可能以 APK 的格式存在。PICO 视频聚合应用虽然以视频为主，但实际上也支持很多以 APK 格式存在的创新类应用。这种特点是 PICO 的优势之一。PICO 能够在 PICO 视频和应用商店两个平台上分发这些创新应用，为开发者提供更多流量。开发者可以选择不同平台上的变现模式。对于以 APK 格式存在的创新内容和内容创作者来说，同样也是一个优势。 PICO 视频也支持很多创作者以 APK 的方式存在，这些创作往往是相对创新的格式，介于游戏和视频之间，例如一些创新的 VR 体验应用。 PICO 通过支持这样的应用方向，持续探索和创新。</p><p></p><p>马杰思补充：作为消费者，我觉得开发者追求迅速回款和维持团队运营的需求与用户更希望看到更多创新之间存在冲突。目前，我觉得 VR 应用领域存在同质化问题，尤其是在 VR 游戏方面，比如大量的射击、汽车和球类游戏，这些可能是因为这些类型相对快速开发、成熟。在这种情况下，我们应该如何避免同质化？我们可以引导开发者利用现有的新技术，如交互，以影响开发方向，而不仅仅是推动开发更多同质化的游戏。</p><p></p><p>从技术的角度来看，尽管有新技术的支持，但人们可能仍然喜欢做枪、车和球类游戏，尽管这些游戏可能是新的枪、车和球。消费者可能不一定非要追求与枪、车和球不同的体验，但他们可能想要一种独特的体验，一种与传统不同的枪、车和球。新技术，特别是与 MR 相关的技术和人机交互相关的技术，肯定能够对XR内容生态产生影响。在过去十年间，VR 的体验基本上是通过六自由度手柄进行设计，但在过去一两年间，这种情况开始改变，不再局限于 VR 体验，还可以是 MR 体验，也不再局限于六自由度手柄，可以使用手部或其他体感追踪器。这种变化确实发生在最近一两年，这也是为什么我认为会有一些新趋势出现的原因。因此，我相信会出现一些不同类型的应用和游戏，可能不是强制性的，但会有很多新的应用和游戏。</p><p></p><p>李卓然补充：在制定赛制规划时，我们一直在思考是否应该强制开发者朝着更创新的方向发展。我们始终秉持着更加开放的态度，不强迫开发者朝特定方向发展。但是我们确实在评分规则和奖励设置上向创新性应用方向倾斜，特别是对与MR相关的赛道提供特殊支持。</p><p></p><p>首先，在评分方面，我们基于我们在八月下旬推出的 SDK 2.0，这个 SDK 关注 MR 相关技术。在评分中，我们明确表示，如果开发者更多地应用这些新技术，他们将在评分中获得更高的分数。其次，在奖项设置方面，我们特别设置了创新类的应用内容奖项，以及针对 MR 赛道和手势赛道的奖项。我们希望通过这些奖项的设立，吸引开发者更多地朝着这些创新方向进行内容开发。</p>",
    "publish_time": "2023-09-26 14:55:17",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "深度走访，核电站如何做数字化转型｜《行知数字中国》完整版",
    "url": "https://www.infoq.cn/article/ajsZRMKFoilCOYkHKTIq",
    "summary": "<p>核电，作为技术密集、资金密集且对安全有着至高要求的重资产行业，正面临着数字化转型的巨大挑战。这种挑战源于核电行业本身的高度复杂性。</p>\n<p>该视频为《行知数字中国》第二季第三期的完整版。本期我们走进宁德核电基地，探寻在确保安全与推动创新不可或缺的双重前提下，如何克服庞大而错综复杂的核电站的数字化难题。</p>\n<p>相关文章延展阅读：<a href=\"https://www.infoq.cn/article/zvjR1E1wzUVeLbseYJ4r\">《既要安全、又要创新，庞大且复杂的核电站数字化怎么破？》</a></p>\n<p>如果对《行知数字中国》栏目或者更多企业数字化转型案例感兴趣，欢迎关注「<strong>InfoQ数字化经纬</strong>」公众号，我们将持续为您推送更多、更优质的数字化案例内容和线上线下活动。</p>",
    "publish_time": "2023-09-26 15:46:25",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "和德爷一起 6DoF 互动探险，火山引擎空间重建和虚实融合技术",
    "url": "https://www.infoq.cn/article/Eh2tQrXjDfuagCeWCAhO",
    "summary": "<p></p><blockquote>《跟着德爷闯东非》是 Pico 一款全新的 6DoF 互动纪录片。主角由在全球拥有 530 万粉丝的明星探险家德爷（Edward James Stafford）担任。观众以第一视角摄影师的身份陪伴德爷一起冒险，近距离观察野生动物，体验非洲大草原的野外生存之旅。</blockquote><p></p><p></p><p>与行业内常见的不具备互动性的 3DoF 实拍纪录片以及不具备写实性的游戏引擎制作的 6DoF 纪录片不同，《跟着德爷闯东非》纪录片的拍摄采用空间重建技术及虚实融合技术，兼顾实拍和虚拟互动，以全新的 6DoF 互动体验，增强了 VR 内容的沉浸性和交互性，让用户跟随德爷的脚步沉浸式体验从城市“跃入”荒野的快感。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/56/68/560d014cbcfef595ec7899b19a3f2368.gif\" /></p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/9d/d9/9d9c2c4fbc8cd9573f1faf6c87cdc3d9.gif\" /></p><p></p><p></p><h2>全新VR空间互动性的挑战和难点</h2><p></p><p></p><p>传统 VR 实拍视频的交互通常采用不同选项触发不同结局的 AB 型互动方式，而《跟着德爷闯东非》想要实现的是全新的 VR 空间互动，用户可以抓起虚拟世界中的物体完成任务，比如和德爷一起钻木取火，也可以在场景中自由走动，在非洲草原和德爷一起追捕猎杀珍珠鸡，实现全新的交互并达到高沉浸感，突破传统视频的界限。</p><p></p><p>而想要实现全新的交互和体验高沉浸感，需要做到：</p><p>实际拍摄的 VR 视频和用于互动的场景、物品具备高度一致性，包含几何结构、纹理色彩及光影的一致性，这对于空间重建技术提出了很高的要求，需要做到高精度、高质量、真实感建模，超写实数字复原空间场景，让用户感受到原汁原味的非洲荒野。用户在体验中，虚拟元素与实际场景相互交织，让用户在场景中难以区分哪些是真实的，哪些是虚拟的，达到了最佳的体验效果。这就要求无缝虚实融合技术，需要对重建的数字素材和实拍的视频素材进行像素级配准，这样用户才能够自然沉浸的地在场景中和德爷一起探索非洲，并从实拍 3DoF 视频中德爷手里顺利接过数字重建的 6DoF 互动道具。</p><p></p><p></p><h2>空间重建，复原现实世界</h2><p></p><p></p><p>空间重建技术能够复原现实世界的场景和物品并转化为数字资产，是计算机视觉和摄影测量中的重要研究课题，也在智慧城市、虚拟现实、数字导航与数字遗产保护等方面有着重要的应用。</p><p></p><p>火山引擎多媒体实验室团队自研改进 SFM 算法框架，实现高精度的场景稀疏重建及图像定位。</p><p></p><blockquote>针对特征点提取、匹配算法，通过结合传统特征与深度学习方法，算法在大视角/尺度变化、暗光、弱纹理、运动模糊等多种挑战场景下仍能有效提取足量稳定的特征；通过将特征点纳入自注意力和交叉注意力网络，结合多源传感器输入检索全局最优图像特征匹配，使得算法即使在空地跨视角、鱼眼/针孔/全景跨相机等复杂数据输入的情况下，实现建图完整度、成功率均达到 100%。同时，开发支持多相机系统、多相机模型光束法平差优化算法，同时也兼容其他不同传感器的联合重建，实现高精度、多模态的位姿估计。</blockquote><p></p><p></p><p>在稀疏重建算法之后，需要进行稠密算法重建。</p><p></p><blockquote>火山引擎多媒体实验室通过立体视觉 (Multiple View Stereo，简称 MVS)技术将二维图像信息转化为三维点云信息。团队自研基于多目立体视觉及全景图的深度估计算法，通过神经网络进行稠密深度估计，在野外大场景环境获得高精度的场景稠密几何测量。获得点云信息后，进行点云去噪和补全，并通过点云配准实现场景几何一致性。最后，通过基于 TSDF 和图像语义信息的点云融合策略，进一步滤除噪声，生成更加平滑一致的完整场景点云。</blockquote><p></p><p></p><p>获得场景点云后，进行 Mesh 重建。</p><p></p><blockquote>火山引擎多媒体实验室自研多种网格优化算法，实现网格平滑、去噪、简化和补洞，获得更加精细、完整的高质量网格模型。得益于图像处理期间高精度的相机位姿估计以及图像超分等画质优化，结合自研贴图算法，获得更高清、拼缝更少的高质量纹理贴图。同时通过纹理重打包算法优化，实现更高的纹理利用率，降低存储资源浪费，提升纹理有效分辨率。</blockquote><p></p><p></p><p></p><p></p><p>目前，<a href=\"https://www.infoq.cn/article/Rx45QcxHI4zZCfMR5r8J\">火山引擎视频云</a>\"平台具备自动化空间建模链路，助力大场景重建，可支持采集 RGBD/RGB 数据（无人机、手持采集等）自动化上传云平台，2-4 小时后自动产出建模结果，建模精度可达1cm～2cm。同时，火山引擎视频云的云渲染可视化系统，联合自研动态传输算法，可实现高度真实感的模型渲染。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/02/02b37e1b606348e6ea19f8e85833480f.png\" /></p><p>图：火山引擎视频云三维重建平台</p><p></p><p><a href=\"https://www.infoq.cn/article/Vsc9cCloJx9mCOTyURGT\">火山引擎</a>\"多媒体实验室将神经辐射场技术（NeRF）与自研大场景建模技术相结合，研发行业领先的大场景光场重建方案，实现高度真实感（psnr&gt;30)的场景重建、复现及后编辑。</p><p></p><p>在具体实践的场景中，动态物体会使NeRF重建出现伪影，借助自研动静态分割、影子检测、inpainting等算法，对场景中和几何不一致的区域进行提取、修复。同时借助自研高精度SFM算法框架，对场景进行高精度的几何重建，包括相机参数估计以及稀疏、稠密点云生成。另外，对场景进行拆分以减小单次训练资源消耗，并可做分布式训练、维护。在神经辐射场训练过程中，针对室外无边界大场景，团队通过优化策略以提升该场景下的新视角生成效果，比如，通过在训练中同时优化位姿提高重建精度、基于哈希编码的层次化表达提升模型训练速度、借助外观编码提升不同时间采集场景的外观一致性、借助mvs稠密深度信息提升几何精度等。</p><p></p><p>以团队同毫末智行合作为例，完成单路采集以及多路合并的NeRF重建，相关成果已在毫末AI Day发布。  </p><p></p><p></p><p></p><p></p><p></p><h2>虚实融合，提升用户体验</h2><p></p><p></p><p>为提升用户沉浸式体验，火山引擎多媒体实验室自研虚实融合技术，将环境实拍全景图与场景模型进行对齐、融合。团队利用先进的人工智能技术，建立全景图图像特征与模型关键点的匹配关系，通过 PnP 算法以及光束法平差算法将全景图注册至场景模型坐标系，实现尺度、位置的统一，从而实现模型渲染与实拍全景视频渲染的统一，达到虚实融合的效果。</p><p></p><p>同时，为扩大用户体验的自由度，<a href=\"https://www.infoq.cn/article/qC55OH6f6852hFjlZ3o8\">团队</a>\"针对该场景自研非球面天空盒渲染，克服传统的球面全景图渲染仅在图像采集中心视觉一致的缺陷，进一步提升实拍全景图渲染模型与地形模型的匹配程度，以实现更大运动范围的视觉一致性，进一步提升沉浸式体验。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/ec/ec236d31adc57de0cf0de1c9245c5715.png\" /></p><p>图：虚实效果对比示例</p><p></p><p></p><p></p><p></p><p>以上2个视频：6DoF互动漫游</p><p></p><h2>物品重建，高精度还原细节</h2><p></p><p></p><p>在《跟着德爷闯东非》互动纪录片中，会有用户虚拟体验探险剧情的桥段，例如钻木取火，木棍训蛇等。为了带来真实的体验，道具往往是在实际拍摄过程中就地取材，有细长的树枝，薄薄的小刀，还有形态复杂的篝火堆。这些道具的重建本身是比较有挑战的，再加上整个拍摄过程比较紧张，留给扫描的时间并不充裕。为此，火山引擎视频云团队沉淀出一套采集方便，操作简单，能还原各类复杂物品的重建系统。</p><p></p><p>为了重建形状比较复杂的道具（例如狭长的木棍、锋利的小刀）。火山引擎视频云采用符号距离场（Signed Distance Fields，简称 SDF）的技术方案来表示三维物体，结合深度学习的方法克服了以上重建难点。对于如何监督神经网络使其准确地拟合该 SDF，火山引擎视频云先用运动恢复结构（Structure from Motion，简称 SfM）算法，精确计算拍摄图像的相机姿态，再利用可微渲染的方法将 SDF 所表示的空间信息渲染到图像上，把渲染得到的图像和该视角下采集的图像做比较，不断优化神经网络，使 SDF 在各个采集视角下的渲染结果尽可能与实际采集的图像一致。为了进一步提高重建精细度，在优化 SDF 的时候加入稀疏重建得到的三维点做约束，能更好的还原物体的细节特征。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/3b/3b8021233a9722a127a927c05e72f752.jpeg\" /></p><p>图：道具重建效果展示</p><p></p><h2>交互技术，让玩法更丰富</h2><p></p><p></p><p>采用虚实融合技术可以构造由空间重建模型和实拍 360°VR 视频两部分构成的 6DoF 互动场景，同时在《跟着德爷闯东非》项目中，多媒体实验室也实现了终端上的交互技术，同内容团队一起创造出了很多有创意性的虚实结合的玩法。</p><p></p><h4>拍照功能</h4><p></p><p>使用离屏相机管道，把从全景视频球上投影出的针孔 2D 图像重新贴在玩家手持的相机模型上，以实现出玩家可以对环境中任意角度拍照的玩法。</p><p><img src=\"https://static001.infoq.cn/resource/image/3a/a4/3a8483c3477e022edf09dcce6ayya5a4.gif\" /></p><p></p><p><img src=\"https://static001.geekbang.org/infoq/5c/5cca054c1d8e6fe07db04816dd5488ee.gif\" /></p><p>图：拍照功能示例</p><p></p><h4>物品交互功能</h4><p></p><p>火山引擎多媒体实验室可以估计 VR 视频中的深度信息，结合 3D 虚拟空间中的虚拟物体的位置信息，计算出全景视频球上指定视频元素，对应于玩家在真实的 3D 空间下的位置。从而，实现视频画面上真实物品转换到玩家可交互虚拟物品模型的无缝转换的玩法。</p><p></p><p><img src=\"https://static001.infoq.cn/resource/image/50/ea/50a972ff746593f453228a90610993ea.gif\" /></p><p>图：物品交互功能示例</p><p></p><h2>虚实融合技术的广阔应用</h2><p></p><p></p><p>虚实融合技术目前正处于快速发展的阶段，在众多领域中展现出广阔的应用前景。如游戏、教育和医疗等领域，已开始积极探索虚实融合技术的应用，并取得了不错的成绩：</p><p></p><p>在游戏领域，虚实融合技术赋予了游戏开发者更多创造力和想象力的空间。通过将虚拟元素与真实世界相结合，游戏能够提供更加沉浸式和交互式的体验。玩家可以与虚拟角色和游戏环境进行实时互动，增强了游戏的娱乐性和参与感。</p><p></p><p>在教育领域，也可以看到虚实融合技术的巨大潜力。通过将虚拟内容融入到教学场景中，学生可以以更加生动和直观的方式进行学习，提高学习效果和兴趣。虚实融合技术可以为学生提供与实物互动的机会，使他们能够亲身体验和理解抽象概念，促进知识的深入理解和记忆。</p><p></p><p>在医疗领域，虚实融合可以用于模拟手术训练、辅助手术导航和可视化诊断等方面。通过结合虚拟现实和真实世界数据，医生可以更准确地进行手术规划和操作，提高手术的安全性和成功率。此外，虚实融合还可以用于康复训练和疼痛管理等方面，为患者提供更加个性化和有效的治疗手段。</p>",
    "publish_time": "2023-09-26 15:49:11",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "突发！Unity最早的用户社区 Boston Unity Group 宣布解散",
    "url": "https://www.infoq.cn/article/YlKCHKi45cq36DgheTlJ",
    "summary": "<p>Unity 曾被誉为游戏产业的救世主，它相对容易使用，成为很多游戏的引擎和框架。在商业游戏引擎普及之前，每个游戏都是定制构建的，这虽然有一定的优势，但需要很多时间，移植也很繁琐。Unity 带来的最伟大的东西之一是相对简单的主机发布流程，如果要进行移植，更多的是关于平台特殊性而不需要进行完全重写。</p><p></p><p>不久前，Unity公布了新的收费规定，条款要求每次有人安装游戏时，游戏开发者都应支付相应费用，此举在业内引来了诸多反对。开发者们普遍认为，Unity 的行为不仅打击了自己多年以来的努力，甚至可能直接导致其入不敷出。</p><p></p><p>Unity 宣布新的“安装费”政策之后，有超过 500 家开发商加入了抗议行列。在引发广泛争议之后，Unity 决定调整收费政策，对收取的费用设定了上限。但这并没有平息开发者们的怒火，甚至让不少忠实的开发者拂袖离去。</p><p>&nbsp;</p><p>日前，最早的 Unity 用户社区 Boston Unity Group（简称 BUG）发布公告称，将于当地时间&nbsp;9 月 27 日星期三正式关闭。</p><p></p><p>BUG 官方公告如下：</p><p></p><p>BUG 由 Elliott Mitchell 和 Alex Schwartz 于 2010 年夏天创立，是世界上第一个官方 Unity 用户社区。彼时，Unity 游戏引擎仍然是一项相对较新的技术，它为创作者提供了一种在各种平台上发布游戏的可用工具。</p><p></p><p>在过去 13 年中，BUG 每月定期举办聚会，包括社交活动、技术讲座、小组讨论、访谈、聚会、演示之夜、研讨会等。这里是开发者们建立联系、分享编程困扰、寻求帮助和提供帮助、共同学习和成长的地方。BUG 社区的持续增长在波士顿及其他地区催生了游戏开发的新时代。</p><p></p><p>BUG 的会员数量从几十人增加到几千人，汇聚了来自波士顿的独立开发者、爱好者、AAA 开发人员、人工智能研究人员、博物馆展览设计师、医疗技术创新者、考古学家、汽车设计师、软件工程师、体积电影制作人、VR/ XR 游戏制作者、教育工作者和无数其他人。</p><p></p><p>随着会员数量的增加，我们的领导团队也随之壮大。Jono Forbes、Graham Pentheny 和 Chris Hart 与 Elliott 一起组织 BUG 的活动和在线展示。Unity真正地将具有广泛不同背景的人们聚集在一起，共同热爱创造交互技术。</p><p></p><p>自创立之日起，BUG 就受到了 Unity 和前首席执行官 David Helgason 的热情认可和支持。Unity 提供后勤支持、Pro 许可证赠品、研讨会、演示、赞助、Unite 演讲机会等等。在早期，David 和 Unity 就明白，培育草根独立开发者群体对于播下 Unity 长期增长的种子以及实现为各行各业的人们实现游戏开发民主化的目标至关重要。</p><p></p><p>我们非常感谢 David 和所有 Unity 员工，他们付出了时间和精力来支持 BUG 和更广泛的 Unity 社区。</p><p>不幸的是，在过去几年中，Unity 已将其重点从游戏行业和支持开发者社区转移开。</p><p></p><p>IPO后，该公司似乎将利润看得比一切都重要，进行了多次收购和核心人员的裁员。开发人员需要的许多关键系统仍然处于混乱且通常不完整的状态，广告和收入对 Unity 的重要性超过游戏开发人员关心的功能。</p><p></p><p>最近，Unity 为其用户公布了一系列令人难以想象的敌对服务条款和价格变化。来自游戏行业的广泛、明确的谴责是前所未有的，Unity 别无选择，只能撤销一些最令人震惊的变化。即使有这些新的让步，修订后的定价模式也会不成比例地影响我们社区中独立工作室的成功。</p><p></p><p>更重要的是，我们已经看到，由高管主导的商业决策是多么容易和轻率地冒着让我们辛辛苦苦建立的工作室破产的风险，威胁我们作为专业人士的生计，并挑战行业的长久持续发展。今天的Unity已丢掉了成立时的初心，我们曾经对公司的信任已经完全不复存在。</p><p></p><p>自 2010 年推出以来，BUG 的重点首先是支持开发者，而不是 Unity 公司。作为更广泛的波士顿游戏开发者社区的成员，我们认为我们作为组织者的努力应该更好地用于为每个人（而不仅仅是 Unity 用户）创造机会。请加入我们，我们在更大的当地发展社区中共同努力，继续举办活动和演示，供所有人享受。</p><p></p><p>我们鼓励会员加入波士顿游戏开发聚会小组（Boston Game Dev meetup group），在那里他们可以继续使用 Unity、Unreal、Godot 等工具与当地开发者建立联系。</p><p></p><p>参考链接：</p><p>https://bostonunitygroup.s3.us-east-1.amazonaws.com/index.html</p><p></p><p></p>",
    "publish_time": "2023-09-26 16:42:58",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "ClickHouse正在退出开源世界？",
    "url": "https://www.infoq.cn/article/U7ejZ4T0VD91NC6oa49Q",
    "summary": "<p>ClickHouse是市面上最好的开源数据库之一，有着非常活跃的技术社区。它最早发布于2016年，采用宽松的Apache 2.0许可证，目前已有超3万人打出star、数百位代码贡献者、丰富的生态系统以及数千家将其纳入生产环境的企业用户。所有这些，都标志着这项开源技术取得了巨大成功。</p><p>&nbsp;</p><p>2021年，为了推动ClickHouse商业化，同名公司应运而生。但在两年后的今天，有迹象表明ClickHouse可能正步步远离开源初衷——重要新功能仅在ClickHouse Cloud上开放。此举也引发人们关于ClickHouse未来命运的讨论。</p><p></p><h2>开源版本无缘各类重要更新，CTO的回应饱受争议</h2><p></p><p>ClickHouse Cloud服务于2022年9月正式启动，自此之后该公司就开始为私有版本“开小灶”、提供某些特定功能。但在很长一段时间内，开源版数据库引擎只遇到一些小问题，对于开源使用影响不大。</p><p>&nbsp;</p><p>但从最近公布的SharedMergeTree和轻量级更新（仅在ClickHouse Cloud中可用）开始，这种略微差异化的策略可能正在转变。我们已经能够明显看到，开源版本正无缘各类重要功能。</p><p>&nbsp;</p><p>社区成员当然向ClickHouse团队提出了相关质疑，该公司CTO Alexey Milovidov回应称：</p><p>&nbsp;</p><p></p><blockquote>“对ClickHouse Cloud进行少量、有限的修改是件好事，这仅限于那些不会影响自托管使用场景的功能或操作变更。而这种调整，也给我们的云服务提供了至关重要的独特优势。”</blockquote><p></p><p>&nbsp;</p><p>很遗憾，这种说法明显是断章取义。当前的闭源功能不仅包含大规模云运营所必需的选项（例如新的ShareMergeTree存储引擎，允许真正将存储和计算剥离开来），还包括每位ClickHouse用户在云和本地都离不开的通用功能，例如轻量级UPDATE和基于S3角色的访问（属于公有云当中的关键安全功能）。</p><p>&nbsp;</p><p>此外，开源ClickHouse中的现有对象存储实现似乎也遭到忽视。该公司在2023年路线图中纳入了一系列重大改进，其中部分内容（例如共享元数据）源自2022年甚至更早的路线图规划，因此社区当然希望能在开源ClickHouse中公平获得。但从目前的情况看，这些改进明显将作为ShareMergeTree的一部分在ClickHouse内部fork中实现，根本不会登陆开源版本。对于已经睽违数年的社区成员们来说，这自然令人感到失望。</p><p>&nbsp;</p><p>随着ClickHouse开源版本无缘各类重要更新的讨论在<a href=\"http://www.baidu.com/link?url=ezYtii1PkrvwgNzP6bqZptgt9xK1inUcglXZu2uBxG6n5Gn3Ea5veYLPyGagqCXD\">Hack</a>\"<a href=\"http://www.baidu.com/link?url=ezYtii1PkrvwgNzP6bqZptgt9xK1inUcglXZu2uBxG6n5Gn3Ea5veYLPyGagqCXD\">er&nbsp;N</a>\"<a href=\"http://www.baidu.com/link?url=ezYtii1PkrvwgNzP6bqZptgt9xK1inUcglXZu2uBxG6n5Gn3Ea5veYLPyGagqCXD\">ews</a>\"、Reddit等平台上的持续发酵，更多的开发者也加入到了开源和商业化关系的讨论中。</p><p>&nbsp;</p><p>一位名为that_guy_iain的用户在Hacker&nbsp;News发表评论称，“开源是免费的，但商业化公司需要赚钱。任何由营利性公司拥有和开发的开源产品都面临着放弃开源的危险。如果想要真正的开源，请出钱资助非营利组织和/或慈善机构。事实上，也没有开发者这么做。”</p><p>&nbsp;</p><p>也有开发者认为：“商业化公司不需要直接从开源项目中赚钱，因为这家大公司可以通过开源项目来接触更多人，然后以某种方式向他们推广付费的产品或服务，但如果一家公司只拥有一个开源项目，就会出现问题。”</p><p></p><h2>ClickHouse现在还算是开源项目吗？</h2><p></p><p>开放核心，是指拥有一套闭源高级功能的开源项目。作为一种重要的开源项目货币化模式，开放核心越来越受到希望获得高投资回报的软件厂商们的关注。而向开放核心转型，也代表着ClickHouse开源社区开始发生结构性变化。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/f8/f8942603d3b324212c1e782a46f22c43.png\" /></p><p>&nbsp;</p><p>在ClickHouse此前多年所遵循的真正开源模式当中，社区作为主要的开发驱动力。社区帮助厂商定义路线图、提交新功能或功能请求、开发生态系统并开展新业务。核心开发团队则负责开发战略功能、充当主理人和管家，努力确保社区的可持续发展。社区活跃度越高，相应的成功应用就越多，项目自然越受欢迎，由此建立起积极的反馈循环。</p><p>&nbsp;</p><p>但在开放核心项目当中，情况则恰恰相反。项目所有方的业务和产品充当主要驱动力，核心开发团队专注于产品开发。而开源社区在此过程中仅充当潜在的客户来源。人们可以先体验开源版本、了解功能设置，但要想在生产环境中大规模应用，就必须转向闭源产品。</p><p>&nbsp;</p><p>可以看到，目前ClickHouse正在向后一种模式转变。以对象存储为例，这项功能对于大数据分析用例至关重要，但在开源版本中并未完全开放。根据发展路线图，未来将有更多功能仅在闭源云端提供，余下部分则被无情抛弃、导致开源版本沦为无根之木。</p><p></p><h2>ClickHouse将走向何方？</h2><p></p><p>ClickHouse是一款出色的数据库，已经在实际应用中证明了自身价值。它能够在任何地方运行，包括边缘设备到大型服务器设施，而且取得了出色的成果。其极致的性能、灵活性和便携性是其成功的主要驱动力。如果没有多年以来不断发展的优秀开源社区，这一切根本不可能实现——究其根基，则源自Apache 2.0许可证和对开源用户的深切关怀。</p><p>&nbsp;</p><p>不幸的是，转向开放核心模式破坏了ClickHouse赖以成功的这几大因素。对产品的关注导致核心团队无法像过去那样提供高水平的社区支持。对ClickHouse云功能的强调，则忽略了想要在其他场景下使用ClickHouse的用户需求。种种因素正在损害社区对于ClickHouse的信任和喜爱，整个社区也必须找到新的相处方式才能保持住过去几年来的惊人增长。</p><p>&nbsp;</p><p>首先，需要将开源路线图与ClickHouse&nbsp;Cloud路线图明确区分开来。用户必须知道开源版本将提供哪些功能、何时交付。</p><p>&nbsp;</p><p>第二，社区必须加紧推动战略性功能的开发。开源组织最近提交了一份关于对象存储支持改进的RFC，其内容基于开源用户的大量反馈，也属于真正的社区努力。我们希望这项工作能够顺利完成并被合并至上游，以社区的方式、从社区的角度拿出一套跟ClickHouse Cloud重合的开源功能集。</p><p>&nbsp;</p><p>第三，ClickHouse团队必须向社区贡献者授予更多权利。ClickHouse团队正在成为审查与合并PR的瓶颈。当然，考虑到他们一直以来对产品质量的关注，这倒也可以理解。</p><p>&nbsp;</p><p>我们一直梦想让ClickHouse成为一个独立治理的基金会，相信许多用户也乐于看到这样的结果。这也许只是种一厢情愿，但ClickHouse这样一款优秀的产品值得我们为之一试。</p><p></p><p>原文链接：</p><p><a href=\"https://altinity.com/blog/is-clickhouse-moving-away-from-open-source\">https://altinity.com/blog/is-clickhouse-moving-away-from-open-source</a>\"</p>",
    "publish_time": "2023-09-26 17:35:11",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]