[
  {
    "title": "“实用主义”主导的数字化趋势下，云底座被撼动了吗？",
    "url": "https://www.infoq.cn/article/yzpZpUaq7A8GEkXLOLgS",
    "summary": "<p>活下去，是这两年每一个企业的主线任务。无论是马斯克大肆“整顿”Twitter，还是互联网大厂们的裁员风波，背后无一不是企业家们焦虑情绪的体现。而为了活下去，降本增效的优先级变得越来越高。</p><p></p><p>在疫情之初，很多企业都在通过加速数字化转型应对市场环境的动荡变化，一手抓降本增效，另一手也还在继续谋求突破式创新。但是，如我们在《<a href=\"https://www.infoq.cn/article/BXWSliYk7FK3EfGSbRtS\">InfoQ&nbsp;年度技术盘点与展望</a>\"》的数字化解读中观察到的，与过往热衷于创新事物的现象相比，如今企业在数字化转型越来越强调“实用主义”，在有限的资源条件下，企业开始“集中力量办大事”，也更看重技术的投入和回报。</p><p></p><p>拿云计算来说，虽然一直被视为是企业数字化转型的底座，但是在巨大的财务和运营压力下，不少企业也开始对云“下手”了，一场“下云潮”悄然而至。</p><p></p><p>根据&nbsp;Wanclouds&nbsp;在《2022&nbsp;年下半年云计算成本和优化展望》的<a href=\"https://www.infoq.cn/news/mMtEqAXuvF7Weml1GROL\">最新报告</a>\"中显示，81%&nbsp;的&nbsp;IT&nbsp;管理者表示，随着成本飙升和市场下行，他们的最高管理层已经指示他们要减少或不承担额外的云支出。根据调研结果，39%&nbsp;的人已经决定将大量的云消耗和高性能工作负载迁移或留在本地，还有&nbsp;29%&nbsp;的人表示在&nbsp;2022&nbsp;年上半年由于价格贵而更换了公有云厂商。</p><p></p><p>此外，IBM在2022年发布的《IBM企业转型指数：云现状》中也反映了这一趋势：80%的企业已经考虑或正在考虑将已经部署到公有云上的工作负载迁回私有的基础设施。</p><p></p><p>所以，在“实用主义”主导的数字化趋势下，<a href=\"https://www.infoq.cn/article/psWB79HDzjsKislYsE0Y\">云计算</a>\"这个“底座”要被撼动了吗？</p><p></p><h2>“下云潮”针对的主要是公有云</h2><p></p><p></p><p>事实上，从目前来看，“下云潮”主要针对的还是公有云。据IBM观察，对于那些不愿放在公有云的负载，企业更愿意选择放在私有云、主机以及主机以外的其它本地设备。</p><p></p><p>“这里有很多原因：首先是性能的问题，如何让公有云的性能达到本地设备的性能值，并且减少延迟，这很重要；其次，已经上了公有云的业务，安全和合规性怎么保证；此外，企业还要避免供应商锁定。”IBM&nbsp;副总裁、IBM&nbsp;中国总经理缪可延在日前接受媒体采访时表示，“过去大家采用云计算的一个重要出发点就是不喜欢集中式管理，不喜欢被锁定。但是，如今他们突然发现，公有云也会锁定，而锁定则会给企业带来成本的增加，这里的成本很可能与私有设施不相上下，甚至更多。”</p><p></p><p>也就是说，技术创新对于企业而言并非不再重要，只不过在经济“寒冬”这样的特殊环境下，企业必须在技术价值和技术投入之间找到一个相对的平衡点。在过去经济蓬勃发展的时候，很多企业为了创新可以不计成本，但随着盈利性降低，成本投入的大小则决定着企业业务是否可持续。</p><p></p><p>“有一段时间，我们经常听到企业纷纷在说自己每年要上几朵云，其实回过头来看，当时大家都是为了拥有而拥有。随着如今大环境的变化，成本压力、不确定性增加，我们发现，企业确实变得更加理智和冷静。他们开始越来越多地关注在数字化转型和上云过程中，哪些与自己的核心业务价值挂钩。”IBM大中华区科技事业部客户成功管理部总经理朱辉强调。</p><p></p><p>当然，在朱辉看来，企业在数字化转型过程中日趋理性，并不意味着一定要极端地抛弃云。根据IBM&nbsp;商业价值研究院一项名为《混合云平台的优势》调研显示，采用全面<a href=\"https://xie.infoq.cn/article/bd7390a2e7768a5e084709970\">混合多云</a>\"平台技术及运营模式所实现的价值，是采用单一平台、单一云厂商所能实现价值的&nbsp;2.5倍。</p><p></p><p>换言之，混合多云或将成为企业平衡云计算投入和成本的那个关键“砝码”。具体而言，IBM对2023年企业云转型给出了如下预测：</p><p></p><p>第一，越来越多企业会开始采用“主机+云”的模式，二者不再是排他的选择题，通过战略性地将云与主机结合，企业可以获得更优的创新、速度和安全优势；</p><p></p><p>第二，企业将实施全面安全策略，构建安全的生态系统，通过全面了解混合云环境中（本地、公共云或私有云、边缘）的数据，为未来的威胁（如量子安全挑战）做好准备；</p><p></p><p>第三，企业将更加重视合规，尤其是金融服务等高度受监管的行业，以及需要处理客户个人信息的企业，将更加专注于处理最关键的任务工作负载，确保数据受到保护；</p><p></p><p>第四，可持续性成为一个重要课题，企业将更加关注提高整个IT运营的能源效率，同时又不牺牲安全性或性能。</p><p></p><h2>混合多云带来复杂架构和云原生应用管理挑战</h2><p></p><p></p><p>混合云作为未来云计算的主流形态，这似乎已经不是什么新鲜观点。而云计算厂商的混合云赛道之争，也早已打响。对于IBM来说，2018年大笔一挥宣布豪掷340亿美元收购<a href=\"https://www.infoq.cn/article/SRcxh_0GMRgRwBlHMRdi\">红帽</a>\"，正是其加速布局混合云战略的决心。</p><p></p><p>但是，由于混合多云架构带来的管理复杂性，不少企业在具体落地过程中也面临全新的挑战。《IBM企业转型指数：云现状》报告指出，虽然77%的受访企业采用了混合云方法，但只有不到1/4的企业能够全面管理其混合云环境。</p><p></p><p>不仅如此，随着更多云原生应用的出现，企业的开发和运维压力也上到新的台阶。</p><p></p><p>以国内某大型股份制商业银行为例，在过去几年中，该银行构建了一套自主可控的全栈式云平台以支持分布式、云原生、微服务等技术，其应用也在进行云原生化改造和上云。在其分布式、容器化、&nbsp;Kubernetes&nbsp;环境下，有上百个服务和上千个实例在运行，运维团队急需理解整个系统当中微服务应用间的相互调用关系，应用开发团队则需要及时发现、定位和解决快速迭代和发布新版本的各种问题。</p><p></p><p>为了应对这一系列挑战，据了解，该银行基于IBM&nbsp;Instana自动化运营监控能力，实现了在传统和云原生环境下不同技术栈问题的自动发现和监控，通过关联全面的相关信息，为快速定位故障提供了<a href=\"https://www.infoq.cn/article/V5R45xKtTVizcIeg6fFS\">可观测</a>\"性。</p><p></p><p>“不管是开发还是运维人员都可以通过IBM&nbsp;Instana了解某个系统和应用的运行状况，及时发现问题。”朱辉介绍，“也就是说，即使是运维团队，也可以在不修改任何应用代码、不改变应用部署的前提下，进行实时监控，并且自动关联和分析应用的端到端调用链，使得动态底层架构之间的关系一目了然。”</p><p></p><p>IBM大中华区科技事业部技术销售总经理陈国豪告诉记者，IBM&nbsp;Instana可以把发现应用运行问题的时间缩短到几分钟或者几秒钟，并且能够快速解决。而相较之下，过去企业在遇到停机或者应用性能问题时，往往至少要花费至少一小时才能发现问题所在，尤其是在上云之后，基于复杂的后台和网络，这个时间可能还要更长。</p><p></p><p>他举了另一个例子：用友网络iUAP技术平台在其生产环境中有600多个微服务，同时支持十几条产品线，在部署了容器化之后会产生大约3000多个微服务实例，需要通过上千个节点支撑微服务的运行。过去，用友使用的是自己产品做实时观测，而通过IBM&nbsp;Instana，定位一个应用故障点或性能瓶颈点的时间从40分钟缩短到4分钟，效率提高了10倍以上。</p><p></p><p>所以，在IBM看来，随着IT架构变的越来越复杂，以及更多云原生应用的引入，企业需要引入更智能的方式协助——混合多云和AI将是一对强CP。</p><p></p><h2>只有企业成功技术才有价值</h2><p></p><p></p><p>当然，放到整个数字化转型的大语境下，<a href=\"https://www.infoq.cn/article/rggHjzaBfCVPV5hxTF7H\">AI</a>\"的价值绝不止于应用开发和运维场景。在各行各业众多具体的业务场景中，AI也大有可为。</p><p></p><p>比如，在全球&nbsp;20&nbsp;多个国家拥有&nbsp;9&nbsp;家研发基地、240&nbsp;多个工厂的全球汽车零部件供应商延锋国际汽车技术有限公司（以下简称“延锋汽车”）。过去，他们需要通过人工根据经验把通用订单转为内部订单，每个工厂每天需要两名工作人员花&nbsp;150&nbsp;分钟进行手工分类。即使在这样的人工投入下，仍伴随&nbsp;15%&nbsp;的分类错误，这给延锋汽车带来成本和效率的双重挑战。</p><p></p><p>为此，延锋汽车利用 IBM&nbsp;Watson&nbsp;Discovery&nbsp;的自然语言学习能力构建&nbsp;AI&nbsp;模型，从&nbsp;1.8&nbsp;亿历史数据、200&nbsp;多种排列组合、结构化数据和非结构化文本混合数据中，学习通用订单对应的内部订单背后蕴藏的规则，进而实现了运营自动化，整个流程不仅无需人工操作，并且订单分类正确率从&nbsp;85%&nbsp;提升到了97%，大大减少了返工时间。</p><p></p><p>再比如在水利行业，上海水利科技基于数据和AI提出了两个应用场景——构建智慧大脑提高工作效率和构建水利枢纽工程安全模型。</p><p></p><p>众所周知，水利建设是一个庞大的工程，需要遵守严格的流程，并且需要严谨的科学理论做支撑。而各种类型的文档及文本数据涉及到很多业领域，使得信息查询耗时耗力。尤其当工程人员在工地上时，特别困难。通过使用&nbsp;IBM&nbsp;Cloud&nbsp;Pak&nbsp;for&nbsp;Data、IBM&nbsp;Watson&nbsp;Discovery&nbsp;Cartridge&nbsp;解决方案所提供的智能文本搜索、数据科学和机器学习预测技术，上海水利科技为工程人员提供了统一平台，在一个整体视图中搜索与访问所需文档信息。通过简单关键字输入，就可以实现从众多非结构化文档（如&nbsp;PDF&nbsp;和图片）中快速定位信息。利用机器学习模型辅助文档分类和标注，为文档提供建议。借助<a href=\"https://xie.infoq.cn/article/6e8c851e2cebf0c0eed1bb4c8\">自然语音处理</a>\"（NLP）技术对非结构化数据进行分析，从文本中提取有效信息，帮助工程人员高效获取知识，辅助水利工程建设智慧决策。</p><p></p><p>同时，安全是工程建设的核心要素，水利工程需要依托实景三维模型和有限元计算模型作为数据模型资产，对大坝及其围堰结构进行分析，通过采集和管理水利工程的多维监测数据。基于&nbsp;IBM&nbsp;Cloud&nbsp;Pak&nbsp;for&nbsp;Data，运用数据科学和机器学习算法，在传统土木工程模型的基础上构建水利枢纽工程安全模型，实现数据模型优化和在线推演预测，实现结构变形预测及异常监测预警等实时应用，从而实现工程安全分析预警、综合决策等上层业务。</p><p></p><p>“其实技术都是手段，只有客户成功了，技术才有存在的价值。”朱辉强调。而可以预见，在“实用主义”主导的数字化趋势下，这种所谓“价值”将越来越重要。</p>",
    "publish_time": "2023-01-16 12:43:26",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]