[
  {
    "title": "无损性能的Amazon DynamoDB分布式事务：TransactGetItems和TransactWriteItems详解",
    "url": "https://www.infoq.cn/article/boAQ70phGHv0TZlDWbiZ",
    "summary": "<p>我们是否能够以可预测的性能支持大规模的事务呢？本文将探讨为何事务被认为与NoSQL数据库的扩展性相冲突，并带你了解如何为<a href=\"https://aws.amazon.com/dynamodb/\">Amazon DynamoDB</a>\"添加事务支持。</p><p></p><h2>NoSQL数据库</h2><p></p><p></p><p>NoSQL数据库（如DynamoDB）因其灵活的数据模型、简单的接口、支持大规模的数据和高性能而获得了广泛采用。为了提供无限扩展的自动分区、容错副本以及可预测性能的低延迟访问，它们一般都牺牲了关系型数据库的核心特性，如SQL查询和事务。</p><p>&nbsp;</p><p>Amazon DynamoDB（请不要与Dynamo混淆）为数十万个客户的应用程序和多个高流量的亚马逊系统（包括Alexa、Amazon.com站点和所有的亚马逊的运营中心）提供了支持。</p><p>&nbsp;</p><p>2023年，在Prime Day期间，亚马逊系统对DynamoDB API进行了数万亿次的调用，DynamoDB保持了高可用性，同时提供了个位数毫秒的响应，峰值达到了每秒钟1.26亿次请求。</p><p>&nbsp;</p><p>当DynamoDB的消费者请求ACID时，我们所面临的挑战是如何在不牺牲这一关键基础架构的决定性特性（即高可扩展性、高可用性和大规模下的可预测性能）的情况下集成事务操作。</p><p>&nbsp;</p><p>为了阐述事务为何如此重要，我们介绍一个样例，它会使用不支持事务的NoSQL数据库构建一个应用程序，这个过程中仅会使用基本的Put和Get操作。</p><p></p><h2>事务</h2><p></p><p></p><p>事务单元是作为单一逻辑单元一起执行的一组读写操作。事务与ACID属性密切相关：</p><p>&nbsp;</p><p>原子性（Atomicity）确保事务中的操作要么全部执行，要么全部不执行，从而提供一种全有或全无的语义。一致性（Consistency）确保操作结果对数据库产生一致和正确的状态。隔离性（Isolation）允许多个开发人员同时读取和写入数据，确保并发操作的序列化。持久性（Durability）确保在事务中写入的任何数据都是永久性的。</p><p>&nbsp;</p><p>我们为何需要NoSQL数据库的事务呢？事务的价值在于它们能够帮助我们构建正确和可靠的应用程序，这些应用程序需要维护多项不变量（invariant）。这些性质的不变量通常会在各种应用程序中都能遇到。假设在一个电子商务应用程序中，某个用户Mary可以将一本图书和一支笔放到一个订单中一起购买。在这种情况下，其中的一些不变量可能是这样的：图书如果缺货的话，将会无法出售，同样，笔如果缺货的话，也会无法出售，而且Mary必须是合法的用户才能购买图书和笔。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/9d/9d0b39db7694afdad3722be7e4ddd383.jpeg\" /></p><p></p><p>图1 简单的电子商务场景</p><p>&nbsp;</p><p>但是，维持这些不变量很具挑战性，尤其是当应用程序的多个实例并行运行并同时访问数据时。此外，在发生节点故障等意外情况时，维持多项不变量会变得很具挑战性。事务为应用程序解决并发访问和部分区域故障这两个难题提供了解决方案，使得开发人员不必为了应对这两个难题编写过多额外的代码。</p><p>&nbsp;</p><p>假设我们正在开发一个电子商务应用的客户端，该应用依赖于一个不支持事务的数据库来创建Mary的订单。我们的应用程序有三个表，分别是inventory、customer和orders表。当要执行购买操作的时候，我们都需要考虑什么呢？</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/73/7317c8f875a4e9f2ea9b0101417c7b4c.jpeg\" /></p><p></p><p>图2 三个独立的NoSQL表，分别为表示库存、消费者和订单</p><p>&nbsp;</p><p>首先，我们需要确保Mary是经过验证的消费者。然后，需要检查图书是否有库存，并处于可销售的状态。还要对笔进行同样的检查，然后创建新的订单并更新库存中图书和笔的状态和数量。实现这一点的方法之一是在客户端编写所有必要的逻辑。</p><p>&nbsp;</p><p>最关键的一点是，所有的操作必须以原子的方式执行，以确保最终状态具有正确的值，并在创建购买订单时，其他读取者不会看到数据库中不一致的状态。在没有事务的情况下，如果多个用户同时访问相同的数据，就有可能遇到不一致的数据。例如，一本图书被标记为已出售给Mary，但是订单创建可能发生失败。事务提供了将这些操作作为一个逻辑单元来执行的方法，确保它们要么全部成功，要么全部失败，同时能够防止消费者观察到不一致的状态。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/c8/c88e5bc3124ab139dc7748b1586ed221.jpeg\" /></p><p></p><p>图3 当遇到崩溃场景时，如果没有事务的话，我们会经历什么？</p><p>&nbsp;</p><p>如果没有事务，在构建应用程序时，还需要克服其他潜在的隐患，比如网络故障和应用程序崩溃。为了缓解这些挑战，有必要实现额外的客户端逻辑来实现健壮的错误处理和韧性。开发人员需要实现回滚逻辑，删除未完成的事务。多用户的场景引入了另一层复杂性，需要确保存储在表中的数据在所有用户间保持一致。</p><p></p><h2>事务与NoSQL的关注点</h2><p></p><p></p><p>人们经常担心在数据库中实现事务需要面临一定的取舍。按照预期，NoSQL数据库会提供低延迟的性能和可扩展性，但通常只提供具有一致延迟的Get和Put操作。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/6f/6f7261b91ecd7ea77f5d2aa29d8ad3c0.jpeg\" /></p><p></p><p>图4 事务能否提供可预测的性能？</p><p>&nbsp;</p><p>很多NoSQL数据库没有提供事务，常见的问题包括破坏非事务性的工作负载、API的复杂性和一些系统问题，比如死锁、竞争以及非事务性和事务性工作负载之间的干扰。有些数据库试图通过提供限制性的特性（如隔离级别或限制事务的范围）来解决这些问题，允许事务在单个分区（partition）中执行。其他的数据库则是对主键或散列键实施限制，或要求预先识别出会成为事务一部分的所有分区。</p><p>&nbsp;</p><p>这些限制旨在提升系统的可预测性并降低复杂性，但它们是以牺牲可扩展性为代价的。随着数据库的增长并分割为多个分区，将数据限制在单个分区可能会导致可用性问题。</p><p></p><h2>DynamoDB事务的目标</h2><p></p><p></p><p>当我们开始为DynamoDB添加事务支持时，团队的目标是为客户提供在特定区域（region）内对跨表的数据项执行原子和可序列化操作的能力，同时保证性能的可预测性，并且不影响非事务性的工作负载。</p><p></p><h2>用户体验</h2><p></p><p></p><p>让我们聚焦体验，探讨一下DynamoDB中提供事务支持的可选方案。传统上，事务以“begin transaction”语句启动，以“commit transaction”结束。在两者之间，用户可以写入所有的Get和Put操作。在这种方式中，对单个项目的现有操作可以简单地视为隐式事务，它们均有单个操作组成。为了确保隔离，可以使用两阶段锁，同时通过两阶段提交实现原子性。</p><p>&nbsp;</p><p>但是，DynamoDB是一个多租户系统，允许长时间运行的事务可能会无限期地占用系统资源。对单例的Get和Put操作强制执行完整的事务提交协议会对不打算使用事务的现有用户的性能产生不利的影响。此外，引入锁会带来死锁的风险，从而严重影响系统的可用性。</p><p>&nbsp;</p><p>因此，我们引入了两个新的单请求操作，即TransactGetItems和TransactWriteItems。与其他的DynamoDB操作相比，这两个操作会以原子和可序列化的顺序执行。TransactGetItems是为只读事务设计的，它能够实现从一致的快照中检索多个条目。这意味着只读事务相对于其他写事务是序列化的。</p><p>TransactWriteItems是一个同步和幂等的写入操作，允许在一个或多个表中原子地创建、删除或更新多个条目。</p><p>&nbsp;</p><p>这样的事务允许在条目的当前值上包含一个或多个可选的前置条件。前置条件能够检查条目属性是否满足特定的条件，比如是否存在、是否为特定值或是否在数字范围内。如果不满足所有的前置条件，DynamoDB将拒绝TransactWriteItems请求。我们不仅可以为修改的条目添加前置条件，还可以为事务中未修改的条目添加前置条件。</p><p>&nbsp;</p><p>这些操作不限制并发性，不需要版本控制，不会影响单例操作的性能，并允许对单个条目进行乐观并发控制。所有的事务和单例操作都是序列化的，以确保一致性。通过TransactGetItems和TransactWriteItem，DynamoDB提供了一个可扩展且经济高效的解决方案，满足了ACID合规性的要求。</p><p>&nbsp;</p><p>我们考虑另外一个样例，它展示了在银行汇款场景中对事务的使用。假设Mary想给Bob转账。传统的事务包括读取Mary和Bob的账户余额、检查资产的可用性以及在TxBegin和TxCommit代码块中执行事务。在DynamoDB中，我们可以使用TransactWriteItems操作，通过单个请求完成相同的事务行为：检查余额，并使用TransactWriteItems执行转账，这个过程无需TxBegin和TxCommit。</p><p></p><h2>事务的高层级架构</h2><p></p><p></p><p>为了更好地理解事务是如何实现的，我们深入了解一下DynamoDB请求的工作流。当应用程序请求Put/Get操作时，请求会被路由到一个由前端负载均衡器随机选择的请求路由器上。请求路由器利用元数据服务将表名和主键映射到一组存储节点集合，该节点集合中包含了要访问的数据条目。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/d0/d053bae61e6e78ed3243955a3f68b9ef.jpeg\" /></p><p></p><p>图5 路由器</p><p>&nbsp;</p><p>DynamoDB中的数据会在多个可用区中以多个副本的形式存储，其中一个副本会作为领导者。在执行Put操作时，请求会被路由到领导者存储节点，然后该节点会将数据传播到不同可用区的其他存储节点。当大多数的副本成功写入条目后，就会向应用程序发送完成响应。Get操作与之类似，只不过它会由单个存储节点来进行处理。在一致性读取的情况下，领导者副本会为读取请求提供服务。不过，对于最终一致性读取，三个副本中的任意一个均可为请求提供服务。</p><p>&nbsp;</p><p>为了实现事务，我们引入了一个专门的事务协调者群（fleet）。群中的所有事务协调者均可负责任意的事务。当收到事务性的请求时，请求路由器会对请求进行必要的认证和鉴权，并将请求发送给其中的一个事务协调者。这些协调者会将请求路由到相应的存储节点，这些节点负责处理事务中相关的条目。收到存储节点的响应后，协调者会为客户端生成一个事务性的响应，表明事务成功或失败。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/2b/2be97fed4b4393269a8342c8639adebe.jpeg\" /></p><p></p><p>图6 事务协调器</p><p>&nbsp;</p><p>事务协议分为两个阶段，以确保原子性。在第一阶段，事务协调者会为要写入的条目向领导者存储节点发送一条Prepare消息。收到Prepare消息后，每个存储节点都会验证是否满足条目的前置条件。如果所有的节点都接受了Prepare消息，事务处理就会进入第二阶段。</p><p>&nbsp;</p><p>在这个阶段，事务协调者提交事务并指示存储节点执行它们的写入操作。事务进入第二阶段后，会确保它在全局执行一次。协调者会重试每个写操作，直到所有的写入都成功为止。因为写入操作是幂等的，在遇到超时等场景时，协调者可以重新发送写入请求。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/99/99b465fd45cd2f32712e4514e6fa49e6.jpeg\" /></p><p></p><p>图7 当事务失败时的场景</p><p>&nbsp;</p><p>如果Prepare消息没有被某个参与的存储节点所接受，那么事务协调者就会取消事务。为了取消事务，事务协调者发送一个Release消息给所有参与的存储节点并发送响应给客户端，表明事务已经被取消。因为在第一个阶段没有数据写入，因此不需要回滚过程。</p><p></p><h2>事务恢复</h2><p></p><p></p><p>为了确保事务的原子性，并在出现故障时确保事务完成，协调者会在其总账（ledger）中维持每个事务及其输出的持久化记录。恢复管理器会定期扫描总账，找出尚未完成的事务。这样的事务会被分配给新的事务协调者，由其恢复事务协议的执行。由于提交和释放操作是幂等的，因此多个协调者同时处理同一个事务是可以接受的。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/11/11d97d8e059c22493fcee4ec25a643ad.jpeg\" /></p><p></p><p>图8 事务协调者和故障处理</p><p>&nbsp;</p><p>一旦事务处理成功，它就会在总账中标记为已完成，表明无需采取后续的行动。在事务完成十分钟后，事务信息会从总账中删除，以支持幂等的TransactWriteItems请求。如果在十分钟的时间窗口内客户端再次发送相同的请求，则会从总账中查找相关信息，以确保该请求时幂等的。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/f2/f298a4b370aac5ba2b81033f6fc9c351.jpeg\" /></p><p></p><p>图9 事务协调者和总账</p><p></p><h2>确保序列化</h2><p></p><p>&nbsp;</p><p>在事务处理过程中，使用了时间戳排序来定义事务的逻辑执行顺序。当收到事务请求时，事务协调者会使用其当前的时钟值为事务分配一个时间戳。分配了时间戳之后，参与事务的节点就可以无需协调地执行其操作。每个存储节点负责确保条目中涉及的请求请求按正确的顺序执行，并拒绝可能不按顺序执行的冲突事务。如果每个事务都按照分配的时间戳执行，就实现了可序列化。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/d8/d886b8e63bbbfb3e03576e6bdd37f9bf.jpeg\" /></p><p></p><p>图10 使用基于时间戳的排序协议</p><p>&nbsp;</p><p>为了处理事务的负载，大量的事务协调器会并行运行。为防止时钟不同步导致的不必要的事务中止，系统使用<a href=\"https://aws.amazon.com/blogs/aws/keeping-time-with-amazon-time-sync-service/\">AWS提供的时间同步服务</a>\"，使协调者群中的时钟保持同步。不过，即便时钟完全同步，由于延迟、网络故障和其他问题，事务到达存储节点的顺序也可能不一致。存储节点会使用存储的时间戳来处理以任何顺序到达的事务。</p><p></p><h2>TransactGetItems</h2><p></p><p></p><p>TransactGetItems&nbsp;API的工作原理与TransactWriteItems类似，但不会使用总账，以避免延迟和节省开销。TransactGetItems为执行读取事务实现了无写入的两阶段协议。在第一阶段，事务协调者会读取事务所涉及的读集合中的所有条目。如果这些条目中有任何一项正在被其他事务写入，那么读取事务将会被拒绝。否则，读取事务将进入第二阶段。</p><p>&nbsp;</p><p>在对事务协调者的响应中，存储节点不仅会返回条目的值，还会返回其当前已提交的日志序列号（log sequence number，LSN），代表了存储节点最后一次确认的写入。在第二阶段，条目会被重新读取。如果条目在两个阶段之间没有变化，读取事务会成功返回已获取的条目值。但是，如果在这两个阶段有任何的条目更新，读取事务就会被拒绝。</p><p></p><h2>事务性与非事务性工作负载</h2><p></p><p></p><p>为了确保不使用事务的应用程序避免出现性能下降，非事务性的操作会绕过事务协调器和两阶段协议。这些操作直接从请求路由器路由到存储节点，不会对性能造成影响。</p><p></p><h2>重新审视事务的目标</h2><p></p><p></p><p>我们刚开始提出的可扩展性问题又会怎样呢？我们看一下往DynamoDB添加事务后取得了哪些成果：</p><p>传统的Get/Put操作没有受到影响，性能与非事务性工作负载相同。TransactGetItems&nbsp;API的工作原理与TransactWriteItems&nbsp;API类似，但是不使用总账，以避免延迟和额外的成本。所有的操作在系统扩展时都保持相同的延迟。借助单请求事务和时间戳排序，我们同时实现了事务和可扩展性。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/f1/f169c411ccc53aa861f5c7ee30430b0c.jpeg\" /></p><p></p><p>图11 可预测的事务延迟</p><p></p><h2>最佳实践</h2><p></p><p></p><p>在DynamoDB上使用事务的最佳实践是什么呢？</p><p>幂等的写入事务：当调用TransactWriteItems时，我们可以包含客户端的令牌，以确保请求是幂等的。在事务中加入幂等性有助于防止无意中多次提交相同的操作而出现潜在的应用程序错误。使用AWS SDK时，该特性默认是可用的。自动缩放或按需缩放：推荐启用自动缩放或使用按需缩放（on-demand）的表。这可以确保提供必要的容量，以便于有效处理事务性的工作负载。避免批量加载事务：对于批量加载的场景，建议使用DynamoDB的批量导入特性，它比依赖事务更经济高效。</p><p>&nbsp;</p><p>DynamoDB事务在很大程度上受到了消费者宝贵反馈的影响，他们激励我们为了客户不断进行创新。我非常感激有这样一支优秀的团队陪伴我走过这段旅程。特别感谢Elizabeth Solomon、Prithvi Ramanathan和Somu Perianayagam审阅本文并分享他们的反馈意见以完善本文。你可以在USENIX ATC 2022上发表的<a href=\"https://www.usenix.org/system/files/atc22-elhemali.pdf\">论文</a>\"中了解有关DynamoDB的更多信息，也可以在USENIX ATC 2023 上发表的<a href=\"https://www.usenix.org/system/files/atc23-idziorek.pdf\">论文</a>\"中了解有关DynamoDB事务的更多信息。</p><p></p><h2>作者介绍</h2><p></p><p></p><p>Akshat Vig是AWS高级首席工程师。Akshat自DynamoDB诞生以来就一直从事相关的工作。他是在USENIX上发表的DynamoDB论文的主要作者之一。DynamoDB 是世界上最大、最重要的分布式系统之一，是AWS、亚马逊和当今互联网生态系统的基础。作为首席工程师，Akshat解决了亚马逊多个服务中最棘手的分布式系统问题。他申请了近 100项专利，曾在IEEE项目委员会任职，并在世界各地发表过主题演讲。他很高兴能解决分布式系统的下一项重大挑战。</p><p>&nbsp;</p><p>原文链接：</p><p><a href=\"https://www.infoq.com/articles/amazon-dynamodb-transactions/\">Distributed Transactions at Scale in Amazon DynamoDB</a>\"</p>",
    "publish_time": "2023-12-15 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "以数据持有权，开启数据流通与利用新秩序",
    "url": "https://www.infoq.cn/article/WbZoIeOHORkNhbHPVyLR",
    "summary": "<p>在这个以数据为核心的数字化时代，我们即将探索数据的真正潜力。在<a href=\"https://fcon.infoq.cn/2023/shanghai/\">FCon全球金融科技大会</a>上，我们有幸邀请到华东政法大学的高富平教授，他将解析数据如何转化为强大的生产力，还将讨论数据所有权与管理的现代挑战。以下为要点内容：</p>\n<ol>\n<li>\n<p><strong>数据要素化和资产化</strong>：</p>\n<ul>\n<li>由于大数据和人工智能等第二代数字技术带来的认知革命，数据被提议作为一种生产要素。</li>\n<li>机器学习、数据挖掘和人工智能已成为生产知识的新方式，识别人类无法识别的模式，从而改变了模式识别的范围和能力。</li>\n</ul>\n</li>\n<li>\n<p><strong>适应数据特性的数据产权</strong>：</p>\n<ul>\n<li>论证数据本身并不生产力；其价值在于认知价值，只有在被正确识别并转化为明智的决策或行动时，才会转化为生产力。</li>\n<li>数据的价值已从人类认知工具演变为机器分析和学习的材料。新数字技术的本质是从大量、多样化的数据中快速提取价值（知识）。</li>\n</ul>\n</li>\n<li>\n<p><strong>数据资产的定义、估值和管理</strong>：</p>\n<ul>\n<li>当数据加速人工智能应用和知识生产时，它就成为了一种生产要素。</li>\n<li>数据治理将无用的数字记录转化为有用的数据，增加价值，将数据转化为经济资源。</li>\n<li>讨论了数据要素的概念，它们作为非排他性、可共享、不耗竭的特性，以及如何成为可交易的商品。</li>\n</ul>\n</li>\n<li>\n<p><strong>数据所有权和社会对数据要素的利用</strong>：</p>\n<ul>\n<li>涉及了人类社会中关于数据不能私有化的假设，以及为什么事实数据没有所有者的原因。</li>\n<li>讨论了数据赋权和开放之间的平衡、数据所有权权利的动态性质，以及数据使用权和数据产权之间的区别。</li>\n</ul>\n</li>\n<li>\n<p><strong>数据资产管理框架</strong>：</p>\n<ul>\n<li>根据场景或用例，讨论了不同的数据估值策略。</li>\n<li>深入探讨了数据资源是否应作为无形资产或存货入账，这取决于它们的预期用途和可实现的价值。</li>\n</ul>\n</li>\n</ol>\n<p><strong>活动推荐：</strong></p>\n<p><a href=\"https://qcon.infoq.cn/202312/shanghai/\">QCon 全球软件开发大会</a>（上海站）即将在 12 月 28-29 日开始，届时将围绕 GenAI和通用大模型应用探索、AI Agent 与行业融合应用的前景、LLM 时代的性能优化、智能化信创软件 IDE、面向人工智能时代的架构、性能工程：提升效率和创新的新方法等专题进行交流。现在购票，享 9 折优惠，立减￥680！咨询购票请联系：18514549229（微信同手机号）。</p>",
    "publish_time": "2023-12-15 11:11:57",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "腾讯金融云技术总监全成确认出席 QCon 上海，分享大语言模型金融智能应用研发实战与探索",
    "url": "https://www.infoq.cn/article/6kV1dgYUepjSUjW9v2oz",
    "summary": "<p><a href=\"https://qcon.infoq.cn/2023/shanghai/?utm_source=infoqweb&amp;utm_medium=teacherart&amp;utm_campaign=9&amp;utm_term=1215&amp;utm_content=quancheng\">QCon 全球软件开发大会</a>\"，将于 12 月在上海召开。腾讯金融云技术总监全成将发表题为《<a href=\"https://qcon.infoq.cn/2023/shanghai/presentation/5611?utm_source=infoqweb&amp;utm_medium=teacherart&amp;utm_campaign=9&amp;utm_term=1215&amp;utm_content=quancheng\">大语言模型金融智能应用研发实战与探索</a>\"》主题分享，探讨基于 AI 大语言模型的金融智能应用平台搭建实践，在实际应用场景中，如何利用 AI 大语言模型端到端的解决实际问题，以及以工程化视角，如何搭建可维护可持续可运维的金融智能化应用。</p><p></p><p><a href=\"https://qcon.infoq.cn/2023/shanghai/presentation/5611?utm_source=infoqweb&amp;utm_medium=teacherart&amp;utm_campaign=9&amp;utm_term=1215&amp;utm_content=quancheng\">全成</a>\"，之前曾在某金融集团公司参与关系网络风控识别项目，和说话人声纹识别比对项目；在券商互联网企业参与过大数据量化投资项目。目前在腾讯主要参与 TX2SQL 大模型智能应用项目，负责专业知识及推理大模型微调，构建端到端 TX2SQL 问答系统。他在本次会议的演讲内容如下：</p><p></p><p>演讲：大语言模型金融智能应用研发实战与探索</p><p></p><p>介绍基于 AI 大语言模型的金融智能应用平台搭建实践，分解在实际应用场景中，如何利用 AI 大语言模型端到端的解决实际问题，并以工程化视角，分享如何搭建可维护可持续可运维的金融智能化应用。</p><p></p><p>演讲提纲：</p><p></p><p>AI 大语言模型在实际应用中面临的问题及挑战AI 大语言模型金融智能应用架构，包括业务架构、技术架构、模型矩阵AI 大语言模型金融智能应用介绍，包括智能客服、TXT2SQL 数据分析、OCR 平台</p><p></p><p>听众受益点：</p><p></p><p>○ 大模型时代，智能化应用的研发模式</p><p>○ 端到端智能应用搭建与大模型微调、Prompt 工程等</p><p></p><p>除上述演讲外，QCon 上海还将围绕&nbsp;<a href=\"https://qcon.infoq.cn/2023/shanghai/track/1595?utm_source=infoqweb&amp;utm_medium=teacherart\">GenAI和通用大模型应用探索</a>\"、<a href=\"https://qcon.infoq.cn/2023/shanghai/track/1596?utm_source=infoqweb&amp;utm_medium=teacherart\">AI&nbsp;Agent&nbsp;与行业融合应用的前景</a>\"、<a href=\"https://qcon.infoq.cn/2023/shanghai/track/1597?utm_source=infoqweb&amp;utm_medium=teacherart\">LLM&nbsp;时代的性能优化</a>\"、<a href=\"https://qcon.infoq.cn/2023/shanghai/track/1598?utm_source=infoqweb&amp;utm_medium=teacherart\">智能化信创软件&nbsp;IDE</a>\"、<a href=\"https://qcon.infoq.cn/2023/shanghai/track/1602?utm_source=infoqweb&amp;utm_medium=teacherart\">面向人工智能时代的架构</a>\"、<a href=\"https://qcon.infoq.cn/2023/shanghai/track/1604?utm_source=infoqweb&amp;utm_medium=teacherart\">性能工程：提升效率和创新的新方法</a>\"等专题进行交流。</p><p></p><p>QCon 上海 2023，相约 12 月！ 9 折优惠仅剩最后 1 天，现在购票立减￥680！咨询购票请联系：18514549229（微信同手机号）。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/01/0113b3dfb187d5f9988b7eb16d2e0594.png\" /></p><p></p>",
    "publish_time": "2023-12-15 11:30:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "子曰教育大模型加速落地应用：推出虚拟人AI产品Hi Echo 2.0，新增口语定级等功能",
    "url": "https://www.infoq.cn/article/XbbSlEGawfOpXBSAcI7f",
    "summary": "<p>12月15日，教育科技公司网易有道公布了全球首个虚拟人口语教练Hi Echo的2.0版本。Hi Echo 是全球首个虚拟人口语私教，于今年10月正式推出，其搭载了国内首个教育大模型子曰，是国内最早实现大模型能力真正落地的教育类应用。Hi Echo表情生动、发音地道，还能像“社牛”一样轻松掌控各种话题，超强的语言能力和共情能力刷新了大众对于口语教练的常规认知，快速受到大量用户欢迎。仅仅三周时间，注册用户便突破10万。据介绍，Hi Echo还被苹果应用商店首页推荐，成为首个被苹果官方推荐的虚拟人AI产品。</p><p>&nbsp;</p><p>最新推出的Hi Echo 2.0版本进行了四大能力创新升级——新增口语难度分级；更丰富的虚拟人形象；更多元的对话场景及更具个性化的对话评价报告。即便是零基础的英语学习者，也可以毫无压力地开口说英文，在不同语境中快速提升口语能力，实现真正的英语对话自由。</p><p>&nbsp;</p><p>Hi Echo 2.0新增的“口语定级”能力能根据用户的学习阶段和英语水平，将其实际口语能力划分为“小学、初中、高中、大学、工作中”五个阶段及初级、中级、高级三个等级。不同能力等级的用户可以根据自己的需求和实际水平获取相对应的对话练习，从单词难度、句子长度到语法技巧，Hi Echo能够提供差异化的对话语句。即便是英语口语小白，在面对Hi Echo时，也能避免出现“哑口无言”的情况。</p><p>&nbsp;</p><p>在Hi Echo 2.0中，对话过程中的每句话都将被完整保留。在对话结束后，系统会提供详尽个性化口语分析报告。除了此前所具备的发音及语法打分、润色外，Hi Echo 2.0还提供音素级别的单词发音指导。无论英音还是美音，都能给予用户精准的发音纠正，使用户对自己的薄弱环节和不足之处有更清晰的了解。</p><p>&nbsp;</p><p>除此之外，Hi Echo还是全球首个具备标准MBTI人格模型系统的虚拟人口语教练。在本次升级版本中，除了北京姑娘Echo外，新增了英国绅士Daniel和中加混血Sherry两个虚拟形象，他们有各自的人格特点，用户可以选择自己喜欢的形象无限畅聊。</p><p>&nbsp;</p><p>多元对话场景方面，Hi Echo本次拓展至10个主题、88个子场景的对话方向，还支持用户自定义话题。无论是谈论兴趣理想还是热点事实，Hi Echo都能够灵活切换各种语境，运用专业且地道的词汇和表达方式，配合用户畅快交谈。</p>",
    "publish_time": "2023-12-15 12:44:36",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "AI 浪潮下，搞懂业务逻辑是数智平台的关键能力",
    "url": "https://www.infoq.cn/article/g9qvqGMWf3LuZwbsOIuz",
    "summary": "<p></p><blockquote>从云原生到生成式 AI，企业数智化跟随技术发展而不断升级的脚步从未停歇。但无论企业引入何种前沿技术，其能否取得丰硕的数智化应用成果，关键都在于这些技术创新能否真正理解企业业务，与业务融合的程度如何。因此，基于新技术的数智化创新只有更懂业务，才能真正带动企业生产力进化，助力企业竞争力持续提升。</blockquote><p></p><p></p><p></p><h2>大模型浪潮来袭，更懂业务才是决胜关键</h2><p></p><p></p><p>如今，生成式 AI 技术在企业的应用是行业热门主题，各行业企业都在跃跃欲试，希望引入大模型改造现有的管理和业务流程，助力企业智能决策与运营，甚至发现新的商业模式和收入来源。但归根结底，企业真正关注的焦点并非某些大模型本身，抑或是生成式 AI 这个技术，而是一项创新技术能否在管理和业务中发挥举足轻重的力量，为业务带来增长机会。既然如此，能够被企业认可的大模型很难仅凭通用能力就脱颖而出，而是必须真正落地到业务实践中，与业务充分融合，起到“润物无声”的效果，使企业员工能够在日常工作中感受到效率提升，为企业管理者能够带来有效的决策依据。</p><p></p><p>2023 年，用友推出了业界首个企业服务大模型YonGPT。YonGPT融入了用友专业的人工智能相关技术知识沉淀，服务千行百业企业的经验，以及丰富的业务应用场景。在开发YonGPT的过程中，用友所坚持的原则从未改变：任何服务企业的技术都必须懂业务、与业务深度结合。YonGPT的研发初衷同样如此。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/6e/6e76f53255f1200ad3a68eed58cbf479.png\" /></p><p></p><p>首先，YonGPT将大模型的基础能力与上层的应用服务做了充分解耦。YonGPT可以适配百川 Baichuan、智谱 ChatGLM、百度文心一言等多种通用大语言模型，可以根据企业需要换用不同的模型底座，使企业无需绑定具体的底层大模型技术，随时跟进行业最新的发展成果。实现模型技术与应用层的解耦后，YonGPT专注于上层的工程能力实现，精细打磨提示词、控件、调优等功能，为企业提供低门槛、易维护的应用组件。更为重要的是，用友 iuap将YonGPT的能力逐渐结合到了iuap的各个产品中，使iuap的数智融合能力在 AI 助力下得到大幅提升，进而推动企业业务与管理创新达到全新水平。</p><p></p><p>其次，YonGPT契合了企业基于数智技术实现业务与业务、业务与财务、业务与管理融合创新的时代需求。YonGPT围绕智能化的业务运营、自然化的人机交互、智慧化的知识生成、语义化的应用生成，这四个维度，为企业提供深入到业务前端的全价值链、全场景的智能应用，覆盖了财务、人力资源、营销、研发、采购、制造、供应链、项目、资产营运等业务的多个企业生产经营与运营管理领域。比如企业经营洞察、智能订单生成、供应商风控、动态库存优化、智能人才发现、智能招聘、智能预算分析、智能商旅费控、代码生成等。</p><p></p><p>用友之所以能够第一时间推出与业务深度结合的业内首个企业服务大模型，背后是用友多年的业务积累，以及夯实的数智化底座支撑。用友iuap平台作为用友BIP商业创新平台以及YonGPT的技术底座，在二十多年中，持续创新，不断进化，从单一功能平台，发展成为全面的数智化底座，这个过程尽管经历了不同的技术迭代，平台中融合的企业业务逻辑、业务场景等沉淀越来越厚。懂业务才是企业数智化底座的决胜关键。</p><p></p><h2>技术与业务充分融合，让数智底座真正服务业务</h2><p></p><p></p><p>大型企业为了更便捷的成为数智企业，希望通过第三方服务商为自身构建一个坚实的数智化底座，为上层业务和应用持续输送养分，加速企业创新。经过市场竞争大浪淘沙，主流 PaaS 平台的综合技术水平并没有太大差别，而在实际应用中平台能力能否真正影响业务、支持业务、推动业务持续增长、创新才是关键所在。相比令人眼花缭乱的技术名词，业务层面的较量更能显露真章。</p><p></p><p>用友从 1999 年着手平台产品研发、沉淀技术能力，经过二十多年积累，用友 iuap如今已成为更懂业务、技术领先、体系完整的数智平台，助力企业升级数智化底座。回顾用友iuap的发展历程，从信息化到数字化，再到数智化，不难看出，随着产业的发展和企业需求的升级，用友iuap支撑企业业务的范围在慢慢扩大，技术与业务融合的程度也越来越深。</p><p></p><p>第一阶段：能力储备，为企业信息化提供应用平台支撑</p><p></p><p>从 1999 年到 2011 年，是用友基于自身应用软件，沉淀平台能力的阶段。</p><p>1999 年，为加强对全国信息化工作的领导，国务院成立国家信息化工作领导小组。我国开始积极围绕国民经济发展的重点和热点推动领域信息化工作。此时，用友通过管理软件应用平台，大幅提升了应用系统的开发效率。</p><p></p><p>到了 2006 年，在《2006-2020 国家信息化发展战略》的政策鼓励下，国内企业纷纷投入到信息化建设的大潮中，为了能够帮助企业更快速地建设信息化，用友基于应用软件，沉淀平台能力，帮助企业处理领域业务管理问题，是国内第一款 J2EE 架构的大型企业软件客户化平台。</p><p></p><p>到了 2010 年左右，部分企业的信息化有了初步起色，并且应用系统开始多样化。经过一段时间的技术沉淀后，用友的平台可以根据企业不同的业务场景，满足定制开发、系统集成的需求。</p><p></p><p>第二阶段：拥抱云原生，灵活支持业务创新</p><p></p><p>随着云计算的加速发展，企业开始寻找不仅能够降低成本，还要提高业务灵活性，并寻找更多业务创新机会。2012 年到 2017 年，用友iuap初步完成了在云时代，满足企业业务创新的需要。</p><p></p><p>2012 年，用友企业云平台面市。2014 年，用友iuap开始引入云原生技术，同时完成了从单体应用到分布式服务架构的升级，从单体应用中抽取出了关键的技术服务能力进行组件化封装，例如分布式缓存、分布式锁、打印、工作流等，更加灵活地服务于企业。</p><p></p><p>2015 年，随着企业不断上云，用友iuap完成了云原生技术的重构，成为国内企业服务领域首款完全云原生的平台，并同时在平台之上搭载了 SaaS 服务，例如纯云原生的友云采、友报账等，对企业服务领域的云原生进行了重新定义。</p><p></p><p>在本阶段，基于云原生技术，用友iuap大大简化了企业应用的开发和运维流程，同时为企业应用架构提供了充足的扩展能力。例如，企业开发者可以轻松基于iuap构建自动化测试、流程审批等功能，并在iuap的支持下向信创环境平滑迁移应用。</p><p></p><p>第三阶段：夯实数智底座，推动企业商业创新</p><p></p><p>2016 年《“十三五”国家信息化规划》中，将“数字中国建设卓有成效”作为“十三五”期间信息化工作的总体目标，我国逐步迈入数字化时代，智能制造、数字政府、智慧交通等数字化应用全面开花。随着数字化战略在国家、社会中的重视程度越来越高，工智能、云计算、物联网等技也开始在全社会应用。企业也不再局限于企业内部的创新，开始寻求通过与外部资源的链接，以及进行社会化的商业创新。</p><p></p><p>2019 年，企业对于云计算的认知逐渐深入，单纯的公有云服务不能满足所有需求，混合云成为了新趋势。用友iuap采用混合云架构，基于中台理念，推动技术与业务的深度融合，具有中台架构、云原生、低代码开发、数据智能、混合云、专属化、丰富领域及行业应用融合的全新特点。</p><p></p><p>2020 年，为了帮助企业快速创新，用友推出了用友商业创新平台——用友BIP，而用友iuap正是用友BIP坚实的技术底座，用友行业及领域云都统一构建在iuap之上。用友iuap多云适配、区块链、AIoT、数据智能等能力进一步增强，支持企业社会化商业创新。</p><p></p><p>如今，用友iuap通过应用架构的多项领先创新和强大的业务、数据和智能中台能力，成为是更懂企业业务的数智平台。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/d8/d89c9801d1a083ec2029efa14a9a5ea9.png\" /></p><p></p><p>用友iuap平台以企业业务为导向，实现了多项应用架构的领先创新，包括支撑业务变化和精准运营的特征体系、支撑产业链及价值网业务协同的社会化商业组织与数据模型、重构企业精细管理的事项会计中台、支持组织柔性与灵动发展的多维组织模型、支撑企业实时管控与精益运营的PDCA循环、业务导向随需应用的场景化应用组装等，使能企业随需而变、柔性扩展、韧性成长。</p><p></p><p>用友iuap业务中台把通用的企业服务功能提炼封装为可复用、可扩展、可运营的中台能力，如用户、企业、组织、权限、流程、报表、供应商、物料、商品、电子发票、全球化应用等，并为中台能力的开发、运营提供系列能力支撑。</p><p></p><p>用友iuap为企业提供了财务、人力、采购、制造、营销等 10 大领域 564 个创新服务，比如基于事项会计的大数据财务服务、供应链计划与控制塔、采购供应链协同、基于时间轴的多维组织与人力管理、人才发现与智能招聘等。</p><p></p><p>创新永不止步，AI 时代用友iuap赋能企业智能运营&nbsp;&nbsp;</p><p></p><p>用友充分意识到企业引入任何技术创新和服务方案时，最终目标一定是助力业务成长，而这些技术成功与否的关键也在于能否真正落地到业务层面。正因如此，用友在研发iuap平台时，从一开始就将 PaaS 平台分为技术域与业务域两层，前者包括基础的容器、服务、治理架构等，后者则是一个完整的应用层，包括流程、权限、消息与领域中台等，用以连接业务。应用层包含众多精心调整、可复用和通用的原子化企业应用，按照应用行业和领域做了细分归类，这样的设计主要是为业务考虑，目标是平台上的每一个产品都能做到业务和技术的充分融合。</p><p></p><p>据了解，为了确保能够持续为企业提供业务所需的数智底座，用友iuap平台开发团队每月都会与业务团队召开沟通会，汇聚不同业务领域的客户需求，进行针对性的技术迭代和优化，确保平台上的每一款产品都是为业务而生，能够为业务提供夯实的平台支撑。</p><p></p><p>在用友iuap平台中，原子化的应用能力是支撑业务成长的核心要素，但如何划分每一个能力的维度，将应用适当拆分为合适尺寸的子集，就需要长期的摸索和打磨。用友在实践中沉淀出大量业务知识和方法论，从而构建出了高度成熟的原子化能力矩阵。这些能力经过产品化封装，能够很好地适配各个行业中企业不同领域的业务需求。例如，物流类企业可以使用用友iuap智能中台中的票证识别应用，结合数据中台的数据工场应用矩阵，快速搭建长途货运的数字化票证管理体系；工业生产企业可以利用数据中台的即时分析、数据大屏等服务构建可视化的运维风险识别能力；企业 IT 部门可以借助 YonBuilder低代码开发平台快速开发企业应用，等等。</p><p></p><p>在 AI 普及应用时代，用友开始将生成式 AI 技术与iuap平台的每一个组件逐步结合，为企业数智化进程开启全新的大门。在YonGPT大模型的帮助下，用友iuap平台就能够更加深入地洞察企业业务、优化业务，驱动企业数智化进程从流程自动化进展为价值创造自动化。YonGPT已置入iuap平台业财融合的整体框架，重塑业财流程，帮助财务部门实现价值创造；人力资源领域，YonGPT为人力资源管理数智化提供强力支撑，帮助企业实现数据识人、智能选人、智慧用人；在采购业务中，YonGPT可以实现供应商推荐、价格预测、智能评标等智能交易；在供应链环节可以实现需求预测，库存优化，韧性供应，高效执行；在营销环节可以实现销售预测，产销协同，精准营销；在智能制造环节可以实现智能排产、设备智能维修维护、废钢检测等智能应用。</p><p></p><p>YonGPT是用友iuap平台的一次里程碑式革新，但用友iuap作为企业数智化底座的进化脚步并未就此停歇。一方面，用友iuap将继续拓展YonGPT的应用场景，运用生成式 AI 能力对全平台进行改造升级，帮助企业实现智能化运营；另一方面，用友iuap会进一步探索平台的能力边界，面向更多产业的社会化能力开发应用，使平台可以有效支撑超大型企业的业务创新与管理变革，实现社会化的商业创新。</p>",
    "publish_time": "2023-12-15 14:37:11",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "国内服务器操作系统市场份额第一！欧拉部署累计610万套，市场份额达36.8%",
    "url": "https://www.infoq.cn/article/mTh6gNtBVcczp2JiPGsU",
    "summary": "<p>12月15日，以“崛起数字时代，引领数智未来”为主题的操作系统大会2023在北京国家会议中心举办，大会由开放原子开源基金会、中国电子技术标准化研究院、国家工业信息安全发展研究中心、中国软件行业协会共同主办，旨在汇聚全球产业界创新力量，构筑坚实的基础软件根基，推动基础软件技术持续创新，共建全球开源新生态。</p><p></p><h2>欧拉累计装机量超过610万套</h2><p></p><p>&nbsp;</p><p>据介绍，截至目前，欧拉累计装机量超过610万套，根据IDC预测，2023年欧拉在中国服务器操作系统市场份额达到36.8%。开源四年，欧拉实现了跨越式发展，成长为中国第一服务器操作系统，并在技术创新、生态发展、社区合作、商业落地上建立了完善的发展体系，形成了产业正循环。</p><p>&nbsp;</p><p>在技术生态方面，欧拉与国际主流基金会深度合作，已支持全球98%的主流开源软件；作为CI操作系统在云原生、大数据、存储、数据库、HPC等数十款开源社区，欧拉实现了上游原生支持，开箱即用。欧拉深度参与OpenChain、OpenSSF等全球主流软件供应链安全标准与规范的制定、推广，率先通过OpenChain ISO 5230开源软件协议认证，社区基础设施达到OpenSSF SLSA L3标准。此外，还与全球主流社区和组织合作，满足全球各区域本地化要求，规范欧拉开源社区的国际化治理。目前，openEuler社区与9大海外头部开源基金会开展深入合作，为150多个国家和地区提供服务，构建全球开源新生态，开创了中国开源新模式。</p><p>&nbsp;</p><p>开放原子开源基金会理事长孙文龙在大会致辞中表示，充分利用开源、参与开源、支持开源、回馈开源，是实现操作系统技术创新和产业繁荣的有效路径。</p><p>&nbsp;</p><p>openEuler开源社区秉承“共建、共享、共治”的原则，携手全产业链共建可持续发展的操作系统产业生态。社区开源以来，已吸引1300+家头部企业、研究机构和高校加入，汇聚16800+名开源贡献者，成立100+个特别兴趣小组（SIG），openEuler开源社区已成为中国最具活力和创新力的开源社区。</p><p>&nbsp;</p><p>作为openEuler社区成员单位之一，华为高级副总裁、ICT战略与Marketing总裁彭松在大会致辞中表示，华为将持续聚焦根技术投入，提升基础软件的创新力和竞争力，支撑数字基础设施的建设和应用软件生态繁荣；拥抱智能化，促进操作系统和AI融合，激发基础软件创新；推动产学研结合，培养基础软件以及ICT产业人才，为技术创新提供源源不断的动力。</p><p>2023年度openEuler领先商业实践项目揭晓，22个项目签约捐赠意向</p><p>&nbsp;</p><p>随着欧拉在各行各业规模应用，涌现出大批优秀的创新实践，有力推动行业数字化转型深入。为充分发挥openEuler领先商业实践在行业内的示范作用，引导更多新行业新领域应用落地，加快构筑繁荣共赢的产业生态，OpenAtom openEuler社区联合国家工业信息安全发展研究中心，携手业界专家，围绕技术创新性、示范推广价值、应用规模、服务运维能力、社区贡献五大维度对公开征集的商业实践成果完成多轮遴选，最终评选出15个2023年度openEuler领先商业实践项目。</p><p>&nbsp;</p><p>openEuler捐献给开放原子开源基金会后得到加速发展，2022年12月，开放原子开源基金会宣布openEuler升级为项目群，在治理章程、社区运作、资金募集等方面可独立项目运作，接受开源项目加入，使用openEuler项目群基础设施、运营、营销等资源。2023年上半年，9个项目完成捐赠意向签约，此次大会新增13个项目捐赠意向签约，多为解决方案类、涉及全场景、全开发流程的项目，捐赠后将从云原生、AI、智能化、可监控等维度为openEuler注入新的创新力量。</p><p>&nbsp;</p><p>此外，OpenAtom openEuler社区联合中国电子技术标准化研究院及多位业界专家，根据团体标准T/CESA 1270.5-2023，从技术、治理、生态建设等贡献维度进行评价，选出15家突出贡献的先进单位。</p><p></p><h2>智能时代，操作系统需要面向AI不断演进</h2><p></p><p>&nbsp;</p><p>过去一年，以大模型、大算力为代表的技术创新不断推动人工智能的发展，AI加速进入行业生产系统，改变千行万业产业格局。智能时代，操作系统需要面向AI不断演进。一方面，在操作系统开发、部署、运维全流程以AI加持，让操作系统更智能；另一方面，操作系统也需要适应AI的发展要求，满足通用算力和AI算力异构融合，更好的使能上层AI应用。</p><p>&nbsp;</p><p>目前，欧拉已支持ARM，x86，RISC-V等全部主流通用计算架构，在智能时代，欧拉也率先支持NVDIA、昇腾等主流AI处理器，成为使能多样性算力的首选。</p><p>&nbsp;</p><p>欧拉和AI深度结合，一方面使用ChatGLM基础模型，基于大量欧拉操作系统的代码和数据，训练出EulerCopilot，初步实现代码辅助生成、问题智能分析、系统辅助运维等功能，让欧拉更智能。另一方面，欧拉通过异构资源统一管理与调度，统筹内存和算力，实现CPU和NPU的深度融合，充分挖掘空闲资源，提升有效利用率，进而提升AI训练和推理性能，使能AI更高效。</p><p>&nbsp;</p><p>中国工程院邬贺铨院士在主题发言中表示，紧抓“算网融合”大趋势，相信在openEuler社区上万名开发者和千家伙伴的努力下， openEuler将成为全场景协同数字基础设施的坚实底座，也将助力中国工业互联网实现跨越式的发展。</p><p>&nbsp;</p><p>中国工程院倪光南院士在主题发言中表示，“欧拉”的经验充分证明，只要中国开发者协同起来，就有能力创建世界一流的开源社区。呼吁产业界共同携手，推动开源欧拉成为中国业界带头创建的、首个具有世界影响力的开源社区。</p>",
    "publish_time": "2023-12-15 14:50:30",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "传统ETL式微，NoETL 就可行吗？",
    "url": "https://www.infoq.cn/article/51rQOSSUSUGyWhpx6dVp",
    "summary": "<p>“整个中国，P7及以上的高级ETL工程师数量非常有限，可能总共也就四五百人。”在大数据领域深耕了二十多年的周卫林说道。</p><p>&nbsp;</p><p>周卫林曾经从零建立了蚂蚁的数据平台体系，是蚂蚁集团数据技术的主要奠基人之一。是否通过技术创新来模拟这些工程师的能力，让每个行业都能“养得起”很多这样的高级人才？带着对数据工程发展的全新思考，2021年初的周卫林与蚂蚁原数据平台部的核心成员一起建立了专注消除数据管理技术瓶颈的Aloudata。</p><p>&nbsp;</p><p>他们理念的核心就是用智能化的解决方案取代传统由工程师驱动的ETL作业模式，即“NoETL”，通过ETL智能体（ETL Agent）来驱动数据处理和管理。</p><p></p><h4>传统ETL怎么不行了？</h4><p></p><p>&nbsp;</p><p>ETL（Extract, Transform, Load） 的概念最早由“数据仓库之父”William H. Inmon提出。在数据仓库发展初期，企业需要将分散在不同系统、不同格式的数据整合到一个统一的数据仓库中，以支持业务分析和决策。为了解决数据整合和清洗的问题，ETL工具应运而生，成为处理大量数据的重要工具。</p><p>&nbsp;</p><p>ETL受益于数据爆炸式增长和企业对数据驱动决策需求的增加，同样随着数据规模和复杂度的不断增加，传统ETL技术也开始难以应对。具体来说，传统的ETL面临着以下现实挑战：</p><p>&nbsp;</p><p>技术挑战。随着链路的增多，搬运和处理工作也日渐增多，再加上数据每天要更新，所以每个任务都必须经历排期、研发、测试、上线发布等步骤。查询性能的要求各不相同，当需求变得越来越动态时就迫切需要进行性能优化，有些需求等不及系统优化，则会导致无序开发，进而影响整个链路的管理和治理。</p><p>&nbsp;</p><p>成本失控。难以平衡需求满意度和成本，是数据平台部门负责人一直面临的难题。需求的灵活性导致刚提出时需求往往无法立即满足，只能预先计算可能会被使用的数据，然后再提供给用户，这意味着更高的成本和更低的边际收益。现实中，这会导致许多用户需求满足度下降、业务方不断被IT部门追问目标、利益和ROI而感到沮丧。</p><p>&nbsp;</p><p>ETL工程师能力有限。个人可以管理的任务量和处理的系统复杂度都是有限的，而数据仓库系统是一个综合分析系统，系统内部的数据只增不减，使得管理的复杂度越来越高。另外，由于高频变化的研发，目录的人工维护变得极为困难，这导致数据管理失效。</p><p>&nbsp;</p><p>周卫林认为，现有的ETL工程体系不可持续，必须采用全新的思维方式、新的架构和新的技术来应对这一挑战。</p><p>&nbsp;</p><p>实际上，新的数据集成和处理方法也在不断涌现，例如ELT（Extract, Load, Transform）、流式处理、实时数据集成等，那Aloudata提出的“NoETL”是如何解决上述问题的呢？</p><p></p><h4>NoETL是什么？</h4><p></p><p>&nbsp;</p><p>不同于“ETL是一种企业IT活动”的说法，“NoETL”是一种企业业务能力，旨在寻找一种不再依赖于传统ETL工程师驱动的方法，从而实现数据生产力的可持续和大规模增长。</p><p>&nbsp;</p><p>根据周卫林介绍，“NoETL”模式有四个特点：去管道，无需关心数据位置；免运维，无需操心任务运维；自优化，无需担心查询性能；主动元数据，从被动到主动，实现数据管理的“自动驾驶”。</p><p>&nbsp;</p><p>而要实现上述四大特性，关键是构建三大引擎能力：数据语义引擎、数据虚拟化引擎和主动元数据引擎，三大引擎能力背后分别提供了全新的数据交互界面、数据集成方案和数据管理模式。</p><p>&nbsp;</p><p><img src=\"https://static001.geekbang.org/infoq/f5/f594f8a7a417b7b89350e87384c4be68.png\" /></p><p>&nbsp;</p><p>在全新的数据交互界面中，不仅仅包含报表。底层业务人员需要的不仅是报表，而是更细粒度的数据集和口径明确的指标。实际操作中，用户不需要知道表格存放的具体位置，但要清楚理解指标的口径，以及这些口径背后的值。总的来说，业务人员需要做两件事：明确指标的定义，以及确保这些指标是他们所需要的。</p><p>&nbsp;</p><p>对于全新的数据集成方式，则使用逻辑方式进行数据集成和自动化重构ETL链路的新方法，无需物理集中，即可连接和集成全域数据，同时通过自适应加速技术实现更加高效的数据准备和链路编排。可以用淘宝模式类比：商家首先发布商品，消费者通过添加购物车、下单来完成交易，下单后商家再发物流，物流再进行配送。这与传统的“先补货再销售”的模式截然不同。</p><p>&nbsp;</p><p>全新的数据管理模式，即基于主动元数据驱动的管理。Aloudata&nbsp;实现了一套能够实时感知全局信息的主动元数据系统，通过国际上最为精细的血缘解析能力和数据语义挖掘技术，在数据发现、生产、消费和管理等各环节提供全面准确的元数据及高置信智能建议，从而让复杂数据链路看得清、管得住、治得动。</p><p>&nbsp;</p><p>Aloudata的NoETL架构通过数据语义引擎提供全新的交互界面，通过数据虚拟化引擎实现逻辑数据集成与自动化构建ETL链路，通过主动元数据引擎实现数据治理的辅助驾驶（Copilot）。</p><p>&nbsp;</p><p>根据Aloudata说法，通过这一全新的架构，实际业务中的需求交付周期可以从按周或按月变为按天或按小时交付，存储和计算成本降低50%以上。</p><p></p><h4>NoETL实践</h4><p></p><p>&nbsp;</p><p>在现今的数据架构下，Aloudata推出了三款主要产品：逻辑数据平台Aloudata AIR、实现算子级解析的主动元数据平台AloudataBIG&nbsp;和自动化指标平台Aloudata CAN。</p><p>&nbsp;</p><p>Aloudata AIR基于Data Fabric架构，通过虚拟化集成多源异构数据，无需实际搬运数据，类似于淘宝提供集中购物平台的模式。此外，其自动化物化链路编排和智能查询下推技术，实现了自适应查询加速，显著提高处理效率。</p><p>&nbsp;</p><p>Aloudata BIG作为主动元数据平台，拥有算子级血缘解析能力，可以精确理解线上SQL代码逻辑，实现真正实时、精准的数据理解和更高效的产品应用。此外，该平台能将代码翻译成自然语言，使用户更易理解，为模型治理、链路保障、综合安全合规检查等方面提供价值。</p><p>&nbsp;</p><p>Aloudata CAN颠覆了传统指标管理模式，用户在平台定义指标后，系统可以自动进行指标开发，实现定义即生产、一致性和自动化下线资源回收。这种自动化生产过程大幅简化了ETL工作量，降低了IT参与度。</p><p>&nbsp;</p><p>在Aloudata现有客户里，招商银行与蚂蚁类似，都有十万亿量级的数据管理需求。之前，招商银行采用数据仓库方案通过物理方式实现数据的汇总和加工，进而为分析场景提供数据准备。面对不同场景的多次物理搬运与ETL工程不仅成本高昂，而且会导致重复导数、数据安全、数据时效性差、数据灵活性和使用效率较低等问题，招商银行引入了Aloudata的整套服务。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/e7/e7aaf2e19692c2afdd665d0821f460bc.png\" /></p><p>&nbsp;</p><p>该方案首先通过虚拟化手段将ClickHouse、MySQL、Postgres等引擎中的海量数据进行逻辑整合，构建出一个统一的逻辑数据资产层，进而让BIX平台可以对用户提供更加灵活的自助式数据准备和自助式数据服务的取数用数方式。</p><p>&nbsp;</p><p>自适应物化加速方面，基于用户的查询历史以及数据编排逻辑，进行SQL Pattern的抽取，通过抽取算子模板引用关系统计、计算和存储成本、访问次数以及压缩比等因子，计算出有价值、且复用度高的模板，对模板进行泛化和关系投影(Relational Proiection)的创建，以实现数据预计算链路的物理编排，保障每日十亿级数据量下的查询性能。</p><p>&nbsp;</p><p>数据显示，新方案的数据准备周期从原来的两周缩短至1天，总体存储计算成本较之前降低超过50%。</p><p>&nbsp;</p><p>“我们的使命不仅仅是解决人才短缺的问题，而是更彻底地改变数据的生产方式，让数据随时就绪。”周卫林说道。</p><p>&nbsp;</p>",
    "publish_time": "2023-12-15 15:02:48",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "离开云转战AI？ 23岁写了百万人用的开源软件，这个IT奇才11年后离开了自己的上市公司",
    "url": "https://www.infoq.cn/article/wbFv14DI3TEeGJkoI82r",
    "summary": "<p></p><p></p><blockquote>“不同于云平台转变，AI代表的是另外一种平台迭代，但同样有望从根本上改变我们构建和交付软件的方式。”</blockquote><p></p><p>&nbsp;</p><p>当地时间12月14日，HashiCorp联合创始人Mitchell Hasimoto 终于对外宣告将正式离开自己一手创立的公司。这是一场“蓄谋已久”的告别。在公开信里，他回忆了自己十多年的创业经历、对HashiCorp的祝福，以及表达了自己将去探索新的领域。</p><p>&nbsp;</p><p>Mitchell 在12岁就开始了首次创业，他当时编写了网络游戏作弊大全Cheat Neopets，后来收到了Neopets发来的律师函。当时，Mitchell 的父母并没有太关注儿子对于电脑的喜爱，他们限制他每周只能玩两个小时的电脑。他不得不等父母睡着后偷偷编程。</p><p>&nbsp;</p><p>上大学的时候，Mitchell的父亲只给了他一年的时间来“搞电脑方面的事情”。如果一年内无法证明自己具有这方面的天赋，那么Mitchell就得自付学费，或者按照父亲的意思去当律师或医生。</p><p>&nbsp;</p><p>大一时，他写了一个帮助同学报名选修课的软件，他每年只需花费20个小时来维护这款软件就能入账大约50万美元。但他父亲仍希望他找个正经的工作，而不是靠网站赚钱。后来他进入了一家网络开发公司才得以继续攻读计算机专业。</p><p>&nbsp;</p><p>大三时，他在这家网络开发公司开发了他的成名作：Vagrant，这也是后来HashiCorp创立的重要基石。2014年，全世界已有数百万人在使用Vagrant。</p><p>&nbsp;</p><p>在读书时，Mitchell 遇到了Armon&nbsp;Dadgar ，他们一起为Vagrant工具开发了一款收费的插件应用程序，但这种商业模式占用了他们太多的时间，于是他们开发了名为Atlas的云服务。</p><p>&nbsp;</p><p>Mitchell 与Armon创立了HashiCorp。据Mitchell透露，他们还在2013年获得过 5000 万美元的<a href=\"https://twitter.com/mitchellh/status/1357445215259250689\">收购要约</a>\"：“5000 万美元是一笔令人瞠目结舌的钱，当时我们分别是 23 岁和 21 岁”。</p><p>&nbsp;</p><p>随着公司发展相对成熟后，HashiCorp 有超过 1,400 名员工。作为该公司的CTO，Mitchell 涉及到工程和产品、领导力规划、上市战略管理、客户成功建设和组织建设各个方面。在此期间，他获得了福布斯“30 Under 30”等各种荣誉。</p><p>&nbsp;</p><p>然而因为喜欢“工程”和“编程”，Mitchell从两年前就酝酿从CTO职位退下来，作为“个人贡献者”参与HashiCorp的工作。作为一个上市公司的创始人和董事，能“平稳”退出并不容易，但现在这个他计划已久的一天，终于来了。</p><p>&nbsp;</p><p>下面是Mitchell 的离别赠言。</p><p>&nbsp;</p><p></p><h2>“是时候涉足一点新领域了”</h2><p></p><p>&nbsp;</p><p>本周早些时候，我写下这封给HashiCorp全体员工的信。这里我将信件内容对外公开，希望整个HashiCorp社区能够理解我的选择：</p><p>&nbsp;</p><p>今天，我有一条复杂的消息要跟大家分享：我决定从HashiCorp离职，很快将不再是这家公司的一员。千万别误会，我对这家公司仍然感情深厚。不久之前，我刚刚参与了HashiCorp成立11周年庆典。回顾过去十年间的发展历程，我感到这是我人生当中最重要、也最充实的一个阶段。</p><p>&nbsp;</p><p>但长久以来，我一直在考虑要不要、以及如何告别HashiCorp。自从创立这家公司以来，我就在努力让它能够在不需要我参与日常运营、纯由其他领导者接手之下长期保持稳定。随着时间推移，我也开始有意识地进行规划，包括2016年辞去CEO职务，随时间推移迭代出一种不需要我亲自参与决策的自主领导文化，乃至最后于2021年离开高管团队与董事会。从那时起，我终于找回了自己的本心——当一名亲力亲为的全职工程师。</p><p>&nbsp;</p><p>作为一名工程师，我所关注的不只有基础设施。我一直很清楚，当我个人和这家公司做好准备之后，我一定会转而追求其他新的、不同于以往的挑战。最近我刚刚有了第一个孩子，在休假期间我开始认真反思，觉得现在就是完成这种转变的适合时机。云自动化与基础设施工具的世界虽仍充斥着各种机遇和增长，但在这一领域工作了近15年之后，我觉得是时候涉足一点新领域了。</p><p>&nbsp;</p><p>虽然告别HashiCorp完全是按计划行事，但这个时刻的真正到来仍令我的内心五味杂陈。在成年之后，我的人生几乎都跟这家公司有关，最深刻的记忆也大多与它紧密缠绕。漫长的经历无法一一回顾，但我想跟大家分享几个最激动人心的瞬间。</p><p>&nbsp;</p><p>在共同创办HashiCorp的几年之前，Armon（Armon&nbsp;Dadgar，Hashi Corp联合创始人兼CTO）跟我就一直在密切关注云、自动化和分布式系统。当时的我们还只是十来岁的孩子，我们会半开玩笑地提到：“你说，会不会有一天连世界上最大的企业都离不开我们的软件？”我们也没有停留在想象阶段，而是把一些想法转化成了实际代码。接下来我们获得了几千家用户，这时候就得专门创办一家公司承接这笔业务了。后来，我们又决定采取下一步行动、着手筹集资金。就这样，HashiCorp逐渐发展成了今天的样子：经过一系列像这样的小小开拓，我们恍然发现自己当初那种充满理想主义的少年想象已然成为现实。</p><p>&nbsp;</p><p><img src=\"https://static001.geekbang.org/infoq/76/764bd0a045fe72d966d92e514307c6eb.png\" /></p><p></p><p>2013年时的Mitchell与Armon</p><p>&nbsp;</p><p>在刚刚起步之时，我觉得那些&nbsp;“第一次”特别重要。2015年的第一届HashiConf大会将是我人生中最难忘、最特别的回忆。对我来说，这是数字世界第一次真正与物理世界对接，如今想来仍然如梦似幻。我知道我们的软件拥有很高的下载量，我自己每天也在跟社区成员们在线互动，但看到几百人愿意亲赴现场仍是完全不同的别样体验。我为此感到无比自豪，也从这一刻开始真正感受到肩上的责任。我感受到了内心的挣扎：一方面想要构建起强大的业务，另一方面又为不知如何管理好自己和Armon创立的这家公司而感到惶恐。总之，非常感谢每一位参加首届HashiConf大会的早期采用者和公司员工。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/c9/c94abccc09ef274e406671079ce4068c.png\" /></p><p></p><p>HashiConf 2015大会盛况</p><p>&nbsp;</p><p>仅仅几年之后，我们的第一次整体远程办公探索就再次给我留下难以磨灭的印象。这时候公司的员工甚至比第一届HashiConf大会的观众还要多！而且这家公司由我和Armon一手创办、专注于对技术的探索，这也让我深切感受到员工的重要意义。现在回想起来，我和员工们共同度过的时光正是人生中又一段重要经历。</p><p>&nbsp;</p><p>在我与HashiCorp的合作历程中，还有很多类似的、影响深远的重要时刻。一幕幕情景将永远铭刻在我的脑海当中，我重视其中每一段经历、包括那些艰难的时光，也将其视为达成每个里程碑的必要过程。</p><p>&nbsp;</p><p>我与Armon一起工作了近15年（甚至早于HashiCorp的创立），而且与Dave（Dave&nbsp;McJannet，HashiCorp&nbsp;CEO）也合作超过了七年。我们一起领导这家企业，直到2021年我决定退出高管团队。我们培养出了亲密的友谊，我坚定相信他们的领导能力，也永远怀念与他们并肩战斗的岁月。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/ba/ba794c7aad330930d6c299d5c4779883.png\" /></p><p></p><p>Armon、Mitchell和Dave</p><p>&nbsp;</p><p>当初创立这家公司时，我们秉持的多云理念还颇有争议、甚至可以说是离经叛道，但现如今已经被主流所广泛接受。我参与开发的软件在整个行业中得到广泛应用，涵盖业余技术爱好者到全球最大企业的专业人士。最近，GitHub Octoverse报告发现，HashiCorp配置语言（HCL）再次成为开源项目中广泛使用的顶级语言之一。这意味着HashiCorp在行业中仍具有持续影响力、保持增长且拥有光明的发展前景。如今的一切都超出了我当初的期望，我也深深为自己能在实现目标的过程中做出微小的贡献而感到自豪。</p><p>&nbsp;</p><p>正如之前所说，我在成年之后的整个人生几乎都是围绕着HashiCorp所展开。这家公司不仅对我的个人生活产生了巨大影响，更是对很多其他人的生活产生了巨大影响，包括活跃热情的社区、尊贵的客户、往来密切的生态系统合作伙伴以及出色的HashiCorp员工们。感谢大家付出的努力和倾注的信任。最后，我向公司全体同仁致以衷心祝愿。我将为你们喝彩，感谢大家在HashiCorp发展之旅中做出的贡献，也期待看到你们再创新的辉煌！</p><p>&nbsp;</p><p></p><h2>“Mitchell一直是我的榜样之一”</h2><p></p><p>&nbsp;</p><p>对于这个消息，网友更多给出的祝福和赞誉：</p><p>&nbsp;</p><p>“祝贺您在取得的成就：建立一家行业标准的公司，然后根据自己的条件仔细规划退出，这是一个巨大的胜利！”</p><p>&nbsp;</p><p>“Mitchell一直是我的榜样之一，他既是一位出色的工程师，也是一个非常正派、谦虚的人。我真的很期待他将创造出其他令人惊奇的东西。”</p><p>&nbsp;</p><p>“Mitchell是我能想到的唯一一个经历过tinkerer/IC -&gt; 创始人-&gt; CXO，然后回到自己公司IC 的人 。此外，他关于 Zig 的著作对像我这样对其感到好奇的人也非常有帮助。来自IC同仁的崇高敬意！”</p><p>&nbsp;</p><p>“我最尊重Mitchell的一点是他实际上经常编码。很多‘领导’都是空谈，没有行动或技巧。也许他们曾经有过一些 git 提交，但我总觉得 Mitchell 始终在编码。 不过，不幸的是公司的<a href=\"https://www.infoq.cn/article/oIQh45RPuLXOSVKqkwFA?utm_campaign=geek_search&amp;utm_content=geek_search&amp;utm_medium=geek_search&amp;utm_source=geek_search&amp;utm_term=geek_search\">开源许可发生了一些变故</a>\"。”</p><p>&nbsp;</p><p>大家也很关注Mitchell的未来去向，但他并没有透露更多。他个人网站2022年后的主要内容有三个方面：他的个人项目Ghostty（终端模拟器）、Zig 编程语言相关和关于人工智能的一些见解。因此，很多人猜测Mitchell可能要转战到AI领域。</p><p>&nbsp;</p><p>Mitchell实际上也发表了很多关于人工智能的推文，但似乎他对现在的这些技术并不满意。11月份，他略带愤怒地指出Copilot “社交编码”功能还有很大的改进空间，他也曾经吐槽道，“如果人工智能社区的人们能够停止用“就是你所需要的”来结束他们的论文标题，那就太好了。”</p><p><img src=\"https://static001.geekbang.org/infoq/ae/ae63596b49a93e06e28634ac5a4947dd.png\" /></p><p></p><p>&nbsp;</p><p>那么Mitchell眼里的AI发展是怎样的呢？</p><p></p><h2>Mitchell 对AI发展的预测</h2><p></p><p>&nbsp;</p><p>今年4月份，Mitchell 从云崛起的历史视角回顾整个AI发展过程，借此通过对云服务和AI进行比较、并对未来做出预测。</p><p>&nbsp;</p><p>Mitchell 认为，近期的AI发展拥有即时价值的创造力，但由于附加功能和工具的缺失而导致在很多场景下有点不切实际，不过他相信这些问题是可以解决。</p><p>&nbsp;</p><p>Mitchell 预测，AI领域会将某种属性用“新”与“旧”明确划分开来，而拥抱“新”产品和业务的厂商将对下一代用户产生更强大的吸引力。同时，生成式AI在为新型软件带来革命性变化的同时，也能在很大程度上让“遗留”软件变得更好。</p><p>&nbsp;</p><p>下面是Mitchell 在文章里对自己观点的详细论述：</p><p>&nbsp;</p><p></p><h4>即时价值</h4><p></p><p>&nbsp;</p><p>云服务的早期成功标志，在于能够为采用者提供即时价值。对于小型项目而言，EC2是速度最快、成本最低的服务器资源获取方式；而S3同样是存储/交付静态资产与二进制blob的简单可靠方案。所有这一切都基于简单易用的HTTP API，相当于是敞开怀抱欢迎工程师们迈向这个自动化新时代。</p><p>&nbsp;</p><p>近期的AI发展也有着同样直接的价值创造力。以往那些难以快速汇总的问题，例如情感分析（“这段内容有攻击性吗？”）如今已被轻松解决。而Copilot等工具生成的代码不仅帮得上忙，有时候甚至比我们自己写的还要好。而且，生成式AI跟当初的云服务一样，也是从易于上手的HTTP API起步，鼓励工程师们迈向这个自动化的新时代。</p><p>&nbsp;</p><p>即时价值其实非常重要，因为它建立起热情的早期用户群体，并在市场上引发了巨大轰动。但与此同时，很多人把即时价值误解成了持续价值。AI的确表现出了激动人心的早期潜力，但这份价值能够扩展到多大、持续多久仍然有待观察。</p><p>&nbsp;</p><p>大家可能还记得加密货币，在我看来它就没能通过测试，即缺乏显而易见的即时价值。支持者坚称加密货币拥有各种长期的未来价值……可能是，也可能不是。但我只知道时至今日，我们对于手头持有的比特币也不知道该怎么使用——除了投机炒作。整整13年过去，无论是不是真的拥有长期潜力，加密货币都仍未表现出真正的即时价值。</p><p>&nbsp;</p><p></p><h4>不切实际的开端</h4><p></p><p>&nbsp;</p><p>早期云计算根本不足以支撑并解决大量问题，所以很多人觉得它有点不切实际。直到2008年，也就是EC2亮相的两年之后，云实例才真正有了长期IP地址。同样是在这个时候，亚马逊云科技才拿出能够可靠保存数据的持久存储服务。刚开始，所有EC2实例都位于共享公共网络之上，直到三年后的2009年推出VPC。类似的例子还有很多很多。</p><p>&nbsp;</p><p>我们当然不能孤立地判断某种事物是否不切实际，毕竟事物之间有着复杂的关联且互为依托。因此，虽然这种专用网络的缺失无法满足商业软件构建与交付的需要，但对于小型项目和早期初创公司来说并没什么影响。于是他们热情投身于云计算当中，给这个新兴行业带来了关注度和旺盛的增长势头。这又反过来推动亚马逊云科技不断发布新服务，把不切实际转化成了脚踏实地。</p><p>&nbsp;</p><p>而随着云计算的普及和炒作，当时的人们普遍有种误解，即“这东西不是给真正的大企业用的。”可随着云能力的不断增强，论调也悄然发生了变化，诸如“财富500强企业永远不会上云”、“受监管的企业永远不会上云”、“政府机构永远不会上云”之类的说辞一一过时。时至今日，就连美国的国防机构都开始高度依赖云基础设施。</p><p>&nbsp;</p><p>而当下的AI技术也处于类似的境地。尽管它拥有突出的即时价值，但由于附加功能和工具的缺失而导致在很多场景下有点不切实际。必须承认，面对某些问题它很难、甚至根本没办法给出正确的答案。大语言模型与外部最新知识的融合也处于起步阶段，许多工具缺乏企业的广泛支持，整个市场也处于群雄并起、态势不明的混乱阶段。</p><p>&nbsp;</p><p>但就像当初的云计算一样，我发现人们再次用笃定的语气言之凿凿：“AI永远没法生成大量代码”或者“AI永远需要人的指导”等等。也许是，也许不是。这些误解本身无法被立即破除，但千万不要因为它们的存在而忽略时代的整体趋势。</p><p>&nbsp;</p><p>而考虑到AI已经表现出极强的即时价值，我相信这个问题会像当初的云计算一样得到解决。AI当中不切实际的部分并不在于它没用，而在于难以大规模集成或者证明其普适性。好在这是个能够解决的问题，那接下来就要交给时间了。</p><p>&nbsp;</p><p>在考虑种种有待证明的潜在价值时，也确有一些看似无法解决的问题。举个极端的例子，通用人工智能（AGI）到底能不能实现仍无宝座，而且现今存在的模型似乎都没办法通往真正的AGI。然而，这样的所谓“不切实际”属于涉及未经证实的狭义价值挑战，并不满足我前面提到的“不切实际”定义。</p><p>&nbsp;</p><p></p><h4>软件属性正在演变</h4><p></p><p>&nbsp;</p><p>平台转变的一大标志性特征，就是会迫使软件属性也同步发生演变。适配这些属性的软件通常会有专门的头衔，例如“云原生”或者“移动优先”。早在2016年，我就曾在演讲中介绍过“云原生”属性，即从静态思维方式向着动态思维方式的转变：</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/af/af4d3006fd17ff56f5965f8cb42812ac.png\" /></p><p></p><p>（上图并非我在2016年使用的初版幻灯片，而是引入了更多现代元素。我们曾在随后几年多次在HashiCorp演示环节中用到。）</p><p>&nbsp;</p><p>我的观点是，左侧中的软件属于“传统软件”，即虽然也可以在云环境中运行，但却比不上具备同等功能、但采用动态/云原生方法的新软件。对于左边这类软件供应商来说，他们的产品也更有可能被构建同类软件、但具备右侧属性的初创公司所蚕食。举个例子，我一直认为如果老牌企业真能适应云原生世界，那么Vault压根就不会存在。</p><p>&nbsp;</p><p>软件属性变化的鲜明案例就是当初的移动应用。2010年初，我曾跟美国一家大型银行的CEO当面交流。他反问我，“你觉得人们选择更换银行的主要原因是什么？”在听了我提出的几个错误答案后，他表示“谁家的移动应用功能更丰富，人们就更愿意选谁。”也正因为如此，银行才需要在云服务和软件工程中投入这么多的资金，而这一切都将以移动功能的形式呈现。而那些长期对于移动设备的兴起态势无动于衷的银行，必将失去更多客户。</p><p>&nbsp;</p><p>另一个更古老的例子则是Web应用。相信大家也有印象：如果某项服务推出了Web版本，那么用户也更乐于选用。Web应用的性能表现也是同理，性能越好则吸引力越强。</p><p>&nbsp;</p><p>我推测AI领域也会出现类似的情况。将有某种属性将“新”与“旧”明确划分开来，而拥抱“新”产品和业务的厂商将对下一代用户产生更强大的吸引力。“旧”软件当然不会被立即淘汰，只是与“新”软件相比，前者会成为越来越缺乏吸引力的选项，而且双方的差距会随着时间推移而越来越大。</p><p>&nbsp;</p><p>当然，现在对这种属性做具体判断还为时过早，恐怕还须多年的积淀和发展才能找出有说服力的答案。不过从当前大语言模型提供的商品化自然语言界面来看，未来所有软件至少都需要提供某种形式的自然语言交互选项。例如拥有事件生成功能的日历应用、具有语言引导配置的命令行工具、提供高质量使用助手的SaaS等。这些都是相对容易解决的问题、能够为用户提供良好体验，而且未来很可能会成为市场对软件产品的基本要求。</p><p>&nbsp;</p><p>只要各行各业的老牌厂商能够意识到这股洪流、做出反应并适应转变，相信都可以平稳迈入生成式AI新时代。必须承认，除了AI增强之外，大多数应用的核心功能仍是其能够健康存续的善根前提。而AI技术的转变则为初创公司带来机遇，让他们能够成功超越那些迟迟不肯自我革新的传统巨头。</p><p>&nbsp;</p><p></p><h4>结识新朋友，不忘老朋友</h4><p></p><p>&nbsp;</p><p>我认为早期云计算之所以能够成功，一个非常重要的前提就是给出了妥善的迁移方案。尽管功能仍然有限，但“原样上云”确实在很大程度上降低了云计算的使用门槛。其他大型平台转变（例如容器化）也表现出了类似的特征。</p><p>&nbsp;</p><p>而云端之上的后续演进，例如Heroku或者更普遍的平台即服务（PaaS），则不具备这样的向下兼容能力。虽然早期PaaS也曾非常流行，但由于很难、甚至根本无法与“遗留”应用程序相集成，所以在平台变革浪潮中的意义相对有限。</p><p>&nbsp;</p><p>换句话说，那些要求抛弃旧技术才能采用的新技术，往往比积极接纳旧技术的新技术更难在整个行业中产生广泛影响、得到普遍接受。</p><p>&nbsp;</p><p>而如今的生成式AI则没有这样的问题。它们在为新型软件带来革命性变化的同时，也能在很大程度上让“遗留”软件变得更好。</p><p>&nbsp;</p><p>这也是我个人对Web3生态系统评价不高的一大主要原因。因为Web3划出了明确的边界：只存在dApp和非dApp，二者之间没有缓冲地带。我知道理论上某些功能可以采取“链上”构建，但很多功能仍然不行，这会严重限制整个生态系统的推广和落地。</p><p>&nbsp;</p><p></p><h4>总结</h4><p></p><p>&nbsp;</p><p>AI可能正在迎来自己的“平台转变”时刻，我也坚定相信与早期云计算拥有一系列优良品质的AI能够克服当下这些暂时性的挑战。</p><p>&nbsp;</p><p>如果判断正确，那么我们正身处这场漫长比赛的开头几局。假设把亚马逊云科技发布S3和EC2视为云平台转变的起点，那么整个生态系统将需要十年左右才能逐步发展成熟，而那些“传统”主流企业将在此期间持续遭受冲击、顽固不化者则被最终淘汰出局。</p><p>&nbsp;</p><p>当然，我也承认AI掀起的热潮在社会影响力方面要远超当初的云计算，所以也许市场成熟的时间周期会更短。但无论如何，我仍认为至少还有几年的“开放窗口”可供先行者们充分把握。</p><p>&nbsp;</p><p>未来的命运就取决于当下，请大家务必认真关注、努力把握。</p><p>&nbsp;</p><p>&nbsp;</p><p>相关链接：</p><p><a href=\"https://www.hashicorp.com/blog/mitchell-reflects-as-he-departs-hashicorp\">https://www.hashicorp.com/blog/mitchell-reflects-as-he-departs-hashicorp</a>\"</p><p><a href=\"https://mitchellh.com/writing/ai-through-a-cloud-lens\">https://mitchellh.com/writing/ai-through-a-cloud-lens</a>\"</p>",
    "publish_time": "2023-12-15 15:07:50",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "精彩抢先看：2023 英特尔On技术创新大会中国站即将上线！",
    "url": "https://www.infoq.cn/article/06NUuwLU3PC6MTrmTRbg",
    "summary": "<p>2023 英特尔On技术创新大会中国站即将上线！12月19日上午9点，一起跟随中国专家了解最新一代增强AI能力的计算平台，支持开放、多架构的软件方案和工具，塑造未来的技术和应用创新。#IntelON# #英特尔On技术创新大会#<br />\n点击&gt;&gt;&gt;<a href=\"https://marketing.intel.cn/innovation?tc=gsdbsf5v6l&amp;cid=23prcinnovation#/?block=26\">https://marketing.intel.cn/innovation?tc=gsdbsf5v6l&amp;cid=23prcinnovation#/?block=26</a> 预约观看直播</p>",
    "publish_time": "2023-12-15 15:29:26",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "Kevin 邀你一起围观英特尔 On 技术创新大会中国站~",
    "url": "https://www.infoq.cn/article/p1Vl0Df5ZFH5JRmFRCyQ",
    "summary": "<p>欢迎参加英特尔 On 技术创新大会中国站，12 月 19 日上午 9 点，助力开发者，让 AI 无处不在！<br />\n#IntelON# #英特尔On技术创新大会#<br />\n点击&gt;&gt;&gt;<a href=\"https://marketing.intel.cn/innovation?tc=gsdbsf5v6l&amp;cid=23prcinnovation#/?block=26\">https://marketing.intel.cn/innovation?tc=gsdbsf5v6l&amp;cid=23prcinnovation#/?block=26</a> 预约观看直播</p>",
    "publish_time": "2023-12-15 15:41:16",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "英特尔 AI PC 国内落地：联想主力出货机型内嵌混合AI算力",
    "url": "https://www.infoq.cn/article/CI9uyzCEIroZJaQAcz1U",
    "summary": "<p>一直以来，无论是 PC 厂商还是上游芯片厂商都对一个问题很是头疼：如何驱动用户去更换旧电脑。</p><p>&nbsp;</p><p>2020到2022 年期间，由于居家办公以及远程办公的需求陡增，驱动了一波电脑换机潮，但到了 2023 年，用户换机动力下降。不过技术并非线性发展，在大模型技术驱动下，AIGC 应用和需求获得了爆发性增长，PC 和手机也面临产品形态和交互方式重塑的可能性。</p><p>&nbsp;</p><p>在此背景下，在 9 月的 ON 技术创新峰会上，英特尔提出了 AI PC 的概念，并推出了首款基于 Intel 4 制程工艺打造的 Meteor Lake 处理器平台，即第一代酷睿 Ultra 平台。12 月 15 日，英特尔正式在国内发布第一代酷睿 Ultra 系列处理器。</p><p>&nbsp;</p><p>为什么 Meteor Lake 处理器平台是第一代酷睿 Ultra，而不是酷睿第14代？</p><p>&nbsp;</p><p>今年年中，英特尔公布了酷睿 Ultra 品牌，代号 Meteor Lake，采用全新 Intel 4 制程工艺。与以往英特尔处理器架构不同的是，它采用了全新的分离式模块架构：由计算模块、SoC 模块，图形模块和 IO 模块组成。其中在 SoC 模块中，英特尔首次集成了神经网络处理单元 NPU，用来进行高能效的 AI 运算。</p><p>&nbsp;</p><p>目前 Meteor Lake 处理器平台，即酷睿 Ultra 用在了移动平台的 H 系列和 P 系列，分为酷睿 Ultra 9/7/5 三个子系列。移动平台上的 U 系列没有采用新架构，依旧是 13 代酷睿的升级版，不过仍然被命名为第一代酷睿（没有 Ultra 后缀），分为酷睿 7/5/3 三个子系列。在桌面端的 S 系列，还有 HX 系列，也是 Raptor Lake 13 代酷睿的升级版，称之为酷睿第14 代，分为酷睿 i9/i7/i5/i3 四个子系列。</p><p>&nbsp;</p><p>虽然有点复杂，但英特尔表示，只有基于拥有新架构和独立 NPU 单元的酷睿 Ultra 处理器平台，才是定义中的 AI PC。那么，到底什么是AI PC呢？</p><p>&nbsp;</p><p>与传统PC不同，AI PC 能够针对每个人的工作、学习、生活等场景，提供个性化创作、私人秘书和设备管家在内的个性化服务。未来的AI PC，本地、边缘和云端可以合理地调配任务，提供即时的服务。用户购买 AI PC 之后，就可享受设备全生命周期的本地免费推理服务，再加上必要的云端订阅，可以降低个人用户使用 AI 大模型的成本。另外，AI PC可以对个人数据和隐私提供充足的安全保障。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/2c/2c9947a5a2e7f7842b611ee891076c7d.png\" /></p><p></p><p>联想阿木表示，AI PC必须是一个包含了AI 模型、应用以及硬件设备的混合体，这样才能实现其核心价值。它需要具备自然语言交互的能力，内嵌以本地为主、边缘与云为辅的大模型方案，并通过本地混合多重XPU AI算力实现。这还需要开放的 AI 应用生态作为支撑，如AI 原生应用、AI 赋能应用和公共大模型等。另外，在本地实现AI相关能力时，还要支持设备级个人数据和隐私安全保护。</p><p>&nbsp;</p><p>全新的英特尔酷睿Ultra处理器拥有CPU、GPU、NPU三重AI算力，可以针对不同的AI应用场景调用不同的层级的AI算力能力。阿木认为，从产业层面来开看，AI PC还需经历从AI Ready到AI On两个阶段。如今，AI PC已经正式进入AI Ready阶段，所谓AI Ready就是芯片架构升级、内嵌混合AI算力，这就会增强AI PC设备级的AI体验，从此，AI PC将开启本地AI应用体验的创新。</p><p>&nbsp;</p><p>AI On则是指PC具有完整的AI PC核心特征，并且在广泛的通用场景提供划时代的AI创新体验，成为每一个人的个人AI助理。随着核心技术创新、产品体验优化、AI应用生态繁荣，AI PC能够服务于更加广泛的通用场景，并且能够实现端边协同计算、跨设备互联接力，甚至能够基于个人数据和使用历史，在边缘私域环境下实现个人大模型的微调训练。</p><p>&nbsp;</p><p>在英特尔酷睿Ultra处理器的加持下，联想也应完成了AI Ready的初步部署。</p><p>&nbsp;</p><p>阿木表示，联想AI Ready笔记本电脑联想ThinkPad X1 Carbon AI和联想小新Pro 16 AI酷睿版，正式开启预约/预售，这两款产品内嵌混合AI算力、创新/增强AI体验和升级了设备体验。在内嵌混合AI算力方面，两款新品均首批搭载英特尔酷睿Ultra处理器，配有全新AI专属芯片NPU。</p><p>&nbsp;</p><p>一直以来，联想小新 Pro 都是联想的主力出货机型。为了在这个系列上成为量产英特尔酷睿 Ultra 处理器机型，联想小新研发团队基于英特尔酷睿 Ultra 平台，为业界贡献了诸多 Debug 解决方案，并且结合联想小新 Pro 系列性能小钢炮的产品定位，攻克了 7467MT/s 内存超高频难点。</p><p>&nbsp;</p><p>之所以要获得超高频超高带宽的内存，是为了获得在 AIGC 创作和游戏上的更高收益。比如，在与英特尔、剪映的深度合作中，联想进一步优化了剪映在全新酷睿 Ultra 平台的视频剪辑效率，通过优化英特尔 GPU 缓存管理策略，提升 GPU 3D 利用率和稳定 GT 核心功耗，实现了高达 16.7% 的导出速率提升。</p><p>&nbsp;</p><p>另外，联想和剪映合作还带来了首个基于 NPU 的 AI 应用：智能抠像。借助全新的 AI 专属芯片 NPU，通过异构计算调优，实现了更优秀的每瓦功耗。相较于传统基于 iGPU 的软编软解方案，时间缩短约 72.2%，功耗减少约 71.4%。</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "publish_time": "2023-12-15 16:34:06",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]