[
  {
    "title": "科技引领变革，工程师和企业如何提高社会影响力",
    "url": "https://www.infoq.cn/article/ji5jsdqqbat2IHrGI3fk",
    "summary": "<p>科技行业工程师通过他们的社交网络、技能和经验，有能力产生社会影响力。企业可以通过将商业实践与社会意识相结合，发挥其影响力。具备包容性的培训可以考虑到个人的背景和情况，最大程度地降低参与障碍，确保广泛的参与。这种包容性涵盖了种族、性别、神经多样性以及社会经济背景等多个方面。</p><p>&nbsp;</p><p>在<a href=\"https://qconlondon.com/\">QCon 2023伦敦大会</a>\"上，Germán Bencci上谈到了具有社会责任感的企业。</p><p>&nbsp;</p><p>Bencci提到，在大多数情况下，社会影响力并不是企业所认为的那样。企业可以考虑小额慈善捐款、志愿服务日、校园演讲。Bencci说，这并没有什么错，但企业可以通过专注于让自己的商业行为具有社会意识来产生更大的影响：</p><p></p><p></p><blockquote>我考虑的是他们的招聘方式、他们的多样性统计、他们的设备和服务，以及他们的利润承诺，在影响力和业务之间建立起最紧密的联系。</blockquote><p></p><p>&nbsp;</p><p>Bencci建议，为了产生社会影响力，工程师和他们的企业应该尽可能地创造最好的产品，尽可能地盈利，但要仔细考虑创造产品的方式，以及如何在商业成功和影响力之间建立起紧密的联系：</p><p></p><p></p><blockquote>作为一名工程师，你至少有三种可用的资源：技能、经验和社交网络。你可以利用第一种资源，通过招聘、指导和使用合乎道德的服务来创造具有社会影响力的产品。社交网络可以促使企业将一定比例的利润用于提升社会影响力的工作。</blockquote><p></p><p>&nbsp;</p><p>Bencci提到，工程师可以通过他们所做的工作、招聘实践、招聘目标和多样性统计来影响企业并提出建议。他解释说，他们还可以在CodeYourFuture这样的组织中做志愿者。这样的组织为人们创造了一个最佳的空间，让他们可以与机会较少的人分享技能和经验：</p><p></p><p></p><blockquote>试着利用你现有的资源产生最大的影响，但要专注于把自身视为一种资源。</blockquote><p></p><p>&nbsp;</p><p>Bencci认为，人们需要接受教育和就业。他们想要拥有专业人士的生活。他们希望可以有工作、社会地位、同事。他们想要在企业里工作，有一份工资可以养家糊口，并成为孩子的榜样。人人都希望有机会成为专业人士。</p><p>&nbsp;</p><p>Bencci说，包容性培训意味着你要考虑各种不同的个人情况和背景，关键是人们拥有的时间和金钱，以及你可以提供哪些服务来最大限度地降低参与门槛。为了确保广泛参与，还需要对准并跟踪参与者的不同方面，包括种族、性别、神经多样性和社会经济背景。</p><p>&nbsp;</p><p>Bencci举了CodeYourFuture的例子。为了保证公平的代表性，该项目度量了参训人员的关键统计数据，涉及性别（40%是女性）、年龄（平均年龄35岁，20%的学员超过40岁）、种族（超过70%是非欧洲/白人血统）、社会经济背景（78%生活在贫困线以下）和神经多样性（大约30%的学员具有神经多样性）。</p><p>&nbsp;</p><p>InfoQ就如何创造社会影响力采访了<a href=\"https://www.linkedin.com/in/gbencci/\">Germán Bencci</a>\"。</p><p>&nbsp;</p><p>InfoQ：营利性企业能产生什么样的社会影响力？</p><p></p><p></p><blockquote>Germán Bencci：以招聘平台Cord为例。在过去的几年里，它为CodeYourFuture等社会公益事业捐赠了高达1%的资金，并充分利用自己的这一举动向客户推销自己的服务。&nbsp;当有人通过他们的平台找到工作时，他们会发送一条信息告诉人们，他们支付的费用帮助了其他弱势群体的人接受培训并加入了科技行业。</blockquote><p></p><p>&nbsp;</p><p>InfoQ：包容性技术培训有什么影响？</p><p></p><p></p><blockquote>Bencci：这是保持失业状态或从事低收入工作与开启充满机会和经济回报的职业生涯之间的区别。它给人们带来了独立、骄傲和自信。它给他们的生活、家庭和周围的人带来了根本性的改变。人们开始相信新生活是可能的。</blockquote><p></p><p>&nbsp;</p><p>InfoQ：企业可以做些什么来提升他们的社会影响力？</p><p></p><p></p><blockquote>Bencci：关心社会影响力的企业应该专注于创造价值和文化，将社会影响力作为企业的目标之一，同时将产品、盈利能力和增长作为优先事项。&nbsp;一个有社会影响力力的企业会：- 通过一些可变因素来衡量团队的多样性- 创建多样化的招聘实践- 制定有意识的团队采购策略- 给予新人成长机会- 修正营销等领域的支出，以确定支出合乎道德- 确保可持续的盈利比例，以资助社会影响力实践，包括在组织内部&nbsp;还有很多事情可以做。企业不必想的太远就能产生影响力。</blockquote><p></p><p></p><p>原文链接：</p><p><a href=\"https://www.infoq.com/news/2023/04/engineers-social-impact/\">What Engineers and Companies Can Do to Increase Social Impact</a>\"</p><p></p><p>相关阅读：</p><p><a href=\"https://www.infoq.cn/article/qhgHLsmYuUuAZC9J4S2Q\">马斯克开会当场解雇Twitter首席工程师：我有1亿多粉丝，他却说公众对我失去兴趣</a>\"</p><p><a href=\"https://www.infoq.cn/article/YDao4WyBKCuIuuGDMrBB\">从JS到全生态，云原生时代下的前端成长演进之路 ｜展望前端工程师的2023</a>\"</p>",
    "publish_time": "2023-06-15 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "SUSE：强化零信任、自动化和易用性，筑牢云原生安全防线",
    "url": "https://www.infoq.cn/article/5fcfc291be1a718bfdf3e834a",
    "summary": "<p>刚刚过去的五月，全球知名的电动车及能源公司发生了大规模的数据泄露，再次给安全行业敲响了警钟。数字化时代，云原生技术在发挥数字业务快速交付与迭代优势的同时，带来了新的安全风险和挑战。</p><p></p><p>对此，企业应该如何应对？近日，SUSE 安全产品战略副总裁黄飞进行了深度分享。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/6f/6f8e09ae3289e770b72b256fc4938ad1.png\" /></p><p>黄飞，SUSE 安全产品战略副总裁</p><p></p><h2>新技术带来新风险</h2><p></p><p>虚拟机、容器、服务网格、多集群间通信、多云和混合云、Serverless 等新技术不断涌现，对安全边界提出了越来越多的要求。</p><p></p><p>2014 年流行起来的容器技术算是跨时代的变革，它与 Kubernetes 等技术共同助力企业实现了应用程序部署等诸多方面的自动化，但同时也带来了新的安全挑战。黄飞认为挑战主要包括四个方面：首先容器更新迭代非常快，传统的保护方式已经不适用于容器环境；第二是软件生产的流程自动化，容器开发阶段每天可达上千次的软件发布依赖整套 CI/CD 自动化流程控制；三是越来越多的企业开始在跨云多云环境部署容器；四是容器将单一的应用变成了成百上千的微服务，导致服务内部通信爆发式的增长。</p><p></p><p>Kubernetes 采用虚拟化技术，数据、网络、计算等层面的全部虚拟化对于应用程序开发者来讲非常实用。然而，这却让运维安全人员无法了解容器的运行状况，即虚拟化技术本身对安全管控形成了一定的屏障，这无疑升级了安全挑战。</p><p></p><h2>使用“零信任”升级传统安全</h2><p></p><p>2021 年底，“核弹级”的 Log4j 漏洞爆发，大量企业被波及。黄飞将 Log4j 比喻为洋葱芯中的 bug，因为它被层层包裹、嵌入在其他软件包中，很难被常见的扫描方法识别到。他认为对付此类漏洞，首先要从源头进行有效的扫描和控制 CVE 安全漏洞；而对于无法下线进行修复的应用程序，零信任安全则是最有效的保护方法。</p><p></p><p>像 Log4j 这样的高危漏洞随着开源软件的广泛使用而与日俱增，但传统安全工具在云环境很难提供全面的保护。此外，随着公有云的快速发展，业界对安全界限的认识也出现了分歧。“很多客户认为公有云的安全应该完全交给供公有云厂商，但事实并非如此。”黄飞强调，应用程序级别的安全必须由各个企业用户自己负责。这意味着，面对越来越多未知的安全风险，企业的安全防护要从被动式的安全逐渐过渡到主动式安全。</p><p></p><p>主动安全是一个新的概念，无论处于云原生化的哪一个阶段，企业都可以采取较为主动的零信任安全功能来提高效率。“零信任安全并不需要推翻一切从零开始，企业可以循序渐进地进行部署。”黄飞认为，传统安全能够堵住已知的安全漏洞，而零信任安全能够防范未知的安全风险，传统安全与零信任安全的叠加使用可以帮助企业实现多层防护。</p><p></p><p>同时，考虑到大部分企业已经在传统安全上投入了大量资源和金钱，根据企业的实际情况选择最有效的方面开始针对性部署零信任安全也是最经济的方式。</p><p></p><p>黄飞把整个云原生零信任安全的实施划分成四个阶段：用户和可视化；设备、网络和环境；应用程序、服务和编排管理；数据、自动化和合规检查。企业无需推翻所有的安全投资和配置，可以从某一个单点开始介入和部署，逐步深化。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/0b/0b7cba42fa0392d5bbc711e5def52533.png\" /></p><p></p><p>NeuVector 在创立之初就专注于容器安全，能够提供端到端的安全服务以及从 DevOps 流水线漏洞保护到生产中的自动化安全和合规性，可以作为零信任安全模型的重要部分，实现对容器环境的实时安全保护和威胁检测。</p><p></p><h2>开源为云原生安全带来更多可能</h2><p></p><p>2022 年 1 月，在被 SUSE 收购 3 个月后，NeuVector 宣布开源，成为业界首个端到端的开源容器安全平台。“这是推动容器安全发展的重要里程碑。”作为 NeuVector 的联合创始人兼创始 CEO 的黄飞评价道。</p><p></p><p>NeuVector 本身拥有十几项技术专利，包括深层数据包检查和行为学习，可识别适当的容器行为，并且仅允许在容器环境中经过批准的白名单进行网络链接、进程访问和文件存取。NeuVector 在运行时提供完整的攻击检测和预防，主动保护生产环境；作为容器部署，具有高度扩展能力。NeuVector 开源之后，所有加入开源专利联盟的企业都可以开诚布公地合作，共享专利与技术，这对整个软件平台产业的发展至关重要。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/21/213f4b4f77bbb263a313ac0d3acd0702.png\" /></p><p>NeuVector：Kubernetes 安全与合规一体化平台</p><p></p><p>黄飞表示加入 SUSE 后学到的最重要的东西是开放性。NeuVector 虽然是 SUSE 的安全产品，但其开源容器镜像可以安装在任何流行的 Kubernetes 集群上，可以支持包括红帽 OpenShift、VMWare Tanzu 等在内的众多企业级容器管理平台，以及 Google GKE、Amazon EKS、Microsoft Azure AKS 等 K8s 发行版。秉承开放战略，NeuVector 将始终致力于成为所有云原生环境的优秀安全解决方案。</p><p></p><h2>打造全栈云原生平台能力,全方位守护云安全</h2><p></p><p>“SUSE 的愿景不仅仅是打通 Linux 操作系统，而是提供从操作系统到容器管理平台再到云安全方案的一整套解决方案，这也是业界发展的一个趋势。”黄飞介绍，随着 Rancher 和 NeuVector 的加入，SUSE 快速增长，现在逐渐拥有了几乎是全栈的云原生平台能力。</p><p></p><p>目前，SUSE 是唯一一家通过最高级别加密认证 FIPS 的 Linux 平台，新一代 SUSE Linux 操作系统开始集成机密计算技术，各个产品都在持续开发各种各样的安全功能。</p><p></p><p>黄飞介绍，企业级的操作系统管理平台 SUSE Manager 能统一管控安全扫描以及补丁功能；SUSE 为 CNCF 贡献的重要安全工具 Kubewarden，能够帮助 Kubernetes 集中管理安全策略；企业容器管理平台 Rancher Prime 提供集群的全生命周期管理，不仅可以跨云统一创建集群，还可以统一管理、升级和配置集群。此外，Rancher Prime 与零信任容器安全平台 NeuVector 的集成，让 Rancher Prime 能够满足整个应用生命周期中的主要安全场景的需求。</p><p></p><p>面对云原生的快速发展与广泛应用，SUSE 也在持续投资和发展安全生产线，来帮助企业应对云原生安全挑战。黄飞透露，SUSE 安全产品未来会侧重于四个方面：一是会持续引领新一代的零信任安全技术；二是将安全自动化技术合理地嵌入到更多的平台和流程中；三是致力于为客户降低云原生安全管理的复杂性；最后，SUSE 也会持续拓展安全边界，根据客户的需求去支持更多、更大规模的超级分布式计算系统环境和场景。</p>",
    "publish_time": "2023-06-15 11:32:30",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]