[
  {
    "title": "爆火的Web3社交应用Damus 已在中国大陆 App Store 商店下架；微信全面支持“小号”；16岁少年孤身前往深圳腾讯总部解封QQ账号｜Q资讯",
    "url": "https://www.infoq.cn/article/FgHfS6fMIfh9zrRItZd3",
    "summary": "<p></p><p></p><blockquote>据外媒消息称，美国将禁止供应商向华为提供任何产品；小米迎来“开年第一件大事”：组织架构调整，设立两个关键委员会；理想销量夺冠后，员工不满年终奖打折；OpenAI 开始将 ChatGPT 商业化，同时发布新工具对其“制裁”；百度出手，国产版 ChatGPT 要来了；微软回应苏州大裁员：不要把宝贵的时间浪费在这种毫无根据的谣言上；英特尔进行大规模降薪：CEO最高降25%，员工也受影响；Twitter前CEO力推的Web3社交应用刷屏，但已在国内中国大陆 App Store 商店下架；为解封QQ空间，16岁少年春节孤身前往深圳腾讯总部；“他们裁员，我们招聘” ，美国硅谷大裁员德国公司捡漏；春节后，IT行业用工需求旺盛……</blockquote><p></p><p>&nbsp;</p><p></p><h2>科技公司</h2><p></p><p>&nbsp;</p><p></p><h4>消息：美国将禁止供应商向华为提供任何产品</h4><p></p><p>&nbsp;</p><p>1月31日消息，据媒体报道，有知情人士透露，美国正考虑切断美国供应商与中国华为公司之间的所有联系，禁止包括英特尔和高通在内的美国供应商向华为提供任何产品。</p><p>&nbsp;</p><p>报道称，美国一些官员向拜登政府提出了这一建议，若这项政策获得通过，所有美国供应商向华为供货的许可证申请都将被拒绝。目前，这项政策还处于早期讨论阶段，有可能在5月时获得通过，即美国将华为加入“实体清单”四周年之时。</p><p>&nbsp;</p><p>还有知情人士称，美国已停止向美国企业发放向华为出口产品的供货许可证，包括5G级别以下的物品，如4G、Wifi 6和Wifi 7、人工智能以及高性能计算和云项目。对此，美国商务部发言人称将会不断评估自己的政策和法规，而英特尔和高通都拒绝置评。</p><p>&nbsp;</p><p></p><h4>小米迎来“开年第一件大事”：组织架构调整，设立两个关键委员会</h4><p></p><p>&nbsp;</p><p>1月30日，小米创办人、董事长兼CEO雷军发内部信宣布设立两个集团治理专业委员会，包括集团经营管理委员会和集团人力资源委员会，并称这是公司治理史上影响深远的变革，也是开年来第一件大事。</p><p>&nbsp;</p><p>其中，小米集团经营管理委员会由业务相关的集团高管、各个事业部负责人及营销体系战区负责人组成，统筹管理业务战略、规划、预算、执行及日常业务管理等。小米集团人力资源委员会则负责统筹管理人力资源战略、制定重大人力资源政策和审批重大组织结构调整及高级干部任免。</p><p>&nbsp;</p><p>雷军在内部信中表示，这一年小米的关键词是“稳健推进，蓄势待发”，这一年里，小米要不断夯实基础、构建强化体系能力，为未来5-10年的长期发展打下坚实基础，并为未来2-3年的新一轮爆发做好充分的准备。而今天设立两个委员会，推动集团治理专业化，就是其中的一项关键举措。</p><p>&nbsp;</p><p></p><h4>OpenAI 开始将 ChatGPT 商业化，同时发布新工具对其“制裁”</h4><p></p><p>&nbsp;</p><p>OpenAI 推出了 ChatGPT Plus，订阅费每月20美元。据介绍，ChatGPT Plus可以让用户在高峰期优先使用爆火的人工智能聊天机器人ChatGPT，该公司还表示，该服务将给用户提供“更快的响应时间”，并且能“优先使用新功能和改进”。而直面ChatGPT冲击，搜索巨头谷歌也正在内部测试类似聊天机器人。</p><p>&nbsp;</p><p>2月1日，OpenAI发布了监测机器生成文本的免费Web工具(需要登陆或注册)，帮助教师和其他需要的群体判断一段文本是机器还是人类撰写的。OpenAI表示，该工具并不完美，可能会出现假阳性和假阴性，不能单靠它去判断一篇文档的作者身份。该工具会根据五分制对分析的文本给出结果：非常不可能是 AI 生成的、不可能、不清楚、有可能和很可能。该工具对于一千字以上文本和英文书写的文本表现最优。</p><p>&nbsp;</p><p>据悉，微软将在未来几周内将美国人工智能研究公司 OpenAI 旗下的 AI 聊天机器人工具 ChatGPT 整合到必应搜索引擎中，而且整合的将是最新的 GPT-4 版本。有知情人士称，最新版 GPT-4 和 GPT-3（目前大部分地区使用的第三个版本）的主要区别在于速度，GPT-4 要比 GPT-3 快得多。而且，据说 GPT-4 给出的回复也更详细，更人性化。</p><p></p><h4>百度出手，国产版 ChatGPT 要来了</h4><p></p><p>&nbsp;</p><p>据路透社报道，一位匿名知情人士透露，<a href=\"https://www.infoq.cn/article/oMcKFQATvD5QWJXRctb3\">百度正计划</a>\"推出类似于 OpenAI 的 ChatGPT 的人工智能聊天机器人服务。</p><p>&nbsp;</p><p>据悉，百度计划在今年 3 月份推出 ChatGPT 风格的应用程序，准备将其嵌入到其主要搜索服务中。该工具的名称尚未确定，它将允许用户获得对话式搜索结果，就像 OpenAI 的流行对话机器人 ChatGPT 一样。</p><p></p><h4>理想销量夺冠后，员工不满年终奖打折</h4><p></p><p>&nbsp;</p><p>近日，脉脉上一位认证员工直接发帖炮轰理想，“对外宣称各种销量第一，打遍天下无敌手，对内 PUA 员工，疯狂画饼让员工完成销售业绩。到了最后发年终奖的时候却告知大家，销量不达目标，年终奖打折，几乎所有人得到都不是一个月的年终，与承诺的 14 到 16 薪大相径庭，自己准备跑路。”帖子发布后，评论区不少理想员工现身说法，表示今年自己的年终奖都打了对折。</p><p></p><h4>微软回应苏州大裁员：不要把宝贵的时间浪费在这种毫无根据的谣言上</h4><p></p><p>&nbsp;</p><p>近日有网传截图显示，微软苏州将大裁员。赔偿N+12个月工资，股票解禁，一年社保。</p><p>&nbsp;</p><p>对此，职场博主@王落北 发布的聊天记录显示，有网友在网络上表示自己就是这件事情的始作俑者，本来是随便说说而已，但是“看到这么多人相信了，自己差点都信了”。</p><p>&nbsp;</p><p>在脉脉上有认证为微软员工的网友称，“发这个消息的人被PIP了心里不平衡想制造恐慌”。也有微软员工称，此事子虚乌有，但也在吐槽微软高管们自大不作为，让流言招摇过市。（注：PIP常用于美国公司的一种绩效提升计划）</p><p>&nbsp;</p><p>对此，微软全球资深副总裁、微软亚太研发集团主席王永东于1日深夜发送内部邮件辟谣称，并不知道有任何关闭微软苏州站点的计划。王永东在邮件中表示，通常不会对类似谣言进行回应，这次破例是大量询问引起了内部和外部的关注。王永东呼吁员工回归工作，把重点放在客户和用户服务。“不要把宝贵的时间浪费在这种毫无根据的谣言上，也不要进一步散布谣言。”</p><p></p><h4>英特尔进行大规模降薪：CEO最高降25%，员工也受影响</h4><p></p><p>&nbsp;</p><p>2月1日消息，英特尔证实，该公司已开始实施降薪措施，削减管理人员的薪酬，以节省其重振计划所急需的现金。公司表示，CEO帕特·盖尔辛格的基本工资将削减25%。他的行政领导团队的薪酬将减少15%。高级管理人员的薪酬将减少10%，中层管理人员的薪酬将减少5%。小时工和公司第七等级以下的员工的薪酬不会受到影响。</p><p>&nbsp;</p><p>据了解，英特尔去年10月宣布，计划在2023年削减30亿美元的成本。当时该公司报告称第三季度营收下降，并下调了全年预期。自那以来，英特尔一直在陆陆续续地进行小规模裁员，但从未透露最终计划裁减的人数。截至2022年底，英特尔在全球拥有12.1万名员工。</p><p>&nbsp;</p><p></p><h4>长江存储被曝大裁员，员工购买福利房或遭最高百万索赔</h4><p></p><p>&nbsp;</p><p>近日，据业内人士爆料，国内知名的半导体大厂<a href=\"https://www.infoq.cn/article/6CjBjAYJfNDRWbm9Vfbv\">长江存储1月开始大量裁员</a>\"，且由于福利房价格问题，部分员工或面临高额房屋差价赔偿。据公司老员工在知乎平台爆料，1月16日接到裁员通知，并要求过年收假后上班第一天开始一个月内完成交接走人。同时，还被要求支付职工福利费所购住房的差价，估计要支付几十万到上百万的违约金。</p><p>&nbsp;</p><p>据悉，长江存储有福利房，员工买房签了绑定协议，要求在公司干满五年，不然赔偿当初市场调查价（一万四千多一平）和给员工优惠的价格的差价，按户型面积绑定50万至100万不等，且协议没有写明公司主动裁员是否赔偿的事情。</p><p>&nbsp;</p><p></p><h2>IT业界</h2><p></p><p>&nbsp;</p><p></p><h4>Web3社交应用Damus爆火，但已在中国大陆 App Store 商店下架</h4><p></p><p>&nbsp;</p><p>2月1日，Twitter前联合创始人Jack Dorsey发推称，基于去中心化社交媒体协议Nostr的社交产品<a href=\"https://www.infoq.cn/article/3v2U9Ik1FCMkvW11XLyg\">Damus已上线苹果App Store</a>\"，任何人都可以下载。在短短两天时间内，该App就上升为美区iOS App Store社交免费榜第一，并吸引超60万名用户注册。据悉，2022年，Dorsey捐赠了近14个比特币，价值约245000美元，以进一步资助Nostr的开发。</p><p>&nbsp;</p><p>但根据Damus之后的公告，Damus 因不符合国内内容要求，目前已从中国大陆 App Store 商店下架。据悉，Damus 内置比特币闪电网络功能，可以直接调用第三方闪电网络钱包支付。</p><p></p><h4>微信已全面支持“小号”，可用同一手机号注册</h4><p></p><p>&nbsp;</p><p>2月3日消息，微信平台显示，使用同一手机号注册辅助账号的功能已全量开放。据了解，已绑定手机号、已开通微信支付、注册时间超过一定时长且当前帐号无安全风险的微信帐号可以辅助注册一个新微信帐号。辅助账号与原微信帐号在聊天、通讯录和朋友圈等基础功能均无差异。</p><p>&nbsp;</p><p>经实测，微信注册小号步骤为点进 “我-设置-切换账号”，选择“添加账号”，点击“注册一个新的账号”，最后选择“通过当前微信手机号辅助注册”，即可成功注册小号。</p><p>&nbsp;</p><p>为了保证注册账号的安全，需要一个手机号来完成一次短信验证，官方称，该手机号仅用于注册中的微信号安全验证，不会导致该手机号与它当前绑定的微信号解绑。</p><p></p><h4>为解封QQ空间，16岁少年春节孤身前往深圳腾讯总部</h4><p></p><p>&nbsp;</p><p>据报道，一位成为抖音网红的重庆 16 岁少年，他的 QQ 空间去年 8 月被封，原因“发布违规内容”，他首先向客服申诉，客服要求清空所有内容。他遵守了，但账号仍然没有解封。他还尝试通过 12315 和工信部等平台进行投诉，但仍然无效。他一气之下告诉客服要去其公司总部线下申诉。客服于是给了腾讯客服接待中心的地址。大年初二他从重庆搭乘火车前往腾讯总部所在地深圳。到了深圳，他首先去了当地公安局，但公安局表示无能为力。大年初三他去了腾讯总部成功获得解封。</p><p>&nbsp;</p><p>“这个QQ号我从小学开始就在用，对我来说很重要！”这位少年说道。事后腾讯给他打来电话解释，其发布违规内容的情况确实存在，只是他年龄比较小态度较好，解封也只有这一次机会，希望他以后珍惜发QQ空间的机会。</p><p>&nbsp;</p><p></p><h4>春节后，IT行业用工需求旺盛</h4><p></p><p>&nbsp;</p><p>据央视财经消息，最新数据显示，春节后招聘热度最高的行业前五名分别为：计算机/互联网/通信、人事/行政/后勤、餐饮、普工/技工、销售。其中，计算机/互联网/通信行业的招聘需求占比达10.1%。另外，得益于需求广泛、工作灵活度高等特色，人事/行政/后勤和餐饮业也成为当前企业招聘需求较多的行业，分别为9.4%和7%。</p><p>&nbsp;</p><p>而在求职端，数据显示：春节后，销售、普工/技工及本地服务人员比例最高，达35%及以上，而计算机/互联网/通信、家政保洁/安保及影视/娱乐/休闲的求职比例最低。</p><p>&nbsp;</p><p>另外，根据人社部发布最新工资价位表，从不同职业企业从业人员工资价位来看，中位数排名前三的职业分别是金融服务人员，每年11.34万元；企事业单位负责人，每年8.8万元；信息传输、软件和信息技术服务人员，每年8.11万元。高位数排名前三的为企事业单位负责人，每年27.96万元；金融服务人员，每年25万元；信息传输、软件和信息技术服务人员，每年19.73万元。</p><p></p><h4>“他们裁员，我们招聘” ，美国硅谷大裁员德国公司捡漏</h4><p></p><p>&nbsp;</p><p>1月31日消息，许多德国公司正面临劳动力市场供需紧张的困境，急需具备关键软件工程技能的员工，美国硅谷的大规模裁员为德国公司的招聘创造了机会。汽车制造商大众旗下软件子公司Cariad的首席人事官表示：“他们裁员，我们招聘。我们在美国、欧洲和中国都有数百个空缺职位需要填补。”</p><p>&nbsp;</p><p>由于担心通货膨胀和经济衰退加剧，谷歌母公司Alphabet、微软和Facebook母公司Meta宣布总共裁员近4万人。德国是世界上人口老龄化最严重的国家之一，其劳动力存在巨大缺口。IT行业组织Bitkom的数据显示，目前有13.7万个IT职位空缺。</p>",
    "publish_time": "2023-02-04 10:30:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]