[
  {
    "title": "天命人+1！马斯克发AI照片盛赞《黑神话：悟空》；亏损太多，LG 1400人自愿离职，赔偿金达36月工资；要求实习生会开直升机、做饭？官方回应 | AI周报",
    "url": "https://www.infoq.cn/article/ivdMFFblD2YPwMDR7FpA",
    "summary": "<p></p><p></p><h2>行业热点</h2><p></p><p></p><h4>马斯克发布悟空版AI照片，为《黑神话悟空》打call</h4><p></p><p>9月7日，马斯克在社交媒体平台“X”发布了一张“悟空版”AI照片，发文称“来自中国的令人印象深刻的3A游戏！似乎莫名熟悉”。网友们纷纷在留言区为这款中国3A游戏大作点赞，甚至喊话马斯克直播打游戏。随后相关话题冲上热搜。</p><p>&nbsp;</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/79/79311fa0ead568529a316c194434e26d.png\" /></p><p></p><p></p><h4>爱奇艺就国足18强赛直播致歉：瞬时流量过大，技术服务资源分配超出限额</h4><p></p><p>&nbsp;</p><p>9月5日，中国男足在世预赛亚洲区18强赛首场比赛中客场对阵日本队。足球中国官方微博公布了转播平台，央视确定不转播，国内唯--家转播平台为爱奇艺体育。不过，本场比赛并不是免费的，若是想观看本场比赛，非会员用户需要支付9元钱观看。</p><p>&nbsp;</p><p>然而，开赛后不久，关于“爱奇艺花钱看不了”的话题迅速冲上微博热搜榜第一。有网友吐槽“已经花了兑换券，却一直不出来。”“爱奇艺付费页面卡住看不了比赛。”比赛结束后两个小时，爱奇艺体育发文回应了此事。</p><p>&nbsp;</p><p>爱奇艺体育官微发消息致歉称，“在今晚世预赛亚洲区18强赛中国男足首场客场对阵日本队的直播中，因球迷的热情，造成瞬时流量过大。其技术服务资源分配超出限额，给部分用户造成了不好的观赛体验。后续会进一步加强技术预案和运营能力，给大家提供更稳定可靠的直播服务。“</p><p>&nbsp;</p><p>此前，针对不能转播比赛一事，央视发布声明，称其已经反复争取比赛转播权，但对方报价仍极度畸高，坚决抵制境内外资本搅乱体育版权市场的行为，并将争取尽快获得中国队参赛的场次版权。</p><p>&nbsp;</p><p></p><h4>网传“重庆本土最大互联网公司”拖欠薪资数月，猪八戒网内部回应：公司多次上市未果，负债率高居不下</h4><p></p><p>&nbsp;</p><p>近日，有网友发视频称“重庆猪八戒网欠薪”，多张截图显示，“1月工资将于2024年2月23日发放”“2月工资将于2024年3月18日发放”“4月工资将于2024年5月20日发放”“5月工资分两次发放，第一次为2024年6月18日，第二次为2024年6月28日”“从2024年7月起，工资发放时间将固定于每月28日”。</p><p>&nbsp;</p><p>在社交平台上，还有网友发帖称“从年初到现在一次次延迟发放工资，从最初的10号拖到15号再到18号再到28号，到现在通知直接没有了，直接拖欠工资，工资也不发了，还要让我们做收款，什么时候做到盈利目标了，什么时候就发。”据网友爆料，该公司表示从28号开始计算，当个人收款毛利可以覆盖工资时才可以申请发工资，8月份开始各个经营单元独立核算。</p><p>&nbsp;</p><p>对此，猪八戒网内部人士，对方回应称：“这个消息不准确，我们只是最近一个月延迟发放了（工资）。”“最近市场大环境对我们造成了一些影响，给公司经营带来了一些挑战，我们对内在组织改革，对外在做产品升级。但在组织改革过程中，个别员工不是很理解，所以在网上发布了一些言论。”</p><p>&nbsp;</p><p>公开资料显示，猪八戒网于2006年在重庆成立，在市场上有着“重庆互联网一哥”之称。据悉，自2011年以来猪八戒曾多次谋划上市。但多次上市未果，负债率居高不下。招股书显示，2020-2022年以及2023年上半年，企业净利润分别为-2.68亿元、-3.67亿元、-2.30亿元和-0.78亿元，近3年半合计亏损达到9.43亿元。</p><p>&nbsp;</p><p>此外，招股书显示，报告期内，猪八戒股份的资产负债率也一直高于100%，在2021年更是超过161.51%。也就是说，猪八戒股份一直处于资不抵债的状态中，企业财务状况和业务状况都面临较大挑战。</p><p>&nbsp;</p><p></p><h4>亏损太多，LG显示1400人自愿离职，赔偿金高达36个月工资</h4><p></p><p>&nbsp;</p><p>近日，据媒体报道，面对连续的财务亏损，LG显示采取了大规模的自愿离职计划以降低人力成本。最新动态显示，超过1400名员工选择自愿离职，约占公司总员工数的5.12%，这些员工将获得高达36个月工资的赔偿金，以及额外的子女教育费用支持。</p><p>&nbsp;</p><p>LG显示近期关闭了位于韩国龟尾市的M3生产线，该生产线主要生产IT类LCD模组产品，大约700名龟尾工厂的员工将被重新分配其他地点，同时也提供了自愿离职计划。为了进一步降低成本，LG显示在今年6月针对28岁及以上的制造员工推出了额外的自愿裁员计划，此前已经实施了针对40岁及以上、35岁及以上员工的离职计划。值得一提的是，由于离职人员太多，韩国地方政府将为这些人员专门举办就业专题讲座。</p><p>&nbsp;</p><p>LG显示的财务状况显示，公司在今年第二季度的综合销售额为6.71万亿韩元，约合48.5亿美元，营业亏损937亿韩元，净亏损为4708亿韩元。</p><p>&nbsp;</p><p>&nbsp;</p><p></p><h4>阿里通义千问全系列大模型被 GitHub 下架，所有仓库页面404</h4><p></p><p>&nbsp;</p><p>9 月 5 日早上，有开发者在社交平台上称在 GitHub 上打开阿里云 Qwen 页面后显示 404。阿里高级算法专家林俊旸在社交媒体上表示：“GitHub 因未知原因标记了我们的组织，我们正在尝试与他们联系以寻求解决方案。”</p><p>&nbsp;</p><p>直到当天下午，阿里通义千问全系列大模型的开源代码仓库恢复正常访问。不过，GitHub 一直未对此事做出回应。</p><p>&nbsp;</p><p></p><h4>京东大幅上调校招薪资！有岗位全年20个月工资、年终奖8倍月薪</h4><p></p><p>&nbsp;</p><p>9月2日，京东在其官微表示，京东2025届校招生岗位薪酬将全面上调。同时，京东还宣布，开启行业最大规模校招，本次校招开放了1.8万个岗位，包含1.2万个2025届应届生岗位和6000多个实习生岗位。其中，采销、技术、产品等核心岗位薪酬上调不低于20%。所有校招入职的“京东采销”将可达到全年20个月的薪酬结构，年终奖高达8倍月薪，另外设置“上不封顶”的Big Boss激励。产研类岗位中，算法岗平均起薪涨幅超75%。硬件和设计等岗位起薪涨幅超50%。</p><p>&nbsp;</p><p>值得注意的是，今年以来京东已多次宣布涨薪。5月27日，京东集团宣布，自2024年7月1日起，通过一年半时间，京东采销年度固定薪酬由16薪提升至20薪，业绩激励上不封顶。更早前，京东集团宣布，2024年1月1日起京东采销等一线业务人员的年固定薪酬大幅上涨近100%，2024年初京东零售全员将平均加薪不低于20%。</p><p>&nbsp;</p><p></p><h4>律所招聘实习律师要求会开直升机还要会做饭？律所回应：因出差需要，不是炫耀</h4><p></p><p>&nbsp;</p><p>9月3日消息，据媒体报道，南京一家律师事务所近期发布了一则别具一格的实习律师兼助理招聘启事，其中一项独特要求——“除协助主办律师处理案件外，还需具备小型直升机驾驶能力”，引发了社会广泛关注，有网友质疑其是否炒作。律所负责人针对这一引发热议的招聘要求作出正式回应：“的确在招聘，并非炒作。”确认该信息确为招聘条件之一，并表示薪酬待遇将根据个人能力与经验面议。</p><p>&nbsp;</p><p>从该律所招聘信息可知，该律所招聘实习律师兼助理3名。实习律师除协助主办律师办案外，另需兼任岗位分别为：驾驶小型直升机、制作律所午饭(色香味俱全者优先录用)、协助主任管理律所行政事务(有财会或行政经验者优先录用)。</p><p>&nbsp;</p><p>律所相关负责人还称，因为我们几乎天天出差，经常坐高铁。但高铁和飞机相比，速度不是一个层次。为了满足快速到达目的地的要求，律所准备买一架小型直升机。该负责人还强调：“律所准备买直升机，目的不是为了炫耀，而是更快速地提高工作效率。”</p><p>&nbsp;</p><p>负责人还透露，目前已有两人报名应聘，但尚未招到合适人选。“目前还在招人。“至于实习律师的薪资酬劳，对方表示不便透露</p><p>&nbsp;</p><p></p><h4>又有AI创始人卖身大厂，带走25%员工留下空壳</h4><p></p><p>&nbsp;</p><p>9月2日消息，亚马逊官宣从机器人AI系统初创公司Covariant挖走了三名联创。三人分别是Pieter Abbeel、Peter Chen（陈曦）和Rocky Duan（段岩），创业之前都是OpenAI的研究员。其中，Pieter Abbeel是强化学习届的大牛、吴恩达教授带的第一位博士生。一同被打包带走的还有1/4的员工，公司研发的模型技术也被授权给了亚马逊。</p><p>&nbsp;</p><p>亚马逊吸纳机器人软件制造商Covariant的创始人团队目的是进一步提升亚马逊在仓库自动化领域的技术水平。通过与Covariant签订的商业协议，亚马逊将获得Covariant机器人基础模型的非独家使用许可，并计划在湾区扩展其人工智能和机器人团队。</p><p>&nbsp;</p><p></p><h4>淘宝宣布接入微信支付，调整将覆盖全体淘宝和天猫商家，双方回应</h4><p></p><p>&nbsp;</p><p>9月4日，淘宝网宣布，为提升消费者购物体验，计划新增微信支付能力。并于意见征集结束后调整平台规则，此次调整将覆盖全体淘宝和天猫商家。目前微信支付暂未出现在淘宝App上。</p><p>&nbsp;</p><p>对此，据晚点报道，淘宝后续将面向所有商家签约，预计9月底完成签约、全量上线该功能，届时消费者在淘宝购物可以使用微信支付。淘宝官方客服也称，微信支付还在试行中，暂未全面开放。用户订单是否可以使用请以支付页面为准。微信支付回应称：目前与淘宝平台商户的功能适配正在开通中，具体上线时间请关注淘宝平台公告。</p><p>&nbsp;</p><p>值得注意的是，淘天接入微信支付的谈判从半年前就开始了。早在今年初，“淘宝订单可以直接微信支付”相关话题就曾登上热搜。据悉，该合作由淘宝方面主动发起，围绕该合作的核心工作骨干人数约50人，涉及技术、安全、法务、行业（所有一类行业负责人）、客服等多个部门。双方业务核心高管亲自沟通并体验了使用流程。</p><p>&nbsp;</p><p>此外，同一天，美团两大核心业务 —— 外卖和酒店正式入驻支付宝小程序，美团团购业务也正在内测中，将于近日上线。此前，支付宝内点外卖只能用饿了么、美团内下单用支付宝需要多点一步。</p><p>&nbsp;</p><p></p><h4>苹果税差异惹争议：欧洲已降，在中国仍按最高档：100元苹果拿30元</h4><p></p><p>&nbsp;</p><p>9月3日消息，近日，围绕“苹果税”的争议再度升温，引发业界广泛关注。所谓“苹果税”，即苹果公司对App Store内应用的数字内容消费抽取的佣金，费率介于15%至30%之间。这一制度在全球范围内引发了不小的争议，尤其是在中国市场。目前，苹果在中国市场的“标准企业”税率仍为30%，而小型企业税率为15%。相比之下，美国、欧洲和韩国等地的税率在经过一系列调整后已有所降低。这一现状使得中国开发者在全球竞争中处于相对不利的地位。</p><p>&nbsp;</p><p>有中国开发者表示，当前中国仍适用全球最高的“苹果税”费率，这对国内应用程序开发者而言并不友好。以直播行业为例，100元的礼物收入在苹果抽成后仅剩70元，再分配给主播及相关运营成本后，利润空间被大幅压缩。与此同时，在欧美等地，相关规则已有所调整，为中国开发者带来了不公平的竞争环境。</p><p>&nbsp;</p><p>在全球范围内，“苹果税”也引发了反垄断调查和诉讼。批评者指出，苹果通过其市场主导地位限制了其他支付和分销渠道的发展。据统计，“苹果税”在全球范围内的收入规模巨大，仅2013年就高达约223.4亿美元。在中国市场，这一数字更是超过了400亿元人民币。</p><p>&nbsp;</p><p>中国人民大学财政金融学院教授戴稳胜表示，苹果对国内开发者的收费模式有不合理的地方。一个是软件在应用商店发售时，如果软件收费，苹果也要收费，第二个是日常游戏中的支付必须通过苹果支付，苹果要收15%或30%的抽佣。这两个收费模式本身就是不合理的，就是垄断型的。</p><p>&nbsp;</p><p></p><h4>OpenAI 前首席科学家的 AI 公司融资 10 亿美元，估值或约 50 亿美元</h4><p></p><p>由 OpenAI 前首席科学家 Ilya Sutskever 联合创立的 AI 初创公司 Safe Superintelligence（SSI）已筹集 10 亿美元现金，以帮助开发远远超过人类能力的安全的 AI 系统。</p><p>&nbsp;</p><p>SSI 目前拥有 10 名员工，计划利用这笔资金来获得计算能力，并雇佣顶尖人才。SSI 将专注于在加州帕洛阿尔托（Palo Alto）和以色列特拉维夫（Tel Aviv）建立一个高度可信的小型研究人员和工程师团队。</p><p>&nbsp;</p><p>SSI 拒绝透露其估值，但知情人士预计，其估值约为 50 亿美元。在此之前，人们对资助这些 AI 初创公司的兴趣有所减弱，因为这些公司可能在很长一段时间内无利可图。但 SSI 这笔交易表明，一些投资者仍愿意对专注于基础 AI 研究的杰出人才进行巨额押注。</p><p>&nbsp;</p><p>参与 SSI 本轮融资的投资者包括顶级风险投资公司 Andreessen Horowitz、红杉资本、DST Global 和 SV Angel。此外，由 Github 前 CEO Nat Friedman 和 SSI 首席执行官 Daniel Gross 经营的投资公司 NFDG 也参加了投资。</p><p>&nbsp;</p><p></p><h2>大模型一周大事</h2><p></p><p>&nbsp;</p><p></p><h3>大模型发布</h3><p></p><p>&nbsp;</p><p></p><h4>腾讯推出新一代大模型“混元 Turbo”：性能大幅提升，定价低 50%</h4><p></p><p>&nbsp;</p><p>9 月 5 日，腾讯宣布推出新一代大模型“混元 Turbo”，据官方介绍，相比前代模型，腾讯混元 Turbo 训练效率提升 108%，推理效率提升 100%，推理成本降低 50%，解码速度提升 20%，效果在多个基准测试上对标 GPT-4o。目前腾讯内部近 700 个业务及场景已接入，包含腾讯元宝、腾讯云、QQ、微信读书、腾讯新闻、腾讯客服等。</p><p>&nbsp;</p><p></p><h4>面壁智能新一代基座模型 MiniCPM 3.0，开启端侧 ChatGPT 时刻</h4><p></p><p>&nbsp;</p><p>9月5日，面壁智能发布了新一代基座模型面壁小钢炮 MiniCPM 3.0 ，再次以小博大，以 4B 参数，带来超越 GPT-3.5 的性能，宣告了端侧 ChatGPT 时刻的到来。而且还在赶在OpenAI、谷歌、苹果等巨头之前。</p><p>&nbsp;</p><p>据了解，MiniCPM 3.0 是一款瑞士军刀般全面开挂的基座模型，一口气带来：无限长文本，榜单性能超越 Kimi，超长文本也不崩；性能比肩 GPT-4o 的端侧最强 Function Calling；超强 RAG 外挂三件套，中文检索第一、生成超 Llama3-8B。</p><p>&nbsp;</p><p></p><h4>百度官宣文心一言 APP 正式升级为文小言</h4><p></p><p>&nbsp;</p><p>百度官宣文心一言 APP 正式升级为文小言，定位百度旗下“新搜索”智能助手。区别其它搜索产品，文小言推出了富媒体搜索、多模态输入、文本与图片创作、高拟真数字人等\"新搜索\"能力，能满足用户搜、创、聊需求。同时，文小言独家首发记忆和自由订阅等全新功能。文小言即日起还将免费开放文心大模型 4.0 能力，所有用户整个九月均可免费使用。</p><p>&nbsp;</p><p></p><h4>xAI 上线全球最强 AI 训练系统 Colossus，10 万块 Nvidia H100 GPU 加持</h4><p></p><p>&nbsp;</p><p>马斯克近日宣布，xAI 现已推出名为 Colossus 的大模型训练系统。Colossus 在 7 月份初步建成，具备 10 万张 H100 GPU 算力。马斯克表示，将会在未来几个月内让 Colossus 的规模达到 20 万块 GPU，其中包括 5 万块 H200.马斯克表示，Colossus 仅用了 122 天完成，xAI 团队、英伟达及其众多合作伙伴均做出了重要的贡献。</p><p>&nbsp;</p><p>&nbsp;</p><p></p><h3>企业应用</h3><p></p><p>&nbsp;</p><p>9 月 5 日，支付宝发布 AI 生活管家 App“支小宝”，目前在苹果及安卓应用商店均可下载。“支小宝”是服务型 AI 独立 App，连接支付宝生态，“支小宝”可通过对话快速订票、点餐、打车、查询附近吃喝玩乐等；同时“支小宝”拥有场景感知系统，能根据用户的生活习惯和使用场景，智能推荐专属的服务。9 月 4 日，OpenAI 首款内部 AI 芯片再次传来新消息。据报道，台积电将开发一款专为 OpenAI Sora 视频模型定制的 A16 埃米级工艺芯片，旨在提升 Sora 的视频生成能力。9 月 4 日，高通在柏林国际电子消费品展览会（IFA）前夕宣布推出全新的 AI PC 处理器骁龙 X Plus 8 核，这是继今年 4 月份推出骁龙 X Plus 10 核平台之后的又一新平台。9 月 3 日，据报道，OpenAI 即将扩充添加语音，让朗读的声音更加自然和富有表现力。有迹象表明 OpenAI 未来可能会额外推出 8 种新的语音，每种语音都有一个独特的代号，后续可能会逐步推出。这些新声音的一个有趣特点是，它们能够更自然地表达非人类语音声，如动物叫声或其他非语言声音。9 月 4 日，谷歌称Chromebooks内置谷歌人工智能，而全新的Chromebook Plus则拥有更多由生成式人工智能驱动的高级功能。</p>",
    "publish_time": "2024-09-09 09:51:27",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]