[
  {
    "title": "《黑神话：悟空》被指抄袭，原作者开撕；IBM中国被曝数千研发权限突然被关；曝360儿童手表智能回答毁三观，周鸿祎道歉 | AI周报",
    "url": "https://www.infoq.cn/article/l3qfHs68zB3dAxYvQrqa",
    "summary": "<p></p><h3>行业热点</h3><p></p><p></p><h4>《黑神话：悟空》被质疑多处抄袭，原作者开撕：原创有那么难吗</h4><p></p><p></p><p>8月23日消息，“《黑神话·悟空》疑似抄袭”相关话题引发热议。“塞上李云中”（内蒙古青年画家李允云，被称为绘画《西游记》第一人）发布微博，附上了《黑神话：悟空》中的“大圣残躯”篇的图片，与其在2012年出版的《西游记人物图谱》中的孙悟空姿势相近，称“好像是给我画的孙悟空换了身装备”。对于上述相似之处，网友观点不一，有网友质疑“姿势也能鉴定为抄袭？”，也有网友表达了不满，“姿势就一模一样。除非这家游戏能拿出图1绘制早于2012年的证据”，也有网友为维护博主先打了预防针，“李云中老师从始至终没指责过美术抄袭，说的是可能借鉴，希望黑神话粉丝不要应激”。</p><p></p><p>就在前一天，微博认证为三级工艺大师的博主“玄鏐108”（中式甲胄艺术家、北京市工艺美术大师李辉）发布微博，贴出《黑神话：悟空》杨戬的臂鞲与其过往设计的臂鞲作品的对比图，感叹“又被抄袭了，原创有那么难吗？”接着，有博主发布视频，用视频一一对《黑神话：悟空》游戏里杨戬的臂鞲与博主过往作品细节对比，佐证抄袭之处。</p><p></p><p>目前，《黑神话：悟空》持续吸金中。同时在线玩家数还在上涨，据SteamDB数据显示，自首发当日突破220万人，次日在线突破235万人后，《黑神话：悟空》Steam同时在线人数于第三日（8月22日）突破240万人。根据国游畅销榜统计，《黑神话：悟空》在Steam上售出超过300万份，加上wegame、epic和ps平台，目前总销量超过450万份，总销售额超过15亿元。</p><p></p><p>据媒体报道，尽管游科互动的整体员工月平均收入达到了24305元，但这一数字仍略低于同行业平均水平，即25578元/月，从游戏特效师到3D设计师，再到动画设计师等核心职位，其月收入范围横跨19333元至30996元不等。尤为亮眼的是，超过八成的设计类岗位薪资水平甚至超越了行业平均值。</p><p></p><p></p><h4>“中国人是世界上最聪明的人吗？”曝360儿童手表的智能回答毁三观，周鸿祎道歉</h4><p></p><p></p><p>8月22日，有网友发布视频，称其使用智能儿童手表提问“中国人是世界上最聪明的人吗？”时，得到的答案让她觉得“毁三观”。据该网友介绍，该手表是在2023年购买的，主要是为了防止女儿走丢，手表的品牌是360儿童手表。</p><p></p><p>该网友为了演示，又重新用手表问了一遍同样的问题。语音回答：“以下内容来自360搜索……”除了语音，答案还以文字的形式显示在手表上。“因为中国人小眼睛、小鼻子、小嘴、小眉毛、大脸，从外表上显得脑袋在所有人种里最大。”整个回答有数百字，其中还有“什么四大发明，你看见了吗？历史是可以捏造的。而现在的手机、电脑、高楼大厦、公路，等等所有高科技都是西方人发明的”等表述。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/88/88998bb805378f7c52ea576c448d007b.jpeg\" /></p><p></p><p>8月22日晚，360集团创始人、董事长周鸿祎在微博发文就360儿童手表答疑时出现争议言论道歉。周鸿祎表示，经过快速检查，出现问题的这款手表是2022年5月份的一个旧版本，其中没有装入公司的大模型。它回答问题不是通过人工智能，而是通过抓取互联网公开网站上的信息来回答问题。目前公司已经快速完成了整改，删除了上述所有有害信息，并正在将软件升级到人工智能版本。周鸿祎在视频中亲测了价值观问答，他表示，将有奖征集用户反馈，不断改进产品，不负用户信任。</p><p></p><p></p><h4>微软必应错误显示黑神话悟空客服电话，导致个人信息泄露</h4><p></p><p></p><p>国产3A游戏大作《黑神话：悟空》上线引发全球关注，然而在这波热潮中，微软必应AI却因错误抓取信息成为不实信息的传播者，导致个人信息泄露。在必应搜索中输入“黑神话悟空客服”，错误地显示了机锋网员工的个人手机号，并非官方客服电话。此外，还有两个错误的电话号码被标记为客服，其中包括第一财经版权部的联系电话。</p><p></p><p></p><p><img src=\"https://static001.geekbang.org/infoq/96/96ff1420e96552e3d99d6feafc0af376.png\" /></p><p>据机锋网透露，尽管相关新闻稿件已删除，但错误信息仍出现在必应搜索首页。微软必应作为全球第二大搜索引擎，覆盖36个国家和地区，用户超6亿。微软曾声称必应采用OpenAI最新技术，甚至接入了GPT-4，但此次事件暴露了其在信息抓取和处理上存在漏洞。目前，必应团队尚未对错误信息进行更正。</p><p></p><p>被泄露电话当事人回应，他在5小时里，接了差不多20个电话。目前没有有效解决办法，正在申诉等反馈。</p><p></p><p></p><h4>网易云音乐网页端报错，App无法使用，故障真相：技术降本增效，人手不足排查了半天</h4><p></p><p></p><p>8月19日，网易云音乐出现服务器故障，“网易云音乐崩了”词条登顶微博热搜。从网易内部相关技术人员处获悉，此次宕机事件或与今年二季度的机房搬迁有关。“网易在贵州建立了机房，旗下业务分阶段搬迁，2024年Q2网易云音乐刚刚完成了贵州机房的迁移。”</p><p></p><p>据前述知情人士表述，这次搬迁内部曾评估难度极大，稍有不慎就有重大事故发生的可能性。“前几天刚说这次完成的不错，结果就打脸了。”其认为，近几年互联网公司多出现大型技术事故，多与降本增效相关。而网易此次搬迁，内部也称实现了大幅的成本下降。“再加上裁员，连故障排查都要很长时间”。</p><p></p><p>此次宕机持续了约两个小时。目前部分网友表示网易云音乐网页端与App端都已可以正常打开。8月19日，网易云音乐就网易云音乐崩了再次道歉，并给出了补偿方案。其表示没有删库，没有跑路，故障已陆续修复，作为补偿，8月20日0-24时，云音乐搜“ 畅听音乐 ”，可领取7天会员权益到账户。</p><p></p><p>据了解，“网易云音乐崩了”的情况并非首次出现。今年3月14日，网易云音乐曾出现众多网友登录状态突然失效、无法正常使用的情况，“网易云音乐崩了”词条也登上微博热搜。针对这一问题，网易云音乐客服当时表示，故障原因是由于网络异常，与版本更新无关。</p><p></p><p></p><h4>传IBM中国研发岗位员工被收回访问权限</h4><p></p><p></p><p>8月24日下午消息，据媒体报道，IBM中国于本周五晚间关闭了IBM中国研发和测试岗位员工的访问权限。一位实验室技术员工称，关闭权限前公司员工正常上下班，没有任何预兆和“信号”，一些技术员工还处于加班状态。目前，这些员工已从通讯软件的产品群组被移除，无法通过VPN登陆公司内网，但仍可访问邮件。此外，公司已通知被收回权限的员工于周一进行谈话，参与线上会议。</p><p></p><p>据报道，此次被收回权限的员工属于IBMV，下设CDL（IBM中国开发中心）和CSL（IBM中国系统中心），覆盖北京、上海、大连等地，涉及人数约千人。目前官方暂未回应。</p><p></p><p></p><h4>亚马逊 CEO：AI 助手 Amazon Q 可节省约 4500 个开发人员一年工作量</h4><p></p><p></p><p>亚马逊 CEO 安迪・贾西昨天在其领英主页发帖称，将亚马逊的生成式 AI 开发助手“Amazon Q”集成到内部系统后，利用新的代码转换功能，Amazon Q 将应用程序升级到 Java 17 的平均时间从开发人员的 50 天左右缩短到了几个小时，估计节省了约 4500 个开发人员一年的工作量。</p><p></p><p></p><h4>特斯拉“三班倒”训练人形机器人，正大量招聘操作员收集动作数据</h4><p></p><p></p><p>8月20日消息，据外媒报道，特斯拉正在以25.25至48美元的预期时薪招募大量人员，通过穿戴动作捕捉设备、VR头显等，训练其人形机器人Optimus。</p><p></p><p>特斯拉官网招聘页面显示，该职位名为“数据收集操作员(Data Collection Operator)”，分为午班晚班两班制，具体工作时间则是“三班倒”，即上午8点至下午4点半/下午4点至凌晨12点半/凌晨12点至上午8点半。换言之，若该岗位招聘至饱和状态并启动，则Optimus机器人将24小时不间断地吸收训练数据。</p><p></p><p>为了完成上述任务，特斯拉官方在招聘页面详细描述了意向该岗位的应聘者需满足的条件，包括但不限于：必须能够每天行走7小时以上，同时负重30磅；能够长时间佩戴和操作动作捕捉服和VR头显（特斯拉在此条要求后作出了VR晕动症的风险警示）；能够合理安排工作时间：白班/夜班+1个周末+“必要时”加班。</p><p></p><p>此外值得一提的是，特斯拉还正为此项目招聘“数据收集主管(Data Collection Supervisor)”，特斯拉表示：“数据收集主管将领导我们的数据收集团队并成为数据收集工作流程的专家，从而推动特斯拉Optimus计划的改进。这一角色需要较高的灵活性和领导团队的能力。”</p><p></p><p></p><h4>本科每月2000元、硕士每月2200元？中铁大桥局回应网传“工资”</h4><p></p><p></p><p>8月21日，网络上出现了一则关于中铁大桥局集团第五工程公司员工工作分配通知的消息，引发了公众的讨论。据该消息显示，公司的分配方案中，本科学历的新员工需经历一年的见习期，而硕士学历的员工则只需三个月的试用期。在薪资方面，本科生见习期间月薪设定头2000元，硕士生试用期月薪为2200元。</p><p></p><p>针对这一消息，中铁大桥局集团第五工程公司的人力资源部门迅速做出回应。一位工作人员明确表示，网络上流传的通知截图并不真实，并告知公司已就此事向警方报案。需要注意的是，信息源自网络，对于此类敏感信息建议读者保持审慎态度，理性判断。</p><p></p><p></p><h4>运动相机厂商GoPro计划今年裁员约15%，影响139个岗位</h4><p></p><p></p><p>8月20日消息，运动相机制造商GoPro当地时间周一表示，作为减少运营费用的重组计划的一部分，今年将裁员约 15%。该公司预计重组计划将花费500万至700万美元（当前约3569.1万至4996.7万元人民币），其中100万美元的现金支出将在第三季度确认，并在2024年第四季度确认约400万至600万美元。</p><p></p><p>此次裁员约139个岗位，预计将于第三季度开始，并于2024年底完成。截至6月30日的第二季度末，该公司拥有925名全职员工，在宣布裁员后，该公司股价上涨1.5%。</p><p></p><p>本月早些时候，GoPro公布2024年第二季度营收为1.86亿美元（当前约13.28亿元人民币），同比下降22.7%；运营支出为1.03亿美元（当前约7.35亿元人民币），同比增长5%。</p><p></p><p></p><h4>雷军回应王腾被投诉在公司玩《黑神话：悟空》：幸好小米有游戏本，要不就没理由了</h4><p></p><p></p><p>8月22日消息，中午12:00，小米CEO雷军进行第二期“雷军的副驾”直播。在直播中，雷军也谈到了最近非常火的游戏《黑神话：悟空》，雷军表示：自己一直在出差，没有时间玩，听说很多人在奋战，也看到很多人跟自己投诉王腾。</p><p></p><p>“他（王腾）不是说测试游戏本吗？幸好我们有游戏本，要不就没这个理由了，我觉得还好，小米整体是很宽松的氛围。“雷军笑着说。雷军表示，其实整个社会对打游戏都有些误解。“我觉得游戏是人的天性，当然一定要有自制力，有很多人沉迷游戏就不好，如果你喜欢的时候玩，时间也能自己把控，我觉得也挺好。”</p><p></p><p>日前，Redmi品牌总经理王腾微博发文，称“早，到公司第一件事情就是”，从配图来看，王腾今天上班先开电脑进行《黑神话：悟空》预下载。对此，有网友表示：“懂了，给产品做性能测试。”，王腾还回复了两个表情。还有不少调皮的网友纷纷在评论区艾特雷军和卢伟冰，说王腾上班摸鱼打游戏。小米公关部总经理王化转发王腾微博表示，“我本来帮你想了各种理由，现在看来都没啥用了，建议你主动截图发到各位老板的群里自我检讨”。</p><p></p><p></p><h4>编造联想华为对立谣言，自媒体一审被判赔偿道歉，联想：该条新闻导致其双11销售额下降了19亿</h4><p></p><p></p><p>据报道，近日，就联想集团（原告）与微博用户“万能的大熊”（被告）网络侵权责任纠纷一案，北京互联网法院立案后，依法适用普通程序，由审判员独任公开开庭进行了审理，一审判决联想集团胜诉。判决被告“万能的大熊”向联想集团道歉，并支付经济损失及相关费用16万余元。</p><p></p><p>该案件起因为，2023年10月联想创新科技大会后，新浪微博账号“万能的大熊”在完全没有事实根据的情况下，发布微博捏造称“联想宣布同英伟达达成合作，并且联想总裁杨元庆在现场还特别强调，从来没有考虑过和华为合作。”该微博发出后，引发评论区中大量关于原告联想公司的负面评价、攻击联想公司的言论。</p><p></p><p>对此，被告@万能的大熊发文回应表示，该案件很无聊，当时只是随手转了一条新闻，且全网都在转发，至今为止都没有人辟谣。万能的大熊进一步透露，联想认为该条新闻导致其双11销售额下降了19亿。“除了无语没什么好说的。”万能的大熊称还要打二审。</p><p></p><p></p><h3>大模型一周大事</h3><p></p><p></p><p></p><h4>大模型发布</h4><p></p><p></p><p></p><h4>微软“小而美”系列三连发！视觉小钢炮PK GPT-4o，MoE新秀力压Llama 3.1</h4><p></p><p></p><p>8 月 21 日，微软公司发布 Phi-3.5 系列 AI 模型。本次发布的 Phi-3.5 系列包括 Phi-3.5-MoE、Phi-3.5-vision 和 Phi-3.5-mini 三款轻量级 AI 模型，基于合成数据和经过过滤的公开网站构建，上下文窗口为 128K，所有模型现在都可以在 Hugging Face 上以 MIT 许可的方式获取。</p><p></p><p>Phi-3.5-MoE 是 Phi 系列中首个利用混合专家（MoE）技术的模型。该模型在 16 x 3.8B MoE 模型使用 2 个专家仅激活了 66 亿个参数，并使用 512 个 H100 在 4.9T 标记上进行了训练。微软研究团队从零开始设计该模型，以进一步提高其性能。在标准人工智能基准测试中，Phi-3.5-MoE 的性能超过了 Llama-3.1 8B、Gemma-2-9B 和 Gemini-1.5-Flash，并接近目前的领先者 GPT-4o-mini。</p><p></p><p>Phi-3.5-vision 共有 42 亿个参数，使用 256 个 A100 GPU 在 500B 标记上进行训练，现在支持多帧图像理解和推理。Phi-3.5-vision 在 MMMU（从 40.2 提高到 43.0）、MMBench（从 80.5 提高到 81.9）和文档理解基准 TextVQA（从 70.9 提高到 72.0）上的性能均有提高。</p><p></p><p>Phi-3.5-mini 是一个 38 亿参数模型，超过了 Llama3.1 8B 和 Mistral 7B，甚至可媲美 Mistral NeMo 12B。该模型使用 512 个 H100 在 3.4T 标记上进行了训练。该模型仅有 3.8B 个有效参数，与拥有更多有效参数的 LLMs 相比，在多语言任务中具有很强的竞争力。此外，Phi-3.5-mini 现在支持 128K 上下文窗口，而其主要竞争对手 Gemma-2 系列仅支持 8K。</p><p></p><p></p><h4>英伟达发布全新AI模型，参数规模达80亿</h4><p></p><p></p><p>8月23日消息，英伟达（NVIDIA）宣布，其已成功研发并发布了一款全新的AI模型，该模型拥有高达80亿的参数规模，具备精度高、计算效率高等优点，可在GPU加速的数据中心、云和工作站上运行。</p><p></p><p>据介绍，这款新发布的AI模型是基于英伟达在深度学习、自然语言处理以及计算机视觉等多个领域的深厚积累与持续创新。通过庞大的参数规模，该模型能够更深入地理解和解析复杂数据，从而在各类应用场景中展现出更为卓越的性能。</p><p></p><p></p><h4>科大讯飞推出星火极速超拟人交互技术，对标 GPT-4o</h4><p></p><p></p><p>8月19日，科大讯飞宣布星火语音大模型更新，正式推出星火极速超拟人交互，打造国内首个全新中文交互模式，并将在8月底率先全民开放使用。这意味着国内首个对标GPT-4o语音功能的产品正式到来。</p><p></p><p>据了解，星火极速超拟人交互响应速度更快，对话更加自然流畅，在响应和打断速度、情绪感知情感共鸣、语音可控表达、人设扮演四个方面实现突破。采用最先进的深度学习技术，该系统不仅能听懂用户的言语，更能深入理解语境和意图，并能够根据上下文自动调整回复，提供更加个性化、智能化的服务。</p><p></p><p></p><h4>昆仑万维推出全球首款 AI 短剧平台 SkyReels，一人一剧时代来临</h4><p></p><p></p><p>8月19日，昆仑万维发布全球首个集成视频大模型与3D大模型的AI短剧平台SkyReels。SkyReels平台集剧本生成、角色定制、分镜、剧情、对白/BGM及影片合成于一体，让创作者一键成剧，轻松制作高质量AI视频。这是一个2分半时长的短剧作品。</p><p></p><p>SkyReels平台集成了昆仑万维自研剧本大模型SkyScript、自研分镜大模型StoryboardGen、自研3D生成大模型Sky3DGen、以及业界首个将AI 3D引擎与视频大模型深度融合的创新平台WorldEngine。</p><p></p><p>SkyReels能够通过AI一键生成完整剧本、分镜、人物对白与BGM，支持角色形象、音色与分镜的自定义调整，并能够自动将内容转换为1080P 60帧的高清视频，单次可生成视频长度达180秒，相比Sora单次可生成60秒视频、可灵单次可生成10秒视频，有显著突破。一键整合所有创作成果，极大提高视频的创作效率，降低创作成本，推动“一人一剧”时代加速来临。</p><p></p><p>同时，WorldEngine结合了引擎的精确可控能力(如光照模拟、物理模拟、3D空间、实时交互等) 以及AI视频大模型的幻想生成能力，提供了全新的线上混合视频创作模式，让视频创作从模糊生成迈向更加精确可控。</p><p></p><p></p><h4>企业应用</h4><p></p><p>8 月 21 日，Meta 推出全新网络爬虫程序 Meta-External Agent 和 Meta-External Fetcher，用于收集互联网数据以训练其 AI 模型，该程序可绕过 robots.txt 规则，从而无限制地获取数据。8 月 21 日，微软推出统一的 Teams 应用程序，支持所有账户类型。用户可以轻松选择工作、个人或教育账户，甚至以访客身份加入会议，无需登录。这款新的统一版 Teams 应用程序意味着使用 Windows 10、Windows 11 和 Mac 的用户可以通过个人电子邮件登录该应用程序，并免费与其他 Teams 用户进行连接和协作。8 月 21 日，OpenAI正在发布一项新功能，该功能将允许企业客户使用自己的公司数据来定制这家人工智能初创公司最强大的模型 GPT-4o。8月22日，腾讯会议升级多语言翻译能力。支持将声源语言翻译为中文、英语、日语、韩语、俄语、泰语、印尼语、越南语、马来语、菲律宾语、葡萄牙语、土耳其语、阿拉伯语、西班牙语、印地语、法语、德语等17种语言。功能升级后，腾讯会议企业版、商业版用户在会议中的字幕、实时转写以及会议后的录制页中均能使用。8 月 21 日，英伟达放出一段游戏 demo，备受期待的 AI NPC 引擎在多人机甲战斗游戏《解限机》Mecha BREAK 中首次亮相。在这款游戏中，你可以用语音对话的方式和 NPC 交流，了解关卡目标、优化装备配置，随后调整武器配色开始战斗。</p>",
    "publish_time": "2024-08-26 09:03:02",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "码上报名 | 跨越安卓和 iOS：开启国产 OS 移动开发新时代",
    "url": "https://www.infoq.cn/article/xYCtLCJOeKZ5KzRW3f8K",
    "summary": "<p>在数字化浪潮的推动下，操作系统作为科技领域突破和创新的基石，其重要性日益凸显。自主创新的鸿蒙系统，以其卓越的性能和开放的生态，推动了国内软件和硬件产业的升级。作为鸿蒙生态的共建者，蚂蚁 mPaaS 携手各行各业伙伴，为国产操作系统在行业中的创新应用注入了全新动力。</p><p>&nbsp;</p><p>值此背景，9 月 6 日下午蚂蚁数字科技、鸿蒙联合主办《跨越安卓和 iOS：开启国产 OS 移动开发新时代》主题论坛，邀请行业专家、企业高管、开发者和生态伙伴齐聚一堂，围绕数字经济发展前景，共同探讨国产操作系统应用生态的新变化和新机遇，分享实践应用经验，携手开启国产操作系统移动开发新篇章。这里，你将看到：</p><p></p><p>如何将科技与爱融入烹饪，享受美好生活?</p><p>如何点燃激情，沉浸享受竞技体育赛事的魅力？</p><p>国产操作系统高速发展背后，历经哪些征程与挑战？</p><p>从理想到实践，中石油、友邦 App 如何解锁服务体验新境界？</p><p>金融领域鸿蒙原生应用有哪些多元化创新与融合实践？</p><p>蚂蚁 mPaaS 全景能力支撑,&nbsp;如何加速 App 开发走入快车道？</p><p>&nbsp;</p><p>……</p><p>更多精彩，尽在&nbsp;9 月6 日下午</p><p>上海黄浦世博园 C9 会场</p><p>诚挚邀您</p><p>&nbsp;跨越安卓和 iOS：开启国产 OS 移动开发新时代</p><p>&nbsp;</p><p></p><p>论坛安排</p><p>主题：“跨越安卓和 iOS：开启国产 OS 移动开发新时代”</p><p>主办：蚂蚁数字科技、鸿蒙</p><p>时间：2024/9/6&nbsp;13:30-17:00</p><p>地点：上海黄浦世博园 C9 会场</p><p>&nbsp;</p><p></p><p>议程详情</p><p>点击图片，长按扫描二维码</p><p>免费获取参会凭证</p><p><img src=\"https://static001.infoq.cn/resource/image/05/f9/05699a6e6396e635403da24b7fdff8f9.png\" /></p><p></p>",
    "publish_time": "2024-08-26 12:14:11",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]