[
  {
    "title": "别踩坑！ 避开这些反模式会让事故处理事倍功半",
    "url": "https://www.infoq.cn/article/XjreJQO9s9omKNis3Zhi",
    "summary": "<p>事故会阻碍我们实现目标，无论你的目标是什么——例如销售 Taylor Swift 音乐会的门票，让人们在假期能够准时回家，或者在全球范围内运输货物——都有可能发生事故。我在 2023 年旧金山 QCon 大会的演讲中 分享了我的见解。</p><p></p><p>幸运的是，事故并不是孤立发生的。我们可以从过去的经验中汲取教训，在未来发生事故时减轻事故的影响。</p><p></p><p>一个注重弹性文化的组织能够迅速从事故中恢复，并将这些事故转化为机会。</p><p></p><p>弹性是指具备迅速抵御或从困境中恢复的能力，比如从故障、从事故中恢复。</p><p></p><p>弹性可以帮助我们将这些事故变成机会。</p><p></p><p></p><h2>事故生命周期</h2><p></p><p></p><p>无论我们多么努力，都不可能做到零事故。之所以发生事故，是因为我们不断发布代码，不断做出变更，而这是一件好事。</p><p></p><p>这是系统实现目标的一部分，是事故生命周期的一部分。</p><p></p><p><img src=\"https://static001.geekbang.org/wechat/images/56/567734d6334c1ef209130cdbc043c857.png\" /></p><p></p><p>事情在顺利进行（系统正常），然后发生了某些事故导致系统过载并崩溃（事故开始）。也许是因为你推出了一款炙手可热的新产品，或者开始销售有史以来最大型的音乐会的门票，导致热切的粉丝蜂拥而至。无论触发因素是什么，你现在都在努力应对一场全面的事故。</p><p></p><p>眼下的重点是恢复正常运营（事故解决），后面会有很多机会评估发生了什么（事故后活动），包括正式和非正式的事后总结。或许你的公司有正式的流程，有文档和确定的行动项，或许你的事后总结只是让一些同事在午餐或喝饮料时做一些回顾。然后，你们基于汲取到的关键教训来改进系统（应用教训），增加待命人员配备，改变请求队列的排队方式，或者在证实为系统问题时促使进行外部调查。</p><p></p><p>关键在于要认识到，“系统”不仅仅是一行行代码——它是将技术和团队结合在一起的一种社会性技术结构。每一个事故都提供了有助于改变人们处理未来事故方式的教训。我们的的大脑保持了这种成长的经历。基于事后智慧做出选择意味着系统在迭代演进。在应用了这些经验教训之后，我们最终回到了系统正常状态。</p><p></p><p>我们处理事故的方式可以引导我们走向更具弹性的基础设施和更明智的决策。事故为我们提供了一个学习的机会，我们的响应方式塑造了我们的系统以及整个团队在未来应对事故的能力。</p><p></p><p></p><h2>提高系统弹性的可能性</h2><p></p><p></p><p>为什么我们要关注这个问题？简单地说，公司需要为事故付出高昂的成本。这些成本可能会以多种方式体现：</p><p></p><p>网站故障可能导致用户无法访问和收入损失；声望受损可能意味着将来的用户减少；用户工作中断不仅发生在事故期间，也会延续到事故发生之后；目标和计划受到影响，因为工程师无法专注于推动这些工作进展。</p><p></p><p>在事故生命周期中有三个点，我们可以将时间和精力集中在改善学习周期上，并获得一些带宽来提高系统弹性。这并不容易，因为在这个过程中你通常需要做出一些小的调整和改变。如果还没有证据表明做一件事情是有用的，CTO 通常不会直接批准花 10 万美元用于跨事故分析（这对利益相关者来说可能不是一个有市场吸引力的改进）。</p><p></p><p></p><h2>专注于事故响应</h2><p></p><p></p><p>我们先从事故响应本身开始。我们可以在三个主要方面做出改进：</p><p></p><p>协调: 记录发生事故时你所遵循的工作流程，即使只是“打电话给那个在这里工作了 10 年的人”。找出可能存在差距的地方，并讨论如何缩小这些差距。协作: 如何将人们聚在一起解决问题？如何知道该打电话给谁？我曾在一家工作工作，当时我必须打开笔记本电脑，连接 VPN 并打开维基页，然后找到需要的电话号码。给一个人打电话可真费劲。你如何能够更容易地让人们聚在一起？沟通: 如何与利益相关者进行沟通？如何告诉客户发生了什么？他们的期望是什么？起草一些指南来管理期望，让每个人都了解响应应该是什么样子的。请记住，你的利益相关方和客户可能需要不同的信息。</p><p></p><p>这些改进都不需要完美。我们只需要找到小的改进和减轻认知负担的方法。也许你可以加入一些自动化功能来帮助解决这个问题。</p><p></p><p></p><h3>反模式：MTTX</h3><p></p><p></p><p>MTTX 是我用来指代发现的平均时间、恢复的平均时间、解决的平均时间等一些指标的术语。我先明确一下，这些指标数字没有任何意义。这并不是说我们不应该关心事故持续了多长时间，但这些单一的数字不应该成为我们的目标。</p><p></p><p>有一次我遇到了一个问题，我们的数据中心着火了，消防长不准我们进去。我们希望为我们的用户和工程师提供更好的体验，因为这是帮助我们取得成功的关键。我们可以做一些事情来简化事故响应，这样我们的工程师就能更好地解决问题。就像我们永远无法做到零事故一样，我们也无法完全控制从事故中恢复需要多长时间。</p><p></p><p></p><h2>专注于事故分析</h2><p></p><p></p><p>事故发生后，通过事故分析进行深入了解并从中学习是非常重要的。我发现基于叙述的方法有助于挖掘信息。这样，你就可以强调发生了什么以及人们从不同角度体验事故的方式。</p><p></p><p>首先，收集有关事故的数据，这个很重要。了解都有谁参与其中，他们在哪里，沟通是如何进行的——通过 Slack、Zoom 还是电话？将这些信息汇编到存储库中，并附上一个时间表，列出事故是如何发生的。记下数据中悬而未决的问题，然后决定是否需要召开会议，或者是否可以通过共享文档进行异步讨论。</p><p></p><p>你需要整个组织提供的各种视角。参与讨论的不应该只包括事故管理人员和推送错误代码的人。我发现市场营销人员、产品管理人员，尤其是客户支持人员对事故的影响也有着深刻的见解。</p><p></p><p>在开会时，请确保这是一场开放的对话——主持人说的话要少于其他人。这样，你可以了解到这次事故如何影响不同的群体。例如，你可能会了解到值班工程师缺少仪表盘的访问权限，或者客户支持收到了怎样的投诉。</p><p></p><p>最终，将主要见解和行动项提炼成适当的格式。领导可能需要简短的执行摘要，其他团队可能需要确定的行动项清单。分享这些信息，确保它们能够有效地提升组织的弹性。</p><p></p><p>我们的目标是有效地传达事故的促成因素和事故的影响，以此来推动变革。一些用于改进事故分析流程的额外的资源包括 Jeli Howie 指南 和 Etsy 的无过失事后分析促进指南。</p><p></p><p></p><h3>反模式：行动项工厂</h3><p></p><p></p><p>关键在于要避免常见的反模式，比如在事后分析当中只是生成行动项而不加以跟进。为特定问题创建警报或生成被遗忘在谷歌文档或待办事项列表中的修复程序，只会在整个流程中埋下不信任的种子。如果提出的修复和改进措施从未被实现，工程师和利益相关者会认为评审会议是在浪费时间。</p><p></p><p>为了抵制这种反模式，事故评审应该更广泛地评审组织的弹性，而不只是专注于行动项。很多时候，我们往往会看到要么是微小的行动项，要么是过于雄心勃勃的行动项，而我们需要找到一个平衡点——在影响范围和优先级方面都刚刚合适的“金发女孩（Goldilocks）”行动项。避开了狭隘的行动项，组织可能会发现更多增强系统弹性的机会，并确定怎样更好地分配资源。但是，如果我们想要保持对流程的信任和参与度，任何已确定的改进措施都必须得到推广。</p><p></p><p>完美的行动项是指那些可以比其他计划优先考虑，并在接下来的一两个月内完成的事情。而且，它还应该推动与事故相关的工作。</p><p></p><p></p><h2>专注于跨事故分析</h2><p></p><p></p><p>基于多个事后分析进行的跨事故分析对于识别系统性问题并进行有意义的改进来说至关重要。通过汇总来自个别高质量事故评审的见解，组织可以发现可能需要在整个公司范围内执行的举措或转变，如调整人员配置、供应商变更或采用新的解决方案。</p><p></p><p>这项分析应该是一项协作工作，需要结合来自工程、产品、客户支持、营销和领导的观点。不应该由任何一方单独拥有整个过程。以易于理解的方式呈现数据对于解决情境化问题并说服领导支持重大变革也至关重要。</p><p></p><p>目前，许多组织在有效进行跨事故分析方面面临困难，因为他们缺少来自事故评审的高质量数据，或者这些数据分散在多种媒介中，这给事故分析造成了阻碍。此外，大多数工程师没有接受过数据分析培训，无法用这种方式汇总见解。</p><p></p><p>如果做得好，这些见解可以清晰地描绘出事故中的痛点。我们的目标不是为了召集具体的团队，而是通过重新分配资源或更新流程来提供有用的支持。这种弹性水平使得工程师能够更好地避免未来可能发生得问题，并为创新创造了良好的环境。</p><p></p><p>通过跨事故分析获取见解的一个例子是了解事故发生在哪里。也许大多数事故发生在你的代码库的某个特定区域。你该如何更好地支持管理负责这个区域的团队？或者代码是否需要进行一些重构？</p><p></p><p>我在很多团队中都这样做过。他们能够基于事故趋势做出组织层面的决策。我们看到人们利用这些见解做出决定，例如使用特性标志，或更换供应商，甚至进行组织变更。所有这些都为工程师的成长创造了一个良好的环境。</p><p></p><p></p><h3>反模式：MTTX</h3><p></p><p></p><p>进行跨事故分析也存在陷入 MTTX 反模式的风险。一些高管可能会要求提供实际上不会提供实用见解的指标。工程师或分析师没有足够的理由去挑战 CTO，因此我建议在这里提供一些背景信息即可。我将这种方法叫作“意大利面酱中的蔬菜”。指标本身可能没有帮助，但你提供的上下文会让信息变得更加丰富。</p><p></p><p></p><h3>反模式：不沟通见解</h3><p></p><p></p><p>我想分享最后一个反模式，它与跨事故见解有关，但也适用于从评估事故中获得的任意见解。我们的工作不应该只是在完成后就将其束之高阁。</p><p></p><p>任何文档都应该能够在整个组织内阅读和分享，即使是在我们采取初始行动很久以后。我经常参加评审会议，工程师们说：“我们都知道该怎么做，我们只是不去做。”我的问题是——我们确实都知道吗？是否已经清楚传达了？</p><p></p><p>通常情况下，人们不愿意参与我们的学习，因为他们觉得这种形式与他们无关。不同的利益相关者需要掌握不同的见解。根据利益相关者调整语言和详细级别，专注于你的目标，不要纠结于不重要的细节。如果要为重新架构系统提供理由，请根据数据解释理由，然后就此结束。</p><p></p><p>还需要考虑你的格式，是否使用了见解、指标、叙述和技术细节？从最重要的见解开始。例如，“X 比例的事故与我们过时的 CI/CD 管道有关。这将影响所有的产品，并让用户难以上手。利益相关者和专家建议下个季度将重点放在重新架构上。”我们提出这个建议并不是凭空想象，而是因为数据为此提供了支撑。展示你的工作。获取到这些信息的人可以从个别事故分析追溯到跨事故见解，然后获得行动线索。</p><p></p><p></p><h2>总结</h2><p></p><p></p><p>我们永远不可能做到零事故。技术在不断发展，新的挑战不断出现，我们在关注事件响应、事件分析和跨事件洞察的同时，也要注意那些反模式，这样就可以降低事故成本。我们可以更好地为处理事故做好准备，这将带来更好的用户体验。这将培育出一种工程师参与的文化，他们不仅有能力完成工作，还能够创造性地解决问题，帮助我们实现组织的目标。</p><p></p><p>原文链接：</p><p><a href=\"https://www.infoq.com/articles/incident-lifecycle-resilience/\">https://www.infoq.com/articles/incident-lifecycle-resilience/</a>\"</p><p></p>",
    "publish_time": "2024-01-31 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "金融产品和服务效率的角逐，背后竟是PaaS平台能力之争？",
    "url": "https://www.infoq.cn/article/RDAqLJTkm0VT7TdVugW4",
    "summary": "<p>去年10月的中央金融工作会议上明确提出，要做好科技金融、绿色金融、普惠金融、养老金融、数字金融“<a href=\"https://www.infoq.cn/article/BpAYeYkzIHtJaPlHC5TR\">五篇大文章</a>\"”。其中数字金融是基础，也是另外“四篇文章”的重要支持。而这篇“文章”的背后，是金融行业数十年来从电算化、信息化、网络化到数字化的持续演进和发展。</p><p></p><p>“金融行业的数字化转型涉及两个方面：一是金融机构本身的数字化，主要体现在数据驱动的决策制定、自动化和智能化的运营流程、以及风险管理能力；二是金融机构的服务和产品的数字化，主要表现为提供更加便捷、个性化的金融服务和创新金融产品，通过移动支付、在线银行、智能投顾等数字化服务，更加深入地了解和满足客户需求，拓宽服务范围，覆盖更广泛的客户群体，同时也提高交易的安全性和透明度。”浙江大学金融科技研究院执行副院长张瑞东表示。</p><p></p><p>这些变化要求金融机构的自我革新速度必须加快。以产品服务为例，随着与客户的连接越来越紧密，以及定制化服务日益普遍，为了适应客户不同场景需求，留给金融产品的开发周期越来越短。张瑞东强调，“产品的尽快推出，对于占领行业领先地位是非常有积极意义的。”</p><p></p><p>基于PaaS平台，构建在云中运行的应用程序，成为金融机构应对这一挑战的重要手段。</p><p></p><p>在日前的《金融行业云平台（PaaS）市场发展趋势白皮书》（以下简称“白皮书”）发布会上，张瑞东介绍了被云原生技术重新定义的PaaS平台如何帮助金融行业解决数字化痛点，以及成熟的PaaS平台所具备的基本特点，为金融机构数字化转型和PaaS平台<a href=\"https://www.infoq.cn/topic/technology-selection\">技术选型</a>\"提供了一定的思路参考。</p><p></p><h3>PaaS解决了金融行业哪些问题？</h3><p></p><p></p><p>金融行业是数字化转型的先行者，与云服务的结合也早早步入深水区。但随着上云进程的推进，许多金融机构已经遇到了新老系统架构出现交集、应用体系的开发运维效率、底层异构资源的复杂性等诸多新的问题。</p><p></p><p>这些新的问题促使金融机构在云计算方面的需求从IaaS层进一步迈向PaaS和SaaS层。</p><p></p><p>根据IDC此前发布的《中国金融云市场（2022下半年）跟踪》报告显示，2022下半年，中国金融云美金市场规模达到46.3亿美元，同比增长18.6%。其中，金融云IaaS美金市场规模为31.4亿美元，美元同比增长13.2%；金融云平台（PaaS）解决方案市场美金同比增速为42.7%，增速在所有子市场中排名第一。</p><p></p><p>那么，<a href=\"https://www.infoq.cn/article/M45ssycoZyWGh1P3I3hW?utm_campaign=geek_search&amp;utm_content=geek_search&amp;utm_medium=geek_search&amp;utm_source=geek_search&amp;utm_term=geek_search\">PaaS平台</a>\"究竟能够解决金融数字化过程中的哪些问题呢？</p><p></p><p>张瑞东指出，PaaS平台由于更面向业务价值，具备以下8大优势：简化开发、弹性扩展、数据驱动、支持跨平台和移动应用开发、提升效率、降低成本、支持多租户和多用户、高效实现DevOps。</p><p></p><p>具体对于金融行业而言，PaaS可以满足金融机构在开发、运营和生态3个层面的一系列需求。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/31/3110ad2e68f9bd1c1f056f158268d40d.png\" /></p><p></p><p>举例来说，面对前文提及的开发周期缩短的挑战，PaaS平台由于可以提供丰富的开发工具和服务，使得开发人员能<a href=\"https://www.infoq.cn/article/pzC0XXGzSWJwPkIOwSlz?utm_campaign=geek_search&amp;utm_content=geek_search&amp;utm_medium=geek_search&amp;utm_source=geek_search&amp;utm_term=geek_search\">高效地开发</a>\"和管理应用，并快速迭代和持续交付；此外，PaaS平台有着很强的可扩展性，能够满足金融行业根据实际需求动态增加或减少应用程序资源的需要。</p><p></p><p>从生态层面来看，金融跨界属性越来越强，与其它业态的业务紧密度和交互频率越来越高。这意味着底层的技术连接也要越来越顺畅。对此，PaaS平台一方面可以提供API管理和开放平台功能，允许金融机构将其数据和服务开放给合作伙伴和第三方开发者；另一方面，还可以提供数据集成和转换的工具和服务，使不同系统和数据源之间可以无缝地进行数据交换和共享。</p><p></p><p>再看运营，金融行业作为经济的“压舱石”，其业务可靠性和稳定性是基本前提。对此，PaaS提供的高可用性和弹性的基础设施，恰恰可以满足金融机构的应用程序始终可用且具备稳定性；在此基础上，PaaS还提供了丰富的开发工具和自动化功能，可以帮助金融机构提高运营效率并实现自动化。</p><p></p><p>“基于这些优势和特点，PaaS正在加速推进金融机构的用云方式从‘上云’向‘云上’转变。”张瑞东表示。</p><p></p><h3>企业如何选择合适的PaaS平台？</h3><p></p><p></p><p>根据需求和目的的差异化进行分类，PaaS平台可以大致分为应用开发、数据平台、通用技术、集成服务四种类型。</p><p></p><p>应用开发类，顾名思义是以应用开发为主要目的，核心价值是提升应用开发效率，简化部署过程，典型代表有低/无代码PaaS平台、mPaaS(移动开发平台)&nbsp;、BPM&nbsp;PaaS(业务流程管理平台)等；</p><p></p><p>数据平台类，主要关注数据存储、处理和分析，核心价值是解决数据孤岛问题，挖掘数据价值，典型代表有DBPaaS(云数据库平台)&nbsp;、BD&nbsp;PaaS(大数据平台)&nbsp;、BI&nbsp;PaaS(商业智能平台)等；</p><p></p><p>通用技术类，指的是以AI、区块链、IoT等某一种通用技术能力为主要目的的PaaS平台，核心价值是降低技术使用门槛，直接赋能前端应用和业务，典型代表有AIPaaS、IoT&nbsp;PaaS&nbsp;、安全技术PaaS等；</p><p></p><p>集成服务类，主要关注应用和服务之间的集成和连接，核心价值是帮助企业进行应用间交互的管理和监控，保障高可用性和可靠性，典型代表有应用集成PaaS&nbsp;、API集成PaaS、CMP&nbsp;PaaS(云管理平台)等。</p><p></p><p>据张瑞东介绍，金融业务拥有鲜明的特点，比如很多问题需要事先决策（如放不放贷、放了贷之后安全性如何等）。因此，对应的金融云PaaS平台要能够把这些能力集成进来，并且速度要快、风险要可控。</p><p></p><p>“对金融行业来说，一个优秀的PaaS平台服务，一是要与时俱进，能够把所有相关技术进行整合，从而帮助企业在进行二次开发、三次开发的时候，能够让开发人员随心应手，缩短开发周期，尽快推出定制化的金融产品或者服务。”张瑞东指出，“另一方面，还要支持多云战略，帮助金融机构能在不同的云服务平台间快速部署和管理应用，充分利用多核心技术的计算能力，从而提升数据处理能力和响应市场的速度。”</p><p></p><p>在此次发布的“白皮书”中，以<a href=\"https://www.infoq.cn/article/2che1Izc72EfbxARdQou?utm_campaign=geek_search&amp;utm_content=geek_search&amp;utm_medium=geek_search&amp;utm_source=geek_search&amp;utm_term=geek_search\">蚂蚁数科</a>\"提供的mPaaS和SOFAStack两大核心产品为例，描画了成熟PaaS平台的范式。</p><p></p><p>据蚂蚁数科数据智能与科技事业群产品解决方案总监曹诗洋在会上介绍，国内前50金融机构，超过60%已经选择了蚂蚁移动云平台服务和蚂蚁整体SOFAStack服务，这里面包括6家国有大型商业银行和11家股份制银行。</p><p></p><p>例如，浙江农商联合银行使用蚂蚁SOFAStack实施方案，完成了全方位分布式架构改造与应用容器化，实现了三地多中心分布和异地容灾，构建了自主可控的技术基础设施，而部署效率以往平台同城高可用架构提升60%，应用研发测试上线周期缩短近50%，PaaS平台运维可观测性提升了40%。</p><p></p><p>再例如，位于云南的<a href=\"https://www.infoq.cn/article/9FRdGfIdRe3OIoygTBrt?utm_campaign=geek_search&amp;utm_content=geek_search&amp;utm_medium=geek_search&amp;utm_source=geek_search&amp;utm_term=geek_search\">富滇银行</a>\"基于SOFAStack，使得系统每分钟交易量提升80倍，核心交易平均处理时间小于200毫秒；手机银行新增用户数同比增长305%。此外，基于mPaaS打造的新版手机APP，在用户体验优化、非金融高频场景和数字化运营营销的三重作用下，其手机银行用户活跃度大幅提升，带动AUM在年初增长31%，定期存款销售同比增长了2.39倍。</p><p></p><p>值得注意的是，虽然业务线上化是普遍需求，但是在采用PaaS层面，不同规模金融机构也表现出了差异化的策略和路径。曹诗洋举例：对于一些技术基础较好的大型金融机构，更倾向于在核心技术领域或垂直领域与技术服务商进行深度合作；而对于中小型金融机构，则更希望采用相对轻量、能够快速落地和见效的解决方案。</p><p></p><h3>PaaS和SaaS是未来云原生的主战场</h3><p></p><p></p><p>“白皮书”数据显示，PaaS在未来几年仍然保持快速发展，预计到2025年，中国PaaS市场规模将达到2155亿元，年均复合增长率将达到48%。面向金融这一垂直行业，PaaS产品将呈现以下发展趋势：</p><p></p><p>第一，PaaS+多云融合管理。</p><p></p><p>虽然去年以来业界翻起一阵“下云潮”，但是曹诗洋向InfoQ记者解释，下云不是目的，如何确保业务在云上和云下更好地协同才是关键。在这个过程中，<a href=\"https://www.infoq.cn/article/WIRXxsAV4V6HOhRivtmx?utm_campaign=geek_search&amp;utm_content=geek_search&amp;utm_medium=geek_search&amp;utm_source=geek_search&amp;utm_term=geek_search\">多云</a>\"模式一方面可以满足企业在ROI方面的要求，另一方面，还可以帮助企业降低被单一厂商绑定的技术风险，确保业务保持一致性和连续性。</p><p></p><p>第二，PaaS+智能化。</p><p></p><p>金融行业拥有较为扎实的数字化基础，经过过去多年的沉淀，下一个阶段的重要课题之一是如何更好地实现精细化运营，为业务价值赋能。在这个过程中，需要数据与智能手段的相互配合。尤其是在<a href=\"https://www.infoq.cn/news/eBpIOezhpdBY7LFPYZu3\">大模型</a>\"这一突破性技术发展的加持下，数据价值将有希望得到更大空间的发挥。再往下落，这也意味着PaaS平台必须具备智能化能力，能够与智能化平台相融合。</p><p></p><p>第三，PaaS+移动端。</p><p></p><p>业务和运营线上化、移动化的趋势不可逆转，手机端的云平台服务成为主战场。这要求PaaS平台能够更高效地支持移动开发、测试和运营，在前端能够满足动态灵活的客户端能力，在中台能够覆盖APP全生命周期，在后台则要能提供稳定的连接能力。</p><p></p><p>第四，集成化大模型与端到端管理。</p><p></p><p>通用模型解决不了专有领域的问题，那么，在大模型的流行趋势下，如何面向金融行业实现<a href=\"https://www.infoq.cn/article/kQOjfc1iCvObWXEleaGP\">最后一公里</a>\"的落地？从底层基础技术层面就要实现云平台与大模型技术的集成化和端到端管理，让行业数据能够流向垂直领域大模型，进而真正在金融业务场景下创造价值。</p><p></p><p>第五，低代码/无代码开发方案。</p><p></p><p>根据IDC预测，未来无代码/低代码全球市场将会持续上升，且涨幅基本集中在云平台。对此，张瑞东还进一步表示，<a href=\"https://archsummit.infoq.cn/2024/shenzhen/track/1643\">低代码/无代码</a>\"开发方案的未来也是与GPT技术相结合，二者强强联合将帮助开发者实现研发效能的进一步提升。</p><p></p><p>“总而言之，未来的云市场将从资源驱动演变到技术和业务驱动，其中所谓技术和业务驱动必须是面向垂直行业的。企业上云能产生什么价值？云原生价值如何被挖掘出来？这是企业关注的。此外，受AI大模型的影响，未来PaaS和SaaS都是云原生的主战场。中国云市场的主战场在于定制化应用的开发、云平台服务灵活性和高度集成，这几点做好了，云厂商的竞争力也会大大提升。”</p><p></p><p>“对于蚂蚁数科来说，我们在这个过程中看到了两个机会点：一是全面兼容，向多云、多芯方向发展；二是全面智能，向多端智能、智能应用、智能平台方向努力。”曹诗洋表示。</p>",
    "publish_time": "2024-01-31 10:09:13",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]