[
  {
    "title": "大厂年终奖疯狂不再？打工人集体怀念过去：想念那个靠年终奖一夜暴富的时代",
    "url": "https://www.infoq.cn/article/NuJUiRhgkkNPDMuVE1qj",
    "summary": "<p></p><blockquote>职场人最大的期待莫过于“揣着年终奖回家过大年”。</blockquote><p></p><p></p><h2>今年的年终奖“打折”了？</h2><p></p><p>&nbsp;</p><p>岁末年初，对职场人来说最关心的除了回家的车票，还有盼了一年的年终奖。但如今不少企业不仅延后了年终奖发放时间，连金额也开始“打折”了。</p><p>&nbsp;</p><p>前程无忧日前发布的《2023职场年终奖调查》显示，78.6%的受访者明确其所在公司会发放年终奖，但是超过三分之一的人(33.6%)表示年终奖要在节后才能拿到。对于这部分人来说，如果在节后跳槽，还有彻底拿不到年终奖的可能。另有16.5%的受访者明确表示年终奖被“跳票”。</p><p>&nbsp;</p><p>根据智联招聘日前发布的《2023年白领年终奖调研报告》，从发放数额来看，2023年全国白领年终奖均值为6950元，比上年的8428元减少了1478元。从城市维度来看，2023年北京白领年终奖均值为10298元，领衔全国主要城市。此外，上海、深圳、苏州、杭州的白领年终奖均值都在9000元以上。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/93/939c255ba653f5692687c0b58184b89d.png\" /></p><p></p><p>从公开消息来看，近两年不少大厂选择在次年三四月份发放年终奖，比如阿里、字节跳动、百度、美团等。京东OS序列（基层员工）年终奖农历年前（2月7日）发放，MPT序列（M是指管理，P是指项目经理，T是指产品和技术）员工年后发放。能在年前发年终奖的大厂堪比“一股清流”，其中包括腾讯、快手、B站、携程等。</p><p>&nbsp;</p><p>金额方面，今年不少大厂的年终奖也在“缩水”。</p><p>&nbsp;</p><p>1月31日，有媒体报道，腾讯今年年终奖绩效评定已经出结果，最高的可达5个月月薪+。腾讯离职员工表示，腾讯现在都是三档绩效：Outstanding（突出）、Good（良好）、Underperform（欠佳），具体几个月年终奖看部门，部门之间也是天差地别。其中三档绩效分别对应：5个月月薪+、中间（绝大多数人4个月月薪，可能略微上浮）、最低档1-2月月薪。而根据往年情况，腾讯普通部门的员工一般能够获得3-6个月的薪资作为年终奖，一些业绩卓越的部门，如游戏部门，则有可能获得高达24-48个月工资的年终奖。</p><p>&nbsp;</p><p>字节跳动在近期发布的“薪酬调整方案”中提到，字节跳动产品线薪酬由18薪调整为15薪，总包不变。同时，年终激励方式改变，将原来年终奖月数大于3的薪酬方案统一调整为3个月。</p><p>&nbsp;</p><p>对此，有网友评论道：“互联网行业业绩增长曲线逐渐由陡峭走向平缓，巨额年终奖也从互联网大厂消失了。以前那个靠转年终奖两年在深圳买一套房的时代已经过去了。”不少网友开始缅怀过去，“想念那个靠年终奖一夜暴富的时代”。</p><p></p><h2>大厂的年终奖曾有多疯狂？</h2><p></p><p>&nbsp;</p><p>年终奖不仅代表了公司的慷慨和认可，也是对员工辛勤付出一年的回馈。曾经，互联网大厂的年终奖总是令人激动不已，在岁末年初时掀起一波又一波小高潮。下面就来盘点下，那些年，让人疯狂的大厂年终奖。（注：以下数据来源于网络，若有不实之处，欢迎大家在评论区及时指正）</p><p></p><h4>100个月工资，相当于8年不用上班？</h4><p></p><p>&nbsp;</p><p>2018年是抖音疯狂增长的一年，当年年末，抖音为早期员工发放了20月薪资的年终奖金。据传给时任抖音负责人任利锋发了100个月薪水。以一年12薪计算，一个年终奖相当于8年多的工资。</p><p></p><h4>50个月工资，年终奖能拿百万元</h4><p></p><p>&nbsp;</p><p>百度的年终奖主要包括奖金、加薪、股权激励，是根据年终评分而定，打分区间是1-5，1分最高。一般员工都可以拿到3分，一般都有2-4个月工资。2015年，百度董事长兼CEO李彦宏在那年公司年会上宣称，“今年拿出了‘史上最大额度的奖金’奖励成绩突出的员工”，有人年终奖甚至拿到了50个月的工资。有知情者推算，当时百度有些员工能领到的年终奖或能达百万元。</p><p></p><h4>全年表现突出可拿28个月工资</h4><p></p><p>&nbsp;</p><p>据脉脉平台上一位认证为快手员工的用户爆料，其2019年年终奖拿到28个月工资。有快手员工透露，年终绩效为A的员工，能够拿到8个月工资作为年终奖。而全年表现突出的员工，最高更是能拿到28个月的工资。</p><p>&nbsp;</p><p>有网友表示，自己从快手离职后收到还2.5个月的年终奖，到手金额比现在公司给的还要多一倍，直呼后悔离开快手。</p><p></p><h4>有钱有股票</h4><p></p><p>&nbsp;</p><p>阿里的年终考核制度是根据公司KPI和个人KPI综合打分来确定。据说年终绩效系数在3.75以上的（占30%），有至少6个月的年终奖，如果部门整体效益好，可以拿10个月+的年终，还有600股左右的股票。2020年，阿里的年终奖包括：年底双薪+大红包+年终大奖金+股权奖励。此外，福利还包括员工买房子能够得到30w无息贷款等。根据阿里员工2020年的爆料，自己职级为P6，年终奖有34万多点，涨薪4000，以及520股票，当时市值大概在75万元。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/79/79ee528dd4fa7ecae6430daa7769cf66.png\" /></p><p></p><p>2020年，腾讯公司为做出特别贡献的员工授予了一笔同心同行奖，奖品为100股腾讯控股股票激励，一年后可以变现。按照腾讯当日每股735港币的股价，相当于61218元人民币。</p><p>&nbsp;</p><p>华为也经常给员工发股票。2020年，华为持续实施股票分红，预计每股1.86元。数据表明，2018年的时候华为总股数是222亿，若以每股1.86元的价格来算，这次的分红至少超过400亿。</p><p></p><h4>游戏部门造就“年终奖神话”</h4><p></p><p>&nbsp;</p><p>游戏部门作为不少大厂的核心利润部门，曾造就了一个又一个“年终奖神话”。</p><p>&nbsp;</p><p>2012年，腾讯游戏部门英雄联盟项目组的部分成员拿到60个月工资的年终奖。据第一财经2017年7月报道，《王者荣耀》项目组当年人均分红140万，最低分到60万，最多分到290万。同时，外界传出“王者荣耀之父”的腾讯副总裁姚晓光，当年的年终绩效奖金是2亿元。</p><p>&nbsp;</p><p>2020、2021年，国内游戏产业发展突飞猛进，游戏公司的年终奖自然也水涨船高，各种天价年终奖的消息不绝于耳。2021年1月，一则关于《原神》开发商、游戏公司米哈游年终奖高达108个月薪的消息传遍互联网。传言称，现在米哈游员工共有4500人，按照底薪8000元计算，108薪就是年终奖864000元，4500名员工共计发放38.88亿元。虽然该消息随后被辟谣，但在前几年，不少游戏大厂都曾发过巨额年终奖。</p><p>&nbsp;</p><p>2021年，一位认证信息为前字节跳动员工的用户在社交平台上发帖称，“听来的各大厂今年的年终奖，有点卷起来的意思了”。</p><p>&nbsp;</p><p>其表示，网易今年《哈利波特·魔法觉醒》项目组年终奖直接全员安排到了888888。他们第二季度在线游戏净收入145亿，第三季度推出的]《哈利波特·魔法觉醒》成了今年的大热门，壕得理直气壮。小米今年第三季度财报营收780.6亿，超出去年同期不少，而他们的智能工厂二期今年7月也正式动工开建，让小米智能工厂技术部门年终奖直接发到8个月工资。腾讯《英雄联盟》项目组，感觉有点和去年的《王者荣耀》卷起来的意思，年终奖直接每人120万现金，再加上他们的阳光普照奖和动不动发股票的操作……</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/98/9899e35b0a101cf0ece13f1eaaaa5d6a.png\" /></p><p></p><p>据时代周报报道，一位接近网易游戏的相关人士证实网传哈利波特项目组年终奖数额属实。而腾讯《英雄联盟》项目组员工的年终奖虽未达到120万，但也会发“双位数分量的月薪，外加公司股票和部门额外奖金。”</p><p></p><h2>结束语</h2><p></p><p>&nbsp;</p><p>年终奖的多与少受到多种因素影响，包括公司的盈利状况、员工的工作表现、公司的整体经济状况以及行业竞争等。</p><p>&nbsp;</p><p>对于年终奖，职场人既有期待，也有担忧。期待一年的辛苦付出可以收获好的结果，也有人会担心离职后是否还能拿到年终奖。最高人民法院2022年发布的指导案例183号提到，针对离职者的年终奖发放，应当结合劳动者离职的原因、时间、工作表现和对单位的贡献程度等多方面因素综合考量。</p><p>&nbsp;</p><p>从司法实践上看，劳动者在职期间履行了职责，劳动争议仲裁机构或法院会支持此类离职劳动者，按照在岗时间得到一定比例“年终奖”。例如，在广东某空调集团担任高管的魏先生于2010年7月辞职。2011年，魏先生将原单位告上法庭，索要2010年的145万元“年终奖”。受理法院认为，根据双方劳动合同，员工中途离职也该拿到部分“年终奖”，一审判令企业支付“年终奖”70万元。</p>",
    "publish_time": "2024-02-18 09:55:11",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "大厂互联网黑话卷到了国外，网友：过年了，请说点人话吧",
    "url": "https://www.infoq.cn/article/tZQo3Ui7om3TFueQvuZF",
    "summary": "<p>前几年，张一鸣在字节跳动年会上，给大家摘录了一段文字，讲的全是互联网\"黑话\"，满屏幕高级词汇叠加在一起，听起来却让人感觉不知所云。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/9b/9bfe6592462bf9c36f2bce8c61502641.jpeg\" /></p><p></p><p>一时间，互联网“黑话”遭遇“群嘲”。甚至有人还弄了个互联网八股文，具体内容如下：</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/f2/f21b65408179ecef3ac751ae0adf3e2b.jpeg\" /></p><p>但最近，这些在国内互联网大厂间盛行的“黑话”居然飘洋过海来到了海外，同样遭到了国外网友的吐槽。如果大家最近玩过TikTok，估计会对这种刺耳的声音产生深刻印象。</p><p>&nbsp;</p><p>由喜剧演员Lisa Beasley创作的“大厂艾琳”（Corporate Erin）是个标志性的符号，讽刺了技术大厂那种以积极话术给员工洗脑的不人道行为。在TikTok视频里，大厂艾琳可谓深得个中精髓，特别擅长用冗长且毫无意义的“黑话”轰炸用户脆弱的神经。</p><p>&nbsp;</p><p>比如作为“物流经理”，大厂欧琳会面带微笑地把一个个残忍的消息甩到你面前，丝毫不为内容所动。</p><p>&nbsp;</p><p>在人气最高的视频里，大厂艾琳解释了她今天为什么要打电话给你开会，然后用“可交付成果”和“上线”之类的废话不断耗费你的宝贵时间。</p><p>&nbsp;</p><p>而面对员工失去家人的噩耗，艾琳也不会表现出一丁点同情。她只会提醒你，根据丧亲政策，直系亲属离世只能批一天假。</p><p>&nbsp;</p><p>Beasley从2021年起就开始制作大厂艾琳系列视频，其中表现的正是她本人作为自由职业者的真实经历。</p><p>&nbsp;</p><p>如今的Beasley只想以大厂艾琳的身份接受采访，并表示这样“会保留一层被动的交互缓冲，也让我能继续把握住这种「不说人话」的精髓。”</p><p></p><h2>为什么“大厂黑话”这么招人烦？</h2><p></p><p></p><p>Beasley的视频之所以能赢得数百万次观看，显然是因为触动了大量观众的共鸣。用户评论精准地总结道，“什么叫大厂黑话？就是说了一大堆企业术语，但又没有任何实质性内容。”而当一个人频繁使用或者听取“大厂黑话”，自己就会不自觉成为黑话的又一个传播节点。</p><p>&nbsp;</p><p>宾夕法尼亚州的技术从业者Sara就表示，她是从大厂艾琳视频中意识到自己被黑话洗脑了。Sara强调，公司里“根本就不存在自主表达的空间”。</p><p>&nbsp;</p><p>“我觉得大厂艾琳视频甚至没多少夸张的成分。现在企业里就是这样，我每天参加的会议就是这样。”</p><p>&nbsp;</p><p>乔治敦大学语言学教授Deborah Tannen也认为，大厂艾琳确实揭露了一些血淋淋的现实。Beasley之所以选择这种极快的表达节奏，就是因为“企业既不想让人听懂，也不想让人理解，只想让人懵圈。”</p><p>&nbsp;</p><p>“而且姿态和表情也是其中的一部分：身体前倾本来是种真诚的姿态，但却被配合上了毫无诚意的基本立场。”</p><p>&nbsp;</p><p>而且这些搞笑视频由于太过真实，仔细想想好像并不该为之发笑。</p><p>&nbsp;</p><p>有专家认为，这些视频体现出了所谓“道德剥离”，也就是“我们经常无意识地参与到某种集体行为当中，并因此确信自己造成的伤害完全合理。”与之类似的还有各种造词行为，比如把解雇或者裁员等完全负面的消息说成是“波动”或者“重组”。</p><p>&nbsp;</p><p>曾经的营销从业者Erin Kenney甚至表示在观看大厂艾琳视频后引发了创作性反应。“我已经离职一年多了，但经常还是把突然吓醒，以为自己错过了消息提醒。”</p><p>&nbsp;</p><p>对Kenney来说，大厂艾琳就是前疫情时代最流行的企业文化代表——不惜一切证明自己对工作的绝对忠诚。当时，X一代和千禧一代甚至以疯狂工作为荣。</p><p>&nbsp;</p><p>“在整个20多岁，我都在努力成为「大厂艾琳」那样的角色。我想快速晋升，愿意为此付出一切——哪怕放弃一个个重要时刻、通宵达旦、做各种自己根本不想做的工作。”</p><p></p><h2>利用个人发展焦虑，以企业文化为名作恶</h2><p></p><p></p><p>大厂艾琳这样的习气确实能帮助新人融入企业、加快晋升，但这一切都是有代价的。</p><p>&nbsp;</p><p>Beasley坦言，刚开始她也不太熟悉像“复盘”这样的黑话。但说人话在企业里不太行得通，甚至可能成为融入团队的阻碍。“如果不能尽快熟悉各种潜规则和黑话，你的前途很可能堪忧。”</p><p>&nbsp;</p><p>所以掌握大厂黑话，似乎成了需要认真对待的生存前提。</p><p>&nbsp;</p><p>于是Sara决定采用语气更深沉、表达更单调的搭配，抛开一切人类的情感，让自己听起来更自信。</p><p>&nbsp;</p><p>“作为女性，要想在这个男性主导的世界里闯出点名堂，我必须从根本上改变自己的表达风格——让自己听起来更像男性。这不好，但只有这样才能让其他人认真听我讲话。”</p><p>&nbsp;</p><p>但这种策略也有可能适得其反。曾因创立血液检测初创公司Theranos而名气大噪、但后被证明造假而名誉扫地的Elizabeth Holmes，在工作期间就特别喜欢以低沉的男中音说话。而根据《纽约时报》的跟踪报道，Holmes日常的语音“完全正常，没有任何低沉沙哑的倾向”。</p><p></p><h2>在社交网站上用幽默解构一切不公</h2><p></p><p></p><p>如果大家经常泡在TikTok上，可能还见过大厂艾琳的另一个版本——非营利组织老板。这个角色由演员Nicole Daniels创作，表现的就是她过往在非营利组织工作时见过、接触过的人和事。</p><p>&nbsp;</p><p>Daniels总结道，“她总是穿着同样的衣服，嘴里从来不停，只是吃的东西不一样。她总是趴在电脑旁边，连吃饭时也是……她还喜欢用肢体语言表达「我觉得不行」。”</p><p>&nbsp;</p><p>跟大厂艾琳不同，非营利组织老板这个角色对美国企业中的不人道问题披露得更加直白，总在以“我跟你是一边的”态度对员工施加折磨。</p><p>&nbsp;</p><p>“虽然他们嘴上总在说「我们都是家人，我们来自同样的阵营」，但他们每年都拿六位数薪水，而普通员工连温饱都成问题。”</p><p>&nbsp;</p><p>Sara在观看了非营利组织老板的视频后感叹，“那边的情况更恶劣。虽然双方都是在PUA员工，但非营利组织老板总会把矛头掉转回来，比如认为要求加薪就是在破坏人类福祉、慈善大业。”</p><p>而这些满载辛酸与讽刺的段子，只能成为我们在面对艰难时局下聊以自慰的调剂。</p><p>&nbsp;</p><p>Sara认为，“特别是那些被公司裁掉、或者年末没拿到奖金的员工，他们在看到这些段子之后会笑起来，借此消解愤懑情绪。生活中那些不愉快的瞬间似乎也都有所减轻。”</p><p>&nbsp;</p><p>Daniels说，最近她在机场遇到一位粉丝，对方表示“谢谢你塑造的这个角色，帮我用幽默化解了很多问题。”</p><p>&nbsp;</p><p>“说着说着她就哭了，讲述了自己在非营利组织中的艰难处境。其实对很多人来说，获得关注是坚持下去的唯一动力。请大家放心，你们的苦处有人知道、有人理解。”</p><p>&nbsp;</p><p>Daniels也很高兴自己的作品能在TikTok上帮助人们重拾勇气。</p><p>&nbsp;</p><p>“我自己当初在非营利组织工作时，也同样需要这样的调剂。现在，我应该以过来人的身份给更多同行一点支持。”</p><p>&nbsp;</p><p>参考链接：</p><p><a href=\"https://www.huffpost.com/entry/corporate-accent-erin-tiktok-trigger_l_659eeb02e4b0e696b9108f9e\">https://www.huffpost.com/entry/corporate-accent-erin-tiktok-trigger_l_659eeb02e4b0e696b9108f9e</a>\"</p><p>&nbsp;</p>",
    "publish_time": "2024-02-18 10:12:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]