[
  {
    "title": "规则大作战：企业如何走出合规迷宫",
    "url": "https://www.infoq.cn/article/k7DvizO0LcLW4TwycKeM",
    "summary": "<p></p><blockquote>本文要点：合规性是风险管理的基础。如果企业能够驾驭棘手的规则，并且以符合道德的方式行事，那么就能在竞争中脱颖而出。从“合规性优先”的方式转变到“风险优先”的思维模式，要认识到合规性不应被孤立地看待，而应该将其作为更广泛的风险管理战略的一个组成部分。“风险优先”是一种理念，重点是识别、处理和管理最高的合规性风险，并通过控制、政策和标准的操作过程对其进行优先排序。风险优先的方法能够增强组织的风险意识，巩固组织风险管理的基础，使其成为所有企业决策的一部分。如果组织能够为员工在管理合规性方面的职责上提供明确的指导，就能培养员工在组织内部进行探索和革新。</blockquote><p></p><p>&nbsp;</p><p></p><h2>引言</h2><p></p><p>合规性是现代商业运作的基础，也是其成功的组成部分。它涉及到<a href=\"https://www.techtarget.com/searchdatamanagement/definition/compliance\">遵守</a>\"法律法规要求、行业标准和合乎道德的商业实践。合规性对于组织管理风险、防止法律惩罚和声誉受损以及提供竞争优势都至关重要。在当今的商业环境中，社会责任和道德行为比以往任何时候都更加重要，合规性已经成为组织成功的关键。组织可以通过优先考虑合规性来维护其声誉并确保长期的可持续性。</p><p>&nbsp;</p><p>合规性的意义不仅仅是明确列出的义务清单，它还是有效管理风险的基础，是抵御潜在的法律风险和声誉受损的屏障。在当今的商业世界中，企业必须遵守社会责任和道德规范，遵守规则变得至关重要。如果企业能够驾驭棘手的规则，并且以符合道德的方式行事，那么就能在竞争中脱颖而出。</p><p>&nbsp;</p><p>随着业务的不断发展，企业从传统的“合规性优先”转换成了更具动态性和前瞻性的“风险优先”的思维方式，模式正在发生着变化。这种文化转移意识到，合规性虽然重要，但是不应被孤立地看待，而应该将其作为更广泛的风险管理战略的一个组成部分。这种变革不仅是理念上的调整，还是一种实践上的变更，因为组织要积极主动地识别、了解和降低风险，从而在不断变化的商业环境中增强自身的风险意识和适应能力。</p><p>&nbsp;</p><p>本文深入探讨了企业进行文化转型的重要性。这种转变包括从狭隘地重视合规性转变为更广泛、更具战略性眼光的对风险的认识。</p><p>&nbsp;</p><p>这种转变不仅仅是一种业务，而且还能培育一种文化，这种文化不仅能够满足监管的需要，同时又能使组织在充满不确定性的环境中发展壮大，从而在这种变化、不确定性和风险中确保组织的长期可持续发展。</p><p>&nbsp;</p><p>本文阐述了企业如何满足预期并进一步优化，从而开创具备韧性、创新性和持续成功的新时代。</p><p></p><h2>合规性至上</h2><p></p><p><a href=\"https://www.linkedin.com/pulse/compliance-mindset-vs-relationship-21-ways-help-calibrate-peter-rufus\">合规性优先的思维模式</a>\"将遵守法律、法规和行业标准置于决策和运营的其他考虑因素之上。<a href=\"https://www.perillon.com/blog/10-most-regulated-industries-in-the-us\">监管严格的组织</a>\"，如金融服务、交通运输和医疗保健，通常会采用这种方式，以确保履行法律和道德义务，并最大程度降低面临处罚或法律诉讼的风险。这需要积极识别并解决潜在的合规性问题，同时建立并实施流程管理和控制措施，以保持合规性。<a href=\"https://medium.com/the-seek-blog/proactive-vs-reactive-approach-to-compliance-54af31241f4d\">这种方式</a>\"的重点是遵守法规和要求，达到最低标准，以避免法律和声誉上的严重后果。在合规性优先的思维模式中，组织将风险管理视为成本中心，而不是战略机遇。鉴于如下的一个或多个原因，组织往往非常重视以合规性为导向的态势：</p><p>&nbsp;</p><p>企业和组织承担了强有力的法律和监管义务，这样能够在<a href=\"https://reciprocity.com/blog/heres-why-regulatory-compliance-is-important/\">很大程度上</a>\"避免法律和财务处罚、声誉受损和运营中断。关注合规性<a href=\"https://uprighthc.com/blog/5-key-reasons-why-your-business-needs-compliance\">有助于组织保持良好的声誉，并通过展示对道德和业务实践的责任心，与客户和股东建立信任</a>\"。<a href=\"https://www.leapxpert.com/why-is-compliance-risk-management-important/\">注重合规性的姿态</a>\"有助于组织更有效地管理、减轻和转移风险。注重合规性有助于最大限度地减少风险对组织运营和声誉的潜在负面影响。<a href=\"https://ca.indeed.com/career-advice/career-development/why-compliance-is-important\">注重合规性</a>\"的组织会努力遵守适用的规则和法规，这有助于使他们避免巨额罚款和破坏性的法律后果。此外，合规性还有助于降低风险，减少风险管理相关的成本。<a href=\"https://www.financierworldwide.com/how-to-retain-customers-trust-the-importance-of-compliance#.ZBGuIbTMLdo\">在客户和股东眼中</a>\"，注重合规性的组织更负责任、更值得信赖，这使得他们比那些不太遵守法规的组织更具优势。</p><p>&nbsp;</p><p>尽管这种以合规性为重点的方式有很多的收益，但是也带来了一些组织必须要注意的挑战。其中，包括如下的挑战：</p><p>&nbsp;</p><p>缺乏灵活性：合规性优先的思维模式会降低组织的适应性，以及适应不断变化的业务和经济环境的能力。他们必须专注于满足法律和监管的要求，这最终会使得它们<a href=\"https://www.bizagi.com/en/blog/governance-compliance/why-agility-is-the-key-to-regulatory-compliance\">丧失应对不断变化的业务环境的灵活性</a>\"。官僚主义：采用<a href=\"https://www2.deloitte.com/us/en/insights/focus/behavioral-economics/compliance-challenges-public-sector-programs.html\">合规性优先的思维模式</a>\"会导致决策过程的层层累加，从而延缓决策和运营的速度，增加成本。阻碍创新：合规性优先的思维方式可能会<a href=\"https://www.forbes.com/sites/tendayiviki/2021/10/24/the-one-thing-legal-and-compliance-hate-about-innovation-teams/?sh=4cc4c0e76bf6\">扼杀创新和创造力</a>\"，因为如果组织认为某件事可能会违反法律法规，那么他们会不太愿意承担风险或尝试新事物。视野受限：合规性优先的组织可能专注于满足法律法规的要求，而忽视了其他重要风险或机会。对客户的关注度有限：合规性优先的思维模式可能会导致对客户需求缺乏关注，因为公司可能更注重满足法律法规的要求，而不是满足客户的需求。</p><p>&nbsp;</p><p>过分强调满足合规性要求的代价是很高的，而且不利于其他重要业务目标的实现。这种专注性会导致对合规性的狭隘和僵化关注，从而导致缺乏创新和冒险精神。它还可能导致畏惧和裹足不前的文化，使员工将合规性置于道德行为或客户满意度之上。虽然基于法律和道德的原因，合规性是必不可少的，但是一味追求合规性会阻碍组织的成长和发展。</p><p>&nbsp;</p><p></p><h2>案例研究：合规性优先思维方式的代价</h2><p></p><p>在许多引起广泛关注的案例中，合规优先的思维方式导致组织付出了高昂的代价，并造成了巨大的损失。</p><p>&nbsp;</p><p><a href=\"https://www.wsj.com/articles/volkswagen-tries-to-change-workplace-culture-that-fueled-emissions-scandal-11601425486\">大众汽车</a>\"：2015年，调查人员发现大众汽车在其柴油发送机中安装了软件，以欺骗排放测试。根据他们的陈述，该公司合规性优先的文化迫使员工以牺牲道德的行为为代价来达到排放的目标。<a href=\"https://www.delta-net.com/blog/equifax-a-tale-of-caution-about-bad-information-security-and-compliance-practices/\">Equifax</a>\"：2017年，Equifax遭遇了大规模的数据泄露事件，数百万客户的个人信息外泄。该公司只注重实现其合规性目标，而不是改善其系统和网络安全，这是数据泄露背后的众多驱动因素之一。</p><p></p><h2>构建韧性</h2><p></p><p>“风险优先”是一种<a href=\"https://ganintegrity.com/blog/what-a-risk-based-approach-means/\">理念</a>\"，重点是识别、处理和管理最高的合规性风险，并通过控制、政策和标准的操作过程对其进行优先排序。这种方式有助于将资源优先分配给合规性风险更高的领域。组织可以评估每种风险的可能性和影响，制定有针对性和高效的合规性策略。组织可以通过风险优先的合规性方式保持领先的位置，确保达到最高的合规性标准，并通过处理影响最大的合规性风险来避免代价高昂的后果。风险优先的组织化思维方式的优势包括：</p><p>&nbsp;</p><p>风险优先的理念可用于识别、优先处理和解决财务收益、合规性/法律、运营和声誉方面的问题。提升韧性，更好地应对突发情况所造成的干扰，并在不造成严重后果的情况下进行恢复。通过审慎的风险管理并帮助员工跳出固有思维方式，寻找创新性的解决方案，从而能够培养创新、实验和改进的文化。与风险意识较弱的竞争者相比，通过武装自己来应对突发事件和适应不断变化的市场条件，从而能够获得竞争优势。</p><p>&nbsp;</p><p>建立风险优先的合规性文化，包括在日常工作中为员工灌输一种优先考虑风险管理和合规性的思维方式。这种主动的方式能够加强组织的风险意识，并为将风险意识作为所有组织决策的一部分奠定基础。在下面的内容中，我们将讨论帮助组织建立风险优先的合规性文化所需的步骤：</p><p>&nbsp;</p><p>企业必须确保员工理解风险管理和合规性在其工作角色中的重要性。治理、风险与合规（Governance, Risk, and Compliance，GRC）是该领域的专家。GRC必须能够准确描述和说明什么是风险，以及他们如何理解组织的合规性。企业应该为管理合规性风险和满足监管要求创建和维护明确的标准和指南。这些文档应该可以方便地供全体员工查阅，并在法规或风险发生变化时定期进行修订。这些文档再加上定期的培训，就能确保员工了解自己的责任，并能采取必要的措施降低合规性风险和遵守法规。员工应定期接受风险管理和合规性方面的指导。这种指导应该针对每位员工的特定角色和职责来开展，以便于他们能够识别、评估和降低在工作中所遇到的合规性风险。这种方式有助于确保员工具备处理风险和遵守法规的能力，从而降低产生不合规和相关风险的几率。创建一个开诚布公的沟通平台，帮助员工表达对合规性风险和违规行为的担忧。鼓励员工提出问题，并确保组织能够认真应对他们的担忧，这有助于识别和降低合规性风险，防止可能发生的商业损失。组织的领导者应该以身作则，遵循风险优先的合规性态度。他们应该激励和赞赏在工作中优先考虑风险管理和合规性而不影响交付质量的员工。领导者应该为员工树立积极的榜样，主动承担风险管理和合规性方面的责任和义务。企业必须定期审查和评估其风险管理和合规性流程，并识别需要改进的地方。鼓励员工提出改进建议，并在必要时实施变革。这种方法有助于确保风险管理和合规性流程保持有效性和时效性，降低不合规行为产生的可能性和相关的风险。表彰和庆祝风险管理和合规性方面的成功，这可以激励员工优先考虑风险管理和合规性。分享成功的案例，并将其作为范例，这可以鼓励员工效仿并保持风险管理和合规性方面的高标准。</p><p>&nbsp;</p><p>如果组织能够为员工提供关于合规性职责的明确和全面的指导，那么这可以为合规性管理打下良好的基础，从而促进员工在组织内部进行创新和改革。这种积极主动的交流方式能够为企业提供一个安全的空间，促成一种负责任的企业决策和遵守标准的文化，在面临市场竞争的条件下，这对于保持竞争力和适应性是至关重要的。此外，这还能培育一种免于互相指责的文化，从而提升员工专注度和竞争力。</p><p>&nbsp;</p><p>如果每个人都重视并勇于承担风险，在组织中就会产生主人翁精神和目标感，这有助于改善决策和提升领导效率。在充满活力的环境中，不断迎接挑战会为企业提供前进的动力，通过促进创新、鼓励尝试和犯错，并培育持续增长的文化，就能为企业的发展奠定基础。</p><p>&nbsp;</p><p>构建一种将风险管理和合规性放在首位的文化需要决心、团队合作和持续改进。在合规性方面，采取风险优先的态度可以降低风险，确保遵守法规，并保护组织的声誉。在当前瞬息万变、难以预测的环境下，组织必须首先考虑风险。通过遵循风险管理和合规性的基本原则，企业可以更好地识别和应对潜在的风险，保持合规性，并在面临质疑时取得成功。建立风险优先的文化对企业大有裨益，也是保证企业未来稳健发展的关键。</p><p>&nbsp;</p><p>原文链接：</p><p><a href=\"https://www.infoq.com/articles/risk-first-compliance/\">From Compliance-First to Risk-First: Why Companies Need a Culture Shift</a>\"</p>",
    "publish_time": "2024-01-23 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]