[
  {
    "title": "如何在 AI 浪潮中屹立不倒：来自企业的组织弹性实践",
    "url": "https://www.infoq.cn/article/XGe6XJLktBiAgIIomyev",
    "summary": "<p>这是我在 2023 年 10 月旧金山 QCon 大会上的演讲的摘要。关于生成式 AI，有很多可怕的东西。但如果我们能从一些角度来看待它的发展，将能够帮助塑造这个过程。我在 AI 实验室工作，我们一直在与私募股权公司的高管们讨论生成式 AI 的未来。我将在这里分享一些关于这些讨论的内容。</p><p></p><p></p><h3>计算机是愚蠢的</h3><p></p><p></p><p>作为一名在计算机早期时代成长起来的软件工程师，我总结出了一条在我整个编程生涯中对我很有帮助的准则：计算机是愚蠢的。它们不知道该怎么完成任务，除非你告诉它们，然后它们完全按照你所说的执行。它们就像提线木偶，背后有一个程序员，让它们发生互动。计算机在与人类互动方面也非常糟糕，这很令人沮丧，因为这就是我们想要使用计算机的目的。</p><p></p><p>大约 10 年前，对话式用户界面出现了，如 Alexa、Siri 和 Google Home。计算机开始变得越来越擅长与人类互动，但仍然有一个程序员在背后操纵——在句子结构、同义词和有限数量的响应方面进行编程。它仍然是一个木偶。你仍然必须对其进行编程。</p><p></p><p></p><h3>生成式 AI</h3><p></p><p></p><p>今年，事情发生了变化。现在，那个木偶可以自己说话了。不再有程序员在背后操纵，相反，系统自己会做出回应，与人类的互动变得更好了。它不再那么愚蠢。作为一名程序员，我发现这令人惊奇、兴奋，但又有点可怕。它无疑正在改变我们开发软件的方式。</p><p></p><p>在某种程度上，我们几乎所有的工作交流都是通过计算机来实现的。几乎我们所有的业务流程都依赖于某种形式的沟通。我们可以开始思考如何利用生成式 AI 来改进所有这些流程和沟通。然后，你可以开始了解我们在未来几年将面临的变革。我认为我们都应该感到惊讶、兴奋，同时也有点害怕。</p><p></p><p></p><h3>威胁与变革</h3><p></p><p></p><p>分析师和经济学家预测，由于生成式 AI 在整个经济中的应用，我们将看到全球生产力每年增长 3.3%。麦肯锡预测，无论这些工作所需的教育水平如何，生成式 AI 都将提高大多数工作的自动化程度。</p><p></p><p>当然，这也使未来变得更加难以预测，并引发了新的担忧。随着这些技术在各个行业的蔓延，我们正面临着巨大的变革。每个组织都将不得不努力将其融入到流程和工作流中。这可能涉及从自动化客户支持和市场调研到生成内容和分析数据的方方面面。</p><p></p><p>潜在的影响范围是巨大的，因为生成式 AI 对我们如何沟通和分享信息——所有业务操作的核心——都产生了影响。企业内部任何有沟通的地方，现在都有可能通过生成式 AI 来优化、增强甚至自动化。它将涉及从内部消息和文档到客户报告和产品界面的方方面面。没有一个部门、角色或项目会完全免受其影响。</p><p></p><p>生成式 AI 的颠覆本质可能是渐进式的，而不是大爆炸式的变革。公司的各个角落都会发生小的变化，每个变化都很温和，但随着时间的推移，它们会形成一场革命。所需的技能、所需的控制和对工作人员的影响将是复杂的，难以管理。每个行业都将面临独特的应用和挑战。</p><p></p><p>在软件行业，我们已经看到 GitHub 的 Copilot 帮助开发人员提高生产力。在西门罗，我们自己做了研究，发现生产力提高了 22%。设计师最终可能会在 AI 的帮助下根据规格制作网页和应用程序。生成式 AI 的测试和质量保证变得非常困难，因为每次运行的输出都可能有所不同。</p><p></p><p>其他行业，如金融和医疗保健，正在探索如何用生成式 AI 改善决策制定、预测结果、生成详细内容并提升客户体验。在营销等领域，生成式 AI 可以产生大量的文案、社交帖子和广告创意，在未来可能会挤掉人类的工作岗位。</p><p></p><p></p><h3>时间表</h3><p></p><p></p><p>William Gibson 说过：“未来已然来临，只是它的到来在各个领域是不均匀的。”我们肯定会在生成式 AI 中看到这一点。确切发生广泛变革的时间表我们尚不清楚，但历史可以提供一些启示——以前的通用技术，如电力、计算机和互联网，花了几十年的时间才充分发挥其潜力。正如你在描述互联网发展的图表中所看到的，核心技术往往在它们改变社会之前很早就被开发出来了。</p><p></p><p><img src=\"https://static001.geekbang.org/wechat/images/57/57662e155c4e1291fb8bafde6f6ee175.png\" /></p><p></p><p>我们很可能会在生成式 AI 上看到类似的轨迹，时间跨度为 10 年或更长（见下图）。尽管神经网络和 Transformer 的基础已经奠定多年，但应用直到 2022 年才出现爆炸式增长，DALL-E 2 和 ChatGPT 等模型展示了应用的可能性。十年后，当我们回顾 2022 年时，可能会觉得那是一个未被 AI 同化、遥远、古老的年代。</p><p></p><p><img src=\"https://static001.geekbang.org/wechat/images/ad/ad5529e611446c0cf09434fc44a55657.png\" /></p><p></p><p></p><h3>保持弹性</h3><p></p><p></p><p>作为企业领导者，面对未来如此巨大的变革，我们该如何建立组织的弹性？关键在于保持灵活性和平衡——不要太保守也不要太激进。出于恐惧而完全抵制或禁止生成式 AI 是不现实的，因为竞争对手会急切地采用它，并最终超越你。但是，为了实现“AI 优化”而仓促地重新设计每个过程也是有风险的，因为我们尚不清楚它会在哪些方面给我们带来或根本不会带来价值。我有一些想法，希望以尽可能最好的方式应对这一转变。</p><p></p><p>让员工自动化他们自己的工作——他们最了解哪些部分适合使用生成式 AI 进行自动化，哪些不适合。让他们独立决定要增强什么以及如何增强。生成式 AI 是迄今为止最民主的技术之一，至少从电子表格出现以来是这样。它使用起来并不困难。</p><p></p><p>对集成生成式 AI 保持开放的态度，而不是出于恐惧而禁用它。允许团队尝试以负责任的方式集成它。在鼓励学习的同时设置一些护栏有助于你领先一步。虽然可能存在一些安全顾虑，但重要的是，所有主要的云平台现在都有一个与之连接的生成式 AI 解决方案，与你存储的敏感信息位于同一个云中。</p><p></p><p>通过培训来建立组织的 AI 素养，例如哪些任务适合使用 AI，哪些不适合。分享有关如何有效利用 AI 的知识。在组织内部分享有关如何防止生成式 AI 产生幻觉的信息。</p><p></p><p>建立一个内部维基或知识仓库，用于收集和分享知识。考虑设立一个提示词管理员来管理最有效的提示词并调整它们以提升性能。分享提示词可以节省员工的时间，而且实质上也是在记录一些人们真正希望自动化的晦涩的业务流程。</p><p></p><p>尝试使用像 GitHub Copilot 这样的工具，我们发现它可以提高生产力，同时还可以提高开发人员的留存率和士气。我发现我们的生产力提高了 22%，这就好比你每支付 4 个开发者的费用，就会多出一个开发者。</p><p></p><p></p><h3>坚定不移</h3><p></p><p></p><p>在这趟 AI 旅途中，我们都处于不同的位置。如果你的组织已经准备好利用这个提高生产力的机会，该怎么办？</p><p></p><p>只是简单地让 AI 摄取手册内容和职位描述不足以复制大多数角色。人类在沟通、解决问题、创新和同理心方面所做的事情是无法编码的。组织应该通过观察、工作流分析和行为研究深刻来理解当前的工作流程。在 AI 实验室，我们看到客户遇到了一些问题，我们在这里提供一些建议和技巧，希望你能从我们的经验中学到一些东西。</p><p></p><p></p><h5>人类在工作中所融入的东西</h5><p></p><p></p><p>人类会在工作中融入创新、推理和同理心，而你并不总是能在工作描述中看到这些。目前的 AI 无法做到这些。通常，工作描述不足以让你真正完成工作。例如，我正在开发一家保险公司的聊天机器人，让它提供保险建议。对于一个认为自己已经怀孕的人，你该如何告诉聊天机器人何时该祝贺或同情这个人？</p><p></p><p></p><h5>通过产品化方法实现自动化</h5><p></p><p></p><p>正如之前所说的，采用大爆炸的方式实现自动化是危险的。下图展示了实现工作自动化的产品化方法。你要做的第一件事就是从工人那里了解他们在做什么，以及自动化有什么意义。然后构建工具，并让团队使用这些工具。朝着自动化的方向小步迈进。</p><p></p><p><img src=\"https://static001.geekbang.org/wechat/images/d3/d35ddbfbff2c7bc73ecf6435b0409d49.png\" /></p><p></p><p>需要注意的是，生成式 AI 很可能会影响就业市场，但它不会消除所有的岗位，更为可能的是它擅长某些特定任务，而其他任务则需要人类参与，因为人类具有更为细致的推理能力和同理心。或者，有些例行任务是 ChatGPT 永远做不了的。我曾与一位法律助理讨论过生成式 AI 对他们工作的影响，他们说生成式 AI 可能永远无法消除他们所做的最乏味的事情——复印文件。</p><p></p><p></p><h5>护栏</h5><p></p><p></p><p>与我们使用的其他工具一样，我们需要了解有哪些限制，并设置护栏。避免 AI 做出冒犯性的事情的最好方法就是尽量远离可能令人反感的事情。不要要求它变得有趣，因为这会引起反感。只需要求它尽可能简洁地回答问题即可。大型平台正在做一些微调，确保其生成式 AI 工具保持道德。一种做法是在每次有人向你的生成式 AI 提出请求时在前面加一个意图过滤器。如果不合适，你可以引导他们避开这个问题。</p><p></p><p></p><h5>谨防奇异谷现象</h5><p></p><p></p><p>奇异谷的概念源于动画和机器人技术。如果你有一个人形角色，随着它变得越来越像人类，在某种程度上变得更有相关性，然后突然，它反转了，变得非常令人毛骨悚然。对于那些希望更积极地利用生成式 AI 的公司来说，避开陷阱是至关重要的。在使用聊天机器人时类似的情况总有可能发生。要小心意想不到的负面影响，比如当 AI 交互不够人性化时，可能会导致客户不满。通过使用集体代词，让聊天机器人代表公司，可以避免“奇异谷”效应。</p><p></p><p></p><h3>结论</h3><p></p><p></p><p>生成式 AI 将改变一切，不过，这需要花费数年的时间。我们应该做好准备，确保所有员工都掌握了 AI 知识。在自动化工作流程时，我们应确保考虑到人的因素，确保人们能够专注于他们所擅长的工作。通过有意识、以人为本的规划，我们可以建立起组织弹性，以应对即将发生的变革，并蓬勃发展。生成式 AI 不会在一夜之间让世界末日降临或淘汰人类，但它可能会逐渐式且实质地改变公司内的工作方式。</p><p></p><p>查看英文原文：</p><p><a href=\"https://www.infoq.com/articles/ai-organizational-resilience/\">https://www.infoq.com/articles/ai-organizational-resilience/</a>\"</p>",
    "publish_time": "2024-02-16 08:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]