[
  {
    "title": "大厂年终奖疯狂不再？打工人集体怀念过去：想念那个靠年终奖一夜暴富的时代",
    "url": "https://www.infoq.cn/article/NuJUiRhgkkNPDMuVE1qj",
    "summary": "<p></p><blockquote>职场人最大的期待莫过于“揣着年终奖回家过大年”。</blockquote><p></p><p></p><h2>今年的年终奖“打折”了？</h2><p></p><p>&nbsp;</p><p>岁末年初，对职场人来说最关心的除了回家的车票，还有盼了一年的年终奖。但如今不少企业不仅延后了年终奖发放时间，连金额也开始“打折”了。</p><p>&nbsp;</p><p>前程无忧日前发布的《2023职场年终奖调查》显示，78.6%的受访者明确其所在公司会发放年终奖，但是超过三分之一的人(33.6%)表示年终奖要在节后才能拿到。对于这部分人来说，如果在节后跳槽，还有彻底拿不到年终奖的可能。另有16.5%的受访者明确表示年终奖被“跳票”。</p><p>&nbsp;</p><p>根据智联招聘日前发布的《2023年白领年终奖调研报告》，从发放数额来看，2023年全国白领年终奖均值为6950元，比上年的8428元减少了1478元。从城市维度来看，2023年北京白领年终奖均值为10298元，领衔全国主要城市。此外，上海、深圳、苏州、杭州的白领年终奖均值都在9000元以上。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/93/939c255ba653f5692687c0b58184b89d.png\" /></p><p></p><p>从公开消息来看，近两年不少大厂选择在次年三四月份发放年终奖，比如阿里、字节跳动、百度、美团等。京东OS序列（基层员工）年终奖农历年前（2月7日）发放，MPT序列（M是指管理，P是指项目经理，T是指产品和技术）员工年后发放。能在年前发年终奖的大厂堪比“一股清流”，其中包括腾讯、快手、B站、携程等。</p><p>&nbsp;</p><p>金额方面，今年不少大厂的年终奖也在“缩水”。</p><p>&nbsp;</p><p>1月31日，有媒体报道，腾讯今年年终奖绩效评定已经出结果，最高的可达5个月月薪+。腾讯离职员工表示，腾讯现在都是三档绩效：Outstanding（突出）、Good（良好）、Underperform（欠佳），具体几个月年终奖看部门，部门之间也是天差地别。其中三档绩效分别对应：5个月月薪+、中间（绝大多数人4个月月薪，可能略微上浮）、最低档1-2月月薪。而根据往年情况，腾讯普通部门的员工一般能够获得3-6个月的薪资作为年终奖，一些业绩卓越的部门，如游戏部门，则有可能获得高达24-48个月工资的年终奖。</p><p>&nbsp;</p><p>字节跳动在近期发布的“薪酬调整方案”中提到，字节跳动产品线薪酬由18薪调整为15薪，总包不变。同时，年终激励方式改变，将原来年终奖月数大于3的薪酬方案统一调整为3个月。</p><p>&nbsp;</p><p>对此，有网友评论道：“互联网行业业绩增长曲线逐渐由陡峭走向平缓，巨额年终奖也从互联网大厂消失了。以前那个靠转年终奖两年在深圳买一套房的时代已经过去了。”不少网友开始缅怀过去，“想念那个靠年终奖一夜暴富的时代”。</p><p></p><h2>大厂的年终奖曾有多疯狂？</h2><p></p><p>&nbsp;</p><p>年终奖不仅代表了公司的慷慨和认可，也是对员工辛勤付出一年的回馈。曾经，互联网大厂的年终奖总是令人激动不已，在岁末年初时掀起一波又一波小高潮。下面就来盘点下，那些年，让人疯狂的大厂年终奖。（注：以下数据来源于网络，若有不实之处，欢迎大家在评论区及时指正）</p><p></p><h4>100个月工资，相当于8年不用上班？</h4><p></p><p>&nbsp;</p><p>2018年是抖音疯狂增长的一年，当年年末，抖音为早期员工发放了20月薪资的年终奖金。据传给时任抖音负责人任利锋发了100个月薪水。以一年12薪计算，一个年终奖相当于8年多的工资。</p><p></p><h4>50个月工资，年终奖能拿百万元</h4><p></p><p>&nbsp;</p><p>百度的年终奖主要包括奖金、加薪、股权激励，是根据年终评分而定，打分区间是1-5，1分最高。一般员工都可以拿到3分，一般都有2-4个月工资。2015年，百度董事长兼CEO李彦宏在那年公司年会上宣称，“今年拿出了‘史上最大额度的奖金’奖励成绩突出的员工”，有人年终奖甚至拿到了50个月的工资。有知情者推算，当时百度有些员工能领到的年终奖或能达百万元。</p><p></p><h4>全年表现突出可拿28个月工资</h4><p></p><p>&nbsp;</p><p>据脉脉平台上一位认证为快手员工的用户爆料，其2019年年终奖拿到28个月工资。有快手员工透露，年终绩效为A的员工，能够拿到8个月工资作为年终奖。而全年表现突出的员工，最高更是能拿到28个月的工资。</p><p>&nbsp;</p><p>有网友表示，自己从快手离职后收到还2.5个月的年终奖，到手金额比现在公司给的还要多一倍，直呼后悔离开快手。</p><p></p><h4>有钱有股票</h4><p></p><p>&nbsp;</p><p>阿里的年终考核制度是根据公司KPI和个人KPI综合打分来确定。据说年终绩效系数在3.75以上的（占30%），有至少6个月的年终奖，如果部门整体效益好，可以拿10个月+的年终，还有600股左右的股票。2020年，阿里的年终奖包括：年底双薪+大红包+年终大奖金+股权奖励。此外，福利还包括员工买房子能够得到30w无息贷款等。根据阿里员工2020年的爆料，自己职级为P6，年终奖有34万多点，涨薪4000，以及520股票，当时市值大概在75万元。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/79/79ee528dd4fa7ecae6430daa7769cf66.png\" /></p><p></p><p>2020年，腾讯公司为做出特别贡献的员工授予了一笔同心同行奖，奖品为100股腾讯控股股票激励，一年后可以变现。按照腾讯当日每股735港币的股价，相当于61218元人民币。</p><p>&nbsp;</p><p>华为也经常给员工发股票。2020年，华为持续实施股票分红，预计每股1.86元。数据表明，2018年的时候华为总股数是222亿，若以每股1.86元的价格来算，这次的分红至少超过400亿。</p><p></p><h4>游戏部门造就“年终奖神话”</h4><p></p><p>&nbsp;</p><p>游戏部门作为不少大厂的核心利润部门，曾造就了一个又一个“年终奖神话”。</p><p>&nbsp;</p><p>2012年，腾讯游戏部门英雄联盟项目组的部分成员拿到60个月工资的年终奖。据第一财经2017年7月报道，《王者荣耀》项目组当年人均分红140万，最低分到60万，最多分到290万。同时，外界传出“王者荣耀之父”的腾讯副总裁姚晓光，当年的年终绩效奖金是2亿元。</p><p>&nbsp;</p><p>2020、2021年，国内游戏产业发展突飞猛进，游戏公司的年终奖自然也水涨船高，各种天价年终奖的消息不绝于耳。2021年1月，一则关于《原神》开发商、游戏公司米哈游年终奖高达108个月薪的消息传遍互联网。传言称，现在米哈游员工共有4500人，按照底薪8000元计算，108薪就是年终奖864000元，4500名员工共计发放38.88亿元。虽然该消息随后被辟谣，但在前几年，不少游戏大厂都曾发过巨额年终奖。</p><p>&nbsp;</p><p>2021年，一位认证信息为前字节跳动员工的用户在社交平台上发帖称，“听来的各大厂今年的年终奖，有点卷起来的意思了”。</p><p>&nbsp;</p><p>其表示，网易今年《哈利波特·魔法觉醒》项目组年终奖直接全员安排到了888888。他们第二季度在线游戏净收入145亿，第三季度推出的]《哈利波特·魔法觉醒》成了今年的大热门，壕得理直气壮。小米今年第三季度财报营收780.6亿，超出去年同期不少，而他们的智能工厂二期今年7月也正式动工开建，让小米智能工厂技术部门年终奖直接发到8个月工资。腾讯《英雄联盟》项目组，感觉有点和去年的《王者荣耀》卷起来的意思，年终奖直接每人120万现金，再加上他们的阳光普照奖和动不动发股票的操作……</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/98/9899e35b0a101cf0ece13f1eaaaa5d6a.png\" /></p><p></p><p>据时代周报报道，一位接近网易游戏的相关人士证实网传哈利波特项目组年终奖数额属实。而腾讯《英雄联盟》项目组员工的年终奖虽未达到120万，但也会发“双位数分量的月薪，外加公司股票和部门额外奖金。”</p><p></p><h2>结束语</h2><p></p><p>&nbsp;</p><p>年终奖的多与少受到多种因素影响，包括公司的盈利状况、员工的工作表现、公司的整体经济状况以及行业竞争等。</p><p>&nbsp;</p><p>对于年终奖，职场人既有期待，也有担忧。期待一年的辛苦付出可以收获好的结果，也有人会担心离职后是否还能拿到年终奖。最高人民法院2022年发布的指导案例183号提到，针对离职者的年终奖发放，应当结合劳动者离职的原因、时间、工作表现和对单位的贡献程度等多方面因素综合考量。</p><p>&nbsp;</p><p>从司法实践上看，劳动者在职期间履行了职责，劳动争议仲裁机构或法院会支持此类离职劳动者，按照在岗时间得到一定比例“年终奖”。例如，在广东某空调集团担任高管的魏先生于2010年7月辞职。2011年，魏先生将原单位告上法庭，索要2010年的145万元“年终奖”。受理法院认为，根据双方劳动合同，员工中途离职也该拿到部分“年终奖”，一审判令企业支付“年终奖”70万元。</p>",
    "publish_time": "2024-02-18 09:55:11",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "大厂互联网黑话卷到了国外，网友：过年了，请说点人话吧",
    "url": "https://www.infoq.cn/article/tZQo3Ui7om3TFueQvuZF",
    "summary": "<p>前几年，张一鸣在字节跳动年会上，给大家摘录了一段文字，讲的全是互联网\"黑话\"，满屏幕高级词汇叠加在一起，听起来却让人感觉不知所云。</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/9b/9bfe6592462bf9c36f2bce8c61502641.jpeg\" /></p><p></p><p>一时间，互联网“黑话”遭遇“群嘲”。甚至有人还弄了个互联网八股文，具体内容如下：</p><p></p><p><img src=\"https://static001.geekbang.org/infoq/f2/f21b65408179ecef3ac751ae0adf3e2b.jpeg\" /></p><p>但最近，这些在国内互联网大厂间盛行的“黑话”居然飘洋过海来到了海外，同样遭到了国外网友的吐槽。如果大家最近玩过TikTok，估计会对这种刺耳的声音产生深刻印象。</p><p>&nbsp;</p><p>由喜剧演员Lisa Beasley创作的“大厂艾琳”（Corporate Erin）是个标志性的符号，讽刺了技术大厂那种以积极话术给员工洗脑的不人道行为。在TikTok视频里，大厂艾琳可谓深得个中精髓，特别擅长用冗长且毫无意义的“黑话”轰炸用户脆弱的神经。</p><p>&nbsp;</p><p>比如作为“物流经理”，大厂欧琳会面带微笑地把一个个残忍的消息甩到你面前，丝毫不为内容所动。</p><p>&nbsp;</p><p>在人气最高的视频里，大厂艾琳解释了她今天为什么要打电话给你开会，然后用“可交付成果”和“上线”之类的废话不断耗费你的宝贵时间。</p><p>&nbsp;</p><p>而面对员工失去家人的噩耗，艾琳也不会表现出一丁点同情。她只会提醒你，根据丧亲政策，直系亲属离世只能批一天假。</p><p>&nbsp;</p><p>Beasley从2021年起就开始制作大厂艾琳系列视频，其中表现的正是她本人作为自由职业者的真实经历。</p><p>&nbsp;</p><p>如今的Beasley只想以大厂艾琳的身份接受采访，并表示这样“会保留一层被动的交互缓冲，也让我能继续把握住这种「不说人话」的精髓。”</p><p></p><h2>为什么“大厂黑话”这么招人烦？</h2><p></p><p></p><p>Beasley的视频之所以能赢得数百万次观看，显然是因为触动了大量观众的共鸣。用户评论精准地总结道，“什么叫大厂黑话？就是说了一大堆企业术语，但又没有任何实质性内容。”而当一个人频繁使用或者听取“大厂黑话”，自己就会不自觉成为黑话的又一个传播节点。</p><p>&nbsp;</p><p>宾夕法尼亚州的技术从业者Sara就表示，她是从大厂艾琳视频中意识到自己被黑话洗脑了。Sara强调，公司里“根本就不存在自主表达的空间”。</p><p>&nbsp;</p><p>“我觉得大厂艾琳视频甚至没多少夸张的成分。现在企业里就是这样，我每天参加的会议就是这样。”</p><p>&nbsp;</p><p>乔治敦大学语言学教授Deborah Tannen也认为，大厂艾琳确实揭露了一些血淋淋的现实。Beasley之所以选择这种极快的表达节奏，就是因为“企业既不想让人听懂，也不想让人理解，只想让人懵圈。”</p><p>&nbsp;</p><p>“而且姿态和表情也是其中的一部分：身体前倾本来是种真诚的姿态，但却被配合上了毫无诚意的基本立场。”</p><p>&nbsp;</p><p>而且这些搞笑视频由于太过真实，仔细想想好像并不该为之发笑。</p><p>&nbsp;</p><p>有专家认为，这些视频体现出了所谓“道德剥离”，也就是“我们经常无意识地参与到某种集体行为当中，并因此确信自己造成的伤害完全合理。”与之类似的还有各种造词行为，比如把解雇或者裁员等完全负面的消息说成是“波动”或者“重组”。</p><p>&nbsp;</p><p>曾经的营销从业者Erin Kenney甚至表示在观看大厂艾琳视频后引发了创作性反应。“我已经离职一年多了，但经常还是把突然吓醒，以为自己错过了消息提醒。”</p><p>&nbsp;</p><p>对Kenney来说，大厂艾琳就是前疫情时代最流行的企业文化代表——不惜一切证明自己对工作的绝对忠诚。当时，X一代和千禧一代甚至以疯狂工作为荣。</p><p>&nbsp;</p><p>“在整个20多岁，我都在努力成为「大厂艾琳」那样的角色。我想快速晋升，愿意为此付出一切——哪怕放弃一个个重要时刻、通宵达旦、做各种自己根本不想做的工作。”</p><p></p><h2>利用个人发展焦虑，以企业文化为名作恶</h2><p></p><p></p><p>大厂艾琳这样的习气确实能帮助新人融入企业、加快晋升，但这一切都是有代价的。</p><p>&nbsp;</p><p>Beasley坦言，刚开始她也不太熟悉像“复盘”这样的黑话。但说人话在企业里不太行得通，甚至可能成为融入团队的阻碍。“如果不能尽快熟悉各种潜规则和黑话，你的前途很可能堪忧。”</p><p>&nbsp;</p><p>所以掌握大厂黑话，似乎成了需要认真对待的生存前提。</p><p>&nbsp;</p><p>于是Sara决定采用语气更深沉、表达更单调的搭配，抛开一切人类的情感，让自己听起来更自信。</p><p>&nbsp;</p><p>“作为女性，要想在这个男性主导的世界里闯出点名堂，我必须从根本上改变自己的表达风格——让自己听起来更像男性。这不好，但只有这样才能让其他人认真听我讲话。”</p><p>&nbsp;</p><p>但这种策略也有可能适得其反。曾因创立血液检测初创公司Theranos而名气大噪、但后被证明造假而名誉扫地的Elizabeth Holmes，在工作期间就特别喜欢以低沉的男中音说话。而根据《纽约时报》的跟踪报道，Holmes日常的语音“完全正常，没有任何低沉沙哑的倾向”。</p><p></p><h2>在社交网站上用幽默解构一切不公</h2><p></p><p></p><p>如果大家经常泡在TikTok上，可能还见过大厂艾琳的另一个版本——非营利组织老板。这个角色由演员Nicole Daniels创作，表现的就是她过往在非营利组织工作时见过、接触过的人和事。</p><p>&nbsp;</p><p>Daniels总结道，“她总是穿着同样的衣服，嘴里从来不停，只是吃的东西不一样。她总是趴在电脑旁边，连吃饭时也是……她还喜欢用肢体语言表达「我觉得不行」。”</p><p>&nbsp;</p><p>跟大厂艾琳不同，非营利组织老板这个角色对美国企业中的不人道问题披露得更加直白，总在以“我跟你是一边的”态度对员工施加折磨。</p><p>&nbsp;</p><p>“虽然他们嘴上总在说「我们都是家人，我们来自同样的阵营」，但他们每年都拿六位数薪水，而普通员工连温饱都成问题。”</p><p>&nbsp;</p><p>Sara在观看了非营利组织老板的视频后感叹，“那边的情况更恶劣。虽然双方都是在PUA员工，但非营利组织老板总会把矛头掉转回来，比如认为要求加薪就是在破坏人类福祉、慈善大业。”</p><p>而这些满载辛酸与讽刺的段子，只能成为我们在面对艰难时局下聊以自慰的调剂。</p><p>&nbsp;</p><p>Sara认为，“特别是那些被公司裁掉、或者年末没拿到奖金的员工，他们在看到这些段子之后会笑起来，借此消解愤懑情绪。生活中那些不愉快的瞬间似乎也都有所减轻。”</p><p>&nbsp;</p><p>Daniels说，最近她在机场遇到一位粉丝，对方表示“谢谢你塑造的这个角色，帮我用幽默化解了很多问题。”</p><p>&nbsp;</p><p>“说着说着她就哭了，讲述了自己在非营利组织中的艰难处境。其实对很多人来说，获得关注是坚持下去的唯一动力。请大家放心，你们的苦处有人知道、有人理解。”</p><p>&nbsp;</p><p>Daniels也很高兴自己的作品能在TikTok上帮助人们重拾勇气。</p><p>&nbsp;</p><p>“我自己当初在非营利组织工作时，也同样需要这样的调剂。现在，我应该以过来人的身份给更多同行一点支持。”</p><p>&nbsp;</p><p>参考链接：</p><p><a href=\"https://www.huffpost.com/entry/corporate-accent-erin-tiktok-trigger_l_659eeb02e4b0e696b9108f9e\">https://www.huffpost.com/entry/corporate-accent-erin-tiktok-trigger_l_659eeb02e4b0e696b9108f9e</a>\"</p><p>&nbsp;</p>",
    "publish_time": "2024-02-18 10:12:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  },
  {
    "title": "大模型时代下的技术管理“新思维”",
    "url": "https://www.infoq.cn/article/Z4GAgXGi6gYdWMrQk8ro",
    "summary": "<p>在大模型时代，技术管理面临着新的挑战和机遇。为了更好地应对这些挑战，管理者需要转变思维方式，重新审视技术管理的本质和目标。那么，大模型时代下的技术管理方式、方法发生了哪些变化？如何更新和改进技术管理的思维方式与策略？如何提升技术管理的效率和效果？</p><p>&nbsp;</p><p>近日，InfoQ《极客有约》特邀某股份制银行数字化转型技术专家王辉，对话飞书项目解决方案负责人丁鹏，云知声董事长、CTO 梁家恩，Thoughtworks 中国区总经理肖然，一起探讨大模型时代下的技术管理新思维，共同迎接未来的挑战和机遇。</p><p>&nbsp;</p><p>以下为访谈实录，完整视频参看：<a href=\"https://www.infoq.cn/video/HJOC4qt3mTCtsicJ4msb\">https://www.infoq.cn/video/HJOC4qt3mTCtsicJ4msb</a>\"</p><p>&nbsp;</p><p></p><blockquote>王辉：InfoQ年度技术盘点与展望系列直播的第三期节目即将开始，我是今晚的主持人王辉，目前在一家股份制银行负责推动数据化和数字化转型。随着大数据和人工智能技术的迅速发展，大模型已成为许多领域中不可或缺的工具。在这个大模型时代，技术管理面临着崭新的挑战和机遇。为了更好地迎接这些挑战，我们必须转变思维方式，重新审视技术管理的本质和目标。在本期直播中，我们将共同探讨《大模型时代下的技术管理“新思维”》，助力我们共同迎接未来的挑战和机遇。本期的分享嘉宾分别是飞书前端项目负责人李梦泽， 云知声董事长、CTO梁家恩和Thoughtworks中国区总经理肖然。下面请三位嘉宾做下自我介绍。</blockquote><p></p><p>&nbsp;</p><p>肖然：大家好，我是Thoughtworks的肖然。很高兴今天能够和大家分享一些关于技术管理的见解。我是一名技术管理者，在过去的十多年里，我不仅负责管理Thoughtworks的技术团队，还在协助许多研发型组织进行敏捷和数字化转型。从某种意义上说，我也是一个在这个领域不断学习的人。我希望通过今天的交流，能够获得更多的启发，同时也能够为大家呈现一些面向未来的思考。当然，由于时代变化迅速，我不敢说这些是绝对的洞见，但我希望这些想法能够帮助大家更好地应对未来的挑战。</p><p>&nbsp;</p><p>李梦泽：我是飞书前端负责人李梦泽。我们的飞书项目实际上是技术管理中沉淀出来的一套SOP，是一种非常实用的技术管理工具。今天很高兴在这个场合能够与各位老师一起交流，探讨大数据和大模型时代下的技术管理。我相信这次交流会为飞书项目带来许多新的思路，注入新的活力。非常期待与大家共同探讨，在这个思想碰撞的过程中汲取新的灵感。</p><p>&nbsp;</p><p>梁家恩：大家好，我是梁家恩，来自云知声。作为一家人工智能领域的独角兽企业，我们专注于语音、语言和知识图谱的研究和开发。在2023年上半年，我们发布了山海大模型，成为大模型技术的提供商，为整个行业提供基于大模型的人工智能解决方案。作为公司的董事长和CTO，今天非常高兴能在这里与大家交流。我期待在这个场合与大家分享经验、进行思想碰撞。</p><p></p><h2>大模型时代，技术管理的方式也变了？</h2><p></p><p>&nbsp;</p><p></p><blockquote>王辉：在过去的一年里，大模型变得非常热门，正在悄悄地改变着我们的生活。对于几位老师而言，在大模型时代，您认为技术管理的方式和方法与大模型出现之前有何不同？我们又应该如何适应这些变化呢？&nbsp;</blockquote><p></p><p>&nbsp;</p><p>肖然：我个人和团队的工作范围涵盖了从需求分析、产品设计、开发测试，一直到最后的运维等各个专业角色。GPT技术可以应用于端到端软件交付的各个阶段，这使得这样的智能体能够参与并贡献于整个软件开发生命周期。从一个管理者的角度来看，我感觉这与以往有很大的不同。我曾经是一名开发人员，是从事研发工作的，当我转向管理职位时，我感到自己经历了从工程师到管理者的转变。这些过往的经验实际上是我在管理工作中能够引领团队从不成熟走向成熟的基础，这其中也包含了团队赋能和人才培养。</p><p>&nbsp;</p><p>然而，去年的GPT给我带来了一种不同的感觉，就是这些过往的研发经验在未来的某个时间点似乎会变得无效。这也意味着，过去的经验可能无法在研发工程过程中帮助团队成长。因此，从去年年底一直到现在，对这项新技术我一直保持一份敬畏心态。此外，我也不断提醒自己要保持开放的心态，因为昨天的经验可能已经无法帮助今天的工程师们。未来，我们可能会发现新的方向和模式，这些新的方向和模式并不是我们过去的从业经验的延续。</p><p>&nbsp;</p><p>如果问我最大的挑战或改变是什么，我觉得就是我们作为研发管理者现在需要承认过去的经验不一定总是正确的，我们需要更加开放地接受由于生成式人工智能技术带来的整个软件研发领域的变化，包括方法论、体系结构以及具体的实践方法都将与过去不同。</p><p>&nbsp;</p><p>李梦泽：我想从另一个角度回答这个问题。首先，我认为大模型的出现在一定程度上提高了我们的工作效率，这一点是显而易见的。其次，我想谈谈关于安全性审视的问题。在提高效率方面，大模型对我们的产研工具产生了积极的影响。特别是在代码工具方面，大模型的支持下使得我们的开发效率得到了显著提升。通过利用大模型，我们能够将许多任务委托给外包，从而节省时间，同时保持对最终结果的掌控。</p><p>&nbsp;</p><p>关于项目管理工具，我想分享一下我们内部遇到的实际场景。在以前，我需要通过工具和我自己的人工理解来获取有关下周截止产品、迭代产品、未完成需求和存在的 bug 信息，以及是否存在发布风险。然而，有了大模型之后，比如我们正在使用 AI 智能助手和飞书项目进行打通，我只需清楚地描述我的需求给智能助手，它就能够帮我在飞书项目中呈现相关数据，大大提高了我的管理效率。这是大模型对项目管理的一项有力支持。总体而言，大模型的出现使得技术管理变得更加便利且效率大幅提升。</p><p>&nbsp;</p><p>第二点我想提到的是关于安全性审视。大模型实际上是一把双刃剑，因此大型企业相对于大模型的态度仍然是持谨慎自研的态度。尽管大模型给业务带来了正向收益，但公有模型的隐私和安全性相对较差，因此我们内部仍然会尝试自研或者自己部署开源模型。尽管这与公有模型相比有较大的提升空间，但逐步推进总是会有回报的。这是我对于这个问题的一些看法。</p><p>&nbsp;</p><p>梁家恩：我想从两个方面谈一下。首先，作为大模型的技术支持方之一，我们拥有在人工智能领域超过20年的从业研究和从业经验。大模型的出现让我们感到非常激动，作为在这个行业已经工作了20 多年的从业者，我觉得大模型带来的技术突破令人兴奋。我相信大模型将成为我们业务的核心要素，甚至可能成为我们业务的基座。因此，在思维上我们必须先认知到这一点，这不仅仅是一个小技术突破，而是一个未来重要的业务方向。未来，我们将迎来许多基于大模型的AI原生应用。尽管我们不清楚具体的发展方向，就像10年前我们不知道移动互联网应用将走向何方一样，但这必定会实现。无论是否从事人工智能领域的工作，我们都应该了解大模型的原理、特点、优势和局限性。这对于我们能够更好地结合业务是一个重要的认知点，是思维上的一个重要进步。</p><p>&nbsp;</p><p>其次，为了将这项技术应用到业务中，从管理角度来看，我们可能需要调整人才梯队。正如之前提到的，很多过去需要大量人工操作的工作，现在通过工具能够更有效地完成，因此我们在人才梯队的建设上需要适应新的业务流程。我们需要进行相应的人才结构调整，特别是在AI架构师和AI产品经理方面需要加速团队的培养，否则可能无法把握住这个新时代的应用。我们当时在设计移动应用架构时，与过去在PC领域的实践有所不同。从业务角度考虑，我们的架构师着重于如何最大化地发挥AI的能力，找到适用的场景。尽管AI这些大模型看起来很强大，但在实际应用中，我们会发现存在许多问题。在这个过程中，我们需要找到平衡点，发挥其优势，避免其短板。因此，这部分的工作需要架构师和专业的产品经理来负责。</p><p>&nbsp;</p><p>总之，如果能够抓住这两点，相信我们可以跟上时代的潮流，应对未来的变化。</p><p>&nbsp;</p><p></p><blockquote>王辉：大家在日常的工作管理中应该都使用到了大模型。那么，在面对如此多种大模型技术的情况下，如何评估和选择适合企业的大模型技术，以及如何有效地将其应用到日常业务中？</blockquote><p></p><p>&nbsp;</p><p>肖然：作为一家咨询公司，去年下半年以来，我们就在帮助许多企业采用生成式人工智能技术。目前，我们观察到几个值得关注的趋势。首先，企业对信息安全的顾虑相当大，特别是在使用模型时，尤其是一些公有模型通过API调用的情况。企业都认识到必须锻炼自身的能力，但在真正结合到业务场景时，很多企业仍期待未来能够私有化部署模型。我们认为这一趋势在未来两三年将持续存在，因为对企业数据安全和隐私数据保护的敏感性不断增强。</p><p>&nbsp;</p><p>第二个趋势是，由于大模型本身的微调和重训练在成本和工程实践方面逐渐变得更为成熟，企业逐渐开始接受领域模型的概念。例如，在企业的客服、财务和战略分析等领域，基于基础模型的微调和重新训练已经成为实际的工程实践。这种趋势在一些有实力的大厂和研发组织中逐渐显现，我们认为它可能会持续存在。</p><p>&nbsp;</p><p>最后，我们发现企业在应对生成式人工智能技术和大模型带来的未来机遇和挑战时，主要建议是将其视为未来数字化平台的一部分，而不是孤立的技术。这带来一个重要的问题，即如何在企业和研发组织内部有效地进行工程化。工程化是使技术规模化使用的关键，它能够在研发流程和未来数字化产品中发挥作用。前两个趋势是我们观察到的，而最后一个实际上是我们认为在2024年有条件的企业都应该思考的问题，即如何有效地将人工智能大模型技术的能力进行工程化，以便在企业中被更多的团队所使用。</p><p>&nbsp;</p><p>李梦泽：刚才肖总在概念和细节上都进行了全面的介绍，所以我将重点谈一下我在日常工作中应用大模型的一些业务能力。最常见的场景之一是在面试过程中，飞书可以根据我的需求利用AI分析简历，在面试前向我推荐相关的面试题，最后提供一份全面的总结。这个系统可以从多个方面、多个角度帮助我们评估候选人是否符合招聘标准，同时也帮助我们节省时间，提高效率。</p><p>&nbsp;</p><p>梁家恩：关于大模型，我认为很多人可能仍将其视为一个提高效率的工具，它在效率方面确实非常强大。然而，作为生成式人工智能，它的生成性质可以启发我们更多的想象空间。如果能更好地挖掘这一点，将对设计和其他新领域产生帮助。大模型在数学方面可能相对较差，但仍然可以被用于探索数学问题，如陶哲轩等数学家所示，他们利用大模型探索数学问题，虽然数学不是大模型的专长，但这可能需要打开更多的新思路。</p><p>&nbsp;</p><p>在大模型的选型上，经过一年的发展，至少在中文领域，中国的开源大模型在中文能力上与国外基本持平，尽管与GPT-4存在差距，但与GPT-3.5相当。对于企业来说，如果想使用大模型，可以从这些开源项目开始，成本相对较低，不论是由大公司发布的开源大模型，还是一些创业公司，如智谱、百川等，它们都在致力于大模型的应用。</p><p>&nbsp;</p><p>对于技术实力强大的公司，可能会自己研发自家的大模型，强调如何将其应用于专业的行业场景。我们认为，对于一些相对基础且可由本科毕业生完成的工作，通用大模型可能已经足够满足需求。这是因为这些工作不涉及到特定领域的深度专业知识，通用大模型的泛化能力足以处理。然而，对于那些需要更深层次、更专业知识的工作，可能需要硕士或博士级别的人才来有效处理。在这种情况下，专业大模型可能更适合，因为它可以结合特定领域的专业知识，提供更为精细和定制的解决方案。</p><p>&nbsp;</p><p>在我们的应用中，有两个主要板块，一个是个人与机器的交互，这是我们主要的业务之一，我们将使用大模型增强其交互体验。对话系统过去经不起人的十轮“蹂躏”，但现在我们可以持续对话，这是一种显著的进步，但仍然是一个相对基本的聊天和完成特定任务的功能。另一个探索较深的方向是与医疗行业的合作。医疗行业需要高度专业化的知识，我们将结合行业知识来减少在这些领域的“幻觉”错误，这在严肃场景中是非常致命的。解决这一层面的问题可能需要与在行业内有经验的公司合作，这可能会提供更具针对性的帮助，通用大模型可能无法达到这种定位的。</p><p>&nbsp;</p><p>至于评估，根据业务进行数据评估可能是一个可行的方式，成本是所有解决工程问题时都必须考虑的问题，因为部署成本确实很大。在特定应用场景下，我们可能需要优化模型，减少与应用无关的参数，从而提高效率。</p><p></p><h2>如何更新和改进技术管理的思维方式和策略？&nbsp;</h2><p></p><p></p><p></p><blockquote>王辉：在新技术层出不穷的当下，技术管理者应该具备哪些核心能力？如何培养和提升这些能力？如何更新和改进技术管理的思维方式和策略？&nbsp;</blockquote><p></p><p>&nbsp;</p><p>肖然：开篇时我提到了一个观点，即底层思维发生了重大变化。多年来，我们一直在业务领导面前强调要从过去的经验管理转向相信数据，让数据来说话。虽然业务领导现在也接受了这一观点，认识到数据的重要性，但在技术管理者这一侧，我们很多时候还是会拿过去的经验和某个框架相比较。通过过去一年的实践，我们已经意识到生成式人工智能技术以及未来人工智能技术在软件工程中的应用将打破这一格局。因此，在底层逻辑和本质上，我们将不再是一代具有丰富经验的人，未来几代人可能才是真正具有实际经验的人。如果我们想要领导他们或者为他们指路，首先我们必须拥有开放的心态，愿意与大家一起开放性地探索。</p><p>&nbsp;</p><p>我们知道研发产业是一个偏学习型的产业。在工作过程中，团队和个体的培养与业务的核心本质息息相关。我们团队每个成员的成长对于产品的交付非常关键。我们预计人工智能技术在未来将取得重大突破。在这个时候，我们更有必要将团队和个体的成长纳入技术管理的核心目标。尽管管理者可能受到实际管理投入产出、人效等方面的压力，但我们更需要关注的是团队是否有成长，团队成员是否感受到在团队中有学习的动力，并且是否在一个持续学习的环境中。我认为这是在变化中保持不变的因素，需要我们重新审视。</p><p>&nbsp;</p><p>李梦泽：我认为在技术管理者个人素养方面，需要特别强调两个关键素质：对技术的敏感度和技术判断力。这两点的提升需要基于充分的知识储备，使你能够更好地适应时代的发展。只有拥有对新技术的清晰理解，你才能做出准确的选择和判断。</p><p>&nbsp;</p><p>在这个过程中，最有效的实践方法之一就是深入了解技术的原理，理解其内部构造。以 ChatGPT 为例，尽管我是前端领域的从业者，但我对这项技术产生了浓厚的兴趣。我研读了大量的技术文档，涵盖了监督学习嵌入、Transformer 模型等方面，并逐步消化理解。通过这个过程，我对于 ChatGPT 这类工具有了一种直观的认识，我学会了在何时使用，何时避免使用，心中有了一种清晰的认知。</p><p>&nbsp;</p><p>其次，技术判断力是一个需要不断磨练的过程，因为它需要结合实际经验来进行。这是一个涉及取舍和博弈的过程。在团队中，你需要综合考虑人力资源、业务收益以及时间周期等多方面因素，这就要求你在实践中不断进行试错和决策，从而不断成长。当然，寻求优秀的导师帮助你进行评判也是一个很好的策略。因此，我认为敏感度和判断力是需要通过培养逐步形成的，同时也是技术管理者必备的两项核心能力。</p><p>&nbsp;</p><p>梁家恩：在技术领域，作为技术管理者，我们面临着技术不断演进的现实，这既有利也有弊。技术对于整个行业而言，我认为领先就是抢占时间差。在我的理念中，并不是说有了什么技术就一定比别人领先，而是看谁能够更快地实现。随着技术的不断演进，我们需要不断提高自己的工作节奏。这是唯一确保保持领先地位的根本条件，因为即使我们在某个领域领先一段时间，如果停滞不前，就会被其他人迎头赶上，失去领先地位。这就好比一架飞机，只有在达到一定速度（300公里以上）时，才能飞翔，否则就会失去升空的能力。这也正是技术人员的命运，同时也是其中的乐趣所在。在这个过程中，我们要关注的不仅仅是技术的新鲜性，还有如何利用技术去提高我们的判断力，例如使用技术工具帮助筛选论文、指导方向等。这种工具本身就有助于提升我们的判断力，因此我认为从技术趋势出发，选择跟随哪些技术，哪些不需要跟随，是一个重要的决策点。</p><p>&nbsp;</p><p>其次，技术最终需要在实际应用场景中得以落实。从目前的技术发展状态来看，整个业务的大流程框架并没有发生大的变化，仍然是从决策到 POC 验证，再到业务验证和优化。然而，在构思 AI 应用时，我们不能再将其视为一个模块，而是更多地将其看作一个基础组件。这是一种“Thinking in large model language”的思维方式。从这个角度出发，用模型的角度来设计新的应用，可能是主要的变化。未来，随着真正的 AI 应用的到来，可能还会有更多的变化。然而，在当前时点上，我认为把握住这两点，我们就能够跟上技术迭代的步伐。</p><p>&nbsp;</p><p></p><blockquote>王辉：在大模型时代，如何平衡技术创新与业务需求，实现技术与管理的高效融合？</blockquote><p></p><p>&nbsp;</p><p>肖然：这个问题实际上是企业长期以来一直面临的一个难题，尤其是在技术飞速发展的背景下，业务领导常常感到投入产出比例不够理想。在去年大模型的出现和人工智能浪潮的推动下，许多业务领导第一次开始认真思考如何看待技术的进步。从现在的角度来看，我们会发现在去年生成式人工智能技术初现时，人们普遍提出了一个非常务实的问题：有没有实际应用案例？有没有其他公司的成功经验可以借鉴？这种务实的探讨精神在经营层面或领导层面是理所当然的。毕竟投资是真金白银，期望有产出。</p><p>&nbsp;</p><p>在这个时代的背景下，对于这样一个问题的传统看法可能是有问题的。因为我们会发现真正从技术中获得最大回报的企业往往是通过一些大胆或多角度的尝试。这种实验的精神是非常重要的，可以说是对企业DNA的一种改造。如果看一些时代上比较领先的公司，比如 SpaceX 发射火箭，你会发现在 SpaceX 的火箭发射中，即便发生了几次爆炸，很少有人认为是失败的。大多数人认为这是成功的，原因是它完成了既定的实验目标。正是由于这种实验精神，造成了 SpaceX 整体成本和效益远高于同类竞争对手。例如，他们采用了不锈钢作为火箭的外壳，这在之前是不可思议的。然而，正是因为实验的精神，如果有可能，为什么不尝试呢？这样大量的尝试、数据整理、收集和分析，造就了我们看到的时代非常具有创新力的企业。</p><p>&nbsp;</p><p>面对科技创新和业务收益的问题，最本质的逻辑是企业需要逐渐习惯多角度的实验，特别是在面对大模型和生成式人工智能技术时。在有条件的情况下，鼓励不同的业务单元、科技部门都去尝试。当然，我们所要做的是设法降低每次实验的成本，以便快速获取更多可能性。从统计学原理来看，这就是大数定律，也就是说，当你进行多次实验时，你的成功概率显然更高。我认为这个时代可能正经历着这样一个核心逻辑的转变。</p><p>&nbsp;</p><p></p><blockquote>王辉：有观众提问，非一本的大四计算机毕业学生该如何适应时代变化？</blockquote><p></p><p>&nbsp;</p><p>肖然：去年，在各种协会和组织的研讨会上，我与南京大学、北京大学等一些教授讨论了这个问题。我们关注的焦点是，对于即将面临这个时代变革的大学生，未来两三代的学生，他们学到的知识可能与我们没有根本性的区别，但他们的眼界已经触及到了下一个时代。在与南京大学的张贺教授交流时，我问他作为计算机科学和计算机工程的专家，对这个问题的看法是什么？他表示，首先要坦诚，这是一个未来变化巨大的事情，而且我们现在也不知道它会变成什么样。我们会积极参与到产学研的研讨中。他认为最重要的一点是，他从大一开始就告诉学生们，你们是自由的，可以尝试运用新的技术，我们不会因为你们应用了新的技术而惩罚你们。因此，我认为这种开放的心态可能是无论大学什么年级，都需要具备的，因为各行各业实质上都在发生变革。</p><p>&nbsp;</p><p>李梦泽：谈到平衡技术创新与业务需求的问题，我完全赞同刚才肖总提出的观点。选择和更迭技术的问题一直是技术团队最常面临的挑战。我认为平衡技术创新与业务需求本质上是一个资源配置的问题。我更倾向于以现有团队的资源进行八二的分配。这样我们可以确保核心业务获得其关键的业务价值，同时在创新方面仍然保持活力。有了大模型的支持，我们或许能够更好地将八分位的资源转化为二分位的资源。通过工具替代以前八分位完成的固有的重复性和流程化工作，实现业务的迭代与技术的创新。</p><p>&nbsp;</p><p>回顾我们的项目，飞书项目最初的雏形是为抖音业务的迭代提供服务。随后，项目逐渐成熟，横向扩展到公司其他业务领域，最终演变成了一个项目管理工具。因此，我认为需要双管齐下，既要保证核心业务的稳健运作，也要保持对技术创新的持续投入。</p><p>&nbsp;</p><p></p><blockquote>王辉：正好有观众问李老师一个问题：“大模型给前端工作带来什么样的实质性影响？”</blockquote><p></p><p>&nbsp;</p><p>李梦泽：我认为大模型，尤其是像我们现有的对话机器人，实际上是一个庞大的知识库。它不仅能极大地提升我们在繁琐工作中的效率，而且本质上能够将所有未知领域的概念和功能呈现在你面前。当然，前提是你要知道如何正确使用它。你可以将其视为一个技术专家，用于咨询和提问。在日常工作中，你实际上可以为自己节省大量时间，用于学习新知识，拓宽视野，比如可以从前端跨足到后端，甚至全栈。</p><p>&nbsp;</p><p>梁家恩：关于创新和业务的问题，实际上并不是大模型时代特有的，这是所有时代都会面临的悖论。一方面，不创新就等于等死，另一方面，创新可能会引发风险，甚至找死。在这个博弈中，作为一家公司，我们可能必须要预留大约20%左右的资源和空间以支持创新，因为没有创新就没有未来。然而，一旦做出这个决定，我们就必须能够接受创新失败的代价。如果我们追求100%的成功，那么这就不叫创新了。</p><p>&nbsp;</p><p>在创新的同时，我们要大胆地假设，小心地求证。我们一定会犯错，但犯错并不意味着要付出巨大代价，关键在于我们能否在试错过程中快速反馈，找到错误的路径并纠正它。这是一个需要平衡的问题，而大模型可能加剧了创新与业务守成的矛盾紧迫感。尽管大模型有助于加剧这一矛盾，但作为一个工具，它也有可能帮助我们提升决策质量和试错效率。因此，它既有加剧矛盾的一面，也有提升效率的一面。</p><p>&nbsp;</p><p>对于大学生面对这个时代的问题，参与AI可以从三个方面进行：首先是作为技术参与者和推动者，需要高专业水准和创意；其次是在应用层面参与工具的研发；第三是以用户的角度参与。这些层面的参与可能会拉平一些人的差距，但对真正能够推动技术演进的人来说，要求更高，需要更有创意和创造性。这可能导致两极分化，但对应用层面来说可能是更有利的。所以大家不要因为身处不同层次就放弃，要充分利用这个时代的机遇。</p><p>&nbsp;</p><p></p><blockquote>王辉：这里有个观众问题：“在医疗行业私有化模型有推荐的吗？”请梁老师解答下吧。</blockquote><p></p><p>&nbsp;</p><p>梁家恩：根据我的了解，在医疗领域的实践似乎是比较早期的。如果你对这些方面感兴趣，欢迎与我们联系，因为我们的客户包括协和医院等百强三甲医院，我们的解决方案在这些医院中的渗透率可能已经超过了30%。</p><p>&nbsp;</p><p></p><blockquote>王辉：那么我们该如何平衡短期业务需求和长期技术战略，各位有哪些经验可以分享下吗？&nbsp;</blockquote><p></p><p>&nbsp;</p><p>肖然：这个问题在不同层面上可能有不同的考虑。从企业宏观角度来看，我们可以从两个层面来解决。首先，Thoughtworks技术雷达提供了企业当前技术栈的评估，指导我们选择已被行业广泛采用且取得成功的技术。这涉及技术的社区支持和已知的技术副作用。其次，我们需要考虑业务部门对技术的理解。在这个层面上，我们不仅需要关注技术细节，还要强调技术趋势对用户交互方式的影响。例如，自然语言处理技术可能导致用户交互方式的根本性变化。</p><p>&nbsp;</p><p>对于团队级别的技术管理者，建议保持开放心态，鼓励团队成员主动尝试新技术。这可以通过分配一定比例的时间，例如20%、10%或5%，来进行技术实验和尝试。这种开放性的管理方式可以激活团队的活力，让团队能够更长远地看待技术的发展，并获得实践经验。团队管理者需要规划并设置机制，使团队成员有机会尝试新技术，促使团队在技术演进方面保持积极性。</p><p>&nbsp;</p><p>李梦泽：在我们的项目实践中，曾经面临平衡短期业务需求和长期技术战略的挑战，有时候甚至走过很长的弯路。这是因为需要在短期内快速响应业务需求，迅速实现实质性的收益，而这个过程往往与长期技术战略存在天然的抗衡关系。制定初期的规划如果没有很好地将短期和长期进行拆分和融合，就容易出现矛盾和对抗。</p><p>&nbsp;</p><p>从我们研发的经验来看，最近几年与之前的超快猛时代已经完全不同。我们的前端项目规模庞大，如果仍然采用过去的超快猛心态，可能会对整体维护和未来产品迭代留下很多隐患，导致尾大不掉的问题。因此，我们采取的策略是定期审视全年的长期规划，进行修正和对齐，力求不让短期、破坏性的需求危害我们的产品和业务线。我们摒弃了追求短期业务需求的能力，认为坚守难而正确的事情是最为准确的策略。这种做法有助于确保我们的决策符合长期技术战略，同时最大程度地减少短期决策对产品和业务的负面影响。</p><p>&nbsp;</p><p>梁家恩：首先，很多人强调的是短期存在资源冲突，这也是许多人不愿意去处理的原因。然而，我们认为一致性可能在意识上没有得到足够重视，因为从业务的角度来看，问题的提出和解决方法的探索是当下的目标，而技术则是帮助我们找到解决方法的工具。带着问题去寻找方法，实际上效率更高。其次，在业务实践中，我们可以验证哪些技术是可靠的，哪些是不可靠的，这样可以避免许多人将资源投入到无效的技术创新中。因此，这两者的结合可以消除冲突所带来的负面影响。</p><p>&nbsp;</p><p>在处理这种冲突的角度上，我们不能只看当下，还要相信技术的力量，因为如果我们在这个时代不相信技术的力量，就不会有未来。我们必须意识到，当我们在技术上落后时，存在着巨大的风险。只有具备了这种风险意识，我们才会不断地改进技术能力。我每年都会向我的团队提出类似的问题，询问他们在当前工作中是否采用了与去年不同的方法，以及在技术方面是否取得了实质性的进展。这是我必须要向他们了解的事项。如果他们无法回答，那么可能意味着团队存在一些问题。</p><p>&nbsp;</p><p></p><blockquote>王辉：目前咱们国内的大模型到底和国外的差距有多少？</blockquote><p></p><p>&nbsp;</p><p>梁家恩：就基础技术创新而言，欧美仍然占据主导地位，占比可能超过八成。他们在原创性技术方面处于领先地位。然而，在应用层面上，我们可能更加大胆，更加前瞻。就基础研究创新能力而言，由于我们长期以来可能一直扮演着跟随者的角色，这在某个阶段可能并不是问题，因为成本相对较低。但当我们在推动应用时，会发现许多前沿性问题。在国外可能找不到解决方案的情况下，我们国内可能会提出许多新的方法。因此，总体而言，在基础性研究方面，我们与国外相比可能存在差距，但在应用方面，我们是处于领先状态的。</p><p>&nbsp;</p><p></p><blockquote>王辉：有观众提问：“我们如何量化评估大模型的产出？”</blockquote><p></p><p>&nbsp;</p><p>梁家恩：在量化评估产出方面，我认为关键在于审视业务本身。暂且不考虑具体的方法，我们需要了解业务本身要解决什么问题，以及需要投入的成本是多少。我们可以比较不同方法在提升质量、提高效率和降低成本方面的表现。</p><p>&nbsp;</p><p>对于大模型的评估，通常应该有一些公开测试集可以进行比较评测。然而，在国内，由于容易出现榜单被滥用的情况，这些测试集的参考价值可能会减弱。后续一些高校可能会推出更大、更充实的测试集，使其不容易通过简单刷榜的方式来评估模型性能。这将促使研究者不得不更深入地挖掘自己的模型极限，从而推动领域的进步。</p><p></p><h2>如何建立有效的团队协作机制？</h2><p></p><p>&nbsp;</p><p></p><blockquote>王辉：作为一名技术管理者，大家是如何建立有效的团队协作机制，提升技术管理的效率和效果？&nbsp;</blockquote><p></p><p>&nbsp;</p><p>肖然：这个问题在过去两年中有了显著的进展，特别是通过引入Team Topology（团队拓扑）的理念，这给我们带来了新的认知。在软件产业中，由于持续迭代演进带来的复杂性，我认为团队会更倾向于小规模化，即将几百人甚至上千人的大团队分割成几十个甚至上百个小团队。这种小团队的背后，实际上有一些基于心理学和我们学科内的基础理论支撑的。</p><p>&nbsp;</p><p>作为知识劳动密集型产业，我们面临的挑战主要在于如何有效地进行交流和沟通。有效地将我们的思想传达给别人，特别是在不同专业背景的同事之间共同讨论问题，确实是一个相当困难的任务。因此，为了能够高效地协同工作，从团队结构的角度来看，我们更倾向于对团队规模进行有效的限制。例如亚马逊提出的\"2 Pizza Team\"团队规模，即一个由两个披萨能吃饱的团队，通常大约有5到7个人。当然，在复杂系统的团队中，一般来说，将其控制在15人以下已经相当不错。然而，小规模的团队也带来了一个问题，就是在组织中可能存在多个团队。例如，在一个拥有几百人的组织中，其研发组织可能会包含几十个团队。客观而言，团队和团队之间的沟通与协调变得不可或缺。</p><p>&nbsp;</p><p>在团队拓扑中，它明确定义了各种小团队的定位。例如，有平台团队，负责内部平台的构建；有业务价值流团队，直接对接业务，完成端到端的业务需求；还有复杂子系统团队，解决特定技术难题，如监控和日志；最后还有赋能团队，专注于类似DevOps或SRE等领域的专业知识传授。这种团队拓补清晰划分了团队的种类，有利于团队设定相关目标。此外，团队拓扑提出了一个有趣的概念，即“团队和团队之间的API”，明确了合理的团队间交流沟通方式。例如，如果一个平台团队的目标是实现自服务，长期将团队成员派驻到其他团队可能并不是最佳做法，因为这可能意味着平台本身的技术成熟度存在问题。</p><p>&nbsp;</p><p>首先，我认为这种问题不应该被短时期的频繁交流所掩盖，或者仅仅因为大家认为频繁的交流沟通是一件好事。相反，这个理论框架的提出引发了我们对团队存在的目的的重新思考。即使在一个小的研发组织或者我们所称之为敏捷团队中，团队也应该明确自己的存在理由、阶段性目标和创造的价值。其次，我们应该认真梳理团队和团队之间的沟通交流协议。明确何时应该进行交流，何时不应该进行交流，因为交流沟通永远都是有成本的。这种考虑是从团队合作效能和效率的角度出发的。</p><p>&nbsp;</p><p>当我进入一个团队时，我通常会尝试找到帮助他们建立小团队结构的方法。另外，我会运用团队拓扑的方式，帮助大家树立团队存在的目标和意义，这是一个阶段性的过程，当然也是一个不断演进的过程。关于团队和团队之间的沟通，我们需要确保这种沟通是合理的，以保证整个组织在协同过程中高效运作。</p><p>&nbsp;</p><p>李梦泽：我想从带领团队、共同攻坚项目的角度讨论团队协作机制。在项目中，我们通常将所有任务拆分成小块，假设团队内所有成员的能力模型是一致的。如何最有效地调度和激发每个团队成员的积极性，以及自动化程度，我认为这是衡量团队是否高效的最重要因素。</p><p>&nbsp;</p><p>我在2019年在字节公司的经历中就有一些实践。当时，我领导了七八人的团队，一同攻坚一个项目。我们使用飞书的表格功能进行项目管理。在这个过程中，我们没有很好的标准SOP（标准操作程序）流程，因此我需要不断摸索，并与团队成员确认事务结果，以及如何让他们自主驱动。由于表格集成的自动化能力也不够强，我在跟进项目和维护管理流程上花费了很多精力。这导致我对整体管理的难度相对较大，团队之间前进的阻力也很大。</p><p>&nbsp;</p><p>后来，我们将这些流程都工具化了，就像之前提到的将固有资源二八开，八做核心业务，二做业务流程自动化工具。在启动新项目时，将这些经验都整合到工具中。有了这个经验后，我就没有了早期的盲目状态。在进行项目管理或团队协作时，我觉得使用好的工具来指导工作是非常有帮助的。此外，在技术能力方面，我强烈推荐大家利用AI工具，尤其是代码辅助工具和多轮对话的AI辅助导师等能力，这些可以为技术人员提供很多帮助，显著提高效率。这是我在团队协作和技术能力方面的一些建议。</p><p>&nbsp;</p><p>梁家恩：从技术管理的角度来看，我认为作为技术出身的管理者，我们应该充分发挥逻辑思维的力量。作为技术人员，我们通常对逻辑有较强的理解力。然而，我们在沟通中常常遇到效率低下的问题，实质上是因为底层的目标与逻辑没有对齐。很多无效沟通往往源于大家话术的不一致，这可能导致混乱。表面上是沟通问题和效率低下，但根本上可能是团队成员之间的目标和逻辑认知没有达成一致。我们希望通过目标导向的方法和将逻辑和流程可视化，以便在共识的基础上进行更多的沟通交流。这样一来，我们就能减少误解，提高效率。</p><p>&nbsp;</p><p>对于技术团队而言，另一个较大的问题可能是情绪管理不足。很多理工男性格相对耿直，在这方面可能需要下一些功夫。我们团队在技术与业务协同初期发现，每个人的背景和诉求各不相同，很难理解技术商业化的节奏演进。我们难以理解那些推向市场一侧的困惑和挑战。由于双方目标本质上存在差异，会导致内在的结构性矛盾。如果大家的期望没有得到清晰的沟通，这种跨部门协同就可能充满冲突和问题。良好的情绪管理可以缓解这些问题，否则可能会放大矛盾，成为更大的难题。技术管理关键在于处理这两个方面的挑战。</p><p>&nbsp;</p><p></p><blockquote>王辉：有一个观众问题是问肖老师的，请问团队管理有书籍推荐吗？</blockquote><p></p><p>&nbsp;</p><p>肖然：我认为一些传统的书籍并不可忽视，比如很多项目经理会学习PMI的PMP课程等系列。对于刚刚步入团队管理领域同事，我认为这些基础书籍还是值得阅读和学习的。</p><p>&nbsp;</p><p>在软件工程和偏向研发的团队中，我会推荐三本书。首先是一本经典之作《人月神话》，它向大家揭示了软件工程的实质，以及与传统工程的区别。书中深入分析了一个简单而重要的观点：加人并不一定代表加效率，甚至可能拖慢效率，这本书的分析非常有深度。</p><p>&nbsp;</p><p>我还推荐《团队拓扑》一书。这本书从实践的角度告诉我们如何设定团队目标，并如何有效地进行团队沟通和协调。</p><p>&nbsp;</p><p>最后是我翻译的一本书《人件》（Peopleware）。这本书在硬件（hardware）和软件（software）之外，引入了“人件”这个概念。两位作者用了25年写作这本书，发表于十多年前，但我翻译时已经是第四版。书中的很多理念在当时是非常先进的。两位作者通过数十年的从业经验，总结出了很多有趣的核心本质，称之为“定律”（law），虽然这些定律并非经过科学论证，但对于管理者来说，阅读这本书将给你带来很多启发。它提供了关于培养人才、促进团队学习等方面的见解，对真正意义上的高效团队管理有着深刻的理解。</p><p>&nbsp;</p><p></p><blockquote>王辉：有观众提问，传统制造业如何将业务与大模型结合？</blockquote><p></p><p>&nbsp;</p><p>梁家恩：这个问题涉及领域较为广泛。我认为重要的是回归到业务本身的目标和存在的问题。即使不能清晰描述方法，看看能否明确目标以及你认为当前存在的重大问题和差距在哪里，你能够指出那些痛点所在，这样我们才能更好地评估技术方案是否能够有效解决这些问题。</p><p>&nbsp;</p><p>对我们来说，我们非常期待与那些在业务中真切感受到痛点的团队进行更多的交流。在学习技术的同时，我们希望找到更广泛的应用场景，以便结合和突破。因此，我认为从一个更具创新性的角度来看，我无法笼统回答这个问题。关键在于明确问题和方法，只有当我们将问题和方法都描述清楚时，我们才可能找到解决问题的有效途径。</p><p></p><h2>未来，大模型将如何影响技术管理？</h2><p></p><p>&nbsp;</p><p></p><blockquote>王辉：您认为大模型与团队管理之间的关系将如何发展？大模型技术的发展对未来的技术管理趋势有何影响？企业应该如何准备和应对？&nbsp;</blockquote><p></p><p>&nbsp;</p><p>肖然：去年我曾经深入思考过这个问题。因为我们公司作为全球采用敏捷开发模式较早的企业之一，也是敏捷宣言的签署者，这些对我们公司的影响力非常大。因此，在大模型出现之前，我们一直在比较传统的瀑布式开发模式与上一代的对比中进行思考。在制造业，瀑布式开发模式广泛存在，其核心利润实际上是流程驱动。例如，许多制造业工厂，包括现今许多企业，都注重学习华为的流程，因为这些流程本身非常关键。对于制造业而言，如果流程没有清晰梳理，所生产的产品就很可能存在问题。我们听到的一些认证标准，例如ISO 9001或9002，实际上是对制造流程的一种认证。这种认证可以验证流程的稳定性，确保其产出是可预测的。</p><p>&nbsp;</p><p>这种流程应用到软件开发就不太奏效了。尝试用流程来控制人的思维，显然是行不通的。尤其是在当前社会趋势下，比如00后带来的职场变革，对于管理者想要控制他人的思维，确保员工不会上班“摸鱼”的做法，我持怀疑态度。敏捷宣言在开篇的第一句中明确指出，正确的软件开发方法是注重个体和互动，而不是过度依赖流程和工具。这一点强调了关注个体，并使其能够直接与其他人互动，例如，开发人员之间、开发人员与测试、开发人员与需求分析之间的协同关系。这是2.0时代的要求。</p><p>&nbsp;</p><p>但在实践中，我们可能感到有些失望，因为它对人的依赖性太强。经常出现这样一种情况，刚开始企业可能在敏捷转型方面表现得不错，前半年取得了显著进展，企业和员工都较为认可。然而，一年后，情况可能发生逆转，我们离开后企业可能回到了过去的状态，之前认为很好的员工纷纷离职，因为缺乏持续运作敏捷机制。现在大多数企业的研发组织绝对没有达到敏捷宣言所描述的程度，可能也就是 0.5 或 1.5 的程度。</p><p>&nbsp;</p><p>在2.0时代，最困难的问题是交流、沟通和知识的同步。而生成式人工智能技术背后产生的大模型，正是最擅长管理和存储知识的。这使得知识的沟通、交流以及跨职能的协作得以快速放大和增长。这也许标志着我们进入了软件工程的3.0时代。然而，模型到底能做到什么程度，目前还不得而知。例如，RAG等技术已经展示了通用型大模型在专业领域知识方面的巨大潜力，但能否真正有效地管理知识，促进我们成为一个既尊重个体又高效组织的3.0，还有待观察。因此，总的来说，对于技术管理者来说，无论如何我们都面临着与大模型共同工作以及如何使大模型更高效的问题。我们需要思考如何管理知识，或者将其融入我们的工作中。</p><p>&nbsp;</p><p></p><blockquote>王辉：这里有个观众提问，大模型时代小企业如何进行技术管理？</blockquote><p></p><p>&nbsp;</p><p>肖然：目前，创业公司大多是由两三个人组成的小团队，这个趋势已经相当明显。在2024年，我们迎来了一个多模态的时代，包括设计、互动，编码。对于这类小公司来说，如果你有创意，你实际上可以从零开始编写代码，进行测试，甚至将其上线并运营，只要你有兴趣去尝试，就完全可以做到。这对于两三个人的团队来说，并没有太多问题，因为你可以轻松在线上和线下之间切换。</p><p>&nbsp;</p><p>对于复杂产品或规模较大的团队来说，应用这项技术可能会更具挑战性。目前这一领域尚未完全实现工业化，但未来充满期待。作为创业者，你现在可以思考两个关键问题。首先，你所做的事情是否仍然有意义？例如，你可以启用并构建自己的GPTs。这个智能体根据你提供的脚本和数据输入，形成一个定制的“个性”。 如果在2024年或2025年，这种方法成为行业标准，你是否仍然需要开发一个APP？这是值得深思的第一步。其次，如果确实有这个需要，你是否考虑使用大模型来解决你自己不具备的技能，比如很多程序员可能缺乏设计技能，而现在完全有可能借助大模型实现。</p><p>&nbsp;</p><p>李梦泽：这个问题涉及到大模型与团队管理之间的关系，大模型的合理应用，以及与先进工具的协同，将使团队管理在效率方面取得巨大进步。在大模型时代，自动化和自然语义化本质上是两个技术上可能难以融合的概念，但有了大模型，它们有机会实现更紧密的结合，为团队管理带来全新的思考方式。</p><p>&nbsp;</p><p>梁家恩：对于管理工具，我认为它目前已经显示出非常重要的价值，特别是现在已经出现了 Agent 的雏形。尽管目前还存在一些不完善之处，但我坚信在未来三到五年，可能不超过十年的时间里，它将成为所有业务中不可或缺的伙伴。当这个时代到来后，我认为可以发挥两个方面的作用。</p><p>&nbsp;</p><p>首先，它是一个极好的知识和信息整合工具。通过设计适应业务环境的方式，我们可以将大模型纳入其中，有效地传递不同岗位上的能力和知识模型，形成一种模型流程。这至少可以降低人员变动带来的不确定性，使其更规范和延续性更强。</p><p>&nbsp;</p><p>其次，对于创新困境的解决，大模型可以取代人工扮演多个角色。当有一个新的想法时，我可以更轻松地打通整个闭环，而不是让人工去承担多个任务。这种轻量级的验证过程可以更快地进行，例如，我们可以使用 GPT-4 来验证一个新的工作流概念。这有助于更快地检验新想法，降低试错的成本。这两个方面都是需要关注的，并且随着大模型能力的不断增强，未来可能会有涌现更多潜力。</p><p>&nbsp;</p><p></p><blockquote>王辉：在这样一个充满变化的时代，你们会给年轻的技术管理者提供哪些建议？</blockquote><p></p><p>&nbsp;</p><p>肖然：我常常在讲课时强调的两个短语，第一个是“主动求变”。这个短语来源于习总书记在央企数字化转型时提到的三个要点中的一个，他用排比句表达了这三个要点。第一个是要积极识变，即要有意识地认知和辨别变化；第二个是要科学应变，也就是当你发现变化时，要用科学的方法而非蛮干的方式来应对；最后一个要求最高，叫做主动求变。作为技术管理者，我们刚才讨论的话题与这个密切相关。未来技术的发展，包括人工智能在内，将变化迅猛。比如，我们见证了苹果眼镜的正式发布，这可能会引发一波增强现实（AR）和虚拟现实（VR）的浪潮。你的企业业务肯定会受到影响，你可能会有很多想法。因此，最重要的一点是要主动求变，而不仅仅是被动地等待变化发生。</p><p>&nbsp;</p><p>第二个短语是“知行合一”，在中国的心学中经常被提到。原因是其实你没有什么特别好的办法，最好的方法就是扩大自己的感知能力。对于未来的预测，通常来说是不准确的，因为时代变化因素太多。在科技行业，这一点在2023年已经表现得淋漓尽致。感知能力的最佳表达其实是由王阳明先生说出的，“知行合一”。怎样去感知？就是通过行动，而如何指导行动呢？就是基于你自己的感知。在感知和行动之间，逐渐地走向正确的方向。</p><p>&nbsp;</p><p>李梦泽：技术管理需要先有扎实的技术基础，因此在相关领域，你必须对基础知识和原理有清晰的理解。这样，你才能够以身作则，成为团队中的领军人物和引领者。其次，作为技术管理者，必须保持对技术的敏感性和准确的技术判断力，以便能够带领团队走出一条正确的道路，即使这可能是一条漫长而艰难的道路。此外，在与团队成员互动时，展现真诚和真心的态度是至关重要的。通过亲身体验团队内部问题并协助解决，能更好地理解问题的本质。最后，除了拥有过硬的个人素质和一个强大的团队，你还需要适当的工具来支持技术管理工作，确保工作能够取得良好效果。</p><p>&nbsp;</p><p>梁家恩：我认为有三点要注意。首先是关注大势，意味着在面对巨大变革时，我们不能惯性地前进，而是要了解变革的方向，因为成功通常与时代密切相关。其次是持续学习。在这个时代，学习变得更为重要，但我们的学习方式可能与以前有所不同。从以前应试性的学习转变为更注重问题导向的学习，这样效率可能会更高，目标明确，解决问题有针对性。最后一点是躬身入局。许多人可能在表面上谈论许多，但并没有真正进入问题场景并亲身体会。作为技术管理者，需要深入了解团队在业务中解决的核心问题和技术方案，而不仅仅是成为一个行政管理者。对这三点的把控是成为合格技术管理者的关键。</p><p>&nbsp;</p><p></p><blockquote>王辉：有观众提问，如何通过 AI 学习程序设计呢？</blockquote><p></p><p>&nbsp;</p><p>肖然：这个问题涉及编码和程序设计两个方面。首先，若讨论编码，即写代码，当需求清晰且任务规划得当时，编写代码本身并不是主要难题。现在的大模型，如Copilot，可以编写不同领域的代码。然而，一旦提到程序设计，情况就有所不同。</p><p>&nbsp;</p><p>在国内，我积极推动领域驱动架构设计（DDD）等方法，尤其关注领域认知和业务领域划分。虽然模型可以提供建议，但不能完全取代架构师的角色。在多次与资深架构师的讨论中，我们共同得出结论：编码部分的能力可能会逐渐被模型替代，但设计部分的能力将被模型放大而无法替代。设计的重要性彰显在它从业务需求到可用软件的翻译过程中，而模型目前尚不能完成这一翻译工作。因此，程序设计中，尤其是在后半程编码阶段，需要学习如何使用提示语工程等方法。尽管代码的准确性在各方面已不再是主要问题，但设计阶段仍然需要不断历练和磨练。如果你站在技术一线，这将是未来三五年核心的竞争力所在。</p><p>&nbsp;</p><p></p><blockquote>王辉：有观众提问，小公司落地大模型有没有性价比高的方式？</blockquote><p></p><p>&nbsp;</p><p>肖然：关于 Token 的使用，首先，对于小公司而言，通常采用公有模型通过 API 进行计算。计算可以采用两种方式，一是基于 Token 的计算，即你使用了多少个 Token；另一是基于流量的计算。目前大多数人认为 Token 是一个相对合理的计费方式。如果你希望减少 Token 的使用量，你可以考虑使用一些方法，比如采用像 Agent 和 RAG 这样的方式，前置准备让使用 Token 时更加高效。</p><p>&nbsp;</p><p>在发送 Prompt 时，你可以思考如何使上下文更加有效，以优化 Token 的使用效果。此外，现在各家的模型都相对便宜，提供免费使用的服务。在未来的半年内，竞争将继续激烈，各公司都在亏损的状态下开展业务。对于小公司来说，找到一个突破点，专注优化应用的质量才是更有意义的，因为当前各家公司都在激烈的竞争。如果能够打造出优秀的应用，将会产生更大的意义。</p><p>&nbsp;</p><p>梁家恩：这个观众的问题我没太理解，他是希望利用大模型帮助他人解决问题，还是希望使用他人的大模型来解决自己的问题。如果是要用大模型帮助他人解决问题，我认为从开源方面入手可能是最经济有效的选择。已经有基础的模型，你可以在其基础上进行 fine-tuning，并结合具体业务需求，这应该是性价比最高的方法。</p><p>&nbsp;</p><p>如果是使用他人的大模型来解决自身问题，目前可能国内外都有一些开放的 API 可供使用，可以先尝试使用这些服务，验证一下是否对业务有真正的价值。如果确实有必要进行更深度的定制和优化，那么可以考虑寻找专业公司的帮助，或者建立自己的团队。最重要的是确认应用是否通用，业务是否可行。如果业务可行，后续的选择很多。</p><p>&nbsp;</p><p></p><blockquote>王辉：观众提问，如何分配核心算法的研发与业务应用落地两个方向的投入比？</blockquote><p></p><p>&nbsp;</p><p>梁家恩：我们在内部分配资源时，大约有20%的精力会专注于前瞻性核心算法。虽然这部分可能并不直接涉及当前应用，但我们坚持在技术主线和未来技术趋势中投入资源。即使目前可能无法立即应用，但如果我们判断这是未来业务的趋势，就会提前进行一些布局和准备。因为我们内部的员工在业务方面可能更为专注，所以除了内部资源投入外，我们还与外部合作建立了一些联合实验室，与高校进行合作，这种合作更适合进行中长期的技术储备。</p>",
    "publish_time": "2024-02-18 14:00:00",
    "source": {
      "name": "infoq_recommend",
      "desc": "InfoQ推荐",
      "icon": "https://raw.githubusercontent.com/maguowei/today/master/imgs/icon/infoq.png"
    }
  }
]